// Images {
var rawImages = [];
// Walls {
rawImages.push(
  "#cSĆĆ¶Bscc¥¶ÖĆtS#Ć¥B s&¶¶¶¥æĆtĦ æ1 Ħ&Ć Ħ-ĆĆ# !&Ķ!B!Ķ !(B!!2B2BĦ!!Ķ!B!ĆĖæ ¶,ÆÆÖs¥æC!!æ ¶)ÖCB !(2!Ķc!!!B!!!C!!2Ħ2ĦR2ĦB !&ĖĦRRc R)BB2c2!s!!ĖĦĆĆĆĖĦBRsC !*2Ć2 !+ĦBĦB !'C!ĶĖ!2B22R2RR2R2B2 !&B!!ĦcccRBR¦ !*B!ĶR!BR !)BĦBĦĶĶBĦ!!!Ħ!2!2ĶBĦ!Ħ !&ĶBĦ!c!C !'B!B !&B !'2!BĶRRB·Ħ !'ĦBĦB!Ħ!BB!!Ķ!2BĦB!!B!ĶBĦ2BĦBB!µs!!!B!Ħ!Ħ!!!R !(BR2csBC !(B !&ĦB!BBsĦ222ĦBĦĦBĦBĶĶBĶĦBBs !&2!ĆĶR2R !-22B !,cBcBcRRRC !'2Ħ!2Ħ2ĦBĶĦB !(Ħt2!Ķ!!Ķ !,ħħćć×··s !(s!!RRRccd !'2ĶBRĶBĶRĦ2BĦB !'B!RBĶRĖBĦ !+µµµÕö Ħ&ĖĖ!!ė···dddCC!!!õ!RĶBĦĖBĦBĖBĶB¶ssR×××Ħ!cB!Ħ2ĶĶ !) B'!ĥ õ& ą&B s,Ħ!¶cÖBc¶s¶s¶s¶R ×&ĦĦöĖĖ!!!Ħ22B !) R&BBBs¶Öö B&µµµÕÕÕ ö'Ė!·ć·ćć ×*ĦĦööĖĖĥĥĥĦBBĦ2ĶĦ !*222RBB!öæÆR¶ÖöBBBĦĦĦąµ 1&Rąąõõõąąĥĵ1QµÕõõ ĥ&!CCdBB!ĖĶ !'C !&2RRRsBs¥c2ĖöæsÖöBBB!æBcc¥ccc¥¥¥cBĦĖöÖcBBBRc¥Ææ!!!2!!BB2 !+2!ĶBĶ2!ĦBssRc!ĆĖÆĆtB!BB!Ħ2R!!Ķ2!s¥¶sc¶ss¶cs2!B!sRB!!Ħ!2 !*2Ħ!!Ħ2Ķ!BĶ!ĦBĦRcĶ!B!C!2Ķ!B2ĦBĶ2Ķ!ĦĶĖB2ĦBBĦ!!BĶ !&B!!BĦ2 !*ĶB!!2ĦBBĶB!BĦ22ĦBR!!s!!ĶBĦĦ22RĶĶ2BĶBĖĶB!ĦRBĦ!B !&C!!ĦRĖ !+ĦB!Ķ!Ħ!B!Ķ222!BĦ !&B!!ĦĶBĦĶĶ!B2ĖB!!B!2BĦĦBĦ !*B!R !+2Ħ!B!BĶĶ!!Ķ2ĦĶ2!!!B!2Ķ2BRĦBĦĦBĦĶ!Ķ!B!ĦĶ!2BĦB !*ĦĶĶ !+2!!ĶBĶ2!Ė2Ħ22!ĶB!B!!22!Ħ2R2B2ĦBĶ22Ħ!ĦBĦ!Ħ!B!B !*Ħ2 !+Ħ!2!22!Ħ2!BĶĶB!ĦR!!!B!ĶsBBBRRcRscRcBsRcRsRBB2B !&B!BRĦ !+2!Ķ!ĶĶ!B2Ħ!2BĶ!c !&Rç#÷÷÷¦¦ss B&RRBBRBBBRRB !)ĦĶ2 !*2!2B2Ķ2!Ħ!RĶĶĦ!ĦĦĖC!!¦ąµÕÕöss·· ×*·· d( !(B!Ħ !*Ķ2ĶĦĶĶ!ĦB2Ķ2ĦB!BBRR!!ĥBB!!ĥÕÕÕöĦĦ !(BB s)!!!22Ħ!B !+Ħ!!ĶBĦBĦĶĦ!BĦ!BRĖB!ÕĆæ Æ'Öæą Õ&ööĦĦĦ !0ĦĦ !+sRcBRcscBBBs¶BĦĖR!!!Ħ æ*¶ÖööĦąąõõĖö !,22ĶBB !*sRcRsBRĆR2sR!ĖRBRB!!!ĖĦRs¶¥sB2ĖöÖÖÆöB!!åÅQQrÕ Ħ&Ėĥ2!ĶĦĦ !)dħ÷ ×'÷·¦ddds!sBt !'c!Ħ2BRBssR2ĖĆÖC!ĦöööÖs1AbbąĦ!BĦBB !) ö)!BB s&·×··B!!!Ħ2Ħ!BĦ!2B!!BBcB!RC!!ĶĶĦĦĖĆöĶBBB!!ĦĦ !)µµrµĥĥĥÕ ö&ĦĦĦ !*BBBĶB!Ħ!2! B&R !&ĦBRB22BRC !/ĦĆĆĆ¶æ!Ħ ĥ&ĖõõÕÕÕĦĦĦ!Ķ2Ħ2Ķ!2B22BĦ2Ħ2B !'ĶRcRs!!!CB!2 !+Ħ2ccBĶÖBCC!ör ¶'AbĖÖĶĶ2ĖB2ĶĦĶĦ!BĦ B& !(Ķ!!R!R!!!2RsB !(ĶRB!Ħ!Ħæ!R!ĆĦĆööĖĖBBą!!!2!!Ķ2R2B2!2Ħ!C !)2BĦ !'BsBB !*ĦĦ!!Ħ!Ç !&ĦBs¶RRB·dĶ!!ĦB22Ķ!!ĦĶĶ!BBsĦĥ !'Ħ!BĦ !&¶Ç÷×d !)BBĦBB!!!BöĆ2BB!!BĦ!sĶ!!2!ĶĶĦĶĖR22ĶĦB !*B!ĦB !&Ħĥööss !)Ħ!!ĦB!!!Ķ!BB!ĦBBB !'Ķ!Ħ!R2B!!Ħ2B !(2B!Ħ!BĦ!!!CBĦąĥöĦĦ !(B!Ħ !'ĶĶR!Ħ!!!·s!2!!2Ħ2!ĶĶĦĶĖBĶ!C !'ĶĦĦB2!RĆÕR!CBB!ĥõõĖ !'Ħ!BB !&Ħ2Ħ!BBĦ !&2!!2B2Ħ!ĦBĦBĦ2R !*BĶĶĦĶBĖõR!!¶RR¥Cąą!!2!BBĦĦĦ !&2B!ĦĦB!!!Ħ!2!!Ħ!BĦB2cBsRB !(2BĦĶ!B!Ħ!Ħ!!!ĆcR2ĥ !(Ħ!ccc!!Ħ!!Ħ!BBĦR!!!2c¥R¶ss¶scRsc¦d !(ĶĦ!BĦ2Ķ!Ķ!!!C!!!ĶCd!!!BĦBBR··!s!!cB!Ħ!B !&ccRc B&dddt·sss!!!Ķ!!!2!B!BBĶ !&cĆ!!ą !&B¶sR !(2RBs¶ss !&·÷× ·'sRR!ĦĦöööĖ !'2ĶĶĦĦ!2 !&R!!BĦsd!!s d&!!s!!RR· d'!!!Ė ö*ĖĖõõõ ĥ&!ĶĶ!2ĶĶ2!22 !'¥!!c !'× s'RĦÕõ·× s)!!åÅ µ+ÖÖÖæ Ħ&!Ķ!!Ķ!Ħ2ĶĶ !*Ć !'Õ ö'ĖĖ!Ħąµ ö(rrbÖÖæ Ö'æææöööĖdB!!Ķ!!2!B2ĦB !)R!2 !(Õ µ'Å!BBB!RĥÕr1¶¶æĦBRss¶s¥¥c¥RRsR!!BĆĶĶ22!ĶBBĖ !&R!ĦÆ¥R !(Ħ æ'Öss¥Ö!!ĦĆĆBRcccBBB!Ħ!Ķ!2Ħ!BĦc!Ħ !(22ĶĦB2 !)Bccö !)RRR!Ķ2RB!!!ĆBBR!!B!2Ħ2BB!Ħ2BBĦ¶d !&Ķ!22BĶ!2!Ķ !(BĆ¥Rąą !'B2R2¥sRB2 !&BB!BB2cB¶¥ss¶¶sss¶!!ĥ !'2!Ħ2Ħ22 !(B¥Ö2c !*BĦBĦ!Ħ !'ö# ħ&ėćć ×- !)2Ħ2!BĦĶĦ !(ĖcB2!× !(ĦBĶB!B2B!!×B Õ+ µ& Õ(ĥ· !'ĶBĦ2!B!B!!B !'Ħ !*ĶBĶB2ĶĦ!B!!ÕĦæÆÆÆÖÖæö!×ddB¶RRRcs¶b× !'Ħ!ĶĦ!!Ħ !*BĶ !'2BĶĦ2ĖĦ!B !'Ć ö&ĆĆöæÖös!!Ć¥¥cRB!R !(B2ĶB2!B !)BĦ !(22!!!2B!!B !&ĦĦ2RccBBcB !*B!BB!!!2!B!2!2ĶĦ !*Ħ!2 !&Ħ22!!!BĦ!!!C !'B2BĦB2Ħ2ĥ!!ĦRĖĦBĦ!ĦĦ!C!Ķ!Ħ!Ħ2!!BĦ !)B !)cB!BĦĶ22B!!RĖ !&2Ķ2Ķ22B !&RĖ!!!B !*ĦBĦĶ!2B !)ĦBĶ !+BĦĦ !,Ķ2Ķ2Ħ2 !'R!BĦBĦB !'22BĦB2ĦĶ !)22Ħ2 !)2Ħ!BBĦ2B!B !'2Ķ2ĶBĶ !'B !&BĦ !(ĶĦ!ĦĦBĶ !)2ĶBĶ !*BĶĦĶB !+Ķ2Ķ2Ħ2Ħ!!R!B!ĦBĦ!B !'2!B!B22B !)2BĦ !+Ħ!!BĦ!!R !(BĶBĶB !*BĦBĦ !)2ĦBĦĶ!!Ķ !(BĦBB !*BĶBĖ !,ĶBĶB2ĦĶ !)BĦ!Ħ !'cccBcR22RB!!ĖĥĦBĆĦ !+Ħ22!B !+2!2!!BĶĦöBd!s2Rs¶¶ !&scc R)B×Ħ!!!¥s¶s !*B2ĖRĦ !+ Ķ'ĦĶ !'çÇ¦¦ddd!!ÇÇ× ·& ×'ĦĖĥ!!!ķ××× !)ĶĦ2ĶB !/ĶB!!ĥ!!Ħąąĥĥĥ!!ö!ąąõõĖĖĖ ö'Ėĥ!Ħ!Ħ µ'!",
);
rawImages.push(
  "#cSStĦÆĦæĆĦæĆĦ#tQQĆÆ æ&ĦĦĦĆ#SQt #1 t&S t-SS# !(ĦĆö!B !)BcBcĆ!ĦĦ!B!öĥÕ Å,ÕÕÅQböĤ!!ö r)ÕĤB !)ö22sĶĦ !)BĆ!Ć¦CĦB !&ö!22B 2)!!2¥2 !&å Ħ&ĶĦcC!Ĥ !)R2!Ćs!!!Ħ !&ĆBĦB !'Ĥ!ĥĶ!2RB2s2Rs2s2R2 !&B!!!BBB2BCs !+Ħ!s !&R !'BĦBĦĥĥBĦ !'Ķ!BĦBĆ!ĦĦ!Ė!ĦcĆ!R!Ĥ !'2!c !&B !'Bc!ĦcĦBtBń !&ĦcĦBĦĆ!BR!!Ħ!2cĆB!!B!ĶBĶBcĆcc!$ !&c!R2Ė !,¦C¦dCd·BĤ !&2!!B!Ħ B&!DB22ĆcĦĦB!BĶĶBĦĆc!t !&B!æĶCRt !,ĥĥ R& !*c!BBcdCtĤ !'BĦ!BĦ!!cĶĦB !)ĤB!2!ą !,Ĥrrr ń&ĤĤ !'sö!tttssń !'B!!¦ĦcĦdĆ2BĦc !)C!ĶsĦĖą !*$$$DD !+µrårńńńĤĤ !'2ĦBĦåcĦBącĶB×tttńńń!!sB!ĆB2Ħ !) B&!! D' $& !/·c÷Ćc×t···t×t ń& !*ĦBBc !) Q&AAAQrÕÕ B&$$$DDD !)ĤrĤÕr ń* !(DDDĦc!!CĦĆ !* 2&BB!ĖææQrÕÕBBBĦĦĦ$÷ t&Qttdddttt¦×Ę$ D)!ĤĤń!B!åĦ !'Ĥ !&Ķ2c2sBR¥B2ĶöæQÕÕBBB!æ!BBcBBBsssB!!ĶĆÅbAAAQbbµö!!!C!!ccB !+2!ĦcĦB!ĆcsR2c!æĦµöĤB!Bc!ĦBB!!ĦB!s¥scB¥RR¶Bs2 !'R!!Ć!B !*Ķ!!!ĆBĦ!cĦĦĦBĦccĦ!R!Ĥ!BĦ!BB!cĦBĦ!ĶĦĖ2BĖR2Ć!!cĦ !&B!!cĆC !*2!!!BĆccĦdBBĦB!ĦBB !'ĦBĦĆBĶRĦĦBdĦcĖĦ2!Ķ¦cĆ!c !&Ĥ!!ĆBą !,c!Ħ!Ć!d!Ħd B&ĦĦ !(ĦĶBĆ2Ķ!BBåc!!2RĶcąĆcĆ !*cdd !+ĶĆ!c!cĦĥ!!ĥBĆĦd !'2ĦBcRĦcĆĦcĦĦ!Ħ!cRĆB!BcĆc !*Ćĥĥ !+2!!ĦcĦBĦå!ĆCB!ĥBBB!!2B!ĆBc!cBĆcĦBBĆ!ĆcĆ!Ć!c !,ĆC !-B!CB!ĦB!cĥĦdĦĦt!!!c!Ħ¦ C&BcC¦dCc!¦CcC¦C!!CR !&c!c¦ą !+Ķ!Ħ!ĥĦ!BBĦĦCcĥ!c !&CµÕ P'·· R&ttRRtRRRttR !)ĆąB !*Ķ!BcBĦB!Ħ!¦!ĥĆĦĦĦõĤ!!P$$DD!!!ĤĤ ń2 !(BBĆ !*22ĦĆĦĦ!ĆBCĥ!Ć B&t!!!DBB!! D& !7C2ĦĦc !.ĦcĆcĦąĆBBĦ!Btõ!!Döö µ'Õö$$$DD !5ĦĦ !+s¦ccCctBBB!·×!!õt !&Õ ö'æÕrµõÕĦ$$DD !.ĥĶĶc !+sCRttRtĖ·C·t!õt!tB!!!åĦ2RssR!ĶĶĖÖö¤õB!! Ę'D !'DC!ĶĆĦ !)õrP ń'PńPńńń·!·BĤ !'¥!Ħ!ccBRR2ĶĶæÕĤ!! Å&Q¦·÷÷$Ħ!B!BB !7ĤńĤĤ !&Ħ2Ć!BĦ!!c!! B&!!Ĥ!!22!!ĶĦöĦBBR!!Ħ !*÷÷·÷ D& !2cc!cĦĦĦB! c&C !&Ħ!2!22!!Ĥ !'Ħ !)ĆæĦærö!Ħ D&! D' !&22ĆCĦ!dcd!BĆCĆCR !'Ķs¥2R!!!ĤB!2 !+Ħ2BBcĥÕBĤĤ!Õ· r'·÷!ÕĶĶBåcCĥĦą!BBąB!B !)Ħ!!RB !&Ķ¦¦R !(2s!cĆ!Ćö!!!ĆĦĦĖĖĶĶc!$!!!B!!ąĦdR!CB!Ħ!Ĥ !)BBĦ !'cÇ!RB !)Ćc!!Ć!s !(R¶22!·ńĦ!!ĆBĆ!!ĵ!ĦĥĦBBR!!D !&ĦĆB2Ħ!D!!·PPńĤĤ !(c!Ćcc !&ÕĦ2B2Ė!c!!!Ħ!!BBBĦ!ĶĶsCBĦ!B !)BBĦĶ2 !&ĦD !-Ć!Ć!c!!!C!!R!Ķ2 !)ĦĦ!BdC!!ĵĦBB !(2BĦĦB2ĶĦ!!ĤBĦ$D !+c!cĆ !&ĥĶc!!!R!·Ĥ!B!!BĦ!BĥĥĆĆĖBĦ!Ĥ !'ĶĦĦB2RsĦĦ!!ĤBB!DDD !(Ć!!cĆĤ!!Ć2Ė!B2Ć !&B!!BB!Ħ!Ħc2BĦBC !*B!ĶĆĶBõD!!!rQQbĤ$$!!Ķ!ccĆĆ !'2R2ĖĶc !'2!ĦĦ!BĦBCB!dCR !(2BĦĦ!c!Ħ!Ħ!!!ĦB22D !(Ć!c!c !'Ė!c2Ćt!!!CR¥d×·t·tRt·sPń !(ĶĦ!cĆ2Ħ!C!D!Ĥ!!!ĶĤB!!!BĆc!t÷· !&Rc!ĆRc !&Rdts B'ńńĤĤ !(ĥ!!!B!c!Rc !'BĦ!!$ĤB!!c×tt!ĤĤ!!!BB!t×tt!Ĥ!!ńPń Ĥ( !*D !'BĦĦĖĖ !(¦!!R !'t ń& !'Bt· ń' !0 D(!!Ħ2!2ĦĦB!BC !'s!!ĖĖ!Ĥ!!ń !)DDrńĤ !*ĘĘ ÷+ÕÕÕö Ħ&!Ķ!!Ħ!ĆBĦĥ !*R !'D !*Ħ$$ !(ĘĘ÷ÅÅæ Ö'æææöööåńB!!Ħ!!2!cBĆd !)2!B !( ÷(Ę!BBB!!D÷·tÅÅæ!!2RRsRs¥B¥22R¦!!BĖĶĶ2B!ĦRcå !(Ħç·C !) æ'ÅQQbÕ!!ĦĆĦ!2 B&RcBĦ!ĦĦBĆ!BĦR!Ħ !(2BĶĆcC !)Rss !*222!22s !&Ħ!Bs!BcBBĆ!cB!Ħ!cBĦ×ń !&Ķ!2BcĦĖB!ĥ !(BĖbQ$$ !(2s2¥ss!C !&Bc!cBCB!×·t·××·t·×!!D !'ĶĦĆĶĶĶC !(BµÅ2B !*cĆcĆ!Ć!!D!!÷Õ r&Prr ń- !)2Ħ2RBĶąĆ !(ĆBcB!ń !(ĆcĦc!cCR!!ńB D+ $& D)Ĥ !'ĶBĦ2 B& !*Ė !*2cĦdCĦĆ!B!!DĦöµµµÕÕöÕ!ńńńBrQQQbQr÷ń !'Ħ!ĖĆBĦĦ !)2RĦ !'C!ĶĆBåą!c !'ĖÅĆĆĆææÅæÕ !&Ħ¥cB2B!t !(BB!cCBB !)RĖ !(ĥ2!!!Bd!!R !&ą!22BsBB¥!D !)BccB!!!2!BBB!2ąĆ !*Ė!B !&ĦC2!!!dą!!!Ħ !(2RĖRBĆC!!!Ħ2öĦBĦĦĆĦ!Ĥ!Ķ!ĦĦĆĶ!BBĦ !)R!Ķ !'sc!cĆĥ!ĆĦ !*BĦ2ĶBBR !&sĶ!!2BB !)ĦBĶö!dB !)ĖRĶ !+cĆĦ¥B !*ĦBĶBĆB !'C!BĦR!Ķ !'22BĦ2¦ĆĥB !(22Ć2 !*Ć!ĦcĦC !*BĦ2ĦcĦ !'R !&ĦĶ !(ĶĦ!ĶącĦ !)ĶĦc !+cĆB!BĥĖ !)ĦRĶBĆBĖ !&B!ĦB!BB !'2!2!BBCd !)2cĆĶ !+c!!!Ć !*cĦ2Ħc !*BĦĦ!B !(2Ķ2ĦĦ!!Ħ !(RĆcc !+ĆcĦĦc !*Ħ22R2Ćĥ !(BBĦĆĦ !'R·cRcBĥĥB !&DĦdĦĆ !+Ć!ĦĦBĆ !*BSB!!cCĦ!!ń!cCd¦×· !&ÇdR t)RBĤ!!!sc×t !*c!Ć!Ħc !*ĦĥĦĶĶĆĥ !'µPPPńńń!!PPP ń+Ĥ!D!!!µńńń !)Ć!BBB !/Ħc!!D!!Ħ$$DDD !&$$DD !+D!Ħ!Ħ $'!",
);
rawImages.push(
  "#cS Ć+ttt##Ć¶22s¶s¶¶s¶ĆĆtt ĆC#!! s&ÆÆööbµµąsd2!!!ĦB!ĦBĦ !) B+ !&æ ¶/æ!× !(BĶĶĆĆæ¶¶Ć!s2!!Ħ!!Ķ!!B !&B!Ė¶¥ R&¶ĦC!!!BĖĦĦĦ Ķ,ĦĖ !(BBcRccBcsc!!RB !&2BĦ !'C!ĆĆĖ!!!cc !+2csRRsRssRs¥s !'Bc!ĦĶĶ!BĶĖ!!!B!!Ķ2!ĶĦBĶĖ !&BĶ!R¥c¥B!!sd!!Ħ!!2c2ĶB!ĶBĦ!B !+Ķ!B!2ĶĶ2!!ö!CB!Ķ2ĦĶ2Ķ2!!ö!R!Ė!2Ħ2Ķ!!B!sd !'2!ĶĦ22ĶBĶ !,ĶRĦBĦ2ĶĦB!ĥ!!B!!Ć2!Ķ2ĦĦ !*B!2ĦĦöÕ!sd!2!!!ĶB!2Ħ2Ķ2!Ħ !+ĶRĦB!!BĶ!!!s2!!!2!B!2 !+Ħ2ĦB!ĆĦö!!!B!!!Ķ!BĶB!2!!B!C !)ĦĖBĦ!2!2ĦĦĦ!c!!BĶ!Ķ!2 !&B!!!B!ĶB!Ķ !&R!R !'Ħ2Ħ !&Ķ !,B!2!2ĶĶĶ !(Ħ22Ķ!Ħ !*Ħ!2Ķ!2B !'2!!Ħ!Ķ2!BĶ!!Ħ2 !+2Ķ!Ķ! Ķ& !(BĦ2!Ħ2 !*BBĦ2!Ħ !(B!!!222!Ħ2!!BĦ !*2Ķ!Ķ2!ĶB !*Ħ!!2B !+ĦĦ2!!B !+22!Ħ!BĦ!!Ķ !+Ķ22!ĶĶB!2Ħ!!!B!!2BĦ2ĦĶ !+22Ķ!Ħ !)B!2!ĦBĦĶBĦ!2B !+Ķ!222Ķ!2Ķ !(2ĶB!BB !*B2Ħ2!BĦ !(R!Ħ!BĶB2ĶB!ĦRB !)B!22!!22Ķ !)2ĶĦĶ !,Ħ!B!ĶĦB !(R!B!!BBBcRs¶BB !)Ħ2ĦĦ2ĦĶĦĶB!!!C!!ĶBB2 !,BĦ!!ĶB !)RBRRRcRRBcBddCR !(BĶ2Ķ!B!ĶBĦ !)Ħ!Ħ!Ħ !*ĦB!ĦBĦĶ !)ÆBBBdd·×··sssB !(ĦBĦB!ĶĶB!B!!!R!!2!ĶBĶB !*B!Ħ2!B2 !)ddd×ssBĦöööÕµµµ !(2B!Ķ!BĶ!Ħ!!!B!BĶB2!2 !+Ħ!B2Ķ!s !)ąąą µ&Õąĥĥ!BB!!!×!!!ĶĦ!22Ķ2Ķ !'BBBĦ!ĶĦĦB !(ccsss¥s!B !' B(ĦĖæÖRR¶··B !'BĦB!ĶĶ2!!B !&Bcs¶s¥¶¶R !'ccsB d'Cs!!!B¶ R'¶ÆöĆ!cc!!C!!!c¥s¶B2B2!!22 !&ÖR !-·#ć·· s( !'Ć! B*ccR!!R!!!cR!!Rcc s&c·Böö· ×' ·&R!! ö/Ė!!!BcRcccBscBR !)ć ×-B!!!ööĦĦĦ! B'!!! ą/d!!!ĦĶĶ!!BĶĶĦ !) µ.ÕÕÕ ĥ&õõõÕ ö)ą !.d !&B!2ĦĶ2!ĶB !*BÖ Æ+ ¥- b) Æ.Ö!s!!!ĦBĦB2ĶĦBĦ !*¶ĆĖ ĶE!!2¶ !(ĦB!!Ķ2!B !*Ħ!BcBccBccBccBcRBBcRBBccBccBscBccBcBcRB¥¶dR !&2BĦ!!22Ħ !*BĦ2cĶBĦĦ2!ĦB!!BĶ2B2Ħ!!B!ĦBĦ!!ĶĦB2!BĶBĶ2cB!!B !&2ĦB!!Ķ!BĶ !,Ħ!Ħ!22ĦBĦ!Ħ!22Ķ22ĶBĦ!RĦBĦBĶBĦĶĦ!2BcRB!dR!ö!!!Ķ!!ĶĶB2!2 !,BĶB22!B2BĶ22ĦĦ2Ħ2RĦB!!2!2!!Ķ2 !&2BB!dRB!ą!!!ĶB!22!!Ħ !-ĦBĦ2!!ĶĶĦ2!Ħ22ĦBĦĶB!ĶĶB!BĦ222R¶ssBdd·sB!ö !&BĦ!!!ĦĶ2Ķ !-ĦB!222ĦBĦĶ2!!B!BĶ222!ĶĦĶBĶ!RBBdd×ssB!öµą!!cĦĦB2ĦĦ!Ķ2 !.BĦ!!!ĶB!RBĦ222!Ħ2!!!Ħ!B!Ķ!2BBCss!!Aĥą1Ć×!!B!B!Ħ!2Ķ2Ħ2 !,BĦB!ĖĶ!!!Ė!BĶ!!ĶB!ĦĶ!B!Ħ!!!B!Csöµ1ąæ!¥cĖÕ×ĦB!Ć!2!22Ħ2Ķ !*2!Ħ!!ĦB!B2ĦBĶ!2ĦĦ2Ħ!2!Ħ2!BĶ2cBds!ąsöccRĦ2!·!!s!!!ĦRĦĶBĶ2 !)ĦR!!BĦBĶ!ĶĖBĶ22Rccs¶sss¶css¥sBBR!öæ!¥!2Ķ2!Bö!d!!!Ħ!Ķ!!ĶBĦ !* R&sRcRRss¥scBBB !,BBCB!ąö!Ħ2!B!2Ķą!!!c!BBĦ!B!ĦB !*¥Rc B) !&BBBddd· ×(··s!ö!!B!!2B¥s¥!!sĦc!Ħ!B2ĦĶBĶ !*CÇ d* ·&tttRRR! Ħ*ööą!BRRç×ć ×&!!!s!B!!!BBĦ2 !*ą ĥ+ õ5ĥą!!Ö¥cąą µ)!!¥Ć!Ķ!Bs¶s !+ Ħ.!! Ħ1 !( B*ddCsBB¥¥R !&d !(ĖÖ s,¶CĦ!BæssÆæĖ B'!!ĖĖÖ¶ss R)¥!!ą!ÖR!!!ddd×s!!Ė!!!ĆĆ!!! 2(Bcs!!Æö!!ĖöÆRRÖ·C!ĖĆÆĆĦ !*RBsR!C· ×&sss!Ħööą!!!Ć!2¥cRcsssR¥s!!!Ħ2¥¥¥s¥¥¥s!!!ĆĆ!!B¥¥¥c¥c¥¥BR!Bdą ö'ÕÕµµÕąą !(R!BB22ĶĦB2 !&ĖR!Ķ!2!ĶĦ !&Ħ!B¥RĶĦĶBĦ!Ķ!RR!!R! ą'ĦĦ!!dd !)BĦ!!!ĶĶB!Bd!!Ė!BĦĶĦ!!ĶB !&Ħ!B!22BĶ!B!2ĶRd !'Ć Ö(ĆR!d !&B!ĦB!!!ĶBĦB !&Ħ!ĦB2B!ĶB2 !(BĦ!ĶĶ2!!BĦ2 !(ĆĖ Ć&ĦRcBs !'B!B!ĶĶĦĶ!B2!R!!Ć!B!!!Ķ!!2!!R !&BĦ22!!ĦĦB !(BĖĆ!B¥¥cB !*B!Ć!2ĶBBĦ!!!B!!ĦBĦĶ2Ķ22ĦRd !)BĶĦĶ!!BĦ !+ccĦĶ !0ĦB!!2 !)BB2!2Ħ!B !*Ħ!2!2ĶBĦB !+BĦB2 !,B!ĶĦB!Ķ!2ĶB !)ĶĦĶB !+ĦB!!2Ķ !/ĦBĦĦĶ !+2!ĶB!ĶB2!2 !(BĦ2B2Ħ!Ħ!!!Ė!!!B!Ķ!2BĶĦB !,B!B2 !,B!!!Ħ2!ĶĦ !(B!B!!!2!2 !+ĶĶ!Ķ!BĦ !.Ħ2 !,B!!!BĦĖ!2Ķ!B!!!R s'¥s¥ !*ĦB2!2!Ħ2Ķ !(Ħ !&2!2 !.Ħ222Ħ22!!!Ħ!ç d& ×'s !'Ħ2!ĦĶ!!BĶ2Ķ !'B!!ĦĦ2!Ħ !/ĶĶ!BĶB!C!!! ą'µ Õ'!s!!!B2Ħ2!Ķ2ĦBĶ2 !+B!ĶB !.BĦBĶĦ !'Ė!!öÖ¶¶¶ R&¶ !'Ħ!BĶ2!2!Ķ2 !+BĦĦ2Ķ !/BĦ!B!2!R!!!ĆĆĆĦĦĦ!!!cR !&BB!!2ĶĶĦB2ĦB !+BBĦ2 !,2!Ħ222Ħ2!!B!!!ĦĦ2RBc¥c¥Rc!!!BBBss¥¥¶¶ss¶R !*Ħ!ĶBĶ !,2!!ĶĶ!BĶB !&ĖĖ!22cBĶBĦc !&BcR d-!!!Ė!!!BĦ2Ħ !/BĦBĶĦ!!B!!!ĶĖR!2Ķ!ĶĶ2 !&dħç× s.!ö!!!B!BĦBcB !+2!!BĦRB !'ĥĖ!ĶR!2!!2 !'ąĖ!Ħ !.ö!ą!RÖss¶sB!d !)ĦB!Ħ!2ĦĶ2!C!!Ħ!!RĦĶ!Ķ2 !)ąÕÕ µ.ąą!·ė ×)s!!ą!!",
);
rawImages.push(
  "#c S, Q'SSStÆÆæĦĆæĦSStt SC#!! r&¤¤õõ $&!ńB !&c!ĦcĆ!!!Ĥ !,ńB !&Õ ¤/Õ!ń !)ĶĶæærrrĖ !*Ħ!ĦB !&B!!µ¤ r&µ!Ĥ !&Ė Ķ.!ĖÕ !)B¥c¥¥B¥ÇR !*BBĦBĖ!!!Ĥ!µĦĶ!!!B×D !+c¥BB¥B¥¥Bsç× !(¥!ĆĦĦ!cĦå!!!Ĥ !&ĦĦĦcĦ !'ńĶ!2¥B¥c!!!B !(cBĦc!ĦcĆ!c !+Ħ!c!BĦĦB!!D !(ĦĦBĦB !(Ķ!2ĆBĦĦ!!!ĤB !'B!ĦĆBBĦcĦ !,Ħ¦ĆcĆBĦĆc !*B!ĦBĆĥ !*c!!ĦÕĦD!ĤB!2!!!Ħc!BĆBĦB!Ć !+ĥ¦Ćc!!cĦ !*B!c!B !+Ć!ĦBBµĦ!!Ĥ!B!!!Ħ!cĦc!B!!c !+ĆåcĆ!B!BBĦ !(Ħ!Ħ!B !*c!!cBĦ!!D!!!B !'ĆBĆ !&Ħ !,c!B!BĦĦĦ !&Ħ!!BBĦĦĆ !*Ć!BĦ!!c !'C!!Ć!ĦB!cĦ!!ĆB !+BĦ!Ħ!ĦĦĦĖ !(2ĆB!ĦB !*cBĆBĦĦĦ !'R!!!BBB!ĆB!!cĆ !*BĦ!ĦB!Ħc !(õ!Ķ!!Bc !+ĆĦB!BBB !*BB!Ć!cĆ!!Ħ !+ĦBB!ĦĦc!Bą !&Ħ!2cĆBĆĦ !+BBĦ!ĦĦ !(B!B!ĆcĆĦcĆ!Bc !+Ħ!BBBĦ!BĦ !&Ė!2Ħc!cc !*cBĆB!BĦ !(B!Ć!cĦcBĦc!Ć· !*c!CC!!BCĦ !'Ķ!BĦĦĦ !,ĆĦc!ĦĦB !(B!c!!dtt×·t×Ħ !*ĆBąąBĆĦąĦc !(ĦBBB !,cĦ!!ĦBB !(CB···R!!ĦĦ!BBBĤ !(cĦBĦ!c!ĦcĆ !)Ħ!Ć!Ć !*ĆB!ĆBĦĦ !(R×ĦĦĦ ń(ĤĤĤ !)ĆcĆc!ĦĦc!c !(B!ĦcĦc !*BBĆBBcB !) ń& !*$$$ !(Cc!Ħ!cĦ!Ć!!!ń!!ĦBB!B !+ĦĦcBĦ!C !) $+!!!ńńB !(ĥĆ!BBĦBĦ !(BcĦ!ĦĆĆt !(B¦·tt·tR !( B)!Õµtt· !*cĆc!ĦĦB!!c !&B×t×t·×× !(B×R B) !&Br b(¤ĆĦ!B× !(B÷t×tCdB!!BC !&Õ B+Ĥ!!!Õńń Ĥ* !& Ķ*BBB×B !(× !&RR t&R !' Ĥ+!!!$ D/ !&Bc¥¥¥B¦cc !* ń/ !1D! Ħ/B !&ĦĦ!!cĥĦĆ !* $' D( !- D( !0B !&c!BĆĦC!Ħc !+µrrr Q( t- Q) r,¤rÕĤ !&ĆcĆcBĥĆcĆ !*µĦ! 2FĶc· !(Ćc!!ĦB!c !*Ħ!2s2ss2ss2ss2sR22sR22ss2ss2·s2ss2s2sRRÇ×B !'BcĆ!!BBĆ !,2sĦcĆĆB!Ćc!!cĦBcBĆ!!c!ĆcĆ!!ĥĆcC!cĦcĦBds!!!Ĥ!!!BĆc!!Ħ!cĦ !,Ć!Ć!BBĆcĆ!Ć!BCĦBBĦcĆ!¦ĆcĆcĦcĆĥĆ!BCdts!!Ĥ !'Ħ!!ĦĦdC!B !,cĦcBB!cCcĦBCĆąBĆB¦Ćc!!B!B!!ĦB !&RsB!!Ĥ!!$!!!Ħc!BB!!Ć !-ĆcĆB!!ĦĥĆB!ąBBĆcĆĥc!Ħĥd!dĆBBBC×··B!ĤĤĤ !)cĆ!!!ąĥBĦ !-Ćc!CCBĆcĆĦB!!c!cĦCCB!ĥĆĥcĦ!CsB!ĤĤĤ !&$$!!2!ĆcCĆĆ!ĦB !.cĆ!!!Ħc!¦cĆBCC!ĆB!!!Ć!c!Ħ!CR!!Ĥ!!!÷tttĖń!!c!c!ą!BĦBĆB !,cĆc!åĥ!!!å!cĦ!!Ħc!ąĥ!c!Ć!!!RB!Ĥ!$×tæ!¥Bå!ńĦt!Ć!B!BBĆBĦ !*2!Ć!!Ćc!dCĆcĦ!BąąBĆ!B!ĆC!cĦB·B!Ĥ!$rĆBBcĆB !&ń!Ķ!Ć¦ĆĦcĦB !*2!!cĆcĦ!ĥåcĦBCC···÷···÷s··×·B!Ĥ!!Õ!¥!BĦB!c!!ń!BĶĆ!ĥ!!ĦcĆ !*¦2¦·÷·×··÷·×·ssBB !-ĤĤ!!$Ć!ĆB!c!BĦ !&B!ccĆ!c!Ćc !*P¦s !- Ĥ0!!!D !'Bt·t·$!!D·!Ć!cBĆĦcĦ !+P Ĥ. !1DDĦ!!c¦µr ń'!!!ń2Ķ!!!ccĆB !*$$ D=ĦĦ!!÷×s D+!!sĶ!Ħ!tt×t !, Ħ= !'ĦĦ Ĥ,!rBĦ·· !/µ r+µµń!!ńÕrr¤Õ! ń&B!!!õµrrr t)¦!!$!Õ·!!!BBBńĤ !(µĦ!!! 2(!c!!!×Ć!!ĶĆrt·÷!ĤB!µæĦ !+2R!!!D! ń&ĤĤĤ!!!D !&Ħ!2¥B2Rsss2¦t!!!Ė2¥¥¥c¥¥cC!!!õĦ!!B¥¥¥B¥B¥¥Rd!!ńĦ D*$$$ĦĦ !'2!ccBCĦĆcR !&Ķ2!Ħ!B!ĦĆR!!!Ć!!¥BĦĆĦcĆ!Ħ!ds !& Ħ*!ńńB !(cĆ!!!ĥĦc!!B!!õ!cĆĦĆ!!Ħc !&Ħ!BĦBBBĦ!c!BĦR !(Ė µ(Ė!!Ĥ !(Ćc!!!ĦcĆC !&Ć!ĆcBc!ĦcC !(BĦĦĦ!B!ĦBĆB !(Ėå Ħ'¦s!!!B!!!B!c!ĦĦĆĦ!c !'Ħ!c!!!Ħ!!R !)BĦBB!ĦĦĦc !(ńåĦ!!¥¥¥ !-Ć!BĦccĆ !*ĆĦBĦBBĆ!B !(BBĦĆĦ!!BĆ !+B¥ĆĦ !,c!Ħ!Ćc!!B !)BcB!BĆ!c !*ĆBB!B!BĦB !+cĆcB !,t!2Ćc!Ħ!BĦ !*ĦĆĦc !+Ħc!!BĦ!B !-ĆcĆĆĦ !+B!Ķc!ĦdC!B!!Ĥ!!!cĆBcBĆ!Ć !)B!Ħ!BBĦĆBB !+c!cB !,Ħ!!!ĆB!ĥĆ !(B!c!!!B!B!Ĥ !)ĦĦ!!!cĦ !.ĆB !0cĆå!BĦ !'B t'·t· !*Ćc!!B!ĆBĦ !($ !&B!B !.ĆCBBĆBBR !&µ ń+ !(ĦBĦĦĦ!!BĦBĦ !'ń!!ĆĆB!Ć !/ĥĦ!cĦC!B!!! $( !,BBĦB!ĦBĦBĦB !+c!Ħc !.cĆcĦĆ !*õµrrr t&· !'ĦĦBĦB!B!!B !+cĆĆBĦ !/cĆ¦c !)ńĆĦ !(B¦ !' B&ĦĦĆcBĆt !+ccĆB !.Ć!BąĦB !)Ħ!!!B¥B¥¦R !&BBtt··××tt×!!Ĥ !(Ć!ĦcĦ !-c×t···t!!Ĥ !(B¥cĦcĆR !&Bc· B,ń !)cĆBĆ !-c· !(R !*BĦ!ĦĦB !&ĤÕr Ĥ- !+cĆc×R !+µ ń+ !*B!!B !'D !3$!¦÷tt×tĦ !, $/ !&Ħ!ĦB !(Ħ $3!!P ń)Ĥ!!$Ħ!",
);
rawImages.push(
  "#cSĆĆ¶Bscc¥¶ÖĆtS#Ć¥B s&¶¶¶¥æĆtĦ æ1 Ħ&Ć Ħ-ĆĆt !&Ķ!B!Ķ !(B!!2B2BĦ!!Ķ!B!ĆĖæ ¶,ÆÆÖs¥æC!!æ ¶)ÖCB !(2!Ķc!!!B!!!C!!2Ħ2ĦR2ĦB !&ĖĦRRc R)BB2c2!s!!ĖĦĆĆĆĖĦBRsC !*2Ć2 !+ĦBĦB !'C!ĶĖ!2B22R2RR2R2B2 !&B!!ĦcccRBR¦ !*BĤ@R!BRC !(BĦBĦĶĶBĦ!!!Ħ!2!2ĶBĦ!Ħ !&ĶBĦ!c!C !'B!B !&B !'2ē!RRRBsĦ !'ĦBĦB!Ħ!BB!!Ķ!2BĦB!!B!ĶBĦ2BĦBB!ös!!!B!Ħ!Ħ!!!R !(ĤÆ!BsBC !(B !&ĦB!BBsÕ222ĦBĦĦBĦBĶĶBĶĦBBs !&2!ĆĶR2R !+Ñp!ÃÔ !,cBcBcRRRC !'2Ħ!2Ħ2ĦBĶĦB !(Ħt2!Ķ!!Ķ !,yĜęù%··s !(s!!RRRccd !'2ĶBRĶBĶRĦ2BĦB!!!d!B!RBĶRĖBĦ !+µµó!µ Ħ&ĖĖ!!ė···dddCC !'RĶBĦĖBĦBĖBĶB¶ss·×ssĦ!cB!Ħ2ĶĶ !) B&!!! õ& ą&B s,ö!¶cÖBc¶s¶s¶s÷·×××sĦĦöĖĖ!!!Ħ22B !) R&!!×Ć¶Öö B&µµµÕÕÕ ö'!!·ć·ćć ×(ssĦĦĦöĖĖĥĥĥĦBBĦ2ĶĦ !*222Vè!!öæÆR¶ÖöBBBĦĦĦąµ 1&Rąąõõõąąĥĵ1QµÕõõõĥĥĥ!CCdBB!ĖĶ !'C !&2R!ĥætķħħħçÇ¦333 S&ÇħħQ¶QħħķbÆQħć÷×·S 3*ĶĶĶ¦çħçB2 !+2!Ē !Ts2 !*2Ħ!!!¦ C4!Ç!CCC!Ç! C7!2 !*ĶB!!Åģ !4ħ!ħ!!!ħ!ħ !BĦB!!!c 23B!B222B!B 27 !-2Ħ!!$R 23BPB222BPR 27 !-2 !&B 24! 2'!! 27 !-Ħ !' 21£P!!!PPP!!!P 26 !-2 !&Ó 20ńöąąC Ħ'Cąąńń 24B !+2!2!!!Ę !.PĤĥĥ33 ĥ)¦3ĥĥĤr !32 !*Ķ2Ķ !& Ķ-Pæĵ¦#ĵĵ #)åĵ##ĵÅr Ķ1C2 !+Ħ !&ĥ Ķ,aæ#¦æ###!!!###Ö###!##Å¤ Ķ0 !-sR !& Ħ+µÆ#¤Æ#ĥĦBĦĦĦb!!·ÖĦĥ#Ħĥ#¤ Ħ0ÇB !*sRc !& ĕ*ÕÔQõõĖ0Q¥Ö¥QQĕbõõB¥Q0ĖQõca ĕ/ !+dħ÷×!!!Ħ q*Ô!Ç¤Ç¤!SsĦsS!!ĕĦĦĦs!!¤Ç¤¶ĥ q/Ĕ !* ö& !& ç,BCB!S¶BBB¶S!S B&!!!B!B ç0ĥ !*µµrµ !& ¤-Æ¤Ç¶ !'¶Ç¶!!!Ö!!!¤ç ¤1C !*ĦĆĆĆ !& ø+ććCćdCCĦĦCCCdCCCÖÖ ć&Cćć ø/T !*Ħ2cc !& S+ !(ąööą !'µÖ !* S/!!B !(ĶRB !' B+22R2µąöææ! R&ąæ 2(R22 B/ !,ĦĦ !' B+22B2ö¥ö2ö× B&×ö22ödö2B22 B/!×d !)BBĦ !& Ĥ+BB! B&æ×!!!Ħ!!×ææ×!×B!BB Ĥ/@öss !)Ħ !' ĵ,2Ĥ222ÆµĤĤĤĦµĤĤĤµµĤĤĤ2Ĥs ĵ0ÕĥöĦĦ !(B !' S,ĥSĥ22µ!!!$QĆ· !(SĥSå S0·ĦĥõõĖ !'Ħ !' $+ !&R!$!!!ńė!Ć· !&SÆ !& $/Õ!æ¥Cąą!!2!BB !& R+ctĕtåBr$!!!ńėBĦt!!tBrtĕtc R/!!!2ĥ !(Ħ !' Ķ+Ĩ2!2¦õ2¤$ !&222¦¦2õ¦¥!2Ĩ Ķ/!!!ĶCd!!!BĦBB!!!B Ė,sSå!SåĖQ$!!! Ė'åS!rS! Ė0!!!cą !&B¶sR !& Ħ,uRCåRCĕĕ¤CCAĶĶRĕĕCRåC2è Ħ0¹!2!Ħsd!!sddd !& Ķ-Øc3åĥ3¦å ĥ'å33ĥå3Bø Ķ1Ė !*×sss!!!C Ħ.¸Ĉķķĵå ķ)ĵĵķėsØ Ħ2öB2 !(Õööö !& ĥ0ćcėėĆ Ħ'Ćėėsħt ĥ3ąC !*Õµµ !5Çħ!Ć!ħħħ!Ć!ħ· !8B !(Ħææ!!!÷ 23!B!222!B! 28!Bccö !,æ !32!2!!!2!2 !9Ħ¥Rąą !'B!!ń! C232·2CCC2·2 C8!!2c !. 22BRńRBBBRńR 28!ĦB2!× !)Ç¨Ķ B4!B222B! B9ĥ!Ħ !*ĶV!Ć 24B!B222B!B 271!!BĶ !'2BĶ!Cģ ´&õõĥŅ ´+õ·DćÔ´´R×R´´õŅŅõ ´-õŅŅŅ!ĦĶĦ !(22!Ēĥ!!ĦĦ !' Ħ+ !' Ħ)!!!ĥ Ħ- !&ÕĆĦ!2 !&Ħ22!!Å×ĦĦĦ !&Õ Ħ+!!!ö Ħ*ą!ö Ħ.!!Ħö!ÖB !)cB !&ĦĶ2!!RĖ!ĦÖĆ Ħ&ĶĦąĥ!!!ĶÖĖ Ķ&!!!ĆöÆöĖĶĖĶĶ!Ķ !)ĦBĶ !*Æ !/Ķ2Ķ2Ħ2 !'R!BĦ!Ħ !(22BĦB2ĦĶ !)22Ħ2 !(Ñ±!ÆĄBĦ2B!B !'2Ķ2ĶBĶ !'B!!!ĦBĦ !(ĶĦ!ĦĦBĶ !)2ĶBĶ !(»ùÆseBB !+Ķ2Ķ2Ħ2Ħ!!R!B!ĦBBĦB !'2!B!B22B !)2BĦ !*ĸ!!!Ħ2!!R !(BĶBĶB !*BĦ!B !)2ĦBĦĶ!!Ķ !(BĦBB !*U!!ĦĖ !+ĶBĶB2ĦĶ !)BĦĦĦ !'cccBcR22RB!!ĖĥĦBĆĦ !+De!!B !+2!2!!BĶĦöBd!s2Rs¶¶d!!!scc R(·¦sĦ!!!¥s¶s !*BöÖ!Ħ !+ Ķ'ĦĶ !'çÇ¦¦dd!!!ÇÇ× ·&×××ssĦĖĥ!!!ķ××× !)ĶĦ2ĶB !/ĶB!!ĥ!!Ħąąĥĥĥ!!ö!ąąõõĖĖĖ ö'Ėĥ!Ħ!Ħ µ'!",
);
rawImages.push(
  "#cSStĦÆĦæĆĦæĆĦ#tQQĆÆ æ&ĦĦĦĆ#SQt #1 t&S t-SS# !(ĦĆö!B !)BcBcĆ!!Ħ!B!öĥÕ Å,ÕÕÅQböĤ!!ö r)ÕĤB !)ö22sĶĦ !)BĆBĆ¦CĆc !&ö!22B 2)!!2¥2 !&å Ħ&ĶĦcC!Ĥ !)R2!Ćs!!!Ħ !&ĆcĆc !'Ĥ!ĥĶ!2RB2s2ss2s2R2 !&B!!!BBB2BCs !+ð}s !&R !'cĆcĆĥĥcĆ !'Ķ!BĦcĆ!Ć !&ĦcĆ!RDĤ !'c!c !&B !'Bø!·cĦBtBń !&ĆcĆc!Ć!cR!!Ħ!2cĆc!!c!ĦcĆBcĆcc!Ħ !&c!Ć!Ć !,Đ!!öCd·BĤ !&2 !&Ćc!!B!DB22ĆcĆĆcĆcĦĦcĦĆc!t !&B!æĶ¦B¦ !+¡øĥD~RR !*c!c!cCCtĤ !'BĆ!BĆBĆcĦĆc !)ĤB!2!!Ħ !+ĤĹ5tĤęńńĤĤ !'sö!tttssń !'BĦc¦ĦcĦ¦ĆBcĆc !)C!Ķsåcą !*$$$Ė!D !*µrårńńńĤĤ !'2ĦcĆåcĆcåcĦ!×tttBBń!!sB!ĆBĦĦ !) B&!!! D& $& !/·c÷Ćc×t×t×t×tBBBńĤĤ !(ĦBBc !) Q&!!!örÕÕ B&$$$DDD !)ĤrĤÕr ń*ĤĤĤ!!!DDDĦc!!CĦĆ !*2225y!!ĖææQrÕÕBBBĦĦĦ$÷ t&Qttdddttt¦×Ę$ D)!ĤĤń!B!åĦ !,Ķ2!ĥėCøèèèÈeeėėė ķ&eèèæcæèèøösæèèØ§Cķ ė*ĹĹĹeÈèÈcB !+2!ĳ !UB !*Ķ !&Ö R4!µ!RRR!µ! R7·C !*2!!!đÃ !4R!R!!!R!R !8å !,c!!!¥ B4! B'! B8!¦ !+ĶĆ !& 23B!B222B!R 27 !-2!!!D! 24! 2'!! 27 !3 21µ0!!!000!!!0 26 !-Ķ !&Ã 20ĤÅÕÕt Ħ'tÕÕĤĤ 24 !,Ķ!B !2PĄõõdd õ)÷dõõĄŅ !<22Ħ !& Ķ-PÆą÷Sąą S)rąSSąõŅ Ķ1 !3 Ķ,aÆĕ÷ÆĕSS!!!ĕĕĕėSSĕ!Sĕõ1 Ķ0!R !+s¦!!!÷ Ħ+A¥ĕ÷¥ĕ3ĦBĦĦĦ·!!ńėĦ3ĕĦ3ĕÕ Ħ0¦ !+sCR!!!t Ć*bµĦ!cĵķĦ¥õ¥ĦĦÆ·!!ń¥ĦķĵĦ!c@ Ć/!B !)õrPń!!!ń Ĵ*µ!3ķ3ķ!Æ×$×Æ!!Æ$$$×!!ķ3ķ÷Ö Ĵ/Ĕ !2 1,ń¶ń!ÆÕńńńÕÆ!Æ ń&!!!ń!ń 10õ !*÷÷·÷!!!D ķ-åķ3Õ !'Õ3Õ!!!·!!!ķ1 ķ1t !*ĆæĦæ!!!Ħ 4+22!2ń!!$$!!!ń!!!·Ö 2&!22 4/T !*Ħ2BB!!!B c+ !($µµ$ !'·Ö !* c/!!R !(2s!c!!!ö B+22!2·$µææ !'$æ 2(!22 B/ !,Ćc !&P B+22!2öAö2ķń !&ńķ22ķĵķ2!22 B/!!ńĤ !(c!Ć !& Ą+BB! B&ħń !(ńħħń!ńB!BB Ą/r !,Ć !' ą,2!222ćń !&Ę!!!ńń!!!2!¶ ą0P !,c !' ¦,õ¦õ22ń !&¦ÕĘ !(¦õ¦r ¦0Ę!DDD !(Ć !' D+ !&s !(å!ÕĘ !&¦å !& D/P!ĦbĤ$Ħ!!Ķ!cc !/·×å×rR× !'åRą×!!×R!×å×· !22D !(Ć !0÷B!B÷µB÷ !'BBB÷÷Bµ÷µ!B÷ !2BĤB!!!BĆc !' Ķ,r¦r!¦rö¦ !& ö'r¦!!¦! Ķ0!!!B$ĤB!!c×tt !& Ħ,vstrståå÷tttĶĶsååtsrt2è Ħ0É !*tńńń !& Ķ-Ø¥drõd÷r õ'rddõrdBĘ Ķ1 !&Ė!Ĥ!!ń !) Ė.§ĘCCąr C)ąąC#¶è Ė2Ć !*D !) Ė0Ĉc##ĥ Ħ'ĥ##sĨT Ė3æ!Ė !)÷÷÷ !5ÈĨ!Ę!ĨĨĨ!Ę!Ĩ¸ !8C !)ææ!!!É 23!R!222!R! 28!Rss !,Ĥ !42!2!!!2!2 !9ĖÕQ$$ !, R2B2ń2RRR2ń2 R8!R!B !. B2RR! R'!R B8!!!B!ń !)WÉĦ B4!B222B! B9 !-25!! B4c!cBBBc!c B7ą!!!Ħ !'C!Ķ!CÃ å'ÃÃ å-r!rååå·D·ååÅÃÃ å/ÃÃÃ!Ħ !*ĥ2!ĳĥ!öööĦ !& ö, !& ö)B!! ö.Ħ !'õ!B !&ĦC2!!đD!ĥĥ!Ħ!!! ĥ+!D!!Ħ ĥ)Ħ!!! ĥ,!!D!!!õ!Ć !(sc !'æĦ !(Ćö Ħ&!ĦR !'ĆĆ !*ĆÖæĆ!ĆĆ!C !)æĆcĦ !*å!!!¥B !'ĦĦ!ĦBĦBĆB !'CĦcĆ !)Ħ22cĆc¦Ćĥ !)2BĆB !(¡âcT-ĥĦC !*BĦBĦcĦ !'R !'Ć !(ĶĆ!ĆącĦ !)ĶĦcĦ !(êqCĔĻ·dĥĖ !)ĦBĦBĆBĖ !&B!Ćc!!c !'2!c!cBCd !)2cĆ !*8!!!öĥĆ !*cĦcĦc !*cĆ !+2ĆcĆĦ!!Ħ !(RĆcc !*q!!!Ħc !*ĦdĦdCĆĥ !)cĆĆĆ !'R·c!cBĥĥB!!Ĥ!DĦdĦĆ !+Xz!!BĆ !*B!B!!cCĦ!!ń!cCC¦×× !&ÇdR t)RB !&sc×t !*crö!Ħc !*ĦĥĦĥĥĆĥ !'µPPPńńń!!PPP ń+Ĥ!D!!!µńńń !)Ć!åąB !/Ħc!!D!!Ħ$$DDD !&$$DD !+D!Ħ!Ħ $'!",
);
rawImages.push(
  "#cS Ć+ttt##Ć¶22s¶s¶¶s¶ĆĆtt ĆC#!! s&ÆÆööbµµąsd2!!!ĦB!ĦBĦ !) B+ !&æ ¶/æ!× !(BĶĶĆĆæ¶¶Ć!s2!!Ħ!!Ķ!!B !&B!Ė¶¥ R&¶ĦC!!!BĖĦĦĦ Ķ,ĦĖ !(BBcRccBcsc!!RB !&2BĦ !'C!ĆĆĖ!!!cc !+2csRRsRssRs¥s !'Bc!ĦĶĶ!BĶĖ!!!B!!Ķ2!ĶĦBĶĖ !&BĶ!R¥c¥B!!sd!!Ħ!!2c2ĶB!ĶBĦ!B !+Ķ!B!2ĶĶ2!!ö!CB!Ķ2ĦĶ2Ķ2!!ö!R!Ė!2Ħ2Ķ!!B!sd !'2!ĶĦ22ĶBĶ !,ĶRĦBĦ2ĶĦB!ĥ!!B!!Ć2!Ķ2ĦĦ !*B!2ĦĦöÕ!sd!2!!!ĶB!2Ħ2Ķ2!Ħ !+ĶRĦB!!BĶ!!!s2!!!2!B!2 !+Ħ2ĦB!ĆĦö!!!B!!!Ķ!BĶB!2!!B!C !)ĦĖBĦ!2!2ĦĦĦ!c!!BĶ!Ķ!2 !&B!!!B!ĶB!Ķ !&R!R !'Ħ2Ħ !&Ķ !,B!2!2ĶĶĶ !(Ħ22Ķ!Ħ !*Ħ!2Ķ!2B !'2!!Ħ!Ķ2!BĶ!!Ħ2 !+2Ķ!Ķ! Ķ& !(BĦ2!Ħ2 !*BBĦ2!Ħ !(B!!!222!Ħ2!!BĦ !)sRBB2R2BRR!ĆrQĆ¶¶RR2RRB2ĆÅQböÆÆBBcBBcBĖÕb¤ĖĖÆ¶cRBBBc B&cĶ !) ¥+ Ç3· ć@ !* Æ* ¤4 1>µ !ºĠĠ !-R !O2Rm<<B2Ġ !,B !M2R]ŀ!2cB22Ġ !+Ħµ !I2R]L,!!ĦRĖcB !+Ħ !'× !4|Đ !/2Rm]<2!B2!!!RR!ĶH !+BB !'C !0¿Ħc !-2R°L 2&B!!R¥RĦÖ!!Ġ !,C!!!c !.ðŀ!¿ĆB!ķñ¿İßĀ !&2Bm !(R!RR!ĶBRR¶ !-R!!!c !,ĠðĥRıÇsc!ĀåSõĦĥ!!!2B}22RRtRR!RĦööĆĦ!!!cŀĀ !.ć !*Ġðõĥ!Ħ!Ìt3ĶĴb!CBd !&Ā¥¥¥ĆĶĥ!ĦööĖ!ĦĦĦB !&cĀ !,µµ !)¥BĥĶĶĶÕÅÐąRöd2ĥĕdRm!2Ġ!ssÖc2ĦöĖ!!ĦĖĶĶĶ!!öĶB!c !-B2 !'¥BX!!!ĦĆæÕĶåRąC22ĖBB!ĠBBööĆööĖ!ĖĖBĶ !)Ćö2!Ā!!!Ķ !(¶ !'BB··!ĶĦRRrC!2Ė3ĥC3RB!<RĦĦ!!ös!!Ė!!R!ĶĶ!!æÆĖ!c2!B !,Ħ !'B!!!íBR!!Rĕ!2!!C!BR2!R!!222RSBĦ!ĶĶdćÆ¥B¥Ć!!cB !.BĦ !'c·ö!Đíí!!!Ė2C!22cRc!ĦĖĖRc!B¶ÅĆ!Ķ!2!!öĖcdR!R!!2!!Ā !4ą2ĀĀS!ĶcC!B2RRR2ĶĖ!õRĦB¶!Ħ!!!2!bąccdAc¶ĖĶB!2!!ð !2ą!HBýĭ×BC! 2&!BĶĖĆÅć!!¶!Ö!!!B !(åcÖ!cĖ!s2 !5döĶy!!RC!22!BBB!ĖĆą·!ĖsSö !(ÆÆĦdĞĞĶRÖĆ!ö !82Ķ !&¶BĦą2öĆĆĖÅą·sĶ!tÕĦ !'ÆĆĦdÝĖ!Æ!c !&2!!y !3cRd!!B!Ħ#tcĵÆĖÅ !'¶ąĖ !(ĆBdxĄÅædÆ2sR!!cB !5d×RRR2!!ÅÖÖtBÆd!·sĶ!SĆ !'2RB!!ė¥Aa)d!RssĶ !.2 !'æ!!ĥµõĖĖI!¶ÖAsæ!!RC!!2cąĦ!!!2B!Rddxĥ·!ėa)ç!!BB!R !+ĦR !'Ķ!sĦĶĦ!!!sRķ4çC!R¥ss!2SĆ!!2BRcsS!xėC!!!Ė!!·cR!!B !,R !'ĶÕ!d2B!!!It !&CCd B&ąĦ!22BBSS!åö!ĵ!CÕ!c¬!SC!!!RĐ !*¥!s !)¦!!!Rs i'!!!¥2!SĆ!!BcRS!µµ!!ÕĶ!ĥsRB!½½!2 !.C !(æÕsRtRRB !&ĦĦěËx!!dą!!!R!Ķ!µ!ĖĖàs!ÕCsB!2!2ÝĎ:c !,ą !(ĦÆ! B&!!!ĦĦõ¤ÆĖ!¼Üĕ !&ĖĖĖµ!ĖR!æ4!¶QB$2!222BKĦ !51Õ !&ĦĦõ¤ÆĖ !&Ķ!2B !(ĖR!!!J4T$$2!222BKĥ !-Ė !+ÆrÕĦĦ!õöĖ !(Ķì !&Ė!B!R!ĖĖRæĎBB2!222!K!!Ķ2 !'Ė!!!Ć !,ĆÆQQQÆĖ !*Ħ!B !&Ħ!!ĖR¥BĆĖ!2!222!B!ĥĦĶ !'Ħą!!!Ć !;ĶìĶR!!B!!!¥R2B2ĶZ!222!BK!!ĶĖöX !EĦB !'RR22ĦĆĆĖĆJ22!BK!!ĦĶĦ !GĶìBR!!B!ĖĆĆĦ !&2ZJBK!!ĥĶĖ!y !+B !=ĦBBR!!BRRss¥¶¶¶BddK!!ąĦĶĦö !'Ė !&B !=ĶìBR!!2ccBBSCCddĦĦ!ĥĥ!ĦĖ !.B !>ĖÜ22!!!CCCBBBĦĦ!!ĥ!ĦĦĖĦöy !JĦÜ2BSdBBBÛª x'¼¼ÜüĬ(y !-B !@Ħ¼¼x W&æĖĦ !82!! ¥& c* RL !)B!! ×& ÷* ćM!s !&BÆą b)µÕ!!µb µ+ö!öµQA b-µö!!ĦµAA b'rµ!!ö !)ĆĶĖĖĆĦĦ!!!Ħ!· d& ×'s!!!ĶĖĆĖĦĆĖĦĆĦĆĦĖ !'B!ĖĆĆĦĦĆ !/ĶĶ!BĶB!C!!! ą'µ Õ'!s!æĖB2Ħ2!Ķ2ĦBĶ2 !(ĦĖ!B!ĶB !.BĦBĶĦ !'Ė!!öÖ¶¶¶ R&¶ !'Ħ!BĶ2!2!Ķ2 !+BĦĦ2Ķ !/BĦ!B!2!R!!!ĆĆĆĦĦĦ!!!cR !&BB!!2ĶĶĦB2ĦB !+BBĦ2 !,2!Ħ222Ħ2!!B!!!ĦĦ2RBc¥c¥Rc!!!BBBss¥¥¶¶ss¶R !*Ħ!ĶBĶ !,2!!ĶĶ!BĶB !&ĖĖ!22cBĶBĦc !&BcR d-!!!Ė!!!BĦ2Ħ !/BĦBĶĦ!!B!!!ĶĖR!2Ķ!ĶĶ2 !&dħç× s.!ö!!!B!BĦBcB !+2!!BĦRB !'ĥĖ!ĶR!2!!2 !'ąĖ!Ħ !.ö!ą!RÖss¶sB!d !)ĦB!Ħ!2ĦĶ2!C!!Ħ!!RĦĶ!Ķ2 !)ąÕÕ µ.ąą!·ė ×)s!!ą!!",
);
rawImages.push(
  "#c S, Q'SSStÆÆæĦĦæĦSStt SC#!! r&¤¤õõ $&!ńB !&c!ĆcĆ!!!Ĥ !,ńB !&Õ ¤/Õ!ń !)ĶĶæærrrĖ !*Ħ!!c !&B!!µ¤ r&µ!Ĥ !&Ė Ķ.!ĖÕ !)B¥c¥¥B¥ÇR !*BcĆ!Ė!!!Ĥ!µĦĶ!!!B×D !+c¥BB¥B¥¥Bsç× !(¥!ĆĦĦ!cĦå!!!Ĥ !'ĦĆcĦ !'ńĶ!2¥B¥c!!!B !(cBĦc!ĦcĆ!c !+Ħ!c!BĦĦB!!D !(ĆĦBĦB !(Ķ!2ĆBĦ !&ĤB !'B!ĦĆBBĦcĦ !,Ħ¦ĆcĆBĦĆc !*B!ĦBĆĥ !*c!BĆõĦD!ĤB!2!!!Ħc!BĆBĦB!Ć !+ĥ¦Ćc!!cĦ !*B!c!B !+ĆBĆc!µĦ!!Ĥ!B!!!Ħ!cĦc!B!!c !+ĆåcĆ!B!BBĦ !(Ħ!Ħ!B !*c!Ħc!Ħ!!D!!!B !'ĆBĆ !&Ħ !,c!B!BĦĦĦ !&Ħ!!BBĦ!Ć !*Ć!BĦ!Bc !'C!!Ć!ĦB!cĦ!!ĆB !+BĦ!Ħ!ĦĦĦĖ !(2ĆB!ĆB !*ccĆB!Ć !(R!!!BBB!ĆB!!cĆ !)cB!!ĦBĦ!BBąÕ××ÕÕcRBĦBB!ĦÕµ×÷÷¥¥!!c!!c!õÕ÷÷õõ¥¥cB!!!c !&c¤ !) B+ d3C ·?ć !* ö* Õ4 b>Ħ !ºĠĠ !-Ĥ !O2sm<<B2Ġ !X2s]Ġ!2cB22Ġ !+$$ !I2s]Lİ!!ĦRĖcB !+Ė!ńB !7|Đ !/2sm]ŀ2!B2!!!RS!ĶH !2C !0ÀĦc !-2s±, 2&B!!R¦SĦÕ!!Ġ !0B !.ðŀ!ÀąB!ćñÀİàĀ !&2cM !(S!SS!ĶBRR¶ !1× !,ĠðĦRġÆtd!İåRöĦĦ!!!2c^22SStSS!SĥõõąĦ!!!cŀĀ !.ń !*ĠðöĦ!Ħ!čs2Ķĵc!BBc !&à¤¤¤ąĶĦ!ĥõõĖ!ĦĦĦB !&cĀ !-$ !)çBĦĶĶĶÖÕlĆRöc2ĦĖcRm!2Ġ!ss×d2ĥõĖ!!ĦĖĶĶĶ!!öĶB!c !.B !'çBy!!!ĥąæÖĶæRĆB22ĖBB!ĠBBööąõõĖ!ĖĖBĶ !)Ćö2!Ā!!!ĥ !(µ !'RB!·!ĵĥSSrB!2Ė2ĦB2RB!<RĦĦ!!öt!!Ė!!S!ĶĶ!!æÆĖ!c2!B !,Ħ !'d!!!ČCS!!SĖ!2!!B!BR2!R!!222RRBĦ!ĶĶsėÇ¥B¥Ć!!cB !5R!!!ðČČ!!!ĕ2B!22cRc!ĦĖĖRc!B·ÅĆ!Ķ!2!!õĖcdR!R!!2!!Ā !4Ħ2ààR!ĶdB!B2RRR2ĶĖ!öRĦB·!Ħ!!!2!QöccdAc¶ĖĶB!2!!ð !2Ħ!iBĝ)ÖBB! 2&!BĶĖĆÆĆ!!·!Õ!!!B !(åcÖ!cĖ!t2 !5BµĦÝ!!RB!22!BBB!ĖĆĆ¶!ĖsRõ !(ÇÇĥdîîĶRÖĆ!ö !8BĦ !&¶BĦĆ2öĆĆĖÆĆ¶sĶ!tÕĦ !'Çąĥd¬Ė!Ç!c !&2!!y !2Ĥ·¦B!!B!Ħ#scĶÆĖÆ !'·ĆĖ !(ąBdË@ÅæcÇ2sR!!cB !4DńPĤĤĤ3!!Å×ÖsCÆc!¶sĶ!Rą !'2RB!!×·¤´ĝc!Rssĵ !.2 !'Õ!!DĘDDDi!¶ÖAsç!!RB!!2dĆĦ!!!2B!SddËŅB!ć´ĝç!!BC!R !,2 !'Ħ!!ĦĥĦ!!!tRķ3çB!S¥ss!2Rą!!2BRdtR!Ë×#!!!Ć!!·dS!!B !,¦ !'ĶĦ!BCB!!!it !&BBdBCCCĆĦ!22BCRR!åÖ!Ņ!#Ħ!cY!RB!!!RĐ !*P!s !&Õ!!s !'8ĺĺĺ8!!!¦2!Rą!!BdSR!µµ!!Ħ!!ŅAcB!jj!2 !5ĖĦ !(ĤĤ!!!Ĥļëx!!cĆ!!!S!Ķ!µ!ĖĖÐA!Ħ#cR!2!2¬ÝĮd !,$ !)ÕĦ !' D&$÷¤ö!»ëĖ !&ĕĕĕµ!ĖR!æĘ!AbRĈ2!222B|ĥ !4ĖÕĦ !(ĦÕ¤ö !&Ħ!2B !(ĖR!!!{Ę4ĘĈ2!222B|Ħ !6ĖÕöĦ!!ĦĦõö !(Ķċ !&Ė!B!R!ĖĖRçĿBB2!222!|!!Ķ2 !+µ !+ĖÕ¤bb¤¤ö !*Ć!C !&Ħ!!ĖR¥Bąĕ!2!222!B!ĦĥĶ !'D !&Ħ !;ĶċĵR!!B!!!¥R2B2Ķ®!222!B|!!ĶĖöX!!!ĦĦ !@ĆC !'RR22ĦĆĆĖĆ{22!B|!!ĥĶĦ !'B !AĶċBR!!B!ĖĆĆĦ !&2¯|B|!!ĦĶĖ!y !&Ĥ !BĆCBR!!BRRss¦···Css|!!ąĥĶĦö !(B!!!B !=ĶċCS!!3ddCCRBBssĖĖ!ĦĦ!ĦĖ !Köë23!!!BBBRRRĖĖ!!Ħ!ĥĦĖĦöy !,c !?Ėë2CRsRRRČ» x'»»ÜüĬ(y !-t !@Ė»»x G&¤öĖ !8B!! ç& ·* sL !)Ħ!! B& s* ·M !)æQÕÕrrÕµµöĦĤĤĦµ Ħ+ĤĤĤ!QQÕr Õ&rrµµÕĦ!ĤĤĤĦrQÕÕµÕÕö!ĤĤ !*ĆCBBĆBBR !&µ ń+ !(ĆB!ĆĦ!!cĦBĦ !'ń!!ĆĆB!Ć !/ĥĦ!cĦC!B!!! $( !,cBĆB!ĦBĆcĦB !+c!Ħc !.cĆcĦĆ !*õµrrr t&· !'Ć!cĦB!B!ĦB !+cĆĆBĦ !/cĆ¦c !)ńĆĦ !(B¦ !'c!!BĦĦĆcBĆt !+ccĆB !.Ć!BąĦB !)Ħ!!!B¥B¥¦R !&B!tt··××tt×!!Ĥ !(Ć!ĦcĦ !-c×t···t!!Ĥ !(B¥cĦcĆR !&Bc· B,ń !)cĆBĆ !-c· !(R !*BĦ!ĦĦB !&ĤÕr Ĥ- !+cĆc×R !+µ ń+ !*B!!B !'D !3$!¦÷tt×tĦ !, $/ !&Ħ!ĦB !(Ħ $3!!P ń)Ĥ!!$Ħ!",
);
rawImages.push(
  "#c#t Q0ë»»Ëëë Ë&ëËëë û& ě(Q t7#ĆĚw ¼* Ì'!Ė22BB!cB!B2RB 2&ĶĦĶĶĦĶĦ !=2BB2!2BB2B!B!2BR2ĶBĆĦRBBĖ!2Ķ!Ħ2!!RBĶ2!!©ww F,wFFVVwwĚ !&BĦ2!2B!ĶĶĦBĦ!B2!ĶĖĶ!!Ė2ĶR22! 2'ĶB22!!ĶĖĖ!R!!!R2R2RĖRRBB!2 !&BæĖĖB!Ħ!ĦBB!c!ĦĶ2!ĶĖR!!ĶĦ!!Ħ2ĶR!22ĶĦBB!!Ħ!2!Ħ2c!ĖRĖĶĖRĖĖBcBc !&Ħ!!2!BĶĦ2!B!!!BĖĦ2scĶRc!BBĦBB!Ķ2!2BBĶĶ!!Ķ!!2BRĶ!c!RRR22R!2 !(Rc¶2!!!2!ĖĖ2Ķ!!2!!222B!!ĶĦB2ĖĶ!2!!3Ķ2Ķ!û!!B!Ħ2ĖRĶĆæĖĦĶc2!ĖR !'Ė!ĖRĦ!B!!2!22!!BBB!ĦBĦĶ!!!Ħ!2!Ħ!2!ĥCC2 !&ĦĶ!Ć2B!ĖõĖ!R!2ĦRĖ !(BBĆĶĦĶB!!23Ħ!!B2!ĦB!!!22!!!B2!!C3C!!C!ĥ!2 !&cöĖRtRc!Ć2söd !'2Ė!!2BBBcBB!B!!ĦĦ!!!ĦBBĦ2BR2CBR !,BĶ2!RĦs2R¶R!ĖsBC·ĵ !'B!ĦBBBĦĦĶSĦĵĶ!Ħ!!ĦBBc2!RBBC3!CC2 !&ĵĵ!Ħ!Ħ!!!ĆĦĆRB!R!B!Ė!!3 !'Ħ2ĶĖ!ĖR!!ĕB¡²DĒòââÂ¡¡²Â²¡¡ n'¡ n&¡¡DÒĢĒĢĒĒĢĒĒâÒâÂÒÒÂÒ^^n¡Âd!!!Ķ!!Ė!Ķ!ĶSĦ!AA QOrµR!!BsB!!2ĶĶSĕB!!R ¥OcB!!!ĦĆ22B!!!ĥ!3!2c !VB2BĦRBCSĥ !& r1Ħ !&rt !( r2Ć !'cĖ!ĦB!CĕĵC !5Ħ !&÷õ !=BĖB2d2!ąB!ĥ !5Ħ !&rrrt !6Ħ !'2Ė2ĕ!Ė!ĦĖC !'Ę× ·.B!!!r$$÷µt !&÷× ·/ !'Ė!c2B!!!ĶR !(Rd ¦.c!!!÷!!t×õ !&Cd ¦/ !'BĦĦ!!2B!!Ħ !(ń P/Ħ !& õ& !' P1 !'2!2Ķ!!222 !X2!B2Ķ3!!SBS !6µ r. !:B!ĦĦĵ!Bĵ !X23Ķ!!!ĦSĦ3 !V222!2!S!!ĦBB !'Ę× ·K !&22!!3!ĵSS !*Rd ¦K !'33!!!SBBB !)ń PL!!!NÂ K' +( !W D- !UĚ w+©©© !X22!!!2B22B !W2Ķ2B!B2!22Ķ !'Ę× ·K !*ĦB2!B22B !'Rd ¦K !'2BĶ!!ĶBĶ !*ń PL !'ĦĶ!R2!Ħ!Ħ!2 !YB22!ĦĶ!Ħ !X2BĶ!Ħ2!!BdĶ !V22Ķ2!!ĶRBĶĥ2 !V2!22Ħ!222BC3 !'Ę× ·K !(ĖCRBBĶ33ĥĵ !'Rd ¦K !(cĵ323SĵĵC !(ń PL !'dC3!3!ĵ33!3 !UNÒ K(] K& !W D- !UĚ w. !'Ę× ·K !'ĖĦĖĖ Ħ) !'Rd ¦K !'2Ķ2RĶĶĦ Ķ& !'ń PL !'Ķ!BĆR2BR !UĶ !&2RĆĖĖB!ĦR2R!B!!××·· tId!Ħ!!!ĶĖ2R!ĦĶBĖB2 !&BBcc ¥Iss !'Ķ2cR!R!RB!!B !OBBB !&BBĖ!!!BBĦB!· t+!ĆCĆĆ! t5ĦĆCĆĆ! t*!!B!Ķ2RĦB!Ķ!2ĶÊúĊêêêĊúúĊúHxĺx«HěêĊÚÚêĊúěĊĊěĊńBgººÊī'Ê7GĻúĊêêêúêêõ!!!R22sR222BB!23B2232C3Cĵ!3!!!ĥ!ĦR22!dB3C!3!!!Ħ!ĶĦ2BBĦĶĶĶ2BS2!!Ħ!Bc2!R!2RRBBCS3ĵ32Cĵ!!2ĵ3!ĵĶ!BdSB32S!!!BĶ!ĥ !&ĦĦB!2ĦBĶĶĶ2Ķĵ3B!!!2BBBĶ2Ķ23!!!ĵ!3!3ĵ!3!Ķ3!3!Cĵ!!B3!C!3Ħ !&C !&BR22ĖB2!Ķ2ĶC3ĵ!!!N¡}}m}m}]K]]K] K&]] K(]K]+++KKK;KK++KKK!!!B22!ĦsĶĶ!BCCĥ!3!!!ĚVy¼ÜÌÌÌ!Ì¼ÌÌÜì!üÜ¼¼yiyy¼¼¼ Ü) ü(!DDD!!!Ć2ĶB2ĶĦ2BBBC!ĵ !)B2Bc!ĖĦĶĶ!2!ÆæĆĆĦĶĦĦĆĆĆ æ)ÆÆæææĖ!ÚÚûĤ2Ħ!ĦR!Ė!BB3 !,cĦĶBS3!!RB222!!!Ħ!!!BB!B!!B!!BB!BB!RR!!!C!!!ĶcR!Ķ!BB2ĵąĕ!ĵ !(ĶR!2!ĵ!!ĖĶRB3!!ĦĦĦBBĶBBĦ!!Ħ2BĦĦ¥ĦRR2 !&ĕ!!!R!Ħ!ccB23Ķ2 !*R2tS3!3!BccCĶ!!!RBcBĦ22Ħ2BB!2RB¥Ķs!2Ķ!B!!Sĥ!BB222 3&!C33!3 !&Nâ° K'!Ð°]KmK!!ĶcĦĦcBĆ!2B!c!ĶR!2!2!22Ħ!mKm!Ð°°}m K,]¡N!",
);
rawImages.push(
  "#c#t Q0ĻěěīĻĻ ī&ĻīĻĻ (& H( Q7tSĦĺê Č* ĝ'!Ħ222C!S2!23CC3222ĵĦĶĶĦĶĦ !=3CC3!3CB2B!B!22C3ĶC2C2Ħĵĥ!2Ķ!ĥ3!!RBĶ2!!ĝČČ ì,ČììüüČêě !&Bĥ2!3B!ĶĶĦBĦ!23!ĵĥ Ķ&2!C22!23222!B22!!ĵĦĦ!B!!!B2B2BĦBB22!3B!!!CĶ!ĕĵ!Ħ!ĥBB!c!Ķĵ2!ĶĥĶB!!Ķ!!Ħ2ĶĵĶ2BĦĶRB!!Ķ!2!Ķ2S!ĦCĦĶĦBĦĦCtCB2!!!ĥĶ3!!ĵĵĥC!B!!!2Ħĥ3B2ĵĦC!!BĦB2!3ĵĶĦB2Ķ!!!Ķ!!22Cĵ!S!BBB32B!!!ĶĦ!!!S!ĵ !&S!ĕĖ!Ħ!!2!!S!!B!SSĦ2Ħ!2BC!BĶ!2Ķ!9!!2!Ķ2ĦBĵĕĖĦĶĵS3!ĖRĶB!!!ĕ!3!3!C!!C !'2CB!3SĦ!!!2!2B!B22ĦĶ!!2 !&ĶĶ!ĕ2C!ĶĆĶ!S!2ĥRĖcĦ!!!ĶĥB3ĵ3ĥĕĶ!2B!!!C2!ĦB!!!2Ķ!!ĶĆ!ĦB!!R2 !'2 !&SąĦ2c2S!ĕ2tõ2!B !'ą!3B!!ĵ!!!B!!ĥĦ!!2ĦBBĦB2!ĵR2!ĦBB!!2 !&2Ķ2!Cĥd2BdB!ĕdB2SBĦ !&d!!BBĶ3 !&Ħ!!Ķ!!ĦRBsB2BRR2S!!2!!2Ķ!!2!Ė!Ķ!!!ĕĶĕCC!S!C!2!RĦB !&ĦCCĦ!!BCC2!R2D¦tcc2!!22B!!RBĶ !&Ķ !&D^·¦·¦¦·¦¦scsRccR!!!B !(2Bĵ!!!22B!!mr à'ÐÐÐààÐÐÐàĀððĀàààÐÐÐÕÕ à* Ð,àāŁ !&2ĶSB2Ħ!!ĦB!!¦ ·OsB !&Ķ2ĦĖ!B!Ķ!Ħ!cs !W2RĦB!2 !( Ĥ1Ħ !&ĤĤ !( Ĥ2ö !'2Ķ!ĖB!B!BB !5Ė !&DD !=BĶ!22B!ĖB !7ĥ !& Ĥ& !6ĥ !'2!ĶĶĦĦRĦĖ !(D$Ę ÷-C!!!Ĥ!!DĘĤ !&D$Ę ÷-Ę !'ĕ!! Ķ&ĦBR2 !'ĤBs ·-s!!!D!!ĤPD !'Bs ·-s !'CĦ2!!Ķ!!Ħ !* Ĥ/Ħ !& D& !' Ĥ1 !'2!B2!!2!BĦĶ !V3!B!22B!BĦB !6ń Ĥ. !9ĦB2BBĦB22 !YBĦB!Ħ!Ħ !X2BBĦBĦ !&Ķ !(D$Ę ÷IĘ !&2!2R2B2RBB!Ķ !'ĤBs ·Is !.2!!2 !( ĤL!!!.MįğğğįğğğįįğŁ !¸ĺê Č*ĝĝĝĻ !W33!!!3C22B2 !V3ĵ2C!C2!22Ķ !'D$Ę ÷IĘ !*ĥC2!R!B2 !'ĤBs ·Is !'2CĶ!!ĶRĦBĦ !) ĤL !'ĥĶ!S2!Ė!ĖB !ZBBB!ĥĶ!ĖB !W3BĶ!Ė2!!RR !W32Ķ2!!ĶSRĦ2 !W2!2BĖ!2B!B!2 !'D$Ę ÷IĘ !(ĕ!2RBĦ !+ĤBs ·Is !(t!B22R!!Ķ !) ĤL !'R!!!Ķ !&2Ķ !U.^ į'ğğįįğįŁ !¸ĺê Č- !'D$Ę ÷IĘ !'ĦĶĦĦ Ķ) !'ĤBs ·Is !'2Ķ2BĶĶĦ Ķ& !( ĤL !'Ķ!2ĖB2BB !UĦ !&2BĖĆĦ2!ĶB2B!C!!$$ĘĘ ÷I×!Ħ!!!ĶĦ2c!ĶĶ2Ħ23 !&BBss ·K !'Ķ2RB!B!BC!!R !OBBB !&B2Ħ!!!CCĥB!ń Ĥ+öµ!öµö Ĥ5öµ!öµö Ĥ(''!!C!Ķ3BĶ2!Ķ!3Ķě99ĽĽĽ9Ľ9Ľ9GÌĻxÜh9Ľ9ĭĭĽ9Ľ 9&I!!ìČČĝĺWÚ'yG99ĽĽĽ9Ė !'B23dS322BR!!2RRBĦBĦBĦB!2!!2!!ĦR2BĦBĦ!22Ķ!!!Ķ!ĵĶ32BĥĶĦ!BBBĦBĦ!!RS3!c!BcRRB!B !&2BĦBĦB !(2BB!BĦBĦB!!!2 !&ĶĶ2!3ĦCĶĶĦ!Ħ!B !'BBRĦBĦ!!!2!!!Ķ !&B!B!!!Ķ !(2!B2R !+2C32ĥB2!Ķ!ĦB!22!!.!++į+į+įįğğ į&ğğğ į* ğ&įįğįįğğįįğğğ!!!232!ĥdĶĶ!B!!Ħ !'ĺåüČĭĝĝĝ!ĝČĝĝĭĽ!9ĭČČüìüüČČČ ĭ) 9( !)ĕ2ĵCBĶĥ2BB!BĦĶ !)R2Bc!ĥĶĵĵ!B!ÅõĖĖĦĶĦĦĖĖĖ õ)ÅÅåååĆ!I9I!2Ķ!ĦS!Ć!CR!ĦBĦB!Ķ !&SĶĦRR!!!CC32 !&Ħ!!!BB!B!!B!!BB!BB!CC!!Ķ!Ķ!!ĶSc!Ķ!BRĦ!R2BĦ !(ĶC!!Ķ!!!ĥĶcB!!!ĦĖĦBBĶ2BĦ!!Ħ2BĦĦtĦCC2 !&Ħ!!!B!Ė!ccBĦ !&2B !'C2cB2!2!2Sc!2!!!RRc2Ħ23Ħ2BB!2CBtĶd!2Ķ!B!2B2!2C22B!!ĦBBĦĶ !).n;įįğįğ!];įįğį!!ĶcĦĶR2ĕ!22!R!ĵC!2!2!22Ħ!ğįğ!];;+įįį+įį+įğğįį-Ł!",
);
rawImages.push(
  "#cSsR 2'BR¶ Ć+ ĦN!!ĦsBsccRcBdB!!!BBBd ¥)¶C ¥)¶C ¥(¶C ¥&¶C ¥'¶Cccc¶ !&ĖRĶBBcB·!!BĖö¥¥¥! Ć(ĦR! Ć)R! Ć(R! Ć&R! Ć'R!ĦĦĦR !&RĶ22Bs·ĥĥÖ¥¶ÖĆĦRR!B R'cR! R'scR! R&scR!RRscR!RRRscR!ssc !&Ķ2B¥·Cĥ!¥ÖĦBBB!!!c! B' !& B' !& B& !&BB!ń!!BBB!ń!!B !&2!2cC!ą!¥ĆB2 R&2!R !)ń !*ń !)ń !7Bsd!ąBĦĆB!B !&ĶÕ2Ħ !N2Bd!ąB¶!¥Ħ !*÷ !OBR!ąBcöĆ¥¥ĦĖ !)2 !NBdąBcĦBÖĆėRĦ !)sĦ!BB!!!Bc B&!!! B'!!!BBB!!! B&!!!B !'¶s!B¶ĦB2cĖÕ#Rö !&Ė!¥scRss!!¶ s(!!¶¶ s&!!¶¶ss!!¶¶sss!!¶¶s!!!ddąÖĖ!!B!ĦĆÕ¥!ĖBB2RĖdÇ·¦ddd!· d)!· d(!· d&!· d'!·dd!!!ąąB!ĦBR!!BĖĦçÆA2scd!! P(! P*! P)! P'! P(!PPPµ !'Ķ !)ĦÕ÷dcdµPPP !J$C!!BrėRĶ !'ĶĦ!÷dP !NĖą!!!dQ#¥Ć !(ÕńP !M22µĦ!BöÖĆÕć¥Ė!!B2Bd !PĂsĶ!!æ!2öÕćsĖB2ÇdP !(Ē ¡+Ē !DĖR!ĆöÕćsĆB !)Ē¡Ö¶é Ĺ(éÖ¡¡Ē !DBĦöÕćcB!P !&ĒÖùù¨ÆR¡ Â&ÆEEéÖĒĒđ !)øøÈÈÈĈĈf !'__ !(RB!!!ĦöÕć !(ŅÖùBŃ/ăă×···dÓăăģEÉU# !'ø§££ĆĆĖæöQøf!!_ĖĖo !&tÖBcB !&ÕµP !&¢ùB/R !&ĦĦĆĖõ¤¤!ăÓÆùÅ!!!¸æĶ§Ø¥¥scRRĆ¤f!ĖĖĖ !'QæssBBB!!d !)B/!!!Ė!!BBĦFÇ·dÅæ!Ó¢!!!¸äBsR! d'!R!¤èĺ !)ĆĖÖöRsBB !*¶ó !+F_!!Bħ¥R!!Ç!¸ä§R!d÷ ö'ķçd!!èF!2 !'ĖĖöööRR!P !(ÙRĖĖµ5¹µ !)&ĊĊĺĺF!!ä§Rçķöc ³'!ßĿç!!èF !)ĦĦöĆö!· !)çĺĺ!!ă/wµ!!_!!ĺ !)ĒoRçēÃÃÃ222t!³VV0ç!!!¥ !(RRB!Ć !.ĺx!sÓwæ !&_ !'Å¡g8!s! ħ(¥!!!ħ¥sĦ!è2 !)B2Bc !0ĺ!Ė3E f'ÅááĢĢģÆ!Rç!# Ć&B !+Ė !9ñÅÅ!!éú!3//p`pÆCCÖ¶!ÆØ!s!ĵ r&Ņ !*B !9ñ3ĳĆĂĂ/_oĂccUfÉsÙÙĩ%!ú´!!³ !/³!Ķ !83Ö!ėæ2Ć!!ĆĆUsÆÓăăăĳĳÆ!Ø!!! 2'!!Æ22 !>æÆĶĵĩU !*ąĖ!R!!!Ă !' ħ'!Ćħħħ !&Ķ !8úùécB!B !+R !&g !(ĆĆĆc! Ć' !<ĵ¢³ãÃ !*Ħ!ĕµ!!æÆĂ !)rrĥ!! r' !;òFĶ!F¥ÙcRc¹¥2ĶúwCÖÖĶú!´!!Ù !/Ùd2 !8xñ¶R!ģ¥ęęÙģ__2ö!!ĆÖÖoÖØ!1 !*Æ 2&t!µc !0B !*xĥå!ĊģÃÃÃR··ó//cÆöê!Æ´ !,Ć ħ&¥ö2 !1Ħ !+xx!!Ċ¨FFR ĺ*!EĶØ!!1#Ć!!!# Ć(!¤c!£Ķ !*2BR !0_ñĆ__!!__ !(ÇV£·!!×§ĨÙ!ĵrrrĨ3Øķ!!çĢæ !'BRBcR×·Õ !)¤..ññEw`ĖĖĖ!ĖĖ !+ĳ·!!Õĵĥ¸ §&ĵ!¤!!çă !(RscR×Ħĵ1!Ę !'Ģ³ĹR××ģ`Ė!!!.R¹Å !+ĳ·!!BRR c&BĦ!!çăĢ!Ħ !&BR×ĦĵÆ2!ö !(ąÖ! Ė&Õ ą&¹!!ĖAŅŅĂĂ¡¤.!!ĳķ·B !)2Çķă. !)ć×ĵÆ2sB2Ėą!DD!!ªĹ¢Ĺ!!ą !&ú!fĖĖĦ!ă!æ%óĺ!!!³Kė÷ Ç'÷ħ¶³!RRR !'ĖĕĦRB!!!s·×ö!D!!÷é¢öĹ Ú'ĦĖæöĦăă!æ%óĺ !'Ċ³į ;'ó³³!!ĊRR !.¶çQ !)/é! ¢)³ãăăææÅöóĺ! D'!! Ċ(! D'ĬĊ !-¶·QæĖ!ö!D!!ĺ/sé æ+ń¤öėĺĺDD !'D!! D' !0B!ĶĦ¶·QæBÖµ !&D!ĺĺ? Ć+§¦ĺĺ!! Ħ*D! Ħ&!! Ħ'!!ċ»!2!!¶BBÖ·QæBRRöµö!!!DD! Ī.DDD !' Ķ&!! Ķ&!! Ķ'!!ĵą·¦!ĥs¶R·QæBR!!RöąĤD!!!D!! D&! D' !&ĶĶĶĦĶĶĦĦ!! Ķ&!! Ķ'!!ĨĨBR!ĦCsćQæBR !&Æ·$µö !&$ Ħ&! Ħ) !&Ķ!Ķĕĥĥ!! Ķ&!! Ķ'!!ĶĶ!B!!ąCQæBR !&RB!Aöąµöö! Ė'! Ė)ö!ąąĕõąĦĦĦö!ąĥĥĥö! ĥ&ąö!ąąöÕ !'BR !'B·AĵÖÖĖÕsD ą'! ą*!ööö Ė'ą!Ėöööą! ö&Ėą!ĖĖą !&ąç¥2 !&R¦¤öė!ö¶Röö Ė'!ĖĖĖĆöææĦ! Ė*Ħ! Ė&Ħ! Ė'Ħ!ĖĖĦ !(cB2!!!cRĆ!BR!BĖRµ æ&Ė!æææöĆĖĖĦ!Ć Ė)Ħ! Ė&Ħ! Ė'Ħ!ĆĆĦ!!ss!ądcB2!R·AöRBBR2R!ö Ė&R! Ė)2!Ħ Ė)2! Ė&2! Ė'2!ĦĦ2!!!ĶÖĦądccRcĖöBB!!Bs!!Ħ R'!! R)!! R*!! R&!!RRRsR!!RR!!!R!ĖĖądBc·¤BR !(¤!!BBc !& B' !& B( !&BB !&BBB!!!B !&BB!ĦĖĥd!Ė !)c·æBB !-B !+B !'B !1BĶĦĶĦöĥd!RB !)Ė2 !IB !&Ħ!!BĦĦĦĥR·sRĶ !(2 !NBĶBĖ!ĦĖĦõR·ÇsccR!!B!!BB!!!BB!BBB!!!B!! B&!!!BB !& B&!!!B !'Ħ22 !&·!ĖR!···Ç!!ss¶sss!!sc¶ s&!!s¥¶ s'!!sc¶s!!scsss!!sB!!!scR2ccc!!CĥĖ R&s×!ćç ·'$ćç ·($ćç ·)$ćç···$ćç ·&$ćç·!!ĕ ç)!!!ąÕõĖĖĦĦ BN!",
);
rawImages.push(
  "#cSĆ ¶*Ħ SVĦ !&BBsss¶!!B !(B µ)ÕB µ)ÕB µ(ÕB µ&ÕB µ'ÕBrrrÕ !&BRR!BB!tńĦ!Ėõµµµ! Ė)!! Ė)!! Ė(!! Ė&!! Ė'!!ĶĶĶ !*B!trń$!µµÖĖĖ×!!2 B&s·!! B's·!! B&s·!!BBs·!!BBBs·!!ss· !&R!Btrń!$µbĦ 2&!!R! R&B !& R&B !&RRRB !&RB !&RRB !&B !(Btń!$$µĖ22 c&ÕĤB !)Ĥ !*Ĥ !/Ĥ !(Ĥ !*Btń!$!!Ė2!R !&B$BĶ !9Ĥ !62!ń!$Ėµ!ħĶ !*C !Oct!$ĖåĖÕĦħĶĆ !(R !OBń$ĖåĖ2öÕ!BĶ !(ńBĖ!BB!!!2s B&!!!2RBBB!!!2RB!!!2RBB!!!2 !'·t!!ąĖ22s!ĦåBö !&õ!çRBCtt!!c t(!!c· t&!!c·tt!!c·ttt!!c·t!!!ńń$õĆ!!R!ĖÕ$s!ĆBBĦt!ńµrPńńń!µ ń)!µ ń(!µ ń&!µ ń'!µńńB·!$$!!Ķ2c!!R!ĖrBĶĦt·ń !LĤ !'Ć !)ą$ås·ńń !MDĦ!!!B÷BĶ !'BĖ!µń !OĦĖ!!!ÕAć¶ö !($ !OĒĒŃĥ!!õÖ2Ħ·¶Ć!!BĦRń !P¹ĒĦ!!ö!2õĦr¥ĆBĦµń !)b ģ+b !>U!!Ħ!!ĦB!öõ$r¥öd !)bģä§Ą ô(Ąäģģb !DRĦõ$rsR !(bä££>t¦B ×&t11Ąäbb> !)v5ĹĹĹEEÙ !(_!!!Ķ!!BR!!!Ħõ$r !(áä£Bċë66x Ī&666·1o¡E !'5ęrÕĕĕĕöĆs5Ù!!__Ħ !'BćBsB !&$ń !'e£Bë !'>>!.ñññ!6ÇtóĲ!!!ĩÕĕB¦dddRBBĖ¶f!ĦĦ !(µµ··!BB!!ń !)Bë !(ĪĪ.ĺxx¦å.!6B!!!ĩąB¦dcc¥¥¥ccB!ĆvĪ !)ĆĖµÕr· !,§÷ !+ĺ!!!ĺxĺĺ!!6!ĩąBdc¥ssRRRss¶B!övĪ !)ĦĆæ÷Õr· !*Âĺ!!ñÑĲñ !.ĺ!nąBd¥sRB ³'BB¶c!övĪ !)ĶĶæö÷Ħń !)h !&»EĶñ !/ĺ!d¥ä´´q###¦!p´´@c!ö!c !(BBB!ö !/x!ŃºĶ. !,Ĳģ¨BcR! s(ć!!!sćsĶ!vã !)RBRs !2ĔħÕ Ĳ(áá..ķQ!dB!¥ ė&ö !+Ħ !9ñĲĲ!!Ħå!ħEEvfvõÚÚĹė!ė¦!R!å Ĥ& !+2!ö !7ñÊ5ÅQQE¦¦ĉRRcscĪssÆè!!å!!³ !/³!Ķ !8Êô!3ô2Ĕ!!ĖĖ2!³Ó Ç'QR¦!!! #'!!A## !>ô§ĤAÔ¡ !*Ħ. !'T !' s'!2sss !&ĵ !8åóĄĖs!D !0` !(ėėėĶ! ė' !<AB©çt !*ĕÙąĲ!!.ėĉ !)ĤĤĖ!! Ĥ' !;2ĺĤ!ĺBâTTR¶R_Ċ!úÙbbUå!_!ĖÙ !/Ù!3 !8xñ§ĺ!hBòòÂÓ!Ċ_!!ĆĦää¦äĊ!Ħ !*A #&¦!ąRs !8x²ñ!!htttĺÇÇhÇÇćħEE!Q_!ĆĖ !)2 s&ć!3 !;xx!!!¤ĺĺ !,1UĊ!!æ¥ė!!!s ė(!¶Rsó¨ !+BC !1ñç !.6ćŃ¥!!èd·Ù!åĤĤĤ·dCħ!!c>Ć !'2RBdCsń$ !)ā!!...¦ĺ !1ã¥!!æ¥søøèèèAĆĆ!!Ö³ !(c¥dCsąQ· !)ĢÊá! ĺ& !(>Ĳ !+ã¥B!2Btt¦¦¦tĦ!sÖ³> !(BCsąQö2 !*ąä !' >'Ĳ!¨Ù^^ġQQģā!!!ãÆ¥c !)sÖc³> !)·sQö2sRBµ$ !'ªôeá!!> !&Ė!Å!Ă!æw!ôĤh !&¢¥sÖ¶¥s¥¶ÖcR³!BB !)AĶBR!!!cń$ !'»ĄeQá å'ĕÙ!Ăæĺw!ôĤh !(`³Rs¥¶¥s³³`!!ĊĊB !'Ħ !(·r× !)ªĄ!e º(ööĺwôô.Eh !+ `( !)Ċ !-·ń×öõ !)ªėĄ ô+ÑĤEċ !>2!!2!ĶĖ·ń×ö2æ !+Ç b+§¦ !=ÆÒ !&¥2Bçń×ö2cct !* Ī. !=ÇW)!!!·¥!ń×ö2c!!ct$ !QRB!!Ħ·Õ×ö2c !&Çń!$ !8 T' !4BB !&×ö2c !'R!×õ$$ !. D&!!DDĶĖĖĖĶD!! D&!! D'!!DDĤt!!!Ħ!2c !'dń¦öæ¤õ÷!! $'!$$$Ħ!öö$!öööĖĖĖöö$! ö&$! ö'$!öö$õ !&×c !(P÷Ħ!ĶĦÖ!!! õ'! õ&ÕĥĥĖ! ĥ*Ė! ĥ&Ė! ĥ'Ė!ĥĥĖ !'Ħ· !'·!ö!BBB2!!¦ ö&Ħ! ö)ą!æ ö)ą! ö&ą! ö'ą!ææą!!bb!!B· !&ń×ĦBRR2Bt! Ħ&ĶB! Ħ(ĶB!Ķ Ħ(ĶB! Ħ&B! Ħ'B!ĶĶB !&ÕĖĦB·d!·!Ė2R!!BB!×!BBB2t!! B'2t!! B(2t!!BBBt!!BBBst!!Bt!!!B!ĥõĦńR·ń·Ķc !(Ħ!!RRs !& R' !& R( !&RR !&RRB!!!R !(Ħ!õDń !+BńĦ2R !-B !+B !'B !4Ħ!ÕDń!cB !*2 !IB !*Ħ!ĦDD·c!Ħ !(2 !SĦõĦ!!·dcBB!t!2!!BB!!!2R!BBB!!!2!! B&!!!2R !&2RBB!!!2 !.ńĦĦ!s··td!!Rc·ttt!!cB· t&!!cs· t'!!cB·t!!cBttt!!c !'s B' !&Ħ!!!BsBTçÇ R'TçÇ R(TçÇ R)TçÇRRRTçÇ R&TçÇ!!!ą r) !& Ħ( ĶM!!",
);
rawImages.push(
  "#c#t Q0ë»»Ëëë Ë&ëËëë û& ě(Q t7#ĆĚw ¼* Ì'!Ė22BB!cB!B2RB 2&ĶĦĶĶĦĶĦ !=2BB2!2BB2B!B!2BR2ĶB2BRBBĖ!ĶĦ!Ħ2!!RBĶB!!©ww F,wFFVVwwĚ !&BĦ222B!ĶĶĦBĦ!B2!ĶĖĶĶĶ22ĶR2!!Ħ 2&ĶB22!!ĶĖĖ!R!!!R2R2RĖRRBB!2 !&BĶcĖ22Ħ!ĦBB!c!ĦĶ2!ĶĖĶBĆĶĦ!!B!!R!22ĶĦB2!!Ħ!2!Ħ2c!ĖRĖĶĖRĖĖBcBc !&ĦĶĖ!öĆ2ĦsBB!!!BĖĦ2RBĶĦR!2ĶĖ2RBĶ2ĶĦBBĶ3!!Ķ!!2BRĶ!c!RRR22R!2 !(R!R !&R!!!2Ķ!!2!!R!!B!2B!!Ķ!2!B!!3ĶB!!û!!B!Ħ2ĖRĶĆæĖĦĶc2!ĖR !'Ė!ĖsBB!!Ķ!!22!!BBB!2RĦ!BĶRB!BĶĶ!BRĥC3 !'ĦĶ!Ć2B!ĖõĖ!R!2ĦRĖ !(BBĆ!2Ķ!Ė!Ħ3Ħ!!B2!ĦB!!!ĦĶBRB!!!3S3Cĵ2!!ĥ!2 !&cöĖRtRc!Ć2söd !'2Ė!!2BB!BĦB!B!!ĦĦ!!!ĦBBĦBĦĶ23BR222ĵ3 !'BĶ2!RĦs2R¶R!ĖsBĖR2 !'B!Ħ B&!!!ĦĵĶ!Ħ!!ĦBBc2!RBBC3!C3Ķ!!32!!!Ħ!Ħ!!!ĆĦĆRB!R!B!ĖR!Ķ!!B!!ĦĦĖĦ!!!BB!B¡²DĒòââÂ¡¡²Â²¡¡ n(M^n^^nDÒĢĒĢĒĒĢĒĒâÒâÂÒÒÂÒ¡Ân¡ÂC !'Ė!Ė!3!!Ħ!AA QOrµR!!BR!!Ħ2Ćĵ3!B!!R ¥OcB!!!ĦBRR2!BĦą!3!2c !UĦc2BĦ!!dSĥ !& r1Ħ !&rt !( r2Ć !'cĖ!ĦBBSĕĵC !5Ħ !&÷õ !=BĖB2d2CBt!ĥ !5Ħ !&rrrt !6Ħ !'22Bĕ !&CC !'Ę× ·.B!!!r$$÷µt !&÷× ·/ !'Ė!ĦĦ!!ĕĶĶ !)Rd ¦.c!!!÷!!t×õ !&Cd ¦/ !'BĦ!BB22ĥĥĶĵ !'ń P/Ħ !& õ& !' P1 !'2 !'ĶĦĶ !X2!B!Ħ!!Ķ!ĶĥS !5µ r. !9B!SS2 !UD !(23!!!dB2C !QD !'222!BĦ!!3C !)Ę× ·Irr !&22!!32ĶĶ22 !)Rd ¦K !'33ĵĵĶĶ222B !(ń PIsss!!!NÂKK]]KK +' !ND !* D- !QĤ!!!Ě w+©©© !Q× !(22!!!2B22B !C3÷S· !,ö !'2Ķ2B!B2!22Ķ !'Ę× ·< !&t ·(rrrR !*ĦB2!B22B !'Rd ¦<!C!!Ç ¦, !'2BĶ!!ĶBĶ !*ń P<b¥!ç¦!PPP s) !'ĦĶ!R2!Ħ!Ħ!2 !Bĵ!ĥPP!!!÷ÕµöĦĦ !+B22!ĦĶ!Ħ !DÕr!!R!Ęt·×!õ !*2BĶ!Ħ2!!BdĶ !GÕd!µrr!!Ė !(22Ķ2!!ĶRBĶĥ2 !Iµ÷÷BåĆ !)2!22Ħ!222BC3 !'Ę× ·@ĦRRrrĦ!!årr !(ĖCRBBĶ33ĥĵ !'Rd ¦K !(cĵ323SĵĵC !(ń P?RPPPRPµPPårRR !'dC3!3!ĵ33!3 !D$µ#!Dr$!·!cÖõõ!!!NÒ K(] K& !DĖĦcķĥcŅĆ¦!!ĦĦĦ !' D- !GRĶµ#!P!rBBB!!!Ě w. !'Ę× ·=åBRsÆ·µ¶···ĆĆĆ !'ĖĦĖĖ Ħ) !'Rd ¦K !'2Ķ2RĶĶĦ Ķ& !'ń P?!!åååĥ P) !'Ķ!BĆR2BR !HPPÕÕÕr !)Ķ !&2RĆĖĖB!ĦR2R!B!!××·· tId!Ħ!!!ĶĖ2R!ĦĶBĖB2 !&BBcc ¥Iss !'Ķ2cR!R!RB!!B !OBBB !&BBĖRsRBBĦB!· t+!ĆCĆĆ! t5ĦĆCĆĆ! t*!!B!Ķ2R!SSĶ!2ĶÊúĊêêêĊúúĊúHxĺx«HěêĊÚÚêĊúěĊĊěĊńBgººÊī'Ê7GĻúĊêêêúêêÕ!!!R22!!!22BB!23B2232C3Cĵ!3!!!ĥ!ĦR22!CBS3!3!!!Ħ!ĶĦ2BBĦĶĶĶ2BS2 !&Bc2!R!ĥĥRBBCS3ĵ32Cĵ!!!ĵ3!ĵĶ!BdSB322 !&2!ĥ !&ĦĦB!2ĦBĶĶĶ2Ķĵ3B!!!2BBBĶ2Ķ23!!!ĵ!3!3ĵ!3!!3!3!Cĵ!!2C2C33!ĦĶĶ!C !&BR22ĖB2!Ķ2ĶC3ĵ!!!N¡}}m}m}]K]]K] K&]] K(]K]++;;; K';KKK!!!B22!ĦsĶĶ!BCCĥ!3!!!ĚVy¼ÜÌÌÌ!Ì¼ÌÌÜì!üÜ¼¼yiyy¼¼¼ Ü) ü(!DDD!!!Ć2ĶB2ĶĦ2BBBC!ĵC !(B2Bc!ĖĦĶĶ!2!ÆæĆĆĦĶĦĦĆĆĆ æ)ÆÆæææĖ!ÚÚû!2Ħ!ĦR!Ė!BB3!!Bĵ !(cĦĶBS3!!RB222!!!Ħ!!!BB!B!!B!!BB!BB!RR!!!C!!!ĶcR!Ķ!¦t2ĵą!!!C !'ĶR!2!ĵ!!ĖĶRB3!!ĦõĦBBĶBBĦ!!Ħ2BĦĦ¥ĦRR2 !&ĕ!!!R!Ħ!cc!!3Ķ2ĕĦ!ĥ !&R2tS3!3!BccCĶ!!!RtcBĦ22Ħ2BB!2RB¥Ķs!2Ķ!B!!Sĥ!BB22233Ķ!2C33!3!ĥ!!Nâ° K'!Ð°]KmK!!ĶcĦĦcBĆ!2B!c!ĶR!2!2!22Ħ!mKmĤÐ°°}mKKK;; K']¡N!",
);
rawImages.push(
  "#c#t Q0ĻěěīĻĻ ī&ĻīĻĻ (& H( Q7tS#ĺê Č* ĝ'!Ħ222C!S2!23CC3222ĵĦĶĶĦĶĦ !=3CC3!3CB2B!B!2!!3ĶC2CCCBĥ!2Ķ!ĥ3!!!BĶ2!!ĝČČ ì,ČììüüČêěĥ!!!Bĥ2!3B!ĶĶĦBĦ!2!!ĥĥĶĶĶ22ą!ĥ2!23222!B22!!ĵĦĦ!B!!!B2B2BĦBB22!3B!!!CĶtĕ!!Ħ!ĥBB!c!Ķ2!!ĶĥĶBĕĶ22!Ħ2Ķ2!2B2ĦRB!!Ķ!2!Ķ2S!ĦCĦĶĦBĦĦdtCBB!!!ĥĶĆ3!!B2C!B!!!2Ħ2C2!ĵĦC!333B2ĥĶ!!ĦBBĦ!!!Ķ!!22Cĵ!S!BBB32B!!BĶĖ!!!S!ĥĥ !'ĕĖR2!!2!!dd3B!2B!BĦ!3ĵ!!B22BĦ!9!!2!Ķ2ĦBĵĕĖĦĶĵS3ĦĶ2ĶR!!!ĕ!!!ĥ!Ħ!ĶC !'2CB!ĦBĦĥĕĶB!BĦ!SRBĦ!!2B !&ĶĶ!ĕ2C!ĶĆĶ!S!RB2ĖcĖ !&Bd !&Ħ!R2ĶĖ!!C2!ĦB!!CĶĶB!B!!Ħ!!!Ķ !(2 !&SąĦ2c2S!ĕ!2Ķ2!n!!!3ĕ!CC B&ĦB!B!!ĥĦ!!!ĦBBCBĦBĦB!!!ĦB !)2Ķ2!Cĥd2BdB!ĕd2Ķ!BĦ !&B!ĦBBBĦ!!!Ħ!!!Ķ!!ĦBBcB!BBBĦBBBcĦB2!!!2!Ė!Ķ!!!ĕĶĕCC!S!C!Ė2!2BĖ!!!Ħ3!Ħ!ĖBĶ!!B22D²¡nnM---MM--M--M-M-Ł-ŁŁŁD^Â²Â²²Â²²n^nM^^M^-=Ł-!!!Ķĵ2Bĵ!!!2!BĦ!mr ÕOö!C!!Ķĥ!SBĶĦ!BĦB!!¦ ·OsB !&Ķĕ!Ė!!ĦĖ!!!cs !S22!!ĶR!!!RBĦ !& Ĥ1Ħ !&ĤĤ !( Ĥ2ö !&32C!ĖBBBĦ!B !5Ė !&DD !=BC22R!!RRĦ !6ĥ !& Ĥ& !6ĥ !'2ĦĶĖ !&R !(D$Ę ÷-C!!!Ĥ!!DĘĤ !&D$Ę ÷-Ę !'ĕ!c!!ĶĶĖ!!2 !'ĤBs ·-s!!!D!!ĤPD !'Bs ·-s !'CĦĦR!RR!ĖĶ !) Ĥ/Ħ !& D& !' Ĥ1 !'2!B!2!!BBĦĶ !V3!B!ĦBĦ!!ĶB !6ń Ĥ. !9ĦBĦB!ĶĶ ![BĦ2!ĦĶ!Ķ !RD !&2BBĦ!Ķ!22 !*D$Ę ÷Iö !&222B!!!BBB2 !(ĤBs ·Is !)2BB!!!2!į !( ĤJ !'.Mğğğįįįğğğį!Ł !ND !dĤ!!!ĺê Č*ĝĝĝ' !MD!!× !(33!!!3C22B !CS×¦$ !,Ė !'3ĵ2C!C2!22Ķ !'D$Ę ÷;!B!! ÷)ÕÕÕ· !*ĥC2!R!B2 !'ĤBs ·;!·!! ·,s !'2CĶ!!ĶRĦBĦ !) Ĥ<1Rö·ĖĦĤĤĤ !.ĥĶ!S2!Ė!ĖB !Cĕ!ąPP!!!Ę ö& !,BBB!ĥĶ!ĖB !Cåµ!!Ė!Ę!ssĥ!ö !)3BĶ!Ė2!!RR !Hĥ¦ĥÕbb!ą !)32Ķ2!!ĶSRĦ22 !IÖćć2öĖ !)2!2BĖ!2B !+D$Ę ÷?!s¶ÕÕcssĥÕö !(ĕ!2RBĦ!BĶ !(ĤBs ·Is !(¦2BĦ!R2!!Ķ !( Ĥ?ö!ĤĤöĤÕĤĤÕQöö !'R!!2B !&į !EĘąÕD$ÅĘ!÷!!¥ĥ !&.^įğğğįįğğį!įŁ !Eö1QB¤ö!!ĦĦĦ !XĶ!Õç!r!µdd !&ĺê Č-Ļ !&D$Ę ÷<ĥBsÖÆ÷ĥs÷÷÷ĥĥ !(ĦĶĦĦ Ķ) !'ĤBs ·Is !'2Ķ2BĶĶĦ Ķ& !( Ĥ?!öÕÕÕö Ĥ) !'Ķ!2ĖB2BB !HĤPrrrP !)Ħ !&2BĖĆĦ2!ĶB2B!C!!$$ĘĘ ÷I×!Ħ!!!ĶĦ2c!ĶĶ2Ħ23 !&BBss ·K !'Ķ2RB!B!BC!!R !OBBB !&B2Ħ!!!CCĥB!ń Ĥ+öµ!öµö Ĥ5öµ!öµö Ĥ(!Ħ!!C!Ķ3BĶ2!Ķ!3ĶĦ99 Ľ)9GÜ'xÌh9Ľ9ĭĭĽ9Ľ9II9I!!ìČČĝĺWÚ'yG99ĽĽĽ9ě7ĥ!!!B23dS322BR!ĦĦBBB !&ĦB!!!2!!!ĦR2BĦBĦ!!2 !&Ķ!ĵĶ32BĥĶĦ!BBBĦB=!!RS3!c!BcRBB!B!!Ħ!!B!B!B !'2!BR2BĦBĦBĶ !)ĶĶ2!3ĦCĶĶĦ!Ħ2R !'BBRĦBĦ !(B !'B!B!!Ķ !*2B!B!!Ķ !(2C32ĥB2!Ķ!ĦB!!2!!.-++į+į+ į)++ į+ ğ&įįğğğ į(ğğ!!!232!ĥdĶĶ!B!!ĦĶ !&ĺÚüČĭĝĝĝ!ĝČĝĝĭĽ!9ĭČČüìüüČČČ ĭ) 9( !)ĕ2ĵCBĶĥ2BB!BĦĶĶ !(R2Bc!ĥĶĵĵ!B!ÅõĖĖĦĶĦĦĖĖĖ õ)ÅÅåååĆ!99I!2Ķ!ĦS!Ć!CR!ĦBĦB !(SĶĦRB!!!CC32 !&Ħ!!!BB!B!!B!!BB!BB!CC !)ĶSc!Ķ!BRĦ!B!BĦ !(ĶC !(ĥĶcB!!!ĦĖĦBBĶ2BĦ!!Ħ2BĦĦtĦCC2 !&Ħ!!!B!Ė!scBĦ!!22!B!!Ė!!C2cB !&2Sc !'RRc2Ħ23Ħ2BB!2CBtĶd!2Ķ!B!2B!!2C22B!2ĦBBĦ!!2 !'.c; į'!]; į&!!ĶcĦĶR2ĕ!22!R!ĵC!2!2!22Ħ!ğįğ!];;+įğğ+įį+ğğğįį-!C",
);
rawImages.push(
  "#c# t1ûËËëûû ë&ûëûû ċ& ī(Q t7#ĆĪ ©+ º'ĤĖBB2B!R2!22BB 2&ĶĦĶĶĦĶĦ !=2BB2!2BB2B!B!B2B2ĶB2 B&Ħ!2Ķ!Ħ2!!SBĶ2!!º©© V,©VVww©©Ī !&BĦ2!2B!ĶĶĦBĦ!22!ĦĦĶĶĶ22ĶBĦĦ 2(ĵC22!!ĶĖĖ!R!!!RBRBRĖRR22!2 !&BĶcĖĦĶĦ!ĦBB!d!ĶĶ2!ĦĦĶBĖĶĦ!!!ĦĶR!22ĶĥBC!!Ķ!B!ĶBc!ĖBĖĦĖBĖĖBcBB !&ĦĶĖ!!ĶĶĦB!C!!!2ĖĦBB!ĶĦBĖĶĶ2!!!Ķ2!ĶCCĶĵ!!Ħ!!B2BĶ!c!RBB!BR!3!Ķ !&R!R!2!!R!Ėĕ2ĵ!!B!!cc2B!!!ĶĶ2R2!C!!ĥĵ2Ķ!ċ!!2!Ķ2ĖRĶĆæĦ!2R2!ĕSĶ !&Ė!Ėt!2B!BB!33!!2BB!ĦBĦ!¦22!BCC2 !&CC2 !&ĶĦ!ĖBB!ĖåĖ!R!2ĦSĕR !'BBĥ!2Ķ!ĖS22ĥ!!B2!ĦB!!!ĥ2tt2!!32SSSĶ!C!ĥ!B !&RöĖR¦RR!Ė2tõd !'2!!!2BBĖĶĥC!C!!ĦĦ!!!ĦBBĦBĥĵ32ĵĵĶĶ22B !'2ĦcB2ĦsBR¶R!ĦcCĕRĶ !'BĖ!!ĶCĦ!!SĥĶĵ!Ķ!!ĦBCd2!2Ķ2C2!ĶĶĵB!!Ķ2Ķ!Ħ!Ķ!!!2ĶĖBB!R!ĶĖĕS!2 !'Ħ2ĦĖ!õRccĕCĥC!2RBBĦ!ĵĶ2!!!ĶĶ !&Ķ!!2!2!!!Ħ!Ķ!!!cBĦĶĖ22!ĦĕĦĶ !(Ķ22!!!C!SĥC!!!Ė!!tĵĶCCBB!2B2CC3!Ķ !)RcĖĆĶ!!!R2!2!2!Ķtĵ !'Bt!!22ĦĶC!CĵĶ!!2Ħ!ĕĶSĥ!CCC!!!222Ķ!ĦĶĶĶ!2!!Ķ!RĖcĖ!!2t3BR2!Ķ33 !&Ħą2!!2!2!!232!!B !'S!ĶĶ!!ĶĦĶ!!2!2 !&2!!ĖcB!ĖBĖĖ2!!CĶRR2ĵ !)C2R!!ĥ!!ĥ!Ķ!âm°mmm;;;KK;;;KK ;)K!3!Ė!Ħ!R!Ħ!!Ķ!!!S3!!3 !(dĕ!Ħ2SCĥĶC2!!!DDDĽĽĭČČČĭĽĽ!! D,2!R!RĦ!¶!cB!ĥ!!ĥ23Ķĵ !'BĕB2d2!ą3!ĥ !'ûºÅÕåĖĖĖąąąüĝċ !,B!BĦR!Ö2Ķ!!Ķĵ!Ķĕĥ2C !(2Ė2ĕ!ĥBĥĕC !&ûĥ!B!ĶĶĶ2!!!ĶĥĶě! û)^!Ķ22ĦR2BĦ2!!!ĵ!!!ĕ !(Ė!d3C!ĶĶ2t2!2!!ĥĦ!ĦĶ!!B22ĶĶĶ!ĥĶĤ!ĵĥąąĕąĤ!!B!!ĦdĦBĦ2B!3S !+BĦĥĥĥ3d23!!2!!!Ħ!ĦR!2B2ĆĦĖĶĶĦ !&ĶĦ2BĶ2!2cĖB!!ĵ!!RdSC2ĶSSS !(2!2!!ĥĥ3ĵĶ !'B!2Ė2Ć2Ħ2ĦrĦBB !&Ħ!BĦ!2!!Ķ¦ĶBB3BC!!!2ĕ2Ķ !)2!B3 !&ĵĶĕĶĶ!!!Ħ!Ķ2ĶsĶ22B÷2ĦĦ !'2ĖBBC!2!ĥS2S2C23Ķ!!S!2ĥĶ !+2!2 !&ĥ !'Ķ!RB2!BB!R!BĶĦ!!!BĶ!!22!!!S2C!Ķ!ĕ2ĶĶĶ!!ĶC !*22!23332 !(ĶĶcSR2BC22Ħ2Ħ2Ķ!!ĵĦBRĦ3!!BSĶĶ!Ķ2!S!2!!!Ķ2!2 !'223!3C2!2CSC !'2ĶĥĶ2!ĥĶ!2ĶĶĶc!!!22ĦR2Ķ!²KKK;K;K ;(K ;&K>!!23!!2!Ķ2!Ķ!Ķ !&R!ĶĶ23Ķ!ĶĶB!sĶĶ !&ĦBĦĶ2!! D5 !&22ĶĶ !&2!2 !'Bd2C!2ĖæĦĦBösĦ!!32BCS2!!!ċċċûûêê!!ººº©©ººÊÊÊĪ!>m;;KK;K ;)!!SSĵCĶ!3RRR2ĶsCR !'ĥ2!ĥ!!!õååõĖĦĤ!!Ķ!B!2ĶĶĶ2!!! D1!!ĵ3!!2ĵĶR2BBCĶĶ!!!CĦĖĥĶ!!!Ķ2Ķ!BRS!!!22ĦBĦBĶ22!!Ī ©+ºººÊÊĤ!2!2Ķ!ĥC2B!ĦSĶĥS !&BR!2 !&ĖB2BC2!!Ķ2!!Ħ22R2 !(22!!!2B22B!S!!!3Ķĵ2!!Ķ32SĕĵS!!!22C!C!C!!ĵctBC!Ķ!!!Ħ!Ķ22!22 !'2Ķ2B!B2!22ĶBĕ!!M2ĵĶĥCĥ2ĵĶĥSC!!2!^;;];;;!!¡m;};;K!!!BĦB2Ħ!Ķ3 !*ĦB2!B22B!S!!!^¡m];]]]mm ;&+!! D)!! D)!!Ķ!Ķ2RĶCĵ !'2BĶ!!ĶBĶ!!!3 !( D& Ì, ©( º&ÊÚ!Êº©ºĤ!Ķ!2ĶĶBĥ !(ĦĶ!R2!Ħ!Ħ!322!!ċêÚÊêê!!Ė2!!Ć222!B!!!2!!Ķ!B2!Ĥ Ķ&!!! Ķ'233 !(B22!ĦĶ!Ħ !'ĥĖĖ!Ć!ĤĖ!Ķ2!RĦ!ĶB!BR2ĶBBRBĶĶC!ĶĶ!B!!BB!Ķ!!Ķ2 !'2BĶ!Ħ2!!Bdĵ !&ĖĶRĦB3!!R!B222Ķt2B2ĦĶ22!C2BSĵ!Ķ22!!2Ķ2!!!Ķ2ĥ !&22Ķ2!!ĶRBĶĥ3 !'R2R!2!R2BĶĶBBRĵCCCRR2!Cĵ3Cĵ3!22B2!!Ķ! 2&!C !&2!22Ħ!223CC2Ķ!!!ĶĶ32S!!!2BĦcBBCĶ!!23222ĵ!2!32!!Ħ22!!R! 2& !*ĖCSBCĶ22ĥĶ2!!!B2ĥ!2Ķ!2BĆB!3!!2!ĶĶ2323CC!!2!!!BĶC!2!S2223CĶ !(cĶ232SĶĶC!Ķ!!!2ĶCCĕ2!!ĦcBĦ!!ĵ3222!23!Ķ!!!Ķ!!2ĦBĶ!!2ĵ2S32Ķ!ĵ !&dC2!2!Ķ22!22!!!222ĥSĶ!223!B!3C2 !(22Ķ !'2sC2!B!CCĶ2!!23!!>} ;(K ;(!!!Cĕ3!!!}mK]]KK ;)K;;K;;K;!!!Ķ!!!C!Ķ!!!2!ĵ!!! D1!¡KmK;K! D9Â]K;!¡;;KK ;&¡>!Ī ©/ º&Üììüüüºº ©/ººÊÊ !' D&! D* !'ĖĶĖĖ Ķ*ĆĆĦĆ!ĖöĖĦĦ!ĆĖĶ!22!!ĖĖ2!ĖĖĦĶ22Ĥ! V/ww©©Ī!!!BĦBRĦĦĖ Ħ&2BBĦBĶ!B!Ķ!ĶBB22ĶĆĶĶ!!Ć!RcB2SC !&B!B!BBR!BB!BĦR2 !&Ħ!2ĆRBRR!!!ĖĦ2cĦĶĦ!!!Ć22ĦĖĶBRĦ!RRcĶ2Ķ!BĶ !(BĦB22!R2ĦRĶRĦB !&BRĆÖĖ2!ĶRBRs!2ĆcĦBscB¥!2RRB22R222ĆB!2BS22 !&Ħ!Böæ2Ķ22B!2RBĶ !&ĦĖ2¶!ĶRRB22Ķs!¥!cB!!B!BB22Ķ!2B!!B¥!RR!ĕĥ !&BB22!!öB!B2RĆĦĶ2 !'ĶBcR !&B!2Ħ2Ħö!2Ħ!!22!2B2!BB2!Ħ2RC32S !(2ĖĶ¥B!22!B!cRĶ2 !'R2Ė!!Ħ!!!BĶB!BsB22Ķ!!!2B22!!3B!!Ħ!!23!3 !&2Ć!!22cĶ!!BĦB!B !&B!Ħ2RĶ2!Ķ!ĶĶBBS!B!C223!C333SSCĥC2223ĥ!!Ķ2Ķ !'Ķ2ĶB 2&Ct!Ķ23 !'R22cR222BB!32C2223C2CĶ!2!!!ĥ!ĥS22!Cĥ22!2!!!Ķc¶R22BĦĶĶ!!CS3 !&Bc2!R!2RSCCCS2Ķ23CĶ!!!Ķ2!Ķĵ!!CSC223!!C!!!ĥ !&Ķ!!B2ĦBĶĶĕĶĵĶ2 !&3BBBĶ2Ķ32!!!Ķ!2!2Ķ!2!!2!2!CĶ!!!2!C22 !'C !&2Ħ!!ĦB2!Ķ2ĵC2Ķ!!!>Kmm]m]mK;KK;K ;&KK ;(K;K ;0!!!222ĦĖcĶĶ!BCCĥ!2!!!Ī¼¼ÌìÜÜÜ!ÜÌÜÜìü!ČìÌÌ¼y¼¼ÌÌÌ ì) Č( D&!!!Ć2ĶB2ĶĦ2C!!C!Ķ !)B2Bd!ĦĶĶĶ!2!ÆæĆĆĖĶĖĖĆĆĆ æ)ÆÆöööĖĤêêċ!BĶ!ĦR!Ė!BB222!Ķ2 !'RĶĶBS2!!BB223!!!Ħ!!!RR!R!!R!!RR!RR!BB!!!C!!!ĦcR!Ķ!BB3Ķ!!2 !)ĶB!3!Ķ!!ĦĶRC2!!ĦĖĦRRĦ2RĖ!!Ė2RĖĖ¥ĖBB2 !&ĕ!!!R!Ħ!ddC32ĵĦ !*B2tS2!2!2RdCĵ!!!RRs2ĖB2Ė2RR!BBR¥Ķs!2Ķ!B!!Sĥ!2B 2)!C2ĶĶ2 !&>°} ;'!À}K;];!!ĶsĖĶc2Ć!B2!c!ĶB!2!2!22Ħ!¡^¡!â}}m] ;-no!",
);
rawImages.push(
  "#c#t Q0ĻěěīĻĻ ī&ĻīĻĻ (& H( Q7tS#ĺê Č* ĝ'!Ħ222C!S2!23CC3222ĵĦĶĶĦĶĦ !7Ļ !'3CC3!3CB2B!B!22C3ĶC2CCCBĥ!2Ķ!ĥ3!!RBĶ2!!ĝČČ ì,ČììüüČõěĪ!!!Bĥ2!3B!ĶĶĦBĦ!23!ĵĥĶĶĕ22ĶC22!23222!B22!!ĵĦĦ!B!!!B2B2BĦBB22!3BĶ!!CĶSĕĵĵĦ!ĥBB!c!Ķĵ2!ĶĥĶ!ĕĶĕ!!Ħ2Ķc!2BĦĦRB!!Ķ!2!Ķ2S!ĦCĦĶĦBĦĦCtCBB!!!ĥĶĦ3!!ĵĥC!B!!!2Ħ!CdSĵ!!!CBą22!Ħ2!ĦBBĦ!!!Ķ!!22Ħą!S!BBB32B!!!ĶĖ!!!Sĕĕ!S!!S!ĕĖB!!!2!!223dC2Bą!ĕĶ2!B!!Ħ!BĦ!9!!2!Ķ!!ĶĵĕĖĦĶĵS3!ĖRĶR!!!ĕ!!ĕĦSC!!C !'2Ķ!!ĶBĦ!BĶS!!ĶĶBĦ !'B !&Ķ!!B!!!ĶĆĶ!S!2ĥĶĖcĖ !&S!!ĵĦĶ!!!2!Ħ!!CBĶĶ2!!!ĦĶ2SC!2ĦB !+2!CC2t2Ħ2c2S!ĕ2!ĵĶ!R!!!3ĵSS3BBĦĶ2B!B!!ĥĦBĶ!ĦBBĦB!222!!!BBB2 !'2Ķ!!3ĥd2BdB!ĕdBC3!Ħ !&B!!BB!Ķ!!ĦĦ!!!Ķ!!ĦBĕĵĶ!BBB!RR!BĦ!2!Ķ!2!Ė!Ķ!ĥ!!!ĕCC!S!C!ĖRBBB !&ąĶ!ĦĦĦ22!!BĦ!!2SBBĦ3!ĥBBĦ!B22B!B!Ķ!!2Ķ!!!Ķ!ĦĕĵĶ2!ĥĵĕĶĥĕRĖĦ!Ħ !(ĥĵ!!Ħ222ĦB!!!ĕ!!B23!ĦĦB!Ħ!!2!!!222!2!!!BĶ2!3!S!C3!!3!ĦRB!!!N!!d!!SB!!!22B !&3Ħ!!2BS!!Ħ2BĶ!!!2 !&Ķ!!2!!R!Ķĕdĕĕ!2C!!3BĦB !(ĕ2dĦĦ2B!Ķ !(B !'BB!!Ķ!!!Ķ2Ķ2Ķ!!2!!B!!ĦSt!ĕCBĥ2Ķ!Bs2BĦBB !(ĕ!!ĶĶ!2!Ħ!2!]+K +&įį++įįįğįğįğį ğ&!!!Ħ!ĥ!B!ĥ!!Ķ!!Ķ!!2B !+ĵ!!B22!!!Ķ !) 9' !2B!Sĥ!Ć!tSĥB2RĖ!!!ĦĦ !&SC!!B2!BBRB!2!!!9ĝüČõĆĆĆĖĽĽĽ99 !,2!2ĥS!c3Ħ!S!RĦ!ĖĖĦ!!-ĵ!!!23S!2 !&2 !&9Ħ!C!Ķĵĵ2!!!ĶĦ!!! 9)į!Ķ2CBS3BĦ!B!ĦB !&BB !&ĕ!BĶĶ!ĦĦ !&Ķ!!ĦĦ!ĥĶ!!C22ĶĶĶ!Ħ9!!!ĦĆĆĖĆ!!!C2ĦBcĦBĦĦBBĦB!!!Ħ !'CĦ !&2ĶĖĶĶ !&Ħ!ĥS!2C2ąĦĕĶĵĦ !&ĦĦ2BĶ2!2dĕĕĶĦ!!!cB!ĦBĦBĶ!B!!Ķ!!2!BR2BB!BĦ!!2!!B!2ĕ2Ė2Ħ2ĥæĥCB !&Ħ!RĦ!2!!Ķ2!ĥĶ!BBĦĦĦBĦB!RR2 !&3!BĦĦB22BĦ!!!Ķ!!Ħ!Ķ2ĶdĶ23C¥2ĥĦ !'2ĆBBB!3!S!!c2R !'B!ĦĦ!!2 !(ĶĶĦ!!2 !&2!!!ĵ!SC2!RB!S!CĵĦ!!!BĶ!!B !&BCC!!!2B !)Ķ !-ĶĶĶ!!!2Ķ!!ĵĶdBc2R!B2ĥ3ĥ3ĵ!!!ĦBcĦ!!!BR!RRĶ !&BB!!!BB!ĶĶĻC!2B !&22ĦBB2!2!!!2Ķ!ĦB!!Ħ!3ĵĶĵt!!!2BĖc!!!+ į'ğğğ į,!ı!!2!B22!!!R !)S!ĶĦB!Ħ!ĶĶB!¦ĶĦ !&ĖRĖ !?BBBĶ !'Ķ !&CcB!!BĆõĥĦCå¦Ħ!!!2R!R !& 9)!!ĝĝĝČČĝĝĭĭĖīĪ.B į(ğğįįğįğ!!BR!!22!cBS2Ķ¦!c !'22 !'ĆõåõĆĖ!!!ĵ!C!2ĵĶĶ2!Ķ !92ĦS2RB!!Ħ!!!BĖ!!2 !&2Ķ!CcR!!!32ĥCĥCĵ2B2!ĺõ Č*ĝĝĝĭĭ!!į!2!Ķ!!BR!ĖB!ĦB !&RĶ !(ĕC2R !&ĵ2!!ĥ32S2ĦB !&33!!!3C22B!R!!!2Ķ2!ĶĶĦ!BRĦ2R !)ĶĶ !&dcC !(ĥ!Ķ32!BBB !&3ĵ2C!C2!22ĶRĖ!!!Ķ2Ė!!!B!ĦĦB!!!į! į)!!į+į;įįį!!!CĥC2ĥ!Ħ !+ĥC2!R!B2!R!!!įğ+ į'++įğğį !7Ķ!ĵ2SĶBĦ !'2CĶ!!ĶRĦBĦ!Ħ !, Č2 ĝ&ĭĽ!ĭĝČĝ!!ĵ!3ĶĶRĦB !'ĥĶ!S2!Ė!ĖB !'99Ľĭ99!!Ħ3!!Ė333!C!!!3!!ĵ!B2!!ĶĵĶĵ!!!ĶĵĶĶĦBĦ!!N !&BBB!ĥĶ!ĖBB !&Ćĕ!õ!!Ħ!ĵ3!Bĥ!ĵC!CS3ĵCBSBĶĶB!ĵĶ!C!!CC!ĵ!!Ħ!!Ķ!!!3BĶ!Ė2!!RR22!!!ĆĵSĥC!!!B!B322ĵt2R2Ħĵ32!BBRR!!Ķ22!!3Ķ2!!!Ķ!BĦ!ĵ!32Ķ2!!ĶSRĦ!!!2!!!SBS!!!B3CĶĵCCS!B!BcS2!B!ĦĦ!!!23C2!!ĵ!3322BĦB!!!2!2BĖ!2B!B!Ķ !&ĵĶ!BR!!!2RĥtRRBĦ!ĦĦ!B2B !&Ħ!!!ĥ2B!!S!222!ĦB!=Ķ!!!ĕ!2RBĦ !&Ķ!!!C2Ħ !&3RõC !&B!!!Ħ!B22!B !'CĶ!!2!R22B!!Ħ !(t!BĦ!B!!!22Ķ!!2ĶB22!!!ĖtRĖ !'B!!Ħ!!!2!BB!!3ĥR!!!BĦ!B!B!B !'R!!!B !&2Ķ!2!!B2 !'22!!R !(BBB!Ķ !)2¦!!!R !(B !&.R į+ğįğğ!!!BĦĶ!!!;+ į0ğğ į& !*BB !;įį+įğį !:;įįį! į+!ĦCĺõ Č. ĝ'ĭĭĽĽĽĝĝ Č/ĝĝĭĭ !9ĦĶĦĦ Ķ*ĕĕĥĕ!ĕąĕĦĦ!ĕĦĶ!33!!ĦĦ3!ĦĦĥĵ22!! ì/üüČõīĪ!!2Ķ2BĶĶĦ Ķ&222Ķ2ĵ!2!ĵ!ĵ2223ĵĕĶĶ!!ĕ!BSC3BB !&2!2!22B!22!CĶS32Ķ!!Ķ!2ĖB2BB!!!ĦĶ2SĶĶĶ!!!ĕ32ĶĦĵCBĶ!BBSĶ3ĵ!B !)2Ķ222!B2ĶBĵBĦBB!!!2BĖĆĦ2!ĶB2Bd!3ĕSĶ22!Ct!3BBC23B233ĕC!3BB !(Ķ!2!!3Ķ332!3SBĶ !&ĶĦ2c!ĶĶ2Ħ23Ķd!t!SC3CR!BB33Ķ!2C!!Bt!cc!Ħ!2!!! 2'3!C!B2SĕĦĶ2 !'Ķ2RB!B!BC!2ĥ2Ħą!222ĦBB!2B2!R23!ĦBBĦ!BB!Ķ !&2ĦĶ!!ĥ22!C!ScĶ !(B2Ħ!!!CCĥBĶC!BdB22!ĶĦ!BRB2!!BB!!Ė!B!22!2!!!23!!3ĕ2Ķ!!RĦB!BBĦB!C!Ķ3BĶ2!Ķ!3ĶBRR!B!B!Ķ!ĶĦ!ĦĦBB!ĦB222BĦ!!!2 !'ĵS2ĵ2322B!B!ĦBĦB !&B23dS322B2!Ħ2RBBĦB2!2 !&Ħ22!ĦR2BĦBĦĶ!!Ķ!!!Ķ!ĵĶ32BĥĶĦ!BBBĦB!!!RS3!c!BcRBB!!!Ķ!22BĦB2!R2B !&RB!BĦBĦB!ĶĶ !'ĶĶ2!3ĦCĶĶĦ!Ħ2R!!.!!BBRĦBĦ !&BBB !'B!BB!!2BBĶ!!2!!B!B!2!!2 !&2C32ĥB2!Ķ!ĦB!!2!!.!++į+į+ į*ğğğ į'ğğğįįįğğğ į(ğįįğ!!!232!ĥdĶĶ!B!!ĦĶ !&ĺåüČĭĝĝĝ!ĝČĝĝĭĽ!9ĭČČüìüüČČČ ĭ) 9( !)ĕ2ĵCBĶĥ2BB!BĦĶĶ !(R2Bc!ĥĶĵĵ!B!ÅõĖĖĦĶĦĦĖĖĖ õ)ÅÅåååĆ!999!2Ķ!ĦS!Ć!CR!ĦBĦB!!-ĵ!!SĶĦRB!!!CC32 !&Ħ!!!BB!B!!B!!BB!BB!CC !)ĶSc!Ķ!BRĦ!R2BĦ !(ĶC !(ĥĶcB!!!ĦĖĦBBĶ2BĦ!!Ħ2BĦĦtĦCC2 !&Ħ!!!B!Ė!ccBĦ !&2B!!!Ķ!C2cB !&2Sc !'RRc2Ħ23Ħ2BB!2CBtĶd!2Ķ!B!!B!!2C22B!!ĦBBĦĶ !).s; į'!]; į&!!ĶcĦĶR2ĕ!22!R!ĵC!2!2!22Ħ!įįį!];;+įįį+įį+įğğįį2ĦC",
);
rawImages.push(
  "#c#t Q0ë»»Ëëë Ë&ëËëë û& ě(Q t7#ĆĪw ¼* Ì'!Ė22BB!cB!B2RB 2&ĶĦĶĶĦĶĦ!!©ww F,wFFVVwwĊ!Ķ!!2BB2!2BB2B!B!2BR2ĶB2BRBBĖ!2Ķ!Ħ2!!RBĶ2!!ĶĖĖ!R!!!R2R2RĖRRBB!2 !'BĦ2!2B!ĶĶĦBĦ!B2!ĖĖĶĶĶ22ĶRĦĦ 2(ĶB22!!Ħ!2!Ħ2c!ĖRĖĶĖ2ĖĖBcBB !&BĶcĖĖĶĦ!ĦBB!c!ĦĶ2!ĶĖĶBĆĶĦ!!!ĦĶR!22ĶĦBB!!Ķ!!2BRĶ!c!R22!2R!2!!2!!!ĦĶÆĆ!ĦĶĦB!B!!!BĖĦR2ĖĶĦRĆĦĶ2!!!Ķ2!ĶBBĶĶ!û!!ĖĖĦ2ĖRĶĆæĶ!Bc2!ĖR !'R!!!B!!R!ĖĖ2Ķ!!2!!sÆ2B!!!ĦĶ2R2!B!!ĦĶ2Ķ !)Ć2B!ĖõĖ!R!2ĦRĖ !'Ė!sÖ!BB!BB!22!!BBB!ĦBĦ!¶BB!BBB2 !&CC2!ĥ!2RB!!cöĖRtRc!Ć2söd !(BBĦ!2Ķ!ĖR23Ħ!!B2!ĦB!!!Ħ2ss2!!23SSSĵ!d!!!BĶcRBĦs2R¶R!ĦsBCRĵ2 !&2!!!2BBĖĶĦB!B!!ĦĦ!!!ĦBBĦBĦĶ23ĶĶ22!ĵS!!!Ħ!Ħ!!!2ĦĆRB!R!ĶĖĖĥ!3 !'BĖ!!ĶBĦ!!SĦĵS!Ħ!!ĦBBc2!2Ķ2C3!ĶĶ!!ĵ3!B !&Ķ!Ķ!!!sBĦĶĖ22!ĦĖĦĵ !'Ħ2ĦĖ!öRccĕBĦ!!BRBBĦ!ĶĶ2!!!ĵĵ!!!ĕĶ3BĦĕ !&RcĖĆĶ!!dR2!2!2!ĶtĶ !(Ķ22!!!C!BĦB!!!Ė!!tĶĶBCBB!3!ĵBB2!!ĦBS!!2!!Ķ!RĖsĖą!2·SBR2!ĵ2Ķ !&Bs!!22Ħĵ23BĶ!!!2Ħ!ĕĶSĦ!CCCB3SS33ĵ!ĵ!Ħ!!2!!ĖcB!ĖBĖĖ2!!BĶRR3Ķ !'ĦĆ2!!2!!3ĵS2!!!B !'S!ĵĵ!!!ĕ!BBS!3!B!!2!Ė!Ė!R!Ħ!!Ķĥĥ!S2!!2 !)B2R!!ĶĵĦąS!!Ð}À}}}KKK]]K+K] +&KK+++!¡ĢĀĀð° Ð'°]]]K]mK]ÂN!!!BB3B!2B2!t !& y*¼¼Ì! D/!! D4 !'Ė2ĕ!2BĶĦ!Ħdą !&ĶĶĶRRĶĖRB!! V. w&Ĥ! F.VVwĊ!!!RĶ2Ķ3!!!ĦB!d!!!R!2cĆ!c¥BS !&BB!!!RR!!!Ħ!!2!!!¥R!22R!2R!2BBB !&2!CSĵ3B !&ĕ!!BĆ2!B¥c2ĶĶ !&c!2c !&ccssB22!!2æĦ¥BBĦ2BĖRBsB22 !&2!!ĶB3SSĕĕ3 !&RRĦ!ĦR !(Ħ22Ć¥BtĖĆ!!!2td!!Bs!Ė!R!RB¥sR!B!!!2!C2ĵB2!BBBSSB!!2¥B !&3RC!!!B22Bc!¦ąÇcdS!!ĵ !&ĶRRRĖs2!!!2!2!!!>òK]]+] +*!!æ!ccBSĵ3ĵĵ!!!2Ķ2d2!Rĵdĵ!SB !&22B2ĖcBR2!!C3 !( D0ÀĀ}]]]K]K]]!!ò°À]K]K]]K]KK]]K!!â°}mÐm]]}}]KK]ÂN!ĊFFFĤ w- ¼'! D(!! D2!! D/ !'R!!!ĖĦĦĦĖĖĦĦĖĖĦ!ĦĦ!!! V0Ĥ!ww V& w3ê!!!ĖR!!!ĶĦ!2RBĆĶRR!RB !&ĶĶ!Ķ!BĶĶĶBsBB!!!Ė Ķ&Ħ!!ĖĦĖĖ!!2ĖĖ!ĦĦ!!Ć!!!22!!!Ė2 !&B!!Ķ!Ķ!2!!!2RB!Ķ!2!R!æĖR !&ĶĶ!!ĶĦĆ!BR!ĖĖĆcR!BĶĦ2¥!!!s!!!2BĶR!Ħ2¥¥2BĖĖ !'BĦĖ22ĖĶRRĖ¥¥Ė !)22Ħ !&RcR!Ķ!22¥ĶĶ !&Ė!!!BBs!R!Ć!!2ĶRRB !&ĖĦĦ!!22ĦĖ¥ĖĖ !'2!!ĶĶss2Ħ!!!BcĖ!!!æR2 !&ĖR!!2BĖ!!!cĶ!!Ķ2BĦ !'Ħ!Ħ!cc!ĦĖ!!R !&RBĦĦ!!!R!2ĖB!ĆR2BĆ!RB !&cĖ!!!ĖBĖĖ!!!ĦĦ!Ķ2RB !'Ķ!B !'RcS !*ĦĆ!!!Ķs!2¥B2ĶRRĦ !'Rt!!ĆR!BĶĶĶ2 !&Ķ!B!!!2RRc!ĦĦRB2!2 !&2Ħ!R!!RĖĆĶĖ !&2ĦĦR¦t!2 !&ĥ!!c2Ė!!2Ħ2R !&B3!!!ĶĦĖ!!Ė!Ķ!B2 !'B!!!ÆBĖB!!!öĶ!Ķ2!!Ėĵĵ !'ĖC !&c!R!!!ĶBRBRĶĵ!!!RĶ2öĖ2!RR223 !'ĦĶ!ĖRR !'ĦĶ2!c !+2!!!Ė !&BB!!!ĦRĦ !'Ħ¥!!RsR!2ĶĦĕĵ !&2!s2!!!R !&2!Ħ!c¦ !)Ħĕ!!RĖĶ2ss2Ķ2Ķ!Ķ!C3!!!BĖRs!ĖĖ!Ķ !*c¥!B2! R'!ĶĶ!C2!332 !'Ė !&R2!!!ĶĶcBĶ2!ĵ!!!ĖRs !&ĖBB !-B!!!R!!Rd2dĥĶĥ!!2 !&B!!!ĖBĖRĖĶB2B!!td !'2!ĖRRR!!Ķ!BB !'Ķ!!22RĦ!Ķ !&S!C!!2B3 !&Bs!!Ķ!RĦ2Ć!2ĶĦS!!ĵ3!!!sĖR!ĶĶcc!Ķ!33 !,2!B¦c!õõĕ!C2 !)ĦĶ !&Ħ!!sSBBB!ĕĕ!B!!!Ė !'ĦC!!3!B!!!22Ė!!2BBBC!CB!!Ħĕ23!ąĕ !&Ħ!!!R2Ķ!B!!!33B3S3 !&ĖRĖ22!!ĵC2 !(2B!ĦĦ!!2!ĵ!!!R2!!!B2 !(Ė2!!!ĶRB3SĵSBB!B!B !(RĆ!Bd3BSĵ !'2Ķ!B23Ħ !&ĵ3!BB !&2 !'RĶ!òÐÐ}]K+] +* !(RS!ĥĵ!!!2 !&æ22!!ĕB33!ĵ3!C!2BĥĦĶS !'B!!! D2!!¥!Ė !&ĶĦĕ !(cĶ!2!!3!!ĶĶ2!22C3SBĶĶS !&ĶC!! w, ©'Ĥ!RĖR¦S!C!!B!C !'ĶĶBĖ!!2BBC!!B23 !&B2 !'Ķĥ!!!22!!RB!R!Ķ!!BB!!Ķ¦S!!ĵ!dd!S22 !&RBBcBB!!!22!!!ĵBB!!!Ħĥ !&ĖĦ !'22Ķ!BĦ!2BtSB!!ò K&]K +)!!ò}} ]&;++;];++] +'K²N !*2!BBĶ!!Ķ2Ķ2!ĵ3!!! D0!! D7 !'RB!!2ĶB!ĖBBB¦Ķ2Ķ!3!! V1 w*ºĤ! V+ F'º!!!22!!!B!SRS!!!¦R2ĵ!B!!ĦĦĦ!ĦĦĦ!!!B Ħ(Ć!ĆĦ!2 !&BĶRĶ !&22!Rs!!!RĶ!!cBB!S!22!ĵ2CSB!!!BB!Bc!!ĦBĦĆcccB!Bc!ccc !&BĦ!Ć2BRĶ2BB !&_Ģmm!!¡]]KKK]]K]]K+++!!ĦĦ!Ć!cssB¥c!2RRBĖ!!RB2S !&ĖĦcR2Ķ2cBĖcR2!!!DDD!! D0!!c!!c !&ĆĆB2BĦBRRĖB22Ķ!!!ĶĦ!2ö!!2cĦĦRĶĦ!!Ī V* F'Ĥ! w'!!!ccB!BĶ!B!ĶtĦ!ĦSRs!C3C !'R !'ĆĦ!!RĶ!!Ķ!Ķ!BĶRRĶ¥¥!¥¥!!!ĦĦB¦!!!2BĦB2!Ķ!R!ĥRB!ĵBdd!ĥ!ĵ !'BBĶĶĶ!!ĦR!R !&RBĦR!!R!æ¥2 !&c!2ĵ!!222sR2¦¦sct2CBBSSBBBdBS !*RRR!!Ķ2 !'2!ĶĦĶĶ2ĦR!22!!!2sS3!ĒÀ°}]]mKK]]K]K]] +*!!!BRcBR22BRRBĶ !'ĶR!BRcĶĶRBĦC!!Ð}}KKD! D:!!BĶ!!!22BBB !)ĦĦ2RĶĦ!!Ħ!B!!! i' F5Ĥº©©©ºº!!ö!ĦR!ĦĶĆĦ!Ķ2 !(ĶB!!!B2!ĦĦ !'R!!!R2!2!!RR!ss!RRcc!c!Ķ!BR2B!!R!2!!SĶ !&22 !&R!RBR!!tt !(RĦ!2R!RcĶ !&c!!¥!!Ķ2s!!2B2Ķ2C!!!2B!S!StB!SS!!!2!B¦!3!R¦BBttB!!!Ħ!2!!2!!RR2ĖĦ!Ķ2!22!!!B !&SCĵ!!RBBSĵĵ!BttBĕĶ!!oĒ}K}K]] +(!!!Ķ!!!2 !(2!B !&2R22Ķ!°}mKK]ĤĀ}}]K]]K +&]}Âd",
);
rawImages.push(
  "#c# Q1(īīĻ(( Ļ&(Ļ ((888HHH Q9#' ĝ+ĭĭĭĽĽ!ĥ223B!S3!3BS B&2!!!2 !'Ľĝĝ ü,ĝüüČČĝĝĭĚĵ!! 2&!22!22!!!23SB!B!BSB!ĕ!!!ĶĶ222 !(Ħĥĥ!C!!!C2C2CĥCC33!22Ķ!!!2Ķ!!B222 !'3B!ĕĕĶ !'SĦĦ!2B2!ĶĶ !'ĵ!2!ĵ2S!ĥCĥĶĥ2ĥĥ222 !'2Ķ2ĶĥĦĶ!Ħ !'ĵĦ!!ĶĥĶ!ĕ!Ħ!!!Ħ !-Ķ!!23CĶ!S!C22!2C!!22 !&Ķ2!!!ĵĶĦB!!2!!3ĥĦS2!Ķ!SĕĵĦB!!!ĶĶ! 2&!!I!!3!ĵ!ĥCĶĕĕĶ!3C2!222 !&B!!!3!!2!Ħ!!2!!2!!CC2Ķ!!!ĵĦBB !*2 !&ĵĶ!ĥ22!ĶĦĶ!222Ķ!Ķ!2!!!Ħ!22!322!B!Ķ!!!3B!2!!2!S33 !&2B222BB!!Ė!2 !&Cĕĥ2B2C2ĕ!BĦB222 !'2!22 !&B!!!B22!2!ĶĶ!BBR22!2 B&Ħ!B!!!3ĶSC3Ķd2CdC2!S!!BĦ!Ķ!!!B!!!B2!ĦĦ !(Ħ!!2 !&ĶĶ!!BB2ĶĦ!!ĦB !'ĵ!!2BĵĕCB!B!ĦĦĶ!!BĦ2 !&Ħ!ĶĦĶ!!!B!Ħ!!ĵ!Ķ!!Ķ !(B!!B2!!!B!ĖĖ!!!Ķ!Ķ!!!C2ĦĶĶ!2!ĶĶ!ĦB !'B!Ķ!ĶĶBBĦ2!2!3B!ĶĶ!!!2!!!Ė!!!22 Ķ&!R!!!CdĥąĦ!!!B2Ķ!222!B!ĶĶ !&Ħ!2!!!B2!!2!!!Ħ!!B222B22!BĖĶ!22!!!2R !'Ħ!CĥSĶĶĶ2BĶ!BB2Ħ2 !(B!222!Ħ2BĶ!Ħ!!B!2Ķ!B2!BBB!B2!!ğ22Ħ!!Ė !&ĥdB!ĦBĶĶ!!2!!!2B!22 !)222 !'B !(22B2ĶĶ222!!ğIğğR !(ĥ!ĕ!C!Ħ!!ĶĶ222 !'Ķ !+ĶĶĦĦ2!Ķ!K++ĿĿĿğğğĿĿ ğ'!ğ!!ğğğ+!+mmm]+ K';;ĿĿįĿĿįĿ!Ł- !&BB!B!!Ķ!!!2! Č*ĝĝĽ !IĦ !'R!!B!Ŀ !&ĶĶĶCCĶĥB!!! Č. ĝ&!! ü.ČČĆěĻ!!B!ĦĦBĦĦ22ĦĶ)!!!S!2Sĕ!dd!R !&33!!!3C!!!ĵ!!2!!!SC!22C!2C!2332BĶ !&BBĦB22!B !&3ą2!ĶS2 !)S!B3!!22CCCSBB2!!2ĕĵS33ĵ23ĥC32B2 !,22BĦ22į!!!C3!Ķ !*ĦB!ĵS3Rĕĥ22!!BR!!3S!Ķ!B!C2dBB2!!B!3!B!Ħ!!Ħ!!įBĶ!9!Bd2B!!!B!B!!!3B!!S!cĦtSBB!!Ħ !'S22ĦS!!Ķ !&B!2Łcį++į++įį!į+įį!!ą!!BBBĦBĦĖ !(B!!!ĦBĦ!B !'B2!2ĶB!2!!!BB!ĦĦ !3+m +&į+į++!!K+++į+į++į+įį++ğ!! +&K+++;;+įį+B--'åüü! ĝ2 !Mĵ!C!!!ĥĵĵĵĥĥĵĵĥĥĵ!ĵĵ!!! Č0!!ĝĝ Č& ĝ2ĆěĻ!!ĥC!!!ĶĶ!2C33!CS!S3 !&ĶĶ!Ķ!3ĶĶĶ3S33!!!ĥ Ķ&ĵ!!ĥĵĥĥ!!Bĥĥ!ĵĵ!!BĶ!!2B !+ĥC!Ħ!Ħ!B!!!2C3!Ķ!2!C!ąĥB !&ĶĶ!!Ķĵĵ!3C!ĥĥądC!3ĶĵB !&S!!!2!!S!ĵBdBBBĥĥ !'3ĵĥ22ĥĶCBĥddĦ !)22ĶĶ!!!CSC!Ħ!BBdĶĦ !&Ħ!!!32d!S!ą !&CCB !&ĥĦĶ!!22ĵĦdĦĦ !'2!!ĶĶCC2ĵ!!!2Sĥ!!!ąCB !&ĥ!!!B3ĕ!!!d!!!ĦBBĦ !)Ħ!SS!ĵĦ!!B !&CB22!!2C!Bĥ!!!CB!ą!BB !&d !&ĥ3ĕĕ!!!ĦĦ!Ħ!B !'2!!3 !'BBB !*Cĥ!2!ĦS222B!!CC!ĦB !&B!!ąC!3ĶĶĦ !-2!2S!ĦĦS3B !(2ĵ !&CĥąĶĥ !'ĦĦBcBB!2!!!Ħ!!dBĥ!!2ĵ!B !'B!!!Ķ2!!!ĥ!Ħ !*3!!!Sĥĥ3!!!ĕĶ !'ĦĦĦ !(B !&d!C!!Ķ!BBB22Ħ!!!CĶ2ĥĥ2!BB!!B !*ĦCC !'ĶĶ!!B!!!B!Ħ !)ĕ !&33 !)2!!!ĵCĶdCSB!!2!ĶĦ !&CCC2!!!C !*Bc!Ħ!B!!!ĦĦ!!SĕĦBB22!!ĕĕ!Ķ22!!!3ĥ2Ħ!ĦĦ!!Ķ2!2 !(2!2!B2CCC !&B!!BBĦ !'Ħ !&B!Ħ222!!!Ħ!!Ķ!!!ĥCS !&Ħ !,2!2!!!22!!2R!BĦ!Ħ!!B !&B!!!ĕ3Ħ!B!!!ĶC3 !)2!ĦBBB!!!2Ķ !(Ķ!ĕĕ2c!B 2&!B!B!!Ħ!Ħ !'B!!Ķ!B2!Ħ !&2B!Ķ2!!!SĥB!!!BB!!222 !'Ķ!!!ĦBĦ!R2!Ħ!Ħ!B!!!R2 !-2RB!2!!22 !'Ħ !(B!Ķ2 !'B2!!!ĕ!ĦBB!B!BĦB!!BB2!Ķ!!!Ħ!!!CBĦĶ !&BRcBB2 !&ĥCĦ !&ĦB!!!2 !(C !'Ħ!!!ĦBĦ !(į!!!ĥ !&ĦB!2ĶĦB!2!!!22 !'BĦ!!BBĦ!Ħ !+St!BĦB!ĦB!!B!22!!ğI!!!C!!KKK++į++įį ğ( !(BB!ĦĦ!22Ħ !&ą222!Ħ!!B!!R!R22!!ğ2ĶIğ!!!B !7d!Ħ !'BĶ!2 !&d !'B!!!2ğ2!ğ!2!Iğ2ĶI !&B!! ĝ,ĭĭĭĽĽ!!SĦBcB!B22!2 !(Ħ !&BĦ!!!ĖIğ!Iğ!ğ!Iğ2Ė!!!ĦĦ!!!22!!22!2!Ķ!2 !&ĦcR22Ħ!BB2BBB !&B !&ĦBĦĦĶ2!Iğğ!ğIğ!IĶ !&ĥ !(2B!!22!22BB2!!Kįğğğ+į ğ)!!K +(į++ĿĿğğ !&ğ!ğğ!-- !)2!!!2!!Ħ2Ķ!!Ħ2 !OC!!!B!22Ħ!22cĶ2!!B!! Č1 ĝ*Ľ!! Č+ ü&åúĻ!!B !(BBB!!!c2!Ħ!Ķ!!ĦĦĦ!ĦĦĦ!!!3ĦĦĦĵĵĵĕ!ĕĵ !(3ĶCĶ !&22!CCĶ3 !+B!22!Ķ2B2Ķ!!!BB!3S!!Ħ3ĦĕSSS3!3S!SSB !&3ĵ!ĕ23CĶ233!!ĥ!Ł¦++!!+++įįįĿĿįĿĿįĿĿĿ!!ĦĦ!ĕ!Sdd2dS!2B23ĥ!!B22B !&Ķ!SS2Ķ2SBĥSBC !:S!!S!!22ĥĥ222!22CĥB !(ĶĵC2!!2BSĦĦCĶ!B!'õ Č) ü'!! ĝ'!!!SSB!2ĦĶ3!2R22!RBd!B22 !'ĵ!ĥĶ!!ĕĵ!!BĦ!2ĵ!Ķ!3ĶCSĶdd!dd!!!ĵĵBc!!!22Ħ2!!Ķ!C!Ħ!!2Ħ!BB!Ķ!Ħ !)ĶĦĦ!!ĵ2!R2!!!C3ĵC!!C!ąd !'S!!Ħ!!222B22ccB2B!2 !'ĶĶ !-2BC !+B!ĶĵĶĦB!C !)SBB!]; +'įį++į+įĿĿ++įĿĿĿį+!!!3SC3!2!2CC!!22!!!ĦB!32BĦĦc!!B!!K++įį !>BĦ2!2!!!BB2!ĦĦ!!!ĵ!22!Ķ!!ĖB !& ü:! Ľ(!!ą!Ħ2!!ĶĶĶ! 2& !&Ħ32!!B2RĦB !'C!!!C2!2!!CC!CS!2C22!2!!ĶĶ !'C!B22B!!Ķ!!Ķ2 !&S!B!22!R!B !'Cĵ!2C!32Ķ !&C22S3!3!SS !(B!!!B!2B!R!!Ķ22!!!3!!c!B!!BĦĦ !(ĵ!2!!22CCC2ĥĵ22!2B2!C2!!!22BBĦ!!B!22ĶĶ!R2!!!Ķ2!Ł]+į+į++į++įįį!!!Ķ!!! 2&!!!2 !(2B2!!!+++įį+!m++ĿįĿĿįį++įĿĿįN",
);
rawImages.push(
  "#c^ŀĀ=MMM=ŀŀİİŀŀ-= M(===ŀŀŀ-== M*== ŀ&-== M+==--ŀŀ- !)2 S&ĶĶĥĕĕĕĦĶ!!222SSC2ĥĥĦĶĶ !'22CC3!ĵĥĥĕĦĶĶ !'22B2C3 !'ĕĕĦĶ!Ķ22dS!!ĶĶĵĥĦĶĶ !&22SC2ĥĥĦĶ !'222C3!!ĶĥĥĥĦĶĶ !'22B !'ĶĶĥĥĦ2!!!2d!!!ĶĶĥĕĶĶ !(22CCĵĶĶ !(2!233!!ĶĶĥĥĥĦĶ !0ĶĥĦĶ!!!ĶSC !'22 !)ĕĥĥ322 !(Ķ!Ķĵĵ !&2!3 !1×÷3ĶĦĖĖĖĦĦĶ 3'Ħ Ė*###ĶĦ Ė)ĦĦĶ## 3&##ĶĶĦĖĖĖ%ĶĶ !(CB¥ UV?ĥĥ !&RS2¥U ÆTRc!tC2!!!Ėåå!!! ÉSĖ!!Ćåå!!!s÷÷ !&::ÝYYY¬¬ÝÝĞ :'ĞÝ¬YY¬ÝĞĞ¬YY¬ÝĞĞ::JJ::ĞĞĞ:J:::JJ!!!¥÷÷!!!Ħöö !'ÅĖĶĦĖĆĖÖÆbrî|||cĖöĖĖæ¶bą!!ĶĆÆ¤Õ®ğlĶÅA¤ÞîĿörÅ !(ööö!!!Ėåå !&ĆĖĆ222ĦĖĶĶs;Ćr¶ö[÷s2!!!¯mĀ]ķc2Ħ;BĶö|Ç![!!Ė[·Ė2 !'Ķåå !&tc !&ąĆ2Ķ22!2ĶR;Ķ!ĆĥĆĖ[÷Æ2!¿ĶååĦ¯÷c¯ĶĦąĆ!!¥22Ķą2[÷l !'c·t !&BS !'2Ķ2!2R!Öl!!Ķ!ĆĥĆĖ[,ĐßB2ĶĆµĖÏRB2Ķ!!öÏd×¦2ĖĆÖ !+B !-Ķ!!Rl]ÐĠç!2!Ķ!ĶÖ¥s!cddB2ķ÷B!Çėç2ėÖ!!!¥!¦#Ć!| !5Ė!!Ħ;R¶ĖR!¦!2!9ĥRĶĦ!Rc!dķý!!!2!!ķ!ýs!c¬RÖýö!ö!î !.Ķ !&Ė!Ė¯ĶĖĥ¶öÆc¦!IĖĞĴRB!BRcÖ@¬RR!l¤s!RĶýĖÏc¥!!ĝ!!!ç !'Ħ !'ąĕ !(¯Ķ!ĶĆĥĖĖÆ¶1Ė!!ßĴ!!RsÆ@ß!Ĵ!ĖĶç!!!2Ķ !'l!!Rö !(B !.Ķ2!!!Ķ!sR!aĞ¾ííĬÅ³³³££ö¬ßßĴR2ööRĖ¿2!!Ï!ö!!ÍssýĶ !,dd !&RĦ2!!!2¦ö!ĴsíQė# C'R2ĕÅĝ9!ĴRc!ÆR!¿!!ĆĦ!ölöY¬Ķ2 !,ĕĕ !&R¯!2!2cĦ´YsQ#C¶ ¥)Æ¦d2ĕ¥öĴcÆcĖĖ!ý!22R!!!ąąĆĶ !'Ħ !&SS !&d2!Ķ2Ķd9ÏYQ#c¥c× ·'dd¦Çć¦RĕöĴĴRRRĴ¬ÍR22sR!!Ėxh !&ĕ !'ĕĕ !)2Ķ2!!!Ņ#cc··!!Ė!!!ĥ!!RR¦÷¦Ćæ!ńĴĴß!!ÍRcRÍ!ÜļĦĔ !&Ķ !'SS !*2!BĆĆ!cc·!!,!RĖ!!tĥ!ĖĖR!¦ėB!!´ß¬ß¬!ÍÍÍ'ËĦĔ³$ !32B!B!!ą!ķc·!!!Ë!!RĖ !'R!R{R÷!´ă'ä'ä '&ĦĔ³2 !(C !&RĶĶ !)BĦB!!!sBõÕÕr!Õ !'t!RJJJ!JJÔăĆĄ Ó)³2!ĸÚs !&22!!!Ėåå !*B!!!c¥¿¿ßBcÖÖÕ!R!!!RJ !'ÍĦĆĦ2 d)ĦĸÚso !&Ćåå!!!s÷÷ !0Í!!¿ĆRĦÖÕ !*ĞĞ¬RĴĦ2Õ ¤)úso!!Ö!!!¥÷÷!!!Ħöö !-dÝ !'ğ!ĖĆÖ Õ'¬YIbAs¥!!B·iýýýiçç¡!úÖúB!!!ööö!!!Ėåå !(B !&c!ĆsĝĝIj!bQĵs¶s¶¶ÖöæöĖ!æ!!!8·!!ĳ·8ÅêÖ!B !'Ķåå !&RR !'BĦB!B!Ý!ÖĦ1!Ö¶Ö!!ćB!cRsscscR!¥!!8!ĳæ!¹ĳ!H²¶²s²s!!!cct !&dd !(BĦBĦ!!!ĦQ!ĖB!Ķ !&BR¥¥×÷ħķ#dĕ!!·ĳ¹pæÓù!·c !+3B !&ąą !(ĦBĦB!!!Qė!¥Rc !1S!2!5æùpù¥ !&c!c !'B !&RSS !(BĦBĦ !&ÆCcB!R !0æ !&æpùp¥ĳ!C !+ĶĶ!!!Ėåå !(ĦBĦB!¯!CsĥĶÇR !01¥!2Õ!p¹¥ùÓ5¶2!C!C !&Ćåå!!!s÷÷ !'ĦBĦBĦ!Ć¯cr!!{ccėėRBR!ĦĦ¤bAĕąö!2!n!5Ó!¥5¶ð2³2³2³!!!¥÷÷!!!Ħöö !(Ħ!Ħ!!ąĆï¦ė!!ß2ssRRBcBĖĦĖĖBR!æ!c2ğ¶¨!s¶¯ąBĕ2!2 !&ööö!!!Ėåå !-ĖąĆ¿Æ!!!cBBcÇ¦dd·RscRR!¥2C2ÙàĀ,ĀàSSĶ!Bĕ !'Ķåå !&tR !.Ėą!ÿÿ!!ßĶk!Rsss!¦sÇ××læ!B!³ ĕ)Ą!Ķ!Bĕ!!!c·t !&BC !*Ħ !)2¬I9ĖĞ×!!ĦĦ!ĥC!!!îlBB2 t*!!Ą !*B !'B !.Rþýþ¬ĦĶ2¥× !&Ė !({!ŃäB õ*¸S!!ô !.Ħ !)ĦBĦ!R!ÖĖ°ñđŁı×!!!ö!ąąĦÕåĥ!î!!µÄaPĴPaPPPõ!¸S!2 !,Ħĥ !(Ħ!Ħ!!ľ×QæGČČČÜĖĖõõąõĦĆæöÖR1aĭ!!µĶÅÕÅĶ!!!aaõ!¸C !'Ħ!!!R2S !'Ķ!!Ķ!Ħ!µC1æ¤!Ė!ĥĥĦĆĦöĦĦĦĶĦ!Q#s!!!ĆdRd2ÏÏÏ!ĶPaõ !'Ķ2!!!Ėåå !)Ķ2Ķ!!ľ¥ķ1ÆŅ¤µææĆĖĆĖĆĖĖĦ!Q#sR!¯¿ďcds¿ĖĆĖ¿ĆĆĶaa!!!Ćåå!!!s÷÷ !)2Ķ2ą¸!!ÖÇ!1öæÖÖÖæööĖĦQQBCsR4¿ĖĖĖÏc¿ĖĶĶöĖą !)¥÷÷!!!Ħöö !'Ķ!Ķ!ĶĆBØ44!sķ Q+2#3RRR4ĆÆĆRR!|!ĶĶĖ!!!c !(ööö!!!Ėåå !&ąíĶ!!!Ķås!!Ĩ¥R C+cBcïď4ĖĆ!ÆĖ!Í!!cB!s¬×Ï| !'Ķåå !&·· !'BĶ!!!2!öĖ!Ħ!¥Z®ï¥ ¸'¥Ŀďs¿ĖĶssĖRÍ!!!Í!s!!¿öölĶ!!!ctt !&ąą !(í2!2cCRRÆÖķß!Ėý4!!ÆÆcĨ¬!¿!R2í !,@ý!Ės!Ć !&BB !&dd !'c¥ý2RCÖsÆĆå!kćJ4ĖĦ!!Ć!¶Ĩ¬ĖĖ!í|ö!Ė!lRÍ!æ!!Ĉ!!!Hą !&ąĦ !-RRRýĖÖRĖ!å!Ķ!{CĖ2B!Ć!!ą1Ĩ!!!Ć!!1!lö!ĶlĖ¶Ĩs!s!!Ė !&C !'ąą !&dd!R!Ýì¼Ü¤!Ķ!2!2¶æö!!ąąĦĶ1rĦ!ąQ¤ĶQ¶!!!æ!åŅc!¬!!R !&BB !&dd !&ccd !&Ķ!½!!2!cCcRiÌiÝĦĶ2c×RYĖĦĶ2!!sÍĆµåĶRc¶!!dd !,ąą !&2!!Ė !&Ķ!Ý2!cCcRiÖĶĶĶý2¦¦BzÕRĭ2Bdc!Ķ!{!2dĶyą¬ !.dd !*Ħ!Ķ!2B!ĭc÷ÖsiÖĶ!22!íi(ČrĖĖRĭĦ2sýÅą!ĭ!RyR !0ąą !'ĆÕĆ!ĦBĶ2!!Ć½ļļČÖĶ !&Ķ!!!Ķ2R!!·9ĭ¬öÖÖą·ĭyR!d !3öŃěGÜĜĬ(Ĝ(ĬĬĬĜČÜÜČĜĬĬĬĜČ Ĝ'ČÜÜ«G«GGGĜĜ«GÜÜ«« G& !+RSSUR2 cT!!!ĶĶ!!!ĖååÆĳ ģV!Ćåå!!!s÷÷ă BX¥÷÷!!!Ħ ö_!!!Ė å_ !& c&¦¦¦ ·&¦¦¦ c(t¦¦ ·)¦¦tccc¦¦ ·+¦¦ttcc R(t",
);
rawImages.push(
  "#c±^- ±'^^MM^^n ±,^^^n ±. ^&n ±/nn^^n !*RRccĶĶĦĆĖĖĦ !(RRRBĖĖĦ !+RR2!ĶĖĖĖĦ !+BBR2 !'ĖĖĦ !'cc!!ĶĶĶĖĦ !*RRBĖĖĦ !*BR2!!ĶĦĖĖĦ !+B !'ĶĶĦĖĦ !'c!!!ĶĶĦĆĦ !+RRĶĦ !+B22!!ĶĶĦĖĖĦ !1ĶĦĦ !'cB !'B !*ĖĖĖ2B !+ĦĶĶ !&2!2 !1ħķ#ħ ć(ħ #' ć+ķķķħ ć,ħķķ #&ķķħħ ć&f !*B22 uUÈãĖĖ !'cB2u óT!o!RRB !&ææ!!! &S2!!æææ !&¥¥ !&LLL<<İİ<<< L*<ĠĠ<LLL<ĠĠ< L'$$ L($LLL$$!!!¥¥¥ !.ĶĆĖ!ĶĖ!ĖöĶ[[lß!ĶĆąÕÅöĶ !&ÕµöĶïKćJ!Ķö¾ïlJ !1ææ !'ĶĆ!ąąĕąĖĶcÿ¶öĖĆ¿2cdR!cÿ;¯įs·dąÿ2ĶĆß!!Ď!!Ėl!!Ğ !'Ėææ !&cR !'Ć!ĕ!ĶĶ!ą!ÿĕ!ĆĖĆĦ¿2sdÇÿĕÖÖĦß2cÐĕĶæĆ!!2SSĕæ2l!ć !'R¥c !&BR !&Ķ!ĕĶSddSÇĿ!!ĕ!ĆĖĆĦ¿ß¯ď2SĕĆ¶Ħß2!Sĕ!!Ćß!æ¶SąĆs !+B !,Ė!ĶĖąĿįįßö!S!ĕ!ĦÆcB!!¥¥2SĶöB!!æsSĦÆ!!!s!¶CÆ!ß !6ĕĖĖ]BÆ!!!¶!S!zQ !&c!!¥Ķb!!!Ğ!¥Ö!bc!!¬RÆbĦ!Ć!B !4ĶĖàĕĦĖÆĦcc¶!ÎÍö¤ !&c!Æ¤B!!!ć¤c¥!Jb!ß!s!!¤!!!ç !'Ħ !'ĆĆ !&Ķ!lĕ!ĕĆĖĦ!c¥rĶ¯!Ħ¤!!ccÆ¤Ħ!¤!!Ķç!!!ĞJ !'ć!!BĆ !(B !.ĖB!!!ĕ!c!!Åľ9Ľb1ĵ q'1õĦĦ¤!2ĆĆ!!ćĞ!!ß!Ć!!bBcbJ !,cc !'ĖS!!!S¶Ć!¤1ĽĦBsææććææsĦ¥1QÕ¤!R!Ć!!ć!!ĶĦ!ĆćJ¬¬JĞ !,ĖĖ !&2l!S!ScĦå¬1Ħs3çć··ss··ć3ćsĦ¥b¤2cR!!!b!22B !(J !'Ħ !&RR !'B!ĕSĕsč*YĦs·!s !+sć3¥öÕ¤¤2!!¤Bb!22c!!!Ĉ×× !&Ė !'ĖĖ !)SĕS!!!ös·s !0÷3æ!!¤¤¤Ħ!!b!2!b!×!öö !&Ķ !'RR !&R!!!S!B!!!·s!!!< !/ėö!!ïĦBĦB!bbbÿĈö¦èR !3S2!2 !&cs !&Ĭ !.Ħ!s!ïeďïďï ď&ö¦è!Ė !'B !02Ķ2!!îÇ !&ö !,ĦĦĦ!ĦĦïeĦ¸ e)¸!ĖqÕd !&BB !&ææ !&2!!!2!!îRsĦĦĦ!srr !)Ħ !'B!Ħĕ2 c)ĥqÕds !&Ėææ !&¥¥ !0B!!Ħö¦Ħr !+BBB1¸ĕ2Ė µ)öds!!Õ!!!R¥¥ !3RB !'R!ĖĆr !'B!ĖÕr1Æ!!CRIýýýI××¥!öÕös !,ææ !(R !(ÕQrrĖB!ĶĦæ1Q1QQr¤µÖĖ!Æ!!!HÖ!!ÓÖHÖæÕ!s !'Ėææ !&BB !'2ĖR!R!B!æĦĆ!¤1¤!!2B!cÇÇ¦·¶sR!Æ!!ļ!Ós!ĉÓ!(···C·C!!!RRc !&cc !(RĖRĖ!!!ĦĦ!ĖB!Ķ !&B¦ s&·×÷ķ¥!CÖÓĉ`s`ĉ!ÖR !&B !&2B !&ĆĆ !(ĖRĖR!!!ĦB!sB2 !1æ!!!¹öĉ`ĉö !&R!R2 !&B !'cc !(RĖRĖ !&ė¥c¦RB !0Æ!B!!s`ĉ`sÓ!B!!R!2 !,ææ !(ĖRĖR!ĦĦ3Bæts¦2 !0Æ!!¶!`ĉöĉ`¹s2RB2B !&Ėææ !&¥¥ !'ĶRĖRĖ!Ė!!Ĥ!ĖĦs¥BBRB¦!!!ĦÕµrQ1!22}!¹`!ö¹sÐ2R2!2B!!!R¥¥ !.Ė!Ė!!{ĖĦ$s!!ĦCķķė¦ss!ĦõööĖĶ!Æ!22ïsù!cs|ĕ!Ħ2B2 !-ææ !-Ķ{Ė!çR!!söö!s!!!B·ç×¶R!Æ!2!!ÐàĠàÐSS!Ķ!Ħ !'Ėææ !&cB !.Ķ{JĖĖ!!Ħĥ{ !)Bs·÷ėÆĕB!! ĕ*!!Ķ!Ħ!!!R¥c !&BB !*Ķ !)RBĖõöľ !-BėBĕĕ! S)!Rĕ !*B !'B !.2îľsB!ĥCć !.Ħ!ČB!B ĵ)S!!Rĕ !.Ħ !)Ķ2Ķ!2!¤Ħ<<<Ñ° !/B!!ČBČÜĴÜČÜĴĴĵ!S!!B !,ĦĦ !(Ķ!Ķ!!ľĞĦrČ Ĭ& !)öÕrQ11ĵ¤!!ČĖ{!{Ė{!îČČĵ!S !(Ħ !&Bc !'ĕ!!ĕ!Ħ!JæĆrĦ !*ĦöĥĆĦĦ!Ħs· !(îRßßķ!ĖÜČĵ !(B !&ææ !)ĕSĕ!!ľ·cĆQQµÕ ö&ÕõÕæĆĦ!Ħs·s!ććķîîRć!Ķ!ćR!ĖČČ!!!Ėææ !&¥¥ !)SĕSöd!!ėæ!ĆæÆ ¤&ÆÆĖĦĦĦBććsçćĶ!!ķ!ć!ĶĶĆ!!!{ !'R¥¥ !-Ħ!ĕ!ĕĆB¦çç·Æc Ħ+2s¥ės!çĶĆĖ!!!ķ!ĶĶĦ !&î !.ææ !'9ĕ!!!ĕÖc!!ç·ė 3+ħć÷*Ħç!Ė!c!!b!!2B!cb!ķķ !'Ėææ !&¥¥ !(Ħ!!!S!Ć!!Ħ!!ľ**! ç'!ĦĦĞć!Ķcc!!b!!!b!c!!ćĦĆćĖ!!!Rcc !&ĆĆ !'d9S!ScRB!Ćæ÷Ħ!Ķľç!!ĆĆÆçB!ć!!2¬ !,¤B!Ħc!{ !&BB !&cc !'cÇ)SBRÆBĆĆÖ!æ+*ç !&Ć!ÆçB!!!¬ßĆ!!!ć!b!ö!!Ç!!!b !'ĆĦ !-2!c)ĦÆ!!!Ö!ĕ!öėĖ!!ĖĆ!!æ2·Ė!!!Ć!2Ė×Ć!JćĖÆ·ĶĆc!Ė !'B !'ĆĆ !(2!c)9ĬĜs!ĕ!S!BöĆĦ!!ææĶĕcÆĦ!!¥sĕsö!!!ö!Ö1öc¬!{ !'BB !&cc !(ĶĖ!!ĕĶĖČ!!S!cRcBÍXyČĶĕScÖB¬ĶĶĕS!!cb!¥Öĕdcö !0ĆĆ !&ĞĶ2RĖ!Ķ!!ĖČS!cRcBÍåĆĶĶĜS¶¶B¬ĶĖĜS2¥c!JĶČ!S¥Ķý!¬ !.cc !'2Ķ!R!!Ė!!!ĜRsccÍÕĆĶ!!ĶĜÝ¬zĶ!!dĜĶ2cb!!dČ!Rý !1ĆĆ !*Ćą!!!R2SĝýÝ9ÕĖĶĶ!!2!!ĶĖ!!RcÇzĝ¬JĶĆcÇŅý !6v¤¢WhhËČČļļČüËËhhËìĜĬļĜČüüËË»hhh W(hËhhÓ W) !,ccu!Â ²T !+ææēē tV!Ėææ !&¥¥ BYR¥¥ !g æ_ !& R& ¥, R(c ¥-cRRR ¥/ccRR B(c",
);
rawImages.push(
  "#c^ŀĀ=MMM=ŀŀİİŀŀ-= M(===ŀŀŀ-== M*== ŀ&-== M+==--ŀŀ- !)2 S&ĶĶĥĕĕĕĦĶ!!222SSC2ĥĥĦĶĶ !'22CC3!ĵĥĥĕĦĶĶ !'22B2C3 !'ĕĕĦĶ!Ķ22dS!!ĶĶĵĥĦĶĶ !&22SC2ĥĥĦĶ !'222C3!!ĶĥĥĥĦĶĶ !'22B !'ĶĶĥĥĦ2!!!2d!!!ĶĶĥĕĶĶ !(22CCĵĶĶ !(2!233!!ĶĶĥĥĥĦĶ !0ĶĥĦĶ!!!ĶSC !'22 !)ĕĥĥ322 !(Ķ!Ķĵĵ !&2!3 !1eeeC3###33C e'3 #*TTTC3 #)33CTT e&TTCC3###ÉĶĶ !(C! D3 T9 e.§³ĥĥ !&RS2!! ģ2 ē6óóó ã-!!!CC2!!!Ėåå!!! Û- »:ÛÛÛ Ë-Ą!!!åå!!!s÷÷ !& æ, Ć= Ė-!!!s÷÷!!!Ħöö !Zöö!!!Ėåå !Yöåå !&tc !XBR·t !&BS ![B !ÃĶ !)Ķ !OĠĠ !*ĶĦ !'ąĕ !J2Rm<<B2Ġ !)2B !O2R]ŀ!2cB22Ġ !(2 !(dd !E2R]L,!!ĦRĖcB !1ĕĕ !3|Đ !/2Rm]<2!B2!!!RR!ĶH !*Ħ !&SS !2¿Ħc !-2R°L 2&B!!R¥RĦÖ!!Ġ!!!Ķ!!!ĕ !'ĕĕ !.ðŀ!¿ĆB!ķñ¿İßĀ !&2Bm !(R!RR!ĶBRR¶ !)ĆĶ !'SS !,ĠðĥRıÇsc!ĀåSõĦĥ!!!2B}22RRtRR!RĦööĆĦ!!!cŀ !8Ġðõĥ!Ħ!Ìt3ĶĴb!CBd !&Ā¥¥¥ĆĶĥ!ĦööĖ!ĦĦĦB!!!ĶĐ !&BC !&RĶĶ !)¥BĥĶĶĶÕÅÐąRöd2ĥĕdRm!2Ġ!ssÖc2ĦöĖ!!ĦĖĶĶĶ!!öĶ !(Ķ22!!!Ėåå !(¥BX!!!ĦĆæÕĶåRąC22ĖBB!ĠBBööĆööĖ!ĖĖBĶ !)Ć!B !'åå!!!s÷÷!2!!!BB··!ĶĦRRrC!2Ė3ĥC3RB!<RĦĦ!!ös!!Ė!!R!ĶĶ!!æÆĖ !)s÷÷!!!Ħöö !'B!!!íBR!!Rĕ!2!!C!BR2!R!!222RSBĦ!ĶĶdćÆ¥B¥Ć!!cB !(öö!!!Ėåå !'c·ö!Đíí!!!Ė2C!22cRc!ĦĖĖRc!B¶ÅĆ!Ķ!2!!öĖcdR!R!B !'öåå !&RR!!!Ħ !&ą2ĀĀS!ĶcC!B2RRR2ĶĖ!õRĦB¶!Ħ!!!2!bąccdAc¶ĖĶB !'Ķct !&dd !)ą!HBýĭ×BC! 2&!BĶĖĆÅć!!¶!Ö!!!B !(åcÖ!cĖ !)3B !&ąą !)döĶy!!RC!22!BBB!ĖĆą·!ĖsSö !(ÆÆĦdĞĞĶRÖĆ!ö!!Ķ!!!B !&RSS !*2Ķ !&¶BĦą2öĆĆĖÅą·sĶ!tÕĦ !'ÆĆĦdÝĖ!Æ!c !*cĶĶ!!!Ėåå !*cRd!!B!Ħ#tcĵÆĖÅ !'¶ąĖ !(ĆBdxĄÅædÆ2sR !)åå!!!s÷÷ !*d×RRR2!!ÅÖÖtBÆd!·sĶ!SĆ !'2RB!!ė¥Aa)d!Rss !'B÷÷!!!Ħöö !'æ!!ĥµõĖĖI!¶ÖAsæ!!RC!!2cąĦ!!!2B!Rddxĥ·!ėa)ç!!BB !'öö!!!Ėåå !'Ķ!sĦĶĦ!!!sRķ4çC!R¥ss!2SĆ!!2BRcsS!xėC!!!Ė!!·cR¥ !&öåå !&tR !'ĶÕ!d2B!!!It !&CCd B&ąĦ!22BBSS!åö!ĵ!CÕ!c¬!SC !'R·t !&BC !+¦!!!Rs i'!!!¥2!SĆ!!BcRS!µµ!!ÕĶ!ĥsRB!½½!Í!!!2!!B !'B !(æÕsRtRRB !&ĦĦěËx!!dą!!!R!Ķ!µ!ĖĖàs!ÕCsB!2!2Ýt !.Ħ !(ĦÆ! B&!!!ĦĦõ¤ÆĖ!¼Üĕ !&ĖĖĖµ!ĖR!æ4!¶QB$2!222õ !-Ħĥ !*1Õ !&ĦĦõ¤ÆĖ !&Ķ!2B !(ĖR!!!J4T$$2!222Bß !(Ħ!!!R2S !+ÆrÕĦĦ!õöĖ !(Ķì !&Ė!B!R!ĖĖRæĎBB2!222!KĦ!!!ĶĦĶ2!!!Ėåå!!Ħ !)ĆÆQQQÆĖ !*Ħ!B !&Ħ!!ĖR¥BĆĖ!2!222!B!Ć !'åå!!!s÷÷ !;ĶìĶR!!B!!!¥R2B2ĶZ!222!BK !(c÷÷!!!Ħöö!2 !:ĦB !'RR22ĦĆĆĖĆJ22!BK!ąĦ !'öö!!!Ėåå !<ĶìBR!!B!ĖĆĆĦ !&2ZJBK!ąĆļ !&Ćåå !&·· !=ĦBBR!!BRRss¥¶¶¶BddK !,tt !&ąą!!!Ķ !9ĶìBR!!2ccBBSCCddĦĦ!ĥĥĆĦ !(BB !&dd !>ĖÜ22!!!CCCBBBĦĦ!!ĥ!æĦļ !(ąĦ !EĦÜ2BSdBBBÛª x'¼¼Ĝļ !)C !'ąą !@Ħ¼¼x W&æĖĦ !0BBB !&dd !aąą !add !aąą !dBSâ Ē. Ă) ò?!!!Ħ !'RSS2!u §/ ¸) È@!!!ĶĶ!!!Ėååu Ó1 óH!cåå!!!s÷÷ģ s1 RI!÷÷!!!Ħ ö_!!!Ė å_ !& c&¦¦¦ ·&¦¦¦ c(t¦¦ ·)¦¦tccc¦¦ ·+¦¦ttcc R(t",
);
rawImages.push(
  "#c±^- ±'^^MM^^n ±,^^^n ±. ^&n ±/nn^^n !*RRccĶĶĦĆĖĖĦ !(RRRBĖĖĦ !+RR2!ĶĖĖĖĦ !+BBR2 !'ĖĖĦ !'cc!!ĶĶĶĖĦ !*RRBĖĖĦ !*BR2!!ĶĦĖĖĦ !+B !'ĶĶĦĖĦ !'c!!!ĶĶĦĆĦ !+RRĶĦ !+B22!!ĶĶĦĖĖĦ !1ĶĦĦ !'cB !'B !*ĖĖĖ2B !+ĦĶĶ !&2!2 !1333ķ ė(ķ 3' ė& ħ'333# ħ,#33 C&33## ħ&µ !*B! ¸5 §CÔdĖĖ !'cB!! ÃF ¢0Ć!!RRB !&ææ!!! Ĝ- û:ěěě û-Ĕ!!Ėææ !&¥¥ !& Õ, ö= Ė-!!!R¥¥ !gææ !XsĖææ !&cR !W2!R¥c !&BR ![B !^2 !½İİ !+Ħ !'ĆĆ !J2Rm<<2!İ !*B !O2R]ŀ!2cB2!İ !/cc !E2R]L,!!ĦRĖcB !1ĖĖ !3|Đ !/2Rm]<2!B2!!!RS!Ķ8 !*Ħ !&RR !2ÀĦc !-2R±L 2&B!!R¦SĦÕ!!Ġ !)Ė !'ĖĖ !.ðŀ!ÀąB!ćñÀİàĀ !&2cn !(S!SS!ĶBRR¶ !*Ķ !'RR !,ĠðĦRġÆtd!İåRöĦĦ!!!2c^22SStSS!SĥõõąĦ!!!cİ !8ĠðöĦ!Ħ!čs2Ķĵc!BBc !&à¤¤¤ąĶĦ!ĥõõĖ!ĦĦĦB !&ŀ !'B !0çBĦĶĶĶÖÕlĆRöc2ĦĖcRm!2Ġ!ss×d2ĥõĖ!!ĦĖĶĶĶ!!öĶ !)BB !&ææ2 !'çBy!!!ĥąæÖĶæRĆB22ĖBB!ĠBBööąõõĖ!ĖĖBĶ !)Ć !(Ėææ !&¥¥ !'RB!·!ĵĥSSrB!2Ė2ĦB2RB!<RĦĦ!!öt!!Ė!!S!ĶĶ!!æÆĖ !)R¥¥ !-d!!!ČCS!!SĖ!2!!B!BR2!R!!222RRBĦ!ĶĶsėÇ¥B¥Ć!!cĶ !.ææ !'R!!!ðČČ!!!ĕ2B!22cRc!ĦĖĖRc!B·ÅĆ!Ķ!2!!õĖcdR!R!B !'Ėææ !&BB!!!ĥ !&Ħ2ààR!ĶdB!B2RRR2ĶĖ!öRĦB·!Ħ!!!2!QöccdAc¶ĖĶĦ !'RRc !&cc !)Ħ!iBĝ)ÖBB! 2&!BĶĖĆÆĆ!!·!Õ!!!B !(åcÖ!cĖ !)2B !&ĆĆ !)BµĦÝ!!RB!22!BBB!ĖĆĆ¶!ĖsRõ !(ÇÇĥdîîĶRÖĆ !*B !'cc !*BĦ !&¶BĦĆ2öĆĆĖÆĆ¶sĶ!tÕĦ !'Çąĥd¬Ė!Ç!c !1ææ !)Ĥ·¦B!!B!Ħ#scĶÆĖÆ !'·ĆĖ !(ąBdË@ÅæcÇ2sRĶ !'Ėææ !&¥¥ !)DńPĤĤĤ3!!Å×ÖsCÆc!¶sĶ!Rą !'2RB!!×·¤´ĝc!Rss !'R¥¥ !-Õ!!DĘDDDi!¶ÖAsç!!RB!!2dĆĦ!!!2B!SddËŅB!ć´ĝç!!B !.ææ !'Ħ!!ĦĥĦ!!!tRķ3çB!S¥ss!2Rą!!2BRdtR!Ë×#!!!Ć!!·dRc !&Ėææ !&cB !'ĶĦ!BCB!!!it !&BBdBCCCĆĦ!22BCRR!åÖ!Ņ!#Ħ!cY!RC !'R¥c !&BB !(Õ!!s !'8ĺĺĺ8!!!¦2!Rą!!BdSR!µµ!!Ħ!!ŅAcB!jjRÍ !(B !'B !(ĖĦ !(ĤĤ!!!Ĥļëx!!cĆ!!!S!Ķ!µ!ĖĖÐA!Ħ#cR!2!2¬t !.Ħ !)ÕĦ !' D&$÷¤ö!»ëĖ !&ĕĕĕµ!ĖR!æĘ!AbRĈ2!222õ !-ĦĦ !)ĖÕĦ !(ĦÕ¤ö !&Ħ!2B !(ĖR!!!{Ę4ĘĈ2!222Bß !(Ħ !&Bc !*ĖÕöĦ!!ĦĦõö !(Ķċ !&Ė!B!R!ĖĖRçĿBB2!222!KĦ !(B !&ææ!!Ħ !(ĖÕ¤bb¤¤ö !*Ć!C !&Ħ!!ĖR¥Bąĕ!2!222!B !(Ėææ !&¥¥ !;ĶċĵR!!B!!!¥R2B2Ķ®!222!B| !(R¥¥ !BĆC !'RR22ĦĆĆĖĆ{22!B|!ą !.ææ !<ĶċBR!!B!ĖĆĆĦ !&2ÏÏB|!!!Č !&Ėææ !&¥¥ !=ĆCBR!!BRRss¦···dRB|!!ą !(Rcc !&ĆĆ!!!Ħ !9ĶċCS!!3ddCCRBBsRĖĖ!ĦĦ !*BB !&cc !>öë23!!!BBBRRRĖĖ!!Ħ!ĥĦČ !(ĆĦ !EĖë2CRsRRRČ» x'»»Üü !)B !'ĆĆ !@Ė»»x G&¤öĖ !1BB !&cc !aĆĆ !acc !aĆĆ !edÒ Ă* òJ !,cc!_ ä& ô( ĄK !+ææe S' ·R!æææ !&¥¥ģ s' !S¥¥¥ !g æ_ !& R& ¥, R(c ¥-cRRR ¥/ccRR B(c",
);
rawImages.push(
  "!c^ąĆ¦2!!Ķĥ!Ķ!2!322 !'Ķ!!ĥ!!32!2 !)Ķ!ĥ!!!32!2 !*Ķ!Ķ!ĵ!3^ąĆ¦2 !'Ķ!ĕ!!!2!322 !(Ķ!ĥ!32!2 !(Ķ!Ķĵ !&32!2 !)Ķ!Ķ!^ąĆ¦ĥ!322Ķ2!!Ķĕ!!!2!32!2 !(Ķ!ĥ!322 !(Ķ!Ķĵ!Ķ!2!32!2 !)Ħ^ąĆ¦ĕ!!23B !'ą !(C22 !)Ķ!ĥ322 !(Ķ!Ķ!ĥ !&2!322 !'Ħ^ąĆ¦ĕ !&C22!!Ķ!Ķĥ !&S2 !)ĕ!!322 !(Ķ!Ķĵ!Ķ!!!2!3!22 !'Ħ^ąĆ¦ĕ!!!C22!Ķ!ĕ !&C2!2 !&Ķ!ĥ!32!2 !(Ķ!Ķĵ !(3!2!2 !&Ķ!!Ķ^ąĆ¦ĕC2!2!!Ķĕ!!C2!2 !&Ķ!ĥ!32!2 !)Ķ!Ķ!ĵ!32!2 !+Ķ!ĥ!!!3^ąĆ×Ė !^^ąĆ¦å !^^ąĆ÷ !_^ąĆ×Ė !^^ąĆ¦å !^^ąĆ¦ĶĵĶ !*2!3!2!2 !+ĶĶĵĶ !&2!322 !&Ķ!ĶĵĶ!2!3B !'Ħ^ąĆ¦2!Ķ!ĶĵĶ !*2!3!2!2 !)ĶĶĵĶ !(2322 !&Ķ!ĶĵĶ!23B !&^ąĆ¦2 !'Ħĵ!Ķ !+2322 !*ĶĶĥ !)2C2 !(Ķ!ĥĶ!!CB!!^ąĆ¦2!!!ĶĶĵĶ !-2322 !,Ħĥ !)2C2 !)ĶĥĶ!23B!^ąĆ¦2Ķ!ĶĵĶ !,2!3!22 !*Ķ!Ķĥ !)2322 !*Ķĕ!!23B^ąĆ¦ĕ !*2!!3!2!2 !-ĶĶ!ĥ !)2322 !*Ķ!ĕ!!23B!^ąĆ¦ĕ!!2!3!2!2 !/ĶĶ!ĵ!Ķ !'2!322 !+ĶĶĵ!Ķ!!23B!!^ąĆ¦2 !0Ķ!!Ķ!!ĵ!Ķ !&2!32!2 !,ĶĶĵ!Ķ !&23B !&^ąĆ¦ĥ !532!2 !1ĶĶĵ!Ķ !&2!3B !)Ħ^ąĆ¦2 !=Ķ!Ķ!!ĵ!Ķ !)2!3!B !,ĕ3^ąĆ¦ĥ !F3!B !1Ħĵ!ĶC^ąĆ¦2 !RĦ!ĵ!!Ķ !&C^ąĆ¦2 ![Ħ!^ąĆ×Ė !^^ąĆ¦å !^^ąĆ÷ !_^ąĆ×Ė !^^ąĆ¦å !^^ąĆ¦ĕ!2!!3!B!!!Ħ!ĥ !&23B !)ĶĶĵĶ !(2!3B !'ĶĥĶ !*23^ąĆ¦2 !)Ħ!ĥ !&2!3B !)ĶĶĵĶ !'2!3!B !'ĶĶĵĶ !)2!3B^ąĆ¦ĕ !-2!3!B !'Ķ!Ķĵ!Ķ !&2!3!B !'Ķ!ĶĵĶ !)2!3!B!^ąĆ×Ė !^^ąĆ¦å !^^ąĆ÷ !_^ąĆ×Ė !^^ąĆ¦å !^^ąĆ¦Ķĥ !(2!3B !'ĦĵĶ !&2!3!B !(Ħ!ĵĶ !(2!3!2!2 !)Ħ^ąĆ¦2Ħĥ !*23B !&ĦĵĶ !(2!3B !(Ħ!ĵĶ !*2!322 !(^ąĆ¦2!Ħĥ !*23B !&ĦĵĶ !*23B !(Ħ!ĵĶ !*2322 !'^ąĆ¦2Ħĥ !*23B !&ĦĵĶ !*23B !(Ħ!ĵĶ !(2!322 !)^ąĆ¦Ķĥ !)2!3B !&ĦĵĶ !(2!3B !)Ħ!ĵĶ!!!2!3!2!2 !*Ħ^ąĆ×Ė !^^ąĆ¦å !^^ąĆ÷ !_^ąĆ×Ė !^^ąĆ¦å !^^ąĆ¦2 ![Ħ!^ąĆ¦ĕ !V2!3!B!!^ąĆ¦2 !RĶ!!!Ķĵ!Ķ!!C^ąĆ¦2 !XĶ!!Ķ!^ąĆ¦ĕ !E2!3!2!!!2 !1^ąĆ¦2 !>Ķ!!!Ķ!ĵ!Ķ !)2!3!2!2 !*^ąĆ¦ĕ !32!3!2!!2 !.Ķ!!Ķ!ĵ!Ķ!!!23!2!2 !'^ąĆ¦2 !)Ķ!!!Ķ!ĵ!!Ķ !+2!3!2!!2 !)Ķ!!Ķ!ĵ!Ķ!!23!22!!!^ąĆ¦ĕ!!!2!3!B !,Ķ!Ķ!ĵ!Ķ !*2!3!2!!2 !&Ķ!Ķ!ĵ!Ķ!!23B!!^ąĆ¦ĕ !.2!!3!B !&Ķ!Ķ!ĵ!Ķ !*2!3!2!!2!!!Ķ!!!ĥ!!322!^ąĆ×Ė !:2Ķ !C^ąĆ¦å !^^ąĆ÷ !_^ąĆ×Ė !^^ąĆ¦å !^^ąĆ¦ĥ!!!C!!2!!!Ķ!!ĥ !'32!2 !(Ķ!Ķĵ!!C!2 !*Ķ!Ķ!ĵ!Ķ !'C",
);
rawImages.push(
  "!c±ĖĖ¥ !&Ė!Ķ!2!2B !+Ė!!2B !-Ė!!!2B !.Ħ!Ķ!2±ĖĖ¥ !*Ć!!!2!2B !+Ė!2B !,ĦĶ !&2B !-Ħ!±ĖĖ¥Ė!2B !(Ć!!!2!2B !,Ė!2B !+ĦĶ!Ķ!2!2B !+Ħ±ĖĖ¥Ć!!22B !'Ć !(BB !,Ė2B !+Ħ!Ħ !&2!2B !(Ħ±ĖĖ¥Ć !&BB !'ĦĦ !&c !*Ė!!2B !+ĦĶ!Ķ!!!2!2!B !(Ħ±ĖĖ¥Ć!!!BB !&Ć !&BB !*Ė!2B !,ĦĶ !(2!B !+Ħ±ĖĖ¥ĆBB !'Ć!!BB !*Ė!2B !-Ħ!Ķ!2B !/Ė!!!2±ĖĖ¥ !_±ĖĖ¥æ !^±ĖĖ¥ !_±ĖĖ¥ !_±ĖĖ¥æ !^±ĖĖ¥ĦĶĶ !*2!2!B !.ĦĶĶ !&2!2B !)ĦĶĶ!2!2B !'Ħ±ĖĖ¥ !&ĦĶĶ !*2!2!B !,ĦĶĶ !(22B !)ĦĶĶ!22B !&±ĖĖ¥ !(ĦĶ!Ķ !+22B !,ĦĦ !)2R !+ĖĶ!!BB!!±ĖĖ¥ !'ĦĶĶ !-22B !-ĦĦ !)2R !+ĖĶ!22B!±ĖĖ¥!!!ĦĶĶ !,2!2!B !-ĦĦ !)22B !,Ć!!22B±ĖĖ¥Ć !*2!!2!B !0Ħ!Ħ !)22B !-Ć!!22B!±ĖĖ¥Ć!!2!2!B !2Ħ!Ķ!Ķ !'2!2B !-ĦĶ!Ķ!!22B!!±ĖĖ¥ !4Ħ!!Ķ!Ķ !&2!2B !/ĦĶ!Ķ !&22B !&±ĖĖ¥Ė !52B !4ĦĶ!Ķ !&2!2B !)Ħ±ĖĖ¥ !@Ħ!!Ķ!Ķ !)2!2!B !,Ė2±ĖĖ¥Ė !F2!B !1ĦĶ!ĶB±ĖĖ¥ !SĦ!Ķ!!Ķ !&B±ĖĖ¥ !]Ħ!±ĖĖ¥ !_±ĖĖ¥æ !^±ĖĖ¥ !_±ĖĖ¥ !_±ĖĖ¥æ !^±ĖĖ¥Ć!2!!2!B!!!Ħ!Ħ !&22B !*ĦĶĶ !(2!2B !(ĖĶ !*22±ĖĖ¥ !*Ħ!Ħ !&2!2B !*ĦĶĶ !'2!2!B !(ĦĶĶ !)2!2B±ĖĖ¥Ć !-2!2!B !)ĦĶ!Ķ !&2!2!B !)ĦĶĶ !)2!2!B!±ĖĖ¥ !_±ĖĖ¥æ !^±ĖĖ¥ !_±ĖĖ¥ !_±ĖĖ¥æ !^±ĖĖ¥ĦĦ !(2!2B !'ĦĶĶ !&2!2!B !(Ħ!ĶĶ !(2!2!B !+Ħ±ĖĖ¥!ĦĦ !*22B !&ĦĶĶ !(2!2B !(Ħ!ĶĶ !*2!2B !)±ĖĖ¥!!ĦĦ !*22B !&ĦĶĶ !*22B !(Ħ!ĶĶ !*22B !(±ĖĖ¥!ĦĦ !*22B !&ĦĶĶ !*22B !(Ħ!ĶĶ !(2!2B !*±ĖĖ¥ĦĦ !)2!2B !&ĦĶĶ !(2!2B !)Ħ!ĶĶ!!!2!2!B !,Ħ±ĖĖ¥ !_±ĖĖ¥æ !^±ĖĖ¥ !_±ĖĖ¥ !_±ĖĖ¥æ !^±ĖĖ¥ !]Ħ!±ĖĖ¥Ć !V2!2!B!!±ĖĖ¥ !WĦĶ!Ķ!!B±ĖĖ¥ !]Ħ!±ĖĖ¥Ć !E2!2!B !5±ĖĖ¥ !CĦ!Ķ!Ķ !)2!2!B !,±ĖĖ¥Ć !32!2!B !4Ħ!Ķ!Ķ!!!22!B !)±ĖĖ¥ !.Ħ!Ķ!!Ķ !+2!2!B !/Ħ!Ķ!Ķ!!22!B !&±ĖĖ¥Ć!!!2!2!B !.Ħ!Ķ!Ķ !*2!2!B !+Ħ!Ķ!Ķ!!22B!!±ĖĖ¥Ć !.2!!2!B !(Ħ!Ķ!Ķ !*2!2!B !,Ė!!2B!!±ĖĖ¥ !_±ĖĖ¥æ !^±ĖĖ¥ !_±ĖĖ¥ !_±ĖĖ¥æ !^±ĖĖ¥Ė!!!R !+Ė !'2B !,ĦĶ!!R !.Ħ!Ķ!Ķ !'B",
);
rawImages.push(
  "#c #c! ąa !& B] !'Ħ æ'ÖæÖæ Ö& Æ+ÖÆ Ö(æÖæÖæÖæÖæÖæÖæÖæÖæÖ æ*Ć !.2Ķ2Ķ!!!ĶĘ!!Ĩ !&2Ķ2 !'2Ķ2Ķ2Ķ2Ķ2Ķ2Ķ2Ķ2Ķ2Ķ2 !3Ħ2c!Ķ2Ķ !&Ę2!!!Ĩ!!2Ķ2 !(Ķ2Ķ2Ķ2Ķ2Ķ2Ķ2Ķ2Ķ2ĦBc!!!Ħ2c !-ĦĖĖĶ2Ķ2!!!Ĩ2 !'Ĩ2Ķ2 !'2!2Ķ2Ķ2Ķ2Ķ2Ķ2Ķ2Ķ2ĶĦĖĖ!!!ĦĖĖ !-BĦĖ2Ķ2Ķ!!ĨĶ !)Ĩ2 !(Ķ2Ķ2Ķ2Ķ2Ķ2Ķ2Ķ2Ķ2Ķ2BĦĖ!!!BĦĖ!2 !+BcBĶ2Ķ!!Ĩ !*2!$ !(2Ķ2Ķ2Ķ2Ķ2Ķ2Ķ2Ķ2Ķ2!BcB!!!BsB2Ķ !-Ķ2Ķ!!!@Ħ !*Bń !'2Ķ2Ķ2Ķ2Ķ2Ķ2Ķ2Ķ2Ķ2 !*2Ķ2Ķ2 !-2Ķ2 !&PĶ !'2Bń !(Ķ2Ķ2Ķ2Ķ2Ķ2Ķ2Ķ2!2 !*2Ķ2Ķ2Ķ !+Ħ2c2Ķ!!!Ķ!PĶ!!!2Bń !)2Ķ2Ķ2Ķ2Ķ2Ķ2Ķ2 !,2ĶĶ!cĶ2 !+ĦĖĖĶ!!!Ķ2!!PĶ!2Bń !'2!2Ķ2Ķ2Ķ2Ķ2Ķ2Ķ2 !,2Ķ2ĶĖĖ2Ķ !+BĦĖ2!!!2Ķ!!!P2Ķń !'2Ķ2Ķ2Ķ2Ķ2Ķ2Ķ2Ķ2 !,2Ķ2Ķ!!Ħ!2 !+BRBĶ!!!Ķ !'Ķ2 !(Ķ2Ķ2Ķ2Ķ2Ķ2Ķ2Ķ2 !,2Ķ2Ķ2BRB !-Ķ2Ķ!!!Ķ !(2 !)2Ķ2Ķ2Ķ2Ķ2Ķ2Ķ2 !*2!2Ķ2Ķ2Ķ2 !/2Ķ2!!Ķ2 !&22 !)2Ķ2Ķ2Ķ2Ķ2Ķ2Ķ2 !*2Ķ2Ķ2Ķ2Ķ2 !0ĦBc!!2Ķ!!BĶ Ė+ĆĖĆĖĖĦĖĦĖĦĖĦ Ė+ĆĖĆĖĆ2Ķ2!Ķ!R !,ĶĦĖĖ!!Ķ !&sc R(cRcRcRRBRBRB R+cRcB2BcĶ2!!ĶĖĖ !,2BĦĖ!Ķ !&ĶĦBs2!!!2Ķ2Ķ2Ķ2Ķ2Ķ2Ķ2 !*2Ķ2ĦĶ2BĶ2 !&2Ķ !,ĶBR2Ķ2!!!2ĶĶĖĦc2!2Ķ2Ķ2Ķ2Ķ2Ķ2!2 !*2ĶĶĖĶ2B!2 !&BB2 !,2Ķ!!2Ķ!!!Ķ2!!ĖĦcRĶ2Ķ2Ķ2Ķ2Ķ2 !,2ĶĶĶ2BB !6Ķ!!!Ķ !&2 !&ĖĦB¶B2Ķ2Ķ2Ķ2 !,2ĶĶĶ222 !72!!Ķ !&2 !'2ĖĆĆcB2Ķ2Ķ2 !*2!2ĦĶĶ222!Ķ!R !4Ķ!Ķ2!!!2!!!ĶBsĶ2ĶĦĆcB2Ķ2 !*2Ķ2ĦĶĶR22!!ĶĖĖ !62ĶĦ!2 !&ĦĖĖ2Ķ2ĶĦĆcB2 !*2Ķ2ĦĶ2RĶ2 !&2Ķ !&2R !0Ķ!¥ĦĶĶ!!!BĦĖĶ2Ķ2ĶĦĆc¥B !(2Ķ2ĦĶ2BĶ2 !&BB2!!!2BĖ !/Ķ!!BsĦĦĶ!22c22Ķ2Ķ2ĶĦæĆcB !&2ĶĶĦĶ2BĶ2 !+2RBĦĖ!!!2 !*Ķ2!!B!RBĦĶĶ2Ķ2Ķ2Ķ2!2!!ĦĆcB!!2 Ķ&BB!2 !+2BĦĖĶ!2!2Ķ !*2Ķ!2!!!2BĦĶĶ2Ķ2Ķ2 !'ÅĦĆc¥BĶĶĶ2B2 !-2BĦĶ!!!Ķ2Ķ2 !*Ķ !(22BĦĦĶ2Ķ2!!!Ħ2cÇ!ĶæĆcĶĶ222!Ķ!R !(2RBĦĶ2!2!2Ķ2 !-2!!!2Ķ22cBĦĶ2 !&ĶĖĖ!2Ķ2Ħö 2&!!ĶĖĖ !'2BĦĖĶ2Ķ2Ķ!!2 !-2 !&Ķ2Ķ2Ķ2BĦĶ !&2ĶĖ2Ķ2Ķ2Ķ222 !&2Ķ !&2BĦĶ!2Ķ2Ķ22 !/Ķ !&2Ķ2Ķ2Ķ2BĦĶ!!!BRRĶ2Ķ2Ķ2Ķ2 !&BB2!!!2BĦ!!2Ķ2!2 !12 !&Ķ2Ķ2Ķ2!2BĦĖĶ!!2Ķ2Ķ2Ķ2Ķ2 !+2RBĦ!Ķ2Ķ2 !32 !'2Ķ2Ķ2!!!2RBĦĶ2Ķ2Ķ2Ķ2!2 !+2BĦĖ!Ķ2Ķ2 !72!!Ķ2Ķ2 !(2BĦĦ2Ķ2Ķ2!Ķ!R !)2BĦĶ2Ķ2!2 !72Ķ!!2Ķ2 !*BBĦĶ2Ķ2!!ĶĖĖ !(2BĦĶ2Ķ2 !92Ķ2!2Ķ2 !(2!2ĦĶB2Ķ2 !&2Ķ !'2Ķ!cRĶ2 !92Ķ2Ķ!!2 !(2Ķ2ĦĶ2BĶ2 !&BB2 !&2Ķ2ĖĦBR !:Ķ2Ķ2 !*2ĶĶĖĶ2BĶ2 !-2Ķ2Ķ2ĦĦBcB !82Ķ2Ķ !)2ĶĶĶ2BBĶ2 !+2!2Ķ2!2!!ĦĆĦBB !7Ķ2Ķ2 !(2ĶĶĶ222Ķ2Ķ!R !(2Ķ2Ķ2!ĶĶB!!!ĦĦBB !62Ķ2 !(2ĶĶĶ222!2!ĶĖĖ!!!2!2Ķ2Ķ2!!ĦĦĖ !&ĦĦBB !5Ķ2 !(2ĦĦĶ222 !'2Ķ!!2Ķ2BĶĖĶ!!!2 !)ĦĦBcB !32 !(2ĦĶ2R22 !'BB2!2!RBĦB2ĶĦ!!BR2 !(ĦĆĦBB !82ĦĶ2BĶ2 !)2!2!B!Ħ!!B2ĶĦ !.ĦĦBB !42ĦĶĖĶ2BĶ2 !)2Ķ2!BĦĦ !&B2!ĦĦ !-ĦĦBcB!!ĶĶ !-2ĶĦĖ2BBĶ2 !'2!2Ķ2BBĦ !)BB!ĶĦ !-ĦĆĦBB!!2Ķ !+2Ķ2Ć222Ķ2!Ķ!R!2Ķ2Ķ2B!Ħ !,B2ĶĦ !(ĶĶB!!ĶĦĦsĶ2Ķ2 !*2Ķ2Ķ222!2!!ĶĖĖ2Ķ2Ķ2BĦĦ !.B2ĶĦ !'ĦĦĖ!Ķ2ĶĦö2Ķ!Ķ !*Ķ2Ķ222 !(2ĶĶ2!2BĦ !1B2ĶĦĦ!!Ķ2!!Ķ2Ķ2Ķ!Ķ !-2Ķ2Ķ2 !'2BR22!BBĦ !3BRĶĦĖĶ22R!2Ķ!Ķ !0Ķ2Ķ2 !'2Ķ2Ķ2!BĦĦ !4Ķ!B2ĶĦĶ2Ķ!Ķ !)Ķ !+2Ķ2!!!2!2Ķ2!2!BĦ !3Ķ!Ķ2Ķ2B2ĶĖĖ !+Ķ2Ķ !*Ķ2!Ķ!RĶ2Ķ2!!BBĦ !1Ķ!Ķ2Ķ2Ķ2Ķ!BR2ĶĦ!Ķ!Ķ!Ė!R2Ķ2 !*2!2ĶĖĖ2Ķ2!!B!! B2RBRBRBRBRR22B2ĶĦ2Ķ2ĶĦĖĖĶ2Ķ !+2Ķ!2Ķ!2!!c B?ccRRRBĶ2Ķ2BĦĖ2Ķ2 !*2Ķ2BRB !& Ć-öĆöĆöĆöĆ ö&æöæöæöæöæĖĦ!Ķ2Ķ2ĶRcRĶ2Ķ !*Ķ2!2 !0Ķ!Ķ2Ķ2Ķ2Ķ!Ķ!Ķ!Ķ2Ķ2Ķ2Ķ2Ķ2Ķ2Ķ2Ķ2Ķ2Ķ2Ķ2Ķ2 !9Ķ!Ķ2Ķ2Ķ2Ķ!Ķ!Ķ!Ķ2Ķ2Ķ2Ķ2Ķ2Ķ2Ķ2Ķ2Ķ2Ķ2Ķ2Ķ2Ķ2Ķ !*2 !-Ķ!Ķ2Ķ2Ķ2Ķ!Ķ!!!Ķ2Ķ2Ķ2Ķ2Ķ2Ķ2Ķ2Ķ2Ķ2Ķ2Ķ2Ķ!Ķ!Ķ!Ķ !4Ķ!Ķ2Ķ2Ķ2Ķ!Ķ !(2Ķ2Ķ2Ķ2Ķ2Ķ2Ķ2Ķ2Ķ2Ķ!Ķ!Ķ !0d ¦,·¦·¦·¦·¦ ·,Ç·Ç·Ç·Ç·Ç·Ç·Ç·Ç· Ç/¦Cdd!",
);
rawImages.push(
  "#c Qc! Da !& Ĥ] !'Ħ ÷'×÷×÷××ÇÇ ·+Ç· Ç'×××ç×ç×ç×ç× ç(÷ç ÷(ć÷$ !.BĦBĦ!Ķ!ĶĨ!!ĸ !&2Ķ2 !&2!!!Ķ2Ķ2Ķ2Ķ2 !'2Ķ2 !'2Ķ2 !+ĆC·!ĦBĦ!Ķ!!Ĩ2!!!ĸ!!2Ķ2 !&2!!2!2Ķ2Ķ2Ķ2 !'2ĆS·!!!ĆC¦2 !,ĦåöĦBĦBĶ2!ĸ2 !'ĸ2Ķ2 !&2!!2Ķ2Ķ2Ķ2Ķ2 !'2ĶĦåö!!2Ħåö !-BĦåBĦBĦ2!ĸĶ !)ĸ2 !&2!!2Ķ2Ķ2Ķ2Ķ2 !'2Ķ2BĦå!2ĶBĦå!3 !+c¥cĦBĦ!!Ĩ !*2!$2!!2!!2Ķ2Ķ2Ķ2Ķ2 !'2Ķ2!c¥c2Ķ2c¶s3ĵ !-ĦBĦ!!!0Ħ !*2ńĶ!2!!2Ķ2Ķ2Ķ2Ķ2 !'2Ķ2 !&2Ķ2Ķ2!3ĵ3 !-BĦB!!Ķ!@Ķ !'22ń!!2!!2Ķ2Ķ2Ķ2Ķ2 !'2!2 !&2Ķ2Ķ2Ķ3ĵ3ĵ !+ĆC·BĦ!Ķ!Ķ2@Ķ!!!22ń!!2!!2Ķ2Ķ2Ķ2Ķ2 !'2 !(2Ķ2Ķ2!Ħ!¦ĵ3 !+ĦåöĦ!Ķ!Ķ2Ķ!@Ķ!22ń!!2!!2Ķ2Ķ2Ķ2Ķ2 !'2 !(2Ķ2Ķ2!3Ħåö3ĵ !+BĦåB!2!2Ķ!!!@2Ķń!!2Ķ!2Ķ2Ķ2Ķ2Ķ2 !'2 !(2Ķ2Ķ2!3ĵ!!ą!3 !+cccĦ!Ķ!Ķ !'Ķ2!!2Ķ2!Ķ2Ķ2Ķ2Ķ2 !'2 !(2Ķ2Ķ2!3ĵ3s¦d !-ĦBĦ!Ķ!Ķ2 !'2!!2Ķ2!!2Ķ2Ķ2Ķ2 !'2 !(2Ķ2Ķ2!3ĵ3ĵ3 !/BĦBĶ!Ķ2Ķ!!!22!!2Ķ2!!2Ķ2Ķ2Ķ2 !'2 !(2Ķ2!2!3ĵ3ĵ3 !0Ćd·2!2Ķ!!cĶ Ė&ĆĖĆĆĆöĆöĆĆĖ Ć( ö)æö æ&Õ3ĵ3!ĥ!s !,ĦĦåö!!Ķ !&ç¥ c(scscs c) s)¥s¥s·R2R·ĵ3!!Ħåö !,BBĦåĶĶ2!!!Ėõt×B!!!2Ķ2Ķ2!2 !'2 !(2Ķ2ĶCąĦBdĵ3 !&Bĥ!2 !*ĦccBĶ2Ķ!!2ĶĖÕĦ·B!2Ķ2Ķ2Ķ !(2 !(2Ķ2ĶĦåĦBd!3 !&ddC2Ķ !*BĦ!Ķ2Ķ!!!Ķ22ĶÕĦ··ĶBĶ2Ķ2 !'2 !(2Ķ2ĶĦĦBsd !+2Ķ2 !*Ħ!Ķ!Ķ !&22Ķ2!ÕĦBµtBĶ2 !'2 !(2Ķ2ĶĦĦBR3 !+2Ķ2 !+BĶ!Ķ !&22Ķ2!!2ÕÕ$ńtB !'2 !(2Ķ2ĖĦĦBR3!ĥ!s!!!2!2Ķ2 !,Ħ!Ķ2!!!22Ķ2Ħd×Ķ2Ħõ$ńt!!!22 !(2Ķ2ĖĦĦ¦R3!!Ħåö!!2Ķ2Ķ2 !-Ķ!2ĶĦ!22Ķ2!Ħåö2Ķ2Ħõ$ń¦!2 !)2Ķ2ĖĦB¦ĵ3 !&Bĥ!2Ķ2Bs !0Ķ!÷ĦĶĦ2!!BĦåĶ2Ķ2Ķõ$ń¤t !(2Ķ2ĖĦBdĵ3 !&ddC2Ķ2BBö !/Ķ!!BÇĦĦĦ!2BsB2Ķ2!!Ķõ÷$ńt !&2ĶĦĖĦBdĵ3 !)2ĶRcBĦå!!!2 !*Ķ2!!Ĥ!cBĦĦĶ2Ķ2Ķ2!!!2!!õ$ńt!!2ĶĦĦĦcd!3 !)2ĶRBĦĆĦ!2!2Ķ !*2Ķ!2!!!BBĦĦĶ2Ķ2!!!2 !&ą$ńrtĶĦĦBsC !+2ĶRBĦĦ!!!Ķ2Ķ2 !*Ķ !(2BBĦĖĶ2!!!2!ĆC·2Ķąć$ńĦĦBR3!ĥ!s !'2BsBĦĦ2!2!2Ķ2 !-2!!!2Ķ2BsRĖĶ!!2!!ĶåöĶ2!!ąĘBBR3!!Ħåö !&2BBĦĆĦ2Ķ2Ķ!!2 !-2 !&Ķ2Ķ2!2RĖĶ2!!!2Ķå2!!!3ĵCR3 !&Bĥ!!!2BBĦĦ!2Ķ2Ķ2B!!!2 !-2!!2Ķ2!!!2RĖĦ!!!sss!!!3ĵ3ĵ3 !&ddC!!2BBĦĶ!2Ķ2!2 !&2Ķ !*2!2!!!Ķ2 !&2BRĖöĦ2Ķ2!!!3ĵ3ĵ3 !*2RcBĦĶĶ2!2 !(2Ķ2 !+2 !&2 !&2!!BsRĖĖ2!!!3ĵ3!3 !*2BBĦĆĶĶ2 !(2!2Ķ2 !+2!!2 !(2 !'BRĖĖ!!3ĵ3!ĥ!s !(2BBĦĦ2Ķ2!!2!2!2!!Ķ2 !.2Ķ !'2 !)RRĖ!3ĵ3!!Ħåö !'22BĦĦ2Ķ2!!2Ķ2Ķ2!!!2 !-22ĶB!R!!2 !'2!2ĖĦR3ĵ3 !&Bĥ !&22Ķ!ńcĶ2!!2!2!2 !3ĶBĶ!!!2 !'2Ķ2ĖĦBdĵ3 !&ddC!!!22Ķ2ĆDĤc2!2 !7ĶBĶ!!!2!!!2!2ĶĦöĦBdĵ3 !*2!22Ķ2Ķ2ĖDĤńR !8BĶ !)2Ķ2ĶĦĦBsdĵ3 !* 2&Ķ2!2!!Ė$DĤB !7Ķ !)2Ķ2ĶĦĦBR3ĵ3ĥ!s!!!2!22Ķ2Ķ2!ĦĦR!2ĶĦDĤB !-Ķ !-2!!!2Ķ2ĶĦĦBR3!3!Ħåö!! 2&Ķ2Ķ2!!ąąö2Ķ2!ĦDĤB !+Ķ2 !,2!!!2Ķ2ĖĆĦBR3 !'Bĥ!22Ķ2Rĕåĕ!!!B!!Ķ2!!!ĦDĤńB !(Ķ2Ķ !+2!2!!Ķ2ĖĦB¦R3 !'tdC222cRĦdBĦą!!d·R2 !'Ħ$DĤB !&Ķ2Ķ !+2!2Ķ!!2ĖĦBdĵ3 !'2Ķ 2&B!ĦĶ!dBĦą!2 !,ĦDĤB!!!2Ķ!2 !+2Ķ2DĖöĦBdĵ3 !'2Ķ2!22BĦĦĶ!!!tB!ąõ !,ĶĖDĤńB!Ķ!ĶĶ !*2Ķ2!ĦåBcdĵ3 !'2Ķ2!BRBĦĶĶ!!!2Ķtt!Ħõ !*Ķ!!ĖĸDĤd!Ķ2Ķ !*Ķ2!!µBBCĵ3!ĥ!s!2!2!BB!ĦĶ!!2!2Ķ2!!tBĦõ !'ĶĖĦR!!ĶĖDPĶ2Ķ2 !*2!!!BBC!3!!Ħåö2!!!BBĦĦĶ!!2Ķ2!2 !&tBĦõ!!!Ķ!ąąĆ!Ķ2ĶĖĨ2Ķ!Ķ !-3BC!!!2!!Bĥ!2BBBĦ!Ķ!!2Ķ2 !*tBĦõõĶ!ĶB!!Ķ2Ķ2Ķ!Ķ!Ķ !-3ĵC!!!2Ķ2t¦S22BBĦ!Ķ2!2!2 !(Ķ!!Ķd¦ĦĆåĶ2S¦!2Ķ!Ķ!!!Ķ2ĥ !+3ĵ3!!!2Ķ2!2Ķ22BĦĦ!Ķ2Ķ2 !(Ķ!Ķ2ĶĶ!Ķ!dBĦõĶ2Ķ!Ķ!! Ķ&!ĥ3 !*3ĵ3!!!2Ķ2! 2&BĦ!!!2!2 !(Ķ2Ķ2ĶĶ!Ķ2ĶBtBĦÕå!!ĶĶĶ !&ĵ3ĵ !*ĵ3!ĥ!sĶ2!22ĶRBĦ !.Ķ! Ķ&2Ķ2Ķ2Ķ!t¦BĦõĶĵ!ĵ!å!s3ĵ !+3!2ĦåöR!22ĶR!! B/RRRcRcRcRcRccBRdBĦą3ĵ3ĥĦåöĵ !-2Ķ!Bĥ!22Ķ0 Ĥ?ńńs·¦dĵ!ĵCBĦå !-2Ķ2dtdĶ2Ķ2$$ĸ$$ ĸ(ĨĸĨĸĨĸĨĸĨĘĘĘćĘ ć&÷ć÷åõĵĵ!!!ĥs¥s!!Ķ !*Ķ2!B2!2Ķ2!!Ķ2ĶĶ!!!Ķ!Ķ2Ķ2Ķ2ĶĶĦĶĵ!ĵ3ĵ!!!Ķ2Ķ2Ķ2Ķ!Ķ!Ķ2Ķ2Ķ!Ķ2 !*2!2!!2Ķ2Ķ!Ķ2Ķ!!Ķ!Ķ2Ķ2Ķ2 Ķ&ĵ!ĵ3ĵ3ĵ!!!Ķ2Ķ2Ķ2Ķ2Ķ2Ķ2Ķ2Ķ2Ķ2Ķ !+2!!2Ķ2Ķ2Ķ!ĶĶ!Ķ2Ķ2Ķ2Ķ!ĶĶ!Ķĵ3ĵ3ĵ3ĵ!!!Ķ2Ķ2Ķ2Ķ2Ķ2Ķ2Ķ!Ķ!Ķ!Ķ !+2!!2Ķ2Ķ!ĶĶ!Ķ2Ķ2Ķ2Ķ!ĶĶ!Ķ!!!3ĵ3ĵ3ĵ!!!Ķ2Ķ2Ķ2Ķ2Ķ!Ķ!Ķ !0Ĥń000ń0ń000@0@0@0@0@@@P@ P'bPbP b&rbrbrbrb r/ń!ĤĤ!",
);
rawImages.push(
  "#cĆ Ĥ, Ĵ) ń0 1( A;æ!àðĐĐ Ġ& İ(ŀŀŀİ ŀ&--===-ŀŀİ ğ&ďď ÿ' ï, ß,!!!ĶĦ!Ķ!!!Ķ!Ķ!!!Ķ!!!ĶĶ!!ĵĵĶĶ!23322!!!22 !'22 !* 2' !+«i !'ĶzĖ!!!Ķ!ĦĆĖ3C!!ĵĕÕå!2332ĶĖĖCd22!ĶĖĦdt2!!!ĦĶdt!!!BĶĶB¦!!!¼tĶĦĶ!!!¬ąyĖS!!ĶĦ¬ĖĥR!!!Ė¬Ķ!R223ĦĖĶ!R!!2Ħ¬Ķ!R!22Ħ¬Ķ!R!!!Ėy½dR !&åðR!Ķ!!!BÐ2 !'¿!C!ĶĶ!2ß2 !&2BB2!!2!!2ß2 !'2ß2 !(Cï !&ÝàĠRBĶ!!!¯ĀRt!Ķ!!2R¥ !'22tc!ĶĶ!dRtc!!22R2tc!22!!2tc!222cÿtR !&ĶBBæĶĶĶ!Rtt!ĕ!Ķ!Bt¦cĖ!!ĶRtc!Ėĵ!Ķ!Sc!Ė33!Ctc!Ė!!2Btc!Ė!!!ĶdR!Ć!!!Ýææ2!!!Ķ!õõąĦ2!Ķ!ĕÕåą!!!Ķĵõõĥ!ĵĵĶ!ĖĖ!2!3!ĵõõĥ!!!2ĥååą !&ąÕÕĕ !*ĶĶ !&Ķ2Ķ!!Ķ!!Ķ2Ķ!!!Ķ!Ķ !&ĵ!Ķ!!!2!!33!!22 !'22 !-Ý!Ķ !&Ķ!!!Ķ !&Ķ!!Ķ2Ķ!!!Ķ!Ķ !&ĵĵĶĶ!!22!!33!!222 !&222 !(ĵ !(·¦¦tt¦¦ t'd··¦· ¦( t(cc R& c& t' ¦&!!!22 !'ĵ¯Ý!×!! c& R* !CĖÅ2·!!!22!!!3Ý¯!¤!!!r¤µ¤ µ& Å& Õ(åÕ å& õ)ĆĆ Ė' Ć'õåĦ!å2 !(3ĵ!Ý!!Ķ !&Ķ2 !&Ķ!!2Ķ !'Ķ2Ķ!!!Ķ !(ĵ!ĶĶ!!!22!!!3 !'22 !&ĵ3ĵ!Ý !&2Ķ!ĶĶ¦ŀŀŀİİĠİ Ġ(ĐĠ Đ& Ā)ïïïßßR!!2 !&23 !&22!!!ĵ3!¯ç!!!Ė!Ķ!!ßð l?ð¯!!!22!2!!¦3 !)3ĵ!Ý¤ !&Ħ !&å¦ ý=¦å!Ķ !&2!!!ö!33 !&3ĵ3!¯Ý !&R!Ķ!!!y ´& !9y!!!ĶĶ !'2 !&33!!ĵ!ĵ!Ý¯Ý!!2Ė2 !' Ø&´ !;ĵĵ!Ķ !'2 !)3!3ĵ!ç¯!ĆĶRĖ!Ķ!!! ´&Ø !'Ĕ!Ĕ !&Ĕ!Ĕ!Ĕ!Ĕ !*ĵ!ĶĶ!!!c22 !'ĵ!ĵ3!ļÝ!!!Ħ!Ħ !& Ø& !?ĵĵ2!!!Ć!!22!!!3!!ĵ!!¯!!!Ķ!RĦ!!! ´'!!!Ĕ !(Ĕ!T !3ĥ!!Ķ !'2!!ĵ3!3ĵ!Ý !&2ĖR !&Ø!Ø !*T !&Ĕ!!!T !22Ķ !)3ĵ!ĵ3, !'ĶRĖ!!!Ø!Ø!Ø !)Ĕ !(T!Ĕ!T !(Ķ !'Ķ!ĥsĶĶ !(3!!ĵļ !(Ħ !& ´'!!!T !(T!!!Ĕ!!!Ĕ !(2Ķ !)åĵ2Ķ !'ĵ!!3ĵ!!!Ý!!Ķ !'Ø!ØØ!!!Ĕ!T !&Ĕ !'T!T !(Ķ2Ķ !*ĥ!ĶĶ!!!3!!ĵ3!!!¯!!!2!!!Ø´Ø´´!!!T!Ĕ !,Ĕ!Ĕ !)Ķ2Ķ !*ĵĵ2!!!ĵ3!!,!!!Ý!!!Ķ !&Ø!ØØ!!!Ĕ !*T !0Ķ2Ķ!!Ķ!¦ !&ĥ!!!3ĵ!!ļĵ!!¯Ý !( ´' !.Ĕ !1Ķ2Ķ!!!å !*ĵ3!!ĵ3!!Ý¯ !)Ø!Ø !(T !9Ķ!!!Ķ !+3ĵ!!!ĵ!!!Ý !(Ø´Ø´Ø !'Ĕ!T !,T !1Ķ !+3!!=3!!!¯Ý !(Ø!Ø !*Ĕ !*T!Ĕ !(Ķ !*·Ķ !*ĵ!!īĵ!!!Ý¯Ý !'´´´ !&T!T !(T!!!Ĕ !*2Ķ !)Õ!Ķ !)3 !)¯Ý¯ !&´ØØØ´!!!Ĕ!Ĕ !&T!Ĕ!!!T !*Ķ2Ķ !*2Ķ !(ĵ3 !(Ý!Ý !&Ø´´´Ø !)T!!Ĕ!!!T!Ĕ!T !)Ķ2Ķ!!!Ħ!!!Ķ2Ķ!!!¯!3ĵ!= !&¯!¯Ý!!!´ØØØ !&T!!!Ĕ!!T!!!Ĕ!!!Ĕ!!´ !'Ķ2Ķ !&·!!Ķ2Ķ !&ĵ3!ī !&Ý!Ý¯ !& ´&!!!Ĕ!!!T!!Ĕ!!!T!T !&s !(Ķ2Ķ!!!Õ!!!Ķ2 !&3ĵ !'ĵ!!¯Ý !& Ø& !)Ĕ !(Ĕ!Ĕ !&ö !)Ķ2 !*Ķ !'3 !'3!!Ý¯!!!Ø !+T !&T !,s !*Ķ!!Ķ !-ĵ!=!!!ĵ!!¯Ý!!! ´' !'Ĕ !&Ĕ !,Ė !.· !,3!ī!!!3ĵ!Ý !'Ø!Ø !5T!!Ħ !&Ķ !(2Å !,ĵ3 !&ĵ3 !(Ø!Ø!Ø !)T !&T!T!!!Ĕ!!c!!!Ķ2 !(Ķ2Ķ !+3ĵ !&3ĵ !( ´'!!!T!!!Ĕ!!T!Ĕ!Ĕ !(Ć!!!2Ķ!Ķ !'Ķ2Ķ !*ĵ3=!!!ĵ3 !(Ø!!ØØ!!!Ĕ !(Ĕ !'T !&B!!!Ķ2Ķ2 !'ÇĶ2Ķ !)3ĵī !&ĵ !(´!!´´ !2Ĕ !&Ħ !&Ķ2Ķ!Ķ!!!Å!Ķ2Ķ !)3 !'3ĵ !' Ø'!!!T!T!T!!T!T!T!T!T!!Ø !&2Ķ2Ķ2Ķ !'Ķ2Ķ!!!¯!!ĵ3 !&ĵ3 !'´´´!´ !<Ķ!Ķ2Ķ !)Ķ2 !(3, !'ĵ !&ðØØØ!Ø !8ð !'2Ķ2!!!Ç !&Ķ !(ĵļ !'3ĵ!!¦å l=å¦ !&Ķ!Ķ!Ý!µ !-3ĵ !'ĵ3!zy ý?yz !'2ĦĶĶ2 !-ĵ3 !(ĵ!( ¢& Č(ĜČļĬĬĬ ļ((ļ ()õ !'Ķ!!2Ķ!Ķ !+3,!!ī Ħ& ĕ( «)¼iyyyiiiyyyiy i& z&jzzĆĆĆ!!Ķ×Ķ2 !,ļ!ûĖ Ħ2ĖĖ Ħ. Ķ&ĥĥĥĵĵĥĥ¼ÍÍÍ!!µ2Ķ!Ķ !*ĵ3 c) t&ĀtĀt Ā'ðĠðĐĐĠĠ Đ'Ā Đ( Ā&Đ ÿ&!2Ķ2Ķ2 !*3ĵ !(3ĵ!!!Ý!Ý¯ !'2ĖR!2Ķ !)Ķ!Ķ !(2Ķ !'Ķ!Ķ2Ķ !*ĵ3 !(ĵ3 !'¯Ý !'ĶRĖ2Ķ !+Ķ2 !(Ķ2Ķ !(2Ķ2Ķ !&ĥĥ!3ĵ!!!ĶĶ3!ĵ!!¯ĥĥÝ!Ý!!!¼¼¬!Ė!!Ėii !'Ėiz !(jzĶ !'öĆĶ2!!!¼tĶ¿!3!!ĶtĶ¿!3ĵ!¼tĶ¿!¯!!¼tĶ¿!RĦ!¼tĶĦ!!!2ÌĦĥĖ !&zĕĵĖĶ!!!Ć«Í!S !&åðR!ĵ3!!åðR!ĵ3!!åðR!Ý!!!åðR2ĖR!!åðR!!!Ķ!2!R !'BÐRtĶ!!!C¿ !'àĠRB!3ĵ!àĠRB!!ĵ!àĠRB!¯Ý!àĠRBĶRĖ2àĠRB !&ÐĐĐBĶ!!!¿ĀcB !&Rïcd !&ĶBBæ!ĵ3!ĶBBæ!!3ĵĶBBæ!Ý¯ÝĶBBæ!Ħ!ĖĶBBæ !&RBBĦ2Ķ!!RBdSõ!Ķ!2td!ą !&æY!!3ĵ!ÌHHÌ!!ĵ3ÝYYÝ!¯Ý¯!ææ!!Ķ2R2ĆĖB !&ĶĖĖ!!2!!!Ħõõ!!!Ķ!ąąą!!!ėėė]ė]] n+ ](ė] ė)ćçć÷ç÷ ç) ×/ Ç'!",
);
rawImages.push(
  "#cĆ 1, A) Î0 î( þ;æ!ïÿďď ğ&įį İ'ŀŀ ×&ç÷÷ććć÷÷ç×Ç·¦¦··¦ t& c, R,!!!ĶĶ!Ķ!!!Ķ!ĵ !&Ķ!!!Ķ!ĶĶ!ĶĶ!2!2B222B!!!22!!33 !* 2' !+Ćö !'ĶĆĕ!2!!Ķĥąĥ2RĶĶĶĦĖĦĶ2!!2B2Ķ2R!!2ĵĕĥCS3!!!ĦĶCS!!!CĶĶCt!!!Ė«ÍĶĶ!!!Ėzöĕ22!!ĦĖĦĶ!2Ķ!!õõ2!22!!ą22!2!!ĦĶĶ!!!33ĦĖĶ!2!!!ĕöĦc !'àÿB!Ķ!!!¿c2 !'B!Ķ!!ĶĶĕ22 !&2!C!Ķ!!2!222!B22!2R2!2 !&Rc !&Ķc¥BCĶ!!!2¥Bd !&2BdB!!2!2dS2!!Ķ!22BB!222tdSR!!!2!2SR!333Stt !'ĶCCõ!ĶĶ!BCd!Ķĥĵ!CdcBĦ!!!C!R!!Ķ2Ķ!B2 !&2!BR!Ķ!2!SCB!Ķ !&RĶĶĖ!!!Ķõõ2!!ĶĶ!ĥĶĶĕ3!ĵ!ĦĦĦ!ĦĶ!!!ĖĦĖĶĶ!Ķ !&2!2!!ĦĦĶ2Ķ2!2ĦĖĦ2!!!ĖĖĖ !,2!!!ĕĕ2ĵ!!ĵ!ĦĦĦ!2Ķ!!!Ķ2ĶĦĶ!Ķ !&2Ķ2!22!!2Ķ2 !'B22 !*Ķ!Ķ!!Ķ!Ķ!!!Ķ !&ĵ !&Ķ!Ķ!Ķ!Ķ!!ĶĶ!Ķ!Ķ!!2!2!!22!2!2!2Ķ!Ķ!!22 !&Ħ !(·¦¦tt¦¦ t'ccc s&cs c'RBB2B 2' B& R&cRsc2!2!!22!!!Ħ2Ķ!Ç!! 2& !& 2( !@ĶĶåĶcĶ !)BĶ2!µ!!!ÕÕåÕåååÕ å& ö(Ćö Ć&ĖĆĖĆĖĦĦĦ Ķ) Ħ'õ!2Ė!!2 !&BĦ!Ķ!!Ķ!!Ķ!Ķ2 !&Ķ!!3ĵ !'Ķ!Ķ!!!Ķ!Ķ2!Ķ!!Ķ!Ķ !&2!2!2!3!!22Ķ2!!!ĦBĦ!Ķ !'Ķ!ĶĶ!!!2Ķ!ĵ!ĵ !)Ķ !&2Ķ!!ĶĶ!Ķ2Ķ !&2Ķ2 !)2!2!!!ĦB!2×!!!Ķ!Ķ!!t,,ŀ, ŀ& į* ğ&ďğ ď&ÿÿïÿ ï&22!23!2R !*BĦ!Ķµ!!!2Ķ!Ķ!ÿÀ }BÀß!!!2B2Ħ22 !'BĦB!2Ķ!!!Ķ2!2Ķ!ĦB ì@BĦ !&2!!2!222!!!Ħ!Ħ!Ķ2Ķ!!2Ķ!Ķ2!!Ì! Ô& !;Ì!!Ķ !(2Ķ2!2!!B!BĦ!×2!ĶĶ2Ķ!Ķ!!!Ô¸¸!¸ !'Ĕ!Ĕ!Ĕ!Ĕ!Ĕ !02ĶĶ!!!2!2Ķ2!!!Ħ!ĦB!¤Ķ!!!Ķ2Ķ !&¸ÔÔ!Ô!!!Ĕ !:Ķ22!!!Ķ!!2!2!!B!!Ħ!!2 !&Ķ2Ķ !& ¸& !+T!!!T !1Ķ!!!Ķ !*ĦB!BĦ!Ķ !&2Ķ2 !&ÔÔÔ !(T!!!Ĕ!!!Ĕ!!!1ôôô1 !(Ķ!ĶĶ!2Ķ !)BĦ!ĦBç !'Ķ2Ķ!!!Ô¸¸¸Ô !'Ĕ !'T !&1åÕÕ!å1 !(ĶĶ!ĶĶBĶĶ !(B!!Ħ¤ !(Ķ2!!!¸!!!¸ !)T!!!Ĕ !&å!·!!Õå !'Ķ!!Ķ!!Ħ!2 !(Ħ!!BĦ!!!Ķ!!!Ķ!!! Ô' !)Ĕ !+ÕÕ!Õ !)2Ķ!!Ķ!!!ĶĶ!Ķ!!!B!!ĦB!!!2!!!2!!!¸¸¸!¸ !'T !)T !&·!·· !(Ķ2Ķĵ!ĶĶ!!2Ķ2!!!ĦB!!ç!Ķ!Ķ!!!Ķ!!!ÔÔÔ!Ô !'Ĕ !)Ĕ!!¦·!!Õ!¦ !(Ķ2!!!RĶ!Ķ2Ķ!!!BĦ!!¤Ħ!!2Ķ !( ¸'!!!T !'T!T !&ķ¦!··¦ķ !)ĶĶ!!Ė!Ķ!Ķ2!!!ĦB!!ĦB!!Ķ2 !(Ô !)Ĕ !)Ĕ !'ķuuuķ !,ĵĶ!!!ĶĶĶ!!!BĦ!!!Ħ!!2Ķ !) Ô& !)T!Ĕ !4Ķ !'Ķ !&Ķ !&B!!ćB!!Ķ2Ķ !( ¸& !)Ĕ!!!T !22Ķ !&cĶ!Ķ !(Ħ!!bĦ!Ķ!Ķ2Ķ !&¸ !)T!T!T!!!Ĕ !2Ķ2Ķ!!!Ć2Ķ2Ķ !'B !*Ķ2 !& Ô& !&Ĕ!Ĕ!Ĕ!!!T !'Ĕ!Ĕ !+Ķ2!Ħ!!Ķ!Ķ2Ķ !&ĦB !)2Ķ !& ¸&Ô !'T !'Ĕ!T !)ĴĴ !)Ķ!Ķ !&2Ķ2!!2!BĦ!ć !'Ķ2Ķ!!! Ô& !&T!Ĕ!!!T!!!Ĕ !)CĦ !,Ķc!!Ķ!Ķ !&ĦB!b!Ħ !&Ķ2!!! ¸'!!!Ĕ!!!T!Ĕ !-ķ !-2ö !&2 !&BĦ !'Ħ!!!Ķ!!! Ô' !)Ĕ !;Ķ2Ķ!!!Ķ !'B !'B!!!2!!!¸!!¸¸ !8B !-Ķ2Ķ !*Ħ!ć!!!Ħ!!!Ķ!!!Ô!!ÔÔ !8C !-sĶ!Ķ !)B!b!!!BĦ !( ¸' !+T!!!T !)1ĥ !-ö!!2Ķ !(ĦB !&ĦB !)ÔÔÔ !&T!!!T!Ĕ!!!Ĕ !)ĥĦ !0Ķ!Ķ !'BĦ !&BĦ !(Ô¸¸¸Ô!!!Ĕ!!!Ĕ!!!T !+4B !'ĵ !,2 !'ĦBć!!ĦĦB !+Ô !.Ĕ !23 !'s !&Ķ !'BĦb !&Ħ !(¸!!¸¸ !8Ħ !'ĵ!ĵ!!!ö !-B !'BĦ !'ÔÔÔ!Ô!!!T!T!T!T!T!T!!!T!T !*3ĵ3Ķ !-2!!ĦB !&ĦB !&À¸¸¸!¸ !8T!!À!!ĵ3ĵ !1Bç !'Ħ!!!BĦ }@ĦB!3ĵ3!!!s !-Ħ¤ !'BĦ!YÌ ìBÌjĵ!ĵ!Ķ!å !-BĦ !'ĦB!ÅüüüČü Č(ĜČĜĜĬĜ Ĭ&ļĬ ļ*(((ą!!3ĶĶĵ3 !-ĦB !(Ħ !'Ķ2 !'2Ķ2!!Ķ2Ķ!!!Ķ2Ķ !)Ķ !'ĵ!!3ĵ!ĵ !+Bç!!8 Í& ¬( z)¬ z&jzjöööæö æ& Ć&öĆĆĖĖĖ!!ĵ¦ĵ3 !,¤!īĕ ĥ2ĕĕ ĥ) Í' Ý&½½½ĦĦĖĖĆĦĦĦ!!å3ĵ!ĵ !*ĦB à) Ā(ĐĀ Đ'ĀĐĀĐĐĠĐ ď'ÿ ď( ¥&¶ s&!3ĵ3ĵ3 !*BĦ !(BĦ !'Ķ2 !'2Ķ2!!Ķ2Ķ !'Ķ!Ķ !(2Ķ !'ĵ!ĵ3ĵ !*ĦB !(ĦB !(Ķ !'Ķ2Ķ!!!Ķ2Ķ !'Ķ2 !(Ķ2Ķ !(3ĵ3ĵ !&ĦĦ!BĦ!!!ÝÝB!Ħ!!2ĦĦ!2Ķ!!!ĖĖĦ2Ķ!!ĶĖĦĶ !&ĦæĆ !(ĆĖĶ !'ąĖĵ3!!!ĖyÍB!B!!ÝąĶB!BĦ!Ėy!BĶ2!!ĖyÍBĶ2Ķ!ĶiĦ2Ķ!!2ĖÍĦĦ !&ĖzĖĦĶ!!!ĖzĦ !(SÿB!ĦB!¯SÿB!ĦB!!ðcB2Ķ!!BðÿB2Ķ2!!àc22!!Ķ!¿cB !'¿cBCĶ!!!ÏB !'cğBC!BĦ!cğBC!!Ħ!c¥BCĶ!Ķ!B¥BCĶ2Ķ!B¥BCĶ!!!c¥BCĶ!!!2¥RC !&BcR3 !&ĶCCõ!ĦB!ĶCCõ!!BĦĶCCõ!!2ĶĶCCõ!Ķ2ĶĶCCõ2Ķ!!BCCĥ2Ķ!!BC3!ĥ!Ķ!2C3!ĵ !&õå!!BĦ!ĖÅÅĖ!!ĦBĶååĶ!!Ķ2!õõ!!!Ķ2!ąą2!2Ķ!Ķĕĕ!!2!!!ĥĥĥ!!!Ķ!ĵĵĵ!!!×××ç×çç ć+ ç* ×*Ç×ÇÇÇ··Ç ·& ¦/ t'!",
);
rawImages.push(
  "#cĆ Ĥ, Ĵ) ń0 1( A;æ!àðĐĐ Ġ& İ(ŀŀŀİ ŀ&--===-ŀŀİ ğ&ďď ÿ' ï, ß,!!!ĶĦ!Ķ!!!Ķ!Ķ!!!Ķ!!!ĶĶ!!ĵĵĶĶ!23322!!!22 !'22 !* 2' !+«i !'ĶzĖ!!!Ķ!ĦĆĖ3C!!ĵĕÕå!2332ĶĖĖCd22!ĶĖĦdt2!!!ĦĶdt!!!BĶĶB¦!!!¼tĶĦĶ!!!¬ąyĖS!!ĶĦ¬ĖĥR!!!Ė¬Ķ!R223ĦĖĶ!R!!2Ħ¬Ķ!R!22Ħ¬Ķ!R!!!Ėy½dR !&åðR!Ķ!!!BÐ2 !'¿!C!ĶĶ!2ß2 !&2BB2!!2!!2ß2 !'2ß2 !(Cï !&ÝàĠRBĶ!!!¯ĀRt!Ķ!!2R¥ !'22tc!ĶĶ!dRtc!!22R2tc!22!!2tc!222cÿtR !&ĶBBæĶĶĶ!Rtt!ĕ!Ķ!Bt¦cĖ!!ĶRtc!Ėĵ!Ķ!Sc!Ė33!Ctc!Ė!!2Btc!Ė!!!ĶdR!Ć!!!Ýææ2!!!Ķ!õõąĦ2!Ķ!ĕÕåą!!!Ķĵõõĥ!ĵĵĶ!ĖĖ!2!3!ĵõõĥ!!!2ĥååą !&ąÕÕĕ !*ĶĶ !&Ķ2Ķ!!Ķ!!Ķ2Ķ!!!Ķ!Ķ !&ĵ!Ķ!!!2!!33!!22 !'22 !-Ý!Ķ !&Ķ!!!Ķ !&Ķ!!Ķ2Ķ!!!Ķ!Ķ !&ĵĵĶĶ!!22!!33!!222 !&222 !(ĵ !(·¦¦tt¦¦ t'd··¦· ¦( t(cc R& c& t' ¦&!!!22 !'ĵ¯Ý!×!! c& R* !CĖÅ2·!!!22!!!3Ý¯!¤!!!r¤µ¤ µ& Å& Õ(åÕ å& õ)ĆĆ Ė' Ć'õåĦ!å2 !(3ĵ!Ý!!Ķ !&Ķ2 !&Ķ!!2Ķ !'Ķ2Ķ!!!Ķ !(ĵ!ĶĶ!!!22!!!3 !'22 !&ĵ3ĵ!Ý !&2Ķ!ĶĶ!!!2Ķ!Ķ!Ķ !'Ķ2Ķ!!!Ķ !(ĵĵ!Ķ !&2 !&23 !&22!!!ĵ3!¯ç!!!Ė!Ķ !'Ķ2Ķ!!2Ķ !'Ķ2Ķ!!!Ķ!Ķ !'ĵ!ĶĶ!!!22!2!!¦3 !)3ĵ!Ý¤ !&Ħ!!!Ķ!!!Ķ2Ķ!Ķ!Ķ !'Ķ2Ķ!!!Ķ2Ķ !'ĵĵ!Ķ !&2!!!ö!33 !&3ĵ3!¯Ý !&R!Ķ!2Ķ!!2Ķ2Ķ!!2Ķ !'Ķ2Ķ!!!Ķ2Ķ !(ĵ!ĶĶ !'2 !&33!!ĵ!ĵ!Ý¯Ý!!2Ė2!!Ķ2Ķ!Ķ!Ķ2!!Ķ!Ķ !'Ķ2Ķ!!!Ķ2Ķ !(ĵĵ!Ķ !'2 !)3!3ĵ!ç¯!ĆĶRĖ!Ķ!Ķ!Ķ!!2Ķ !&2Ķ !'Ķ2Ķ!!!Ķ!Ķ !)ĵ!ĶĶ!!!c22 !'ĵ!ĵ3!ļÝ!!!Ħ!Ħ !&2Ķ!Ķ!Ķ!!!Ķ!Ķ !'Ķ2Ķ !'Ķ !)ĵĵ2!!!Ć!!22!!!3!!ĵ!!¯!!!Ķ!RĦĶ!2Ķ2!!!2Ķ !&2Ķ !'Ķ2Ķ !'Ķ !*ĥ!!Ķ !'2!!ĵ3!3ĵ!Ý !&2ĖR!!Ķ!Ķ!!!Ķ!Ķ!!!Ķ2Ķ !'Ķ2Ķ !'Ķ!Ķ !*2Ķ !)3ĵ!ĵ3, !'ĶRĖ2Ķ!!2Ķ !&2Ķ!!!Ķ2Ķ !'Ķ2Ķ !'Ķ2Ķ !'Ķ!ĥsĶĶ !(3!!ĵļ !(Ħ!Ė!!!Ķ!Ķ!!!Ķ2Ķ!!!Ķ2Ķ !'Ķ2Ķ !'Ķ2Ķ !)åĵ2Ķ !'ĵ!!3ĵ!!!Ý!!Ķ!RĦĶ!!!2Ķ!!!Ķ2Ķ!!!Ķ2Ķ !'Ķ2Ķ !'Ķ2Ķ !*ĥ!ĶĶ!!!3!!ĵ3!!!¯!!!2ĖR !&Ķ!Ķ!!!Ķ2Ķ!!!Ķ2Ķ !'Ķ2Ķ !'Ķ2Ķ !*ĵĵ2!!!ĵ3!!,!!!Ý!!!ĶRĖ2Ķ!!2!2Ķ!!!Ķ2Ķ!!!Ķ2Ķ !'Ķ2Ķ !'Ķ2Ķ!!Ķ!¦ !&ĥ!!!3ĵ!!ļĵ!!¯Ý!!!Ħ!Ė!Ķ!Ķ!Ķ2Ķ!!!Ķ2 !&Ķ2Ķ !'Ķ2Ķ !'Ķ2Ķ!!!å !*ĵ3!!ĵ3!!Ý¯!!!Ķ!RĦ !&2Ķ2 !&Ķ !&2Ķ2 !(Ķ2Ķ !'Ķ!!!Ķ !+3ĵ!!!ĵ!!!Ý !&2ĖR!Ķ!!Ķ!Ķ !'Ķ!!!Ķ!Ķ!Ķ !'Ķ2Ķ !+Ķ !+3!!=3!!!¯Ý!!!ĶRĖ2!!!2!2Ķ !&2Ķ !&2Ķ2 !(Ķ2Ķ !*·Ķ !*ĵ!!īĵ!!!Ý¯Ý!!!Ħ!Ė!Ķ!Ķ!Ķ!Ķ!!!Ķ!Ķ!!!Ķ!Ķ!Ķ !'Ķ2Ķ !)Õ!Ķ !)3 !)¯Ý¯!!!Ķ!RĦ !&2!2Ķ !&2Ķ !&2Ķ2 !(Ķ2Ķ !*2Ķ !(ĵ3 !(Ý!Ý !&2ĖR!Ķ!!Ķ!Ķ2Ķ!!!Ķ2Ķ!!!Ķ!Ķ!Ķ !'Ķ2Ķ!!!Ħ!!!Ķ2Ķ!!!¯!3ĵ!= !&¯!¯Ý!!!ĶRĖ2!Ķ!!!2Ķ2!!!2Ķ2Ķ !&2Ķ2 !(Ķ2Ķ !&·!!Ķ2Ķ !&ĵ3!ī !&Ý!Ý¯ !&Ħ!Ė !'Ķ!Ķ!!!Ķ!Ķ2Ķ!!!Ķ!Ķ!Ķ !'Ķ2Ķ!!!Õ!!!Ķ2 !&3ĵ !'ĵ!!¯Ý !&Ķ!RĦ!Ķ !&2Ķ !&2Ķ2Ķ!!2!2Ķ2 !(Ķ2 !*Ķ !'3 !'3!!Ý¯Ý !&2ĖR !(Ķ2Ķ!!!Ķ!Ķ2Ķ!Ķ!Ķ!Ķ!Ķ !'Ķ!!Ķ !-ĵ!=!!!ĵ!!¯Ý¯Ý!!!ĶRĖ2!Ķ !&Ķ2Ķ !&2Ķ2!!!2!2Ķ2 !+· !,3!ī!!!3ĵ!Ý!Ý¯ !&Ħ!Ė !(2Ķ2Ķ!!!Ķ!Ķ!!!Ķ!Ķ2Ķ!Ķ !(2Å !,ĵ3 !&ĵ3!!!¯Ý !&Ķ!RĦ!Ķ!!!Ķ!Ķ2 !'2Ķ !&2Ķ2Ķ2 !(Ķ2Ķ !+3ĵ !&3ĵ!!!Ý¯Ý !&2ĖR!!Ķ !&2Ķ !'Ķ!Ķ!!!Ķ!Ķ2Ķ!Ķ !'Ķ2Ķ !*ĵ3=!!!ĵ3!!!¯Ý¯ !&ĶRĖ2 !(Ķ!Ķ !(2Ķ !&2Ķ2Ķ2 !'ÇĶ2Ķ !)3ĵī !&ĵ!!!Ý!Ý !'Ħ!Ė!2Ķ !'2Ķ !'Ķ2Ķ!!!Ķ!Ķ2Ķ!Ķ!!!Å!Ķ2Ķ !)3 !'3ĵ !'Ý !&Ķ!RĦĶ !(Ķ2Ķ !'Ķ2Ķ !&2Ķ2Ķ2Ķ !'Ķ2Ķ!!!¯!!ĵ3 !&ĵ3 !'¯Ý !&2ĖR!!Ķ !'Ķ2Ķ !'Ķ2Ķ!!!Ķ!Ķ2Ķ !)Ķ2 !(3, !'ĵ !&¯Ý¯ !&ĶRĖ2 !)2Ķ2 !(Ķ2Ķ !&2Ķ2!!!Ç !&Ķ !(ĵļ !'3ĵ!!!Ý!Ý !'Ħ!Ė!!Ķ !&Ķ!Ķ!Ķ !'Ķ2Ķ!!!Ķ!Ķ!Ý!µ !-3ĵ !'ĵ3 !'¯Ý !&Ķ!RĦ !*2Ķ2 !(Ķ2 !'2ĦĶĶ2 !-ĵ3 !(ĵ !'Ý¯ !'2ĖR!!Ķ !'Ķ2Ķ !)Ķ !'Ķ!!2Ķ!Ķ !+3,!!ī Ħ& ĕ( «)¼iyyyiiiyyyiy i& z&jzzĆĆĆ!!Ķ×Ķ2 !,ļ!ûĖ Ħ2ĖĖ Ħ. Ķ&ĥĥĥĵĵĥĥ¼ÍÍÍ!!µ2Ķ!Ķ !*ĵ3 c) t&ĀtĀt Ā'ðĠðĐĐĠĠ Đ'Ā Đ( Ā&Đ ÿ&!2Ķ2Ķ2 !*3ĵ !(3ĵ!!!Ý!Ý¯ !'2ĖR!2Ķ !)Ķ!Ķ !(2Ķ !'Ķ!Ķ2Ķ !*ĵ3 !(ĵ3 !'¯Ý !'ĶRĖ2Ķ !+Ķ2 !(Ķ2Ķ !(2Ķ2Ķ !&ĥĥ!3ĵ!!!ĶĶ3!ĵ!!¯ĥĥÝ!Ý!!!¼¼¬!Ė!!Ėii !'Ėiz !(jzĶ !'öĆĶ2!!!¼tĶ¿!3!!ĶtĶ¿!3ĵ!¼tĶ¿!¯!!¼tĶ¿!RĦ!¼tĶĦ!!!2ÌĦĥĖ !&zĕĵĖĶ!!!Ć«Í!S !&åðR!ĵ3!!åðR!ĵ3!!åðR!Ý!!!åðR2ĖR!!åðR!!!Ķ!2!R !'BÐRtĶ!!!C¿ !'àĠRB!3ĵ!àĠRB!!ĵ!àĠRB!¯Ý!àĠRBĶRĖ2àĠRB !&ÐĐĐBĶ!!!¿ĀcB !&Rïcd !&ĶBBæ!ĵ3!ĶBBæ!!3ĵĶBBæ!Ý¯ÝĶBBæ!Ħ!ĖĶBBæ !&RBBĦ2Ķ!!RBdSõ!Ķ!2td!ą !&æY!!3ĵ!ÌHHÌ!!ĵ3ÝYYÝ!¯Ý¯!ææ!!Ķ2R2ĆĖB !&ĶĖĖ!!2!!!Ħõõ!!!Ķ!ąąą!!!ėėė]ė]] n+ ](ė] ė)ćçć÷ç÷ ç) ×/ Ç'!",
);
rawImages.push(
  "#cĆ 1, A) Î0 î( þ;æ!ïÿďď ğ&įį İ'ŀŀ ×&ç÷÷ććć÷÷ç×Ç·¦¦··¦ t& c, R,!!!ĶĶ!Ķ!!!Ķ!ĵ !&Ķ!!!Ķ!ĶĶ!ĶĶ!2!2B222B!!!22!!33 !* 2' !+Ćö !'ĶĆĕ!2!!Ķĥąĥ2RĶĶĶĦĖĦĶ2!!2B2Ķ2R!!2ĵĕĥCS3!!!ĦĶCS!!!CĶĶCt!!!Ė«ÍĶĶ!!!Ėzöĕ22!!ĦĖĦĶ!2Ķ!!õõ2!22!!ą22!2!!ĦĶĶ!!!33ĦĖĶ!2!!!ĕöĦc !'àÿB!Ķ!!!¿c2 !'B!Ķ!!ĶĶĕ22 !&2!C!Ķ!!2!222!B22!2R2!2 !&Rc !&Ķc¥BCĶ!!!2¥Bd !&2BdB!!2!2dS2!!Ķ!22BB!222tdSR!!!2!2SR!333Stt !'ĶCCõ!ĶĶ!BCd!Ķĥĵ!CdcBĦ!!!C!R!!Ķ2Ķ!B2 !&2!BR!Ķ!2!SCB!Ķ !&RĶĶĖ!!!Ķõõ2!!ĶĶ!ĥĶĶĕ3!ĵ!ĦĦĦ!ĦĶ!!!ĖĦĖĶĶ!Ķ !&2!2!!ĦĦĶ2Ķ2!2ĦĖĦ2!!!ĖĖĖ !,2!!!ĕĕ2ĵ!!ĵ!ĦĦĦ!2Ķ!!!Ķ2ĶĦĶ!Ķ !&2Ķ2!22!!2Ķ2 !'B22 !*Ķ!Ķ!!Ķ!Ķ!!!Ķ !&ĵ !&Ķ!Ķ!Ķ!Ķ!!ĶĶ!Ķ!Ķ!!2!2!!22!2!2!2Ķ!Ķ!!22 !&Ħ !(·¦¦tt¦¦ t'ccc s&cs c'RBB2B 2' B& R&cRsc2!2!!22!!!Ħ2Ķ!Ç!! 2& !& 2( !@ĶĶåĶcĶ !)BĶ2!µ!!!ÕÕåÕåååÕ å& ö(Ćö Ć&ĖĆĖĆĖĦĦĦ Ķ) Ħ'õ!2Ė!!2 !&BĦ!Ķ!!Ķ!!Ķ!Ķ2 !&Ķ!!3ĵ !'Ķ!Ķ!!!Ķ!Ķ2!Ķ!!Ķ!Ķ !&2!2!2!3!!22Ķ2!!!ĦBĦ!Ķ !'Ķ!ĶĶ!!!2Ķ!ĵ!ĵ !)Ķ !&2Ķ!!ĶĶ!Ķ2Ķ !&2Ķ2 !)2!2!!!ĦB!2×!!!Ķ!Ķ !'Ķ2Ķ!!3ĵ !)Ķ!!!Ķ!Ķ!!!Ķ!Ķ2Ķ !&2!23!2R !*BĦ!Ķµ!!!2Ķ!Ķ!Ķ!!!Ķ2Ķ!ĵ!ĵ !)Ķ !'Ķ!Ķ!Ķ!Ķ!Ķ !(2B2Ħ22 !'BĦB!2Ķ!!!Ķ2!2Ķ2Ķ!!2Ķ2Ķ!!3ĵ !)Ķ!Ķ!!!Ķ2Ķ!ĶĶ!!Ķ!Ķ!!!2!!2!222!!!Ħ!Ħ!Ķ2Ķ!!2Ķ!Ķ2Ķ2Ķ!Ķ!Ķ2!!ĵ!ĵ !)Ķ2Ķ!!!Ķ2Ķ!!Ķ!!Ķ2Ķ !(2Ķ2!2!!B!BĦ!×2!ĶĶ2Ķ!Ķ!Ķ!Ķ!!2Ķ !&3ĵ !)Ķ2Ķ!!!Ķ!Ķ!!Ķ!!Ķ2ĶĶ!!!2!2Ķ2!!!Ħ!ĦB!¤Ķ!!!Ķ2Ķ!Ķ!!2Ķ!Ķ!Ķ!!!ĵ!ĵ !)Ķ2Ķ !&2Ķ!!ĶĶ!Ķ22!!!Ķ!!2!2!!B!!Ħ!!2 !&Ķ2Ķ!Ķ2Ķ2!!!2Ķ !&3ĵ !)Ķ!Ķ!!!Ķ!Ķ!!!Ķ!Ķ!!!Ķ !*ĦB!BĦ!Ķ !&2Ķ2!2Ħ!Ķ!!!Ķ!Ķ!!!ĵ3ĵ !*2Ķ !&2Ķ!!!Ķ!ĶĶ!2Ķ !)BĦ!ĦBç !'Ķ2Ķ!Ķ2!2Ķ !&2Ķ!!!ĵ3ĵ !)Ķ!Ķ!!!Ķ!Ķ!Ķ!ĶĶ!ĶĶBĶĶ !(B!!Ħ¤ !(Ķ2Ķ!Ķ!Ķ!Ķ!!!Ķ2Ķ!!!ĵ3ĵ !*2Ķ !'Ķ2Ķ!!Ķ!!Ħ!2 !(Ħ!!BĦ!!!Ķ!!!Ķ2Ķ!Ķ!!2Ķ!!!Ķ2Ķ!!!ĵ3ĵ !)Ķ!Ķ !'Ķ2Ķ!!Ķ!!!ĶĶ!Ķ!!!B!!ĦB!!!2!!!2Ķ2!2Ķ!Ķ!Ķ!!!Ķ2Ķ!!!ĵ3ĵ !*2Ķ !'Ķ2Ķĵ!ĶĶ!!2Ķ2!!!ĦB!!ç!Ķ!Ķ!!!Ķ2Ķ!Ķ2Ķ2!2Ķ!!!Ķ2Ķ!!!ĵ3ĵ !)Ķ!Ķ !'Ķ2!!!RĶ!Ķ2Ķ!!!BĦ!!¤Ħ!!2Ķ!!!Ķ2Ķ!Ķ2Ķ!Ķ2Ķ!!!Ķ2 !&ĵ3ĵ !*2Ķ !'ĶĶ!!Ė!Ķ!Ķ2!!!ĦB!!ĦB!!Ķ2 !&Ķ2Ķ!Ķ!!2Ķ2 !&Ķ !&3ĵ3 !*Ķ!Ķ !(ĵĶ!!!ĶĶĶ!!!BĦ!!!Ħ!!2Ķ !&2Ķ2!!Ķ!Ķ!Ķ !'Ķ!!!ĵ!ĵ!ĵ !*2Ķ!Ķ !'Ķ !&Ķ !&B!!ćB!!Ķ2Ķ!!!Ķ2Ķ!!2Ķ2!2Ķ !&2Ķ !&3ĵ3 !*Ķ!Ķ2Ķ !&cĶ!Ķ !(Ħ!!bĦ!Ķ!Ķ2Ķ!!!Ķ2Ķ!Ķ2Ħ!Ķ!Ķ!!!Ķ!Ķ!!!ĵ!ĵ!ĵ !+Ķ2Ķ!!!Ć2Ķ2Ķ !'B !*Ķ2 !&Ķ2Ķ!Ķ2!2!2Ķ !&2Ķ !&3ĵ3 !,Ķ2!Ħ!!Ķ!Ķ2Ķ !&ĦB !)2Ķ !&2Ķ2!!Ķ!Ķ!Ķ2Ķ!!!Ķ2Ķ!!!ĵ!ĵ!ĵ !+Ķ!Ķ !&2Ķ2!!2!BĦ!ć !'Ķ2Ķ!!!Ķ2Ķ!!!Ķ!!2Ķ2!!!2Ķ2Ķ !&3ĵ3 !.Ķc!!Ķ!Ķ !&ĦB!b!Ħ !&Ķ2 !&Ķ2Ķ!!2Ķ!Ķ!Ķ!!!Ķ!Ķ2Ķ!!!ĵ!ĵ!ĵ !,2ö !&2 !&BĦ !'Ħ!!!Ķ !'Ķ2Ķ!Ķ2Ķ!!2Ķ !&2Ķ2Ķ!!3!3ĵ3 !,Ķ2Ķ!!!Ķ !'B !'B!!!2Ķ !&2Ķ2!!Ķ2!!Ķ2Ķ!!!Ķ!Ķ2Ķ!ĵ!ĵ!ĵ!ĵ !+Ķ2Ķ !*Ħ!ć!!!Ħ!!!Ķ2Ķ!!!Ķ2Ķ!!!Ķ!!!Ķ2Ķ !&2Ķ2!!!3!3ĵ3 !+sĶ!Ķ !)B!b!!!BĦ!!!Ķ2 !&Ķ2Ķ!!2Ķ!!2Ķ2Ķ!!!Ķ!Ķ!!!ĵ!ĵ3ĵ!ĵ !)ö!!2Ķ !(ĦB !&ĦB !&Ķ !'Ķ2Ķ!Ķ2Ķ!Ķ!Ķ2 !'2Ķ !&3ĵ3ĵ3 !,Ķ!Ķ !'BĦ !&BĦ !&2Ķ !&2Ķ2!!Ķ2Ķ!!2Ķ !'Ķ!Ķ!!!ĵ!ĵ3ĵ!ĵ !,2 !'ĦBć!!ĦĦB !&Ķ2 !&Ķ2Ķ!!!Ķ2!!Ķ!Ķ !(2Ķ !&3ĵ3ĵ3 !'s !&Ķ !'BĦb !&Ħ !'Ķ !'Ķ2Ķ!!!Ķ !&2Ķ !'Ķ2Ķ!!!ĵ!ĵ3ĵ!ĵ!!!ö !-B !'BĦ !&2Ķ !'Ķ2Ķ!!2Ķ!!!Ķ2Ķ !'Ķ2Ķ !&3ĵ3ĵ3Ķ !-2!!ĦB !&ĦB !&Ķ2Ķ !&2Ķ2!!Ķ2Ķ!!!Ķ2Ķ !'Ķ2Ķ!!!ĵ!ĵ3ĵ !1Bç !'Ħ !'Ķ2 !&Ķ2Ķ!!!Ķ2Ķ!!2Ķ2 !(Ķ2Ķ !&3ĵ3!!!s !-Ħ¤ !'BĦ !&2Ķ !'Ķ2Ķ!!!Ķ2!!Ķ!Ķ!Ķ !'Ķ2Ķ!!!ĵ!ĵ!Ķ!å !-BĦ !'ĦB !&Ķ2Ķ !'Ķ2Ķ!!2Ķ !&2Ķ2 !(Ķ2 !'3ĶĶĵ3 !-ĦB !(Ħ !'Ķ2 !'2Ķ2!!Ķ2Ķ!!!Ķ2Ķ !)Ķ !'ĵ!!3ĵ!ĵ !+Bç!!8 Í& ¬( z)¬ z&jzjöööæö æ& Ć&öĆĆĖĖĖ!!ĵ¦ĵ3 !,¤!īĕ ĥ2ĕĕ ĥ) Í' Ý&½½½ĦĦĖĖĆĦĦĦ!!å3ĵ!ĵ !*ĦB à) Ā(ĐĀ Đ'ĀĐĀĐĐĠĐ ď'ÿ ď( ¥&¶ s&!3ĵ3ĵ3 !*BĦ !(BĦ !'Ķ2 !'2Ķ2!!Ķ2Ķ !'Ķ!Ķ !(2Ķ !'ĵ!ĵ3ĵ !*ĦB !(ĦB !(Ķ !'Ķ2Ķ!!!Ķ2Ķ !'Ķ2 !(Ķ2Ķ !(3ĵ3ĵ !&ĦĦ!BĦ!!!ÝÝB!Ħ!!2ĦĦ!2Ķ!!!ĖĖĦ2Ķ!!ĶĖĦĶ !&ĦæĆ !(ĆĖĶ !'ąĖĵ3!!!ĖyÍB!B!!ÝąĶB!BĦ!Ėy!BĶ2!!ĖyÍBĶ2Ķ!ĶiĦ2Ķ!!2ĖÍĦĦ !&ĖzĖĦĶ!!!ĖzĦ !(SÿB!ĦB!¯SÿB!ĦB!!ðcB2Ķ!!BðÿB2Ķ2!!àc22!!Ķ!¿cB !'¿cBCĶ!!!ÏB !'cğBC!BĦ!cğBC!!Ħ!c¥BCĶ!Ķ!B¥BCĶ2Ķ!B¥BCĶ!!!c¥BCĶ!!!2¥RC !&BcR3 !&ĶCCõ!ĦB!ĶCCõ!!BĦĶCCõ!!2ĶĶCCõ!Ķ2ĶĶCCõ2Ķ!!BCCĥ2Ķ!!BC3!ĥ!Ķ!2C3!ĵ !&õå!!BĦ!ĖÅÅĖ!!ĦBĶååĶ!!Ķ2!õõ!!!Ķ2!ąą2!2Ķ!Ķĕĕ!!2!!!ĥĥĥ!!!Ķ!ĵĵĵ!!!×××ç×çç ć+ ç* ×*Ç×ÇÇÇ··Ç ·& ¦/ t'!",
);
rawImages.push(
  "#c č)ĝĝ ĭ/ĽĽĽ :&JJJkk{{®Ńl[;VV F'V F( 6&&&ęęę !+Ķ !<»!!Ħ!Ċ!2!2 !&22!!2 !(S !AB!B!!!ì!đ !+2Ķ !'Ķ22 !&ĕ !-2 !7Ħ !(Å!!!Ķ!2Ķ!Ķ2!!ĶĶ!Ķ !'ĕSS !)2 !8Ħ!!!2 !&Ç!!!2!!22!Ķ!Ķ2B!2!Ķ2!!S !*2 !&Ķ !6B !)B!Ķ !'2!2!Ķ !'ĶĶ22!ĕ !+2Ķ !/Ķ !'B!!!Ķ!}!WĆ!!o!Ķ!Ķ!Ķ!Ķ2!ĶĶĶ2B!2ą!2SS !(22 !9Ħ !(c!!Ķ!2!2!!22Ķ2Ķ2!ĶĦ22S!Ķ!ĕ !-Ķ !?2Ķ!!!Ķ2!Ķ2!2!2Ķ2ĶĶ!ą !;Ķ !.ì!!úĦ!Ċ2!Ķ!2ĶĶ2!Ķ!!!2Ķ2!!d !+Ķ !7R !+o!!_!!2!!!2!Ħ2!ĶĶĶ !'2 !;2 !)B !(ĆB!Ċ!!!Ķ!2!Ķ2Ķ2BB!!Ķ!ĕĶĶ !/2 !2Ė !*đcĦ!Ķ!Ķ!2!Ķ!2!!ĦĶĶ2!2!dĕ!ĕ !(Ķ!!Ķ !?2B!2!2!Ķ!!!Ķ!!2!ĶĦ!ĶĶąd !,Ķ!!!Ķ !,2 !1Ķ!!!Ķ!!2Ķ2Ķ222!Ķ22!22Są !-2 !)Ķ !22!!Ñ !'2Ķ!!2!2Ķ!Ķ2B2!2!!2S !+Ķ!!22 !3R !)»!2 !&2!Ķ!Ķ!Ķ!2 !'ĶĶ !HĶ!}Ñ !'Ķ!!2Ķ2Ķ2! Ķ&2Ķ!2Ķĕ !+2 !AĶĦ!!2Ķ!Ķ2Ķ22Ħ!!Ķ22!Ķ!!Sĕ !,Ķ !/Ķ !,2!!!Ė !'2!2Ķ!!!B2!Ķ!Ħ2B!!!S !*Ķ !&2 !;ªĆB!Ķ!!Ķ!!2!Ķ!Ķ!B Ķ&2!!ĕ !-Ķ !(2 !2Ķ !&c!!o!!2Ķ2!Ķ!Ķ!!!Ħ222Ķĕ2S !@Ė!!Ħ!2 !&ú !&Ķ!2!Ķ22!Ķ2!B2!ĶĶ !DĦ!B!Ķ!!»!oĦ!!Ķ2ĶĶ!2ĶĶ!2!!Ħ!Ķ!BSĶĕS !,2 !&ĶĶ !/B !*Ć!!ú2!22!Ķ22Ķ!ĶĶ2!2!Ħ2!d !Jc!!2!!!Ķ!2Ķ!B!!2!ĶĶ22!!Ķĕ !,Ķ !5Ħ !+B!!!ĶĶ2!Ķ2ĶĶ!!!2!Ķ!!!2 !,Ķ !)2 !)Ķ !)Ħ!2 !+22!Ķ !&2Ħ!Ħ!2!2!!!S !92 !*B !&Ñ!úĦ!!!Ķ!!2!Ķ22!R!222ĶĶ !=Ķ2 !&R !+oB!Ķ!2ĶĶ!2!!ĦĶ!Ķ!!Ķ !'ĕ !0Ķ !*2 !'Ė !+Ć!!o!Ķ22!Ķ!!2!!2!!ĶĶ!!Ķ2S !*2 !(2 !7ª!c!!ú!2!!Ķ22Ķ2!Ķ!!Ķ!2Ķą2Ķĕ !9Ķ !/á!2Ħ!o!Ķ!Ķ2!Ķ!Ķ2!Ħ!22Ķ2SĶĕ !.Ķ!!!Ķ !)2Ķ !-ì !'úĶ2!2ĶĶ22!Ķ!B2Ħ22ą!2S !.2!!2 !5Ķ!!ª!ĶB!o2!Ķ!22!!!2!!ĶBĶ!S2ĶĕS !12 !)Ķ2 !+2 !&Ć !'2!!Ķ!Ķ!ĶĶ!2Ķ!!!Ķ!Sĕ !:Ķ !+Ķ !&c !)Ķ2Ķ2!22!ĶĶ!!2 !DB !+Ħ !'Ķ2Ķ2!!Ħ2!2B!!Ķ!!ĕ !AĦ !*2B!Ċ !)Ķ22Ħ!ĶĦĶ!2 !-2!2!Ķ !4B!!!2!}á!Ķ !(2!2Ķ!!22!222ą!!ĕS !EĶ !&ĆĦ!_ !&Ķ!22Ķ!2!!!Bd!ĕS !BĦ!!!2 !&ĺ!!Ķ!Ķ!!2!ĶĶ!!Ķ!Ķ2!2Ķd!ĕ !AB!!!Ķ !&.B!2!2!ĶĶ!!!ĶĶ!Ķ2ĶĦĶ2 !-Ķ!Ķ !<ì!!c!!Ċ!ĶĶ22Ķ2!!2!!Ķ2!ĶąĶ !+2 !'Ķ!!!ĶĶ !0Ħ !-22Ķ !&BĶ!22Ķ!2d!!!S !'2!2 !+2 !(2 !-}»!!Ħ!!!Ķ!2!2Ķ2!2!!Ķ !&2!S !*222 !<ì !)2Ķ!Ķ!2!Ķ!2!222Ķ!Ķĕ!ĕS !3Ķ !/B!2 !&ÅB !&2Ķ2Ķ!Ķ!!ĶĶ!!Ħ2!2S!Sĕ !12Ķ !.Ħ !'°Ñ!dĦ !&Ķ2Ķ2Ķ !&2!Ķ2!!Ķ2ĕ !(Ķ!!Ķ !+2 !-B !*c!!Ķ!!2!2Ķ2 !)2!Ķ!!Sĕ !)Ķ!!2 !/Ķ !-Ü !'_!!Ķ!Ķ!!22Ķ2!Ķ!Ķ222ąĕ !-Ķ !'Ķ !/Ħ !+B!2!!2Ķ22Ķ!Ķ!!!2!!Ķ!!d !-Ķ !)2 !4}!!!Ħ!!!Ķ!2Ķ!2Ķ!2!2Ķ2 !'d !32 !(2 !.ì!!Ć!!Ķ!2!Ķ2!Ķ2!!ĶĦ!Ķ!2!ĶĶĶS !(Ķ !=Ķ !&cB!2!!Ķ2!Ķ!!!Ķ!2Ķ2!Ķ!2!ĕĕ !)Ķ !&2 !<Å!!ú!Ķ2Ķ!!!Ħ!!Ķ!BĦ !&ĕ !0Ķ !5Ħ!!!}!!W!!2!2!2Ķ 2(!!2Ķ!ą!dSS !*Ķ !=ìª!đĦ !&Ķ!!!Ķ2!!2!Ķ!2Ķd!Ķĕĕ !.2 !<Ç!!ĶĶĶ2!2Ķ2!ĶĶĦ!!2!22ąĕS !-2 !;} !'_22!Ķ!!ĶĶ22B2! Ķ&SS !+222!2 !;á!Å!!2!!Ķ2Ķ22!ĶĶ!Ķ2!22Ķĕĵ !*2!Ķ !0Ķ !1WB!Ċ!!2Ķ2ĶĶ!!2Ķ2Ķ2!2!S3ĕ !+2Ķ !/22 !0o !&Ķ!!Ķ!222Ķ2!2Ķ!Ķ2!!S !) 2& !* C' !5_!2Ķ2!2ĶĶĦ!ĶĦ !'ĵĵĵ!!",
);
rawImages.push(
  "#cQQ# Q-# Q(# Q1tddSSSCCS C,#ĦĖĆöæÖÖ!!P !,CP !(P$ !)¦ !'D !'22!Ķ !8tĘ !)ĥ !*ń !)å !)2Ķ!2!Ķ2 !9õP !&× !7Ę !'Ķ2!ĶĦ !7Ę !+µ !(Ę !0P!!!Ĥ!2!2!B2Ķ2 !4P !&Ę !-P!!!dĘ!!!C !.ĶĶĶ!!2Ķ2 !8P !,· !&ąP!!·ĥ !+T!Ķ222ĶĶ!!Ķ !4Ę !0Õ!!¦ !'Õ !,Ķ!!2Ķ!!BĶ2 !5P !)Ę !+ç!d !3Ķ!2Ķ!!Ķ !;#!P !'Ęd×!ń·ą !0Ĥ !&Ķ!Ħ2 !:Ę!Ņ !)Pąµ×!Õ !+$ !'D!2!2!2!Ķ !72!!P!Ę!Ę!!!· !&µ !-ń !'2!!Ķ!Ķ!B!!2 !5Ķ !&P!P!!!Õ !-× !.Ķ2ĶBĶĶ!!Ķ !3Ę!!!× !6µ !+Ę !'Ķ!!!22 !3P!$!µ !)÷!!!÷ !4PĶ!!2!22Ķ!ĶĶ !5ń !+rt!!r !/$ !'Ĥ!!Ħ!!Ķ2B !5$ !,÷!õ!!!÷!!$ !+ń !'D!2!2Ķ22Ķ2 !4ń !,r !'r!!ń$ !(÷ !)2!Ķ2Ķ!!Ķ !CĘ !'S!ń· !&$r !-2Ķ!ĶĶ !:Ę!!S !&P !&$ĕ!!Õ !&ń !*Ķ!!ĶĶBĶ2!!!2 !2× !&P!!ĕ!× !)ń· !2Ĥ!2!!Ħ!Ķ2Ķ2Ķ !2µ!Ę !)µ3 !'$!Õ!!!S !0Ķ2!2B2Ķ!Ķ !3$!P!!!Ę !&ĵ× !&ń !'ĕ !,$!D!!!22Ħ!2 !5ńd !&P !'µ !3$!!!ń!!!2!Ķ!2 !8ą !=$ń !'2!Ķ!2ĦĶĶ!2 !8C !&× !.C!!!÷!!ń !(Ĕ!2ĶĶ222ĶĶ!2 !6ĥ !&µ !.ĥ!!!r !&$ !(Ķ22Ķ!Ķ!!!Ķ !3Ę !+× !/t !'ń !(2!Ķ2Ķ22 !5ĘP !*Cµ !(Ę!!!×!!õ$!÷ !+Ķ2!2!ĶĶ2 !4P !&Ę !&ĥ !)P!!!µ!÷!ń!r$ !(T!!Ķ!Ķ22!Ķ !9P !,C !&Ę!!r!!÷!ń !(Ķ2!!2!Ķ!2!!2 !52 !'×!!×!!Ęĥ !&P !'r !+Ķ2!Ķ2!Ķ!!!Ķ !5Ķ !'µ!!µ!!P!!Ę !&C !.2!Ķ!2Ķ22!!2 !7C !/P !&ĥ !.Ĕ!!Ķ!!!ĶĶ!Ķ !4Ę!!ĥ !'× !(D !/$ !&D!!2Ķ!Ķ!2!!2 !3P !(×!µ!!!D!$Ĥ !/ń !(2!!!B2Ķ!2Ķ !7C!!µt!!!ĘĤ!ń$ !'ĸ !+Ę !(2!ĦĶ2!Ķ !8ĥ!!!õ÷!DP!!!ń!!!ç!0 !+P!!Ĥ!Ķ2Ķ!22Ķ22 !4× !)×r!Ĥ !)D¤!D !*$ !'2Ķ2!Ķ!2ĶĶ !4µ !)µ !'t !&Ė!DÅD !&÷!!ń$!!D!!ĶĶ!2!Ķ!2 !6× !-õ !&R!ĤÇĤ !&r!!!ń!!Ĥ!!22!ĶĶ!2Ķ !6µ !2Ĥĸ!Ĥ !.D!!!Ķ!22!Ķ !4Ę !'×!!Ę !*D!t0!D !.2!ĶĶ!2!!2 !5P!$!!!µ!!P !*Ĥ!õ!!Ĥ!!!$!$ !+B!!ĶĶ !8ń !,C !/ń!ń !'TĶ!!Ķ!Ķ22!!2 !5Ę !'Ę !&ĥ !)$ !22!2!!ĶĶ2Ķ !4ĘP !'P !+D!!ń !)t !'ĔĤ!Ķ!Ķ!!2!Ķ !5P !-$ !&Ĥ !'×!!!÷õ !(D!!!2!Ķ !7d !,$!ń !,µ!!!r !)Ĥ!2!Ķ22!22!2 !2ą !*×!Õ !(× !3D!Ķ!!Ķ2ĶĶ!!Ķ !4d!$ !&µ!· !(µ !32!!22!Ķ2!Ķ2 !3×!ą!ń!!D·!$ń !:Ĕ!!ĦĶ2 !&Ķ !3µ !'2ĤÕ!Ė !&$ !+÷ !&$ !)222Ķ!Ķ22 !:Ķ!!!P !&ń !(÷!!r !&ń !+Ķ!!2ĶĶ !5$ !&d!$ !/r !.ĘT!Ķ2 !(2 !4ń!!¦$ą!ń !-t !(t !)PĶ!2Ķ2!ĶĶ!2 !7$åń !(C!!÷!!!÷õ !(õ!!$ !-2!2ĶĶ !6ń !)÷ĥ!!r!!!r!!!÷!!!·!!ń !'Ĥ!Ķ!Ķ!Ķ2!2 !=$!r!÷ !+r!!!Õ !*D!!!222ĶĶĶ !<Cń!!!r !5$ !'2!Ķ!!22 !4Ę!!Ę!!!$ĥ !4÷ !'ń!!Ĥ!2ĶĶ!Ķ2Ķ !5P!!P!!!ń!# !(÷ !&2 !'r !*D!Ķ!!22Ķ2Ķ2 !52 !(Ņ !'Dr !&Ķ !02!!22Ķ!!Ķ!Ķ !5Ķ !&Ę !)Ĥ !'D !&D !+Ĕ!!ĶĶ !9",
);
rawImages.push(
  "#c#Ć# Ħ*Ć$uØø¸øøĸSĆĆĆ#ĦĦĆĦĦĦĆe¸¸Ø¸¸øĸSĆ#ĆĦĦ#Ć#Ć#ĆDè¸¸èĈĈèĨS#Ć!d#Deeu§§Ĉ!dBcĦĆBĆæĶ!!ee#§§ÈuØ!!!ĦR2BB!!!B#§eeC§Søĥd!ĖRRĦööĦ!!ą!!ą!RsÆc¥RBt!!!B!!s¶!!B!ÖsÆ2¶c2C!!BĶĖ22ĦĶ!ĦBss¶sscstą!¥!RsRRs!!d!!BBBRĖRĖc !&ĆĦBĦöĶ!BCBĆcöc2scR!!ĦĦ2ĖĖĶ!!d!BsRBss!!d!æĖĖöĖ!æ!!ą !'Ė!Ķ!Ħ!!!BRRĶBcR!Ħ!!ĶĦ!ĦöĶ !&R2B2RR!!ĥ!!ööĦĖö!!ą!!RĖcsBs!!d !&ĖBcĶccR!ĥ!BĶc2ĦĆ!!ĥ!¥2c¶¶!!!B!öĶĖĶĖ!!!C!ĦBsBĦs!!BBsĖs!öĆ !*¶ĦĖBĆĦ !&ö!ö!22!!Ħ!æĶĦÖö !'BRR2RĖ !&sRĖRsĖ!!Ħ!ĆsĆös!Ė !)Ħ2ĶĖ2Ķ !&sRRĶĦĖ!Bd!¥Rc¥2B!!C!!ĖĦBĦR!!ĥ!ööBööB!!B!cĆcsĖcR!!ĥ!!Ħ!öR!cRR !&ĦöĶ2cR!!ą!æ2æĦĖĦ!!ĥ!ĦBĶĶĶ !(B2BsĦ !&öBĦöĦĆĦ !'B!¶ĆcĦĖĦ!!C!2B!ĖöĖ!!d!¥ĦsĦsR!!C!cBcBc!2!CBRĶö2öĶ !&RBĖRsc !*æBĆĦRĦ!B!!ĆRĶ2sR!ĦĥBöĦöĦöĖ!!!RÆ c' !&ĦBsĦsB !&ÖöRĖöĦĖ !)cB¥cBB !&¶ĖccĖB !&c!cB¥ !&´1bb111b!!!ĶĖöĶöĖB!Ħ!¶¥R¥RR¥ !(ss2BcBc !&ÖĦööĦö!!C!ĆBĆBæĦ!!ĥCĥõõĥĥĥõõ!!RsBRsB!ĖĦ!ĖĖæĖRææ!!Ħ!!!´µµ b'Ħ!!c!Bs!R2B!!cĶBĶsR!!ĦąCĦCĦ!!!Ħĥ!ĖĖ2Ėö !'sBB2Ćss !) õ'ĖĖĖĥ!ĦcBĶc !'Ć2ĶĖöĖ!!Ħ§C§C§eèØB!!ccĶ¥c!!!B!öĖR2ĦöĶ!!d!! Ħ(!ąĥąCRÆ c'!Ħ!!ĦĦĶRBB !&sææ¥æcstC!ĦæĦĆĆĦ!RB!RRĆöRsĦ!!ĥ!!Bee§§È§ĈĈBĥ´1 b'1Ėĥ!¥BsĶR!!!B!sööcöö!B!!Ħ2sĦs2!BĦ!ĖĖBsĶĆ22 !&C!cB¶!Ķ!Bt!ĦĥõĖĖõõĥĥ!!ĆRĖRĖĦB!!!öR!öR !'scĆs!c!!dRÆ¥sR¥¶s !'ĥBssös¥R!!!BĦ!ĥĥĦĦĦCĦ!cöĦĦĦB !&cĶRRR¥!!ĥ!öö2ööĖ!!ą´ b* !(ö!RĦĦ!2!!D e&§ØøĥB!ĆccĖB!!!B!ĆĦĦĖöæ !&R¥!¥¥2!!BĦ õ+Ħ !&sĦBBcR !&öRÖÖRBsC!!cĆĦsR2!Ė!!!RĶRĶR!Ħ!!ĖĆcĆĆR!ĦĦB!!222!Ħ!Ħ !'öBĦ!Ćö!!!Bæ¥ĆĆÆc!2!!öBĦööĶ !&sĖcRc2 !&BĶĖĦ2Ķ!!BDeeTTTe¸ØB !'sBcĶcB!B!!ĦĆB!æĦ!B2!2RBBsĖ!!2Bö2ĆöĦĆ!Ė!!Ħ2Ė¥Ėö!!2!sÆÆsĆĆcÆC !'öĆĆĶĆ!!!C!¶RĶRRc!!3!¶ĖRRĖR!R!!BRc2!c!!Ħ!sR¶öR¶!B3B!Ė!¶ÖÖ¶!2 !'¥!BccĦ !&æĖ2ĖĖĦ!!ĵ!ÖĦĦö2Ė!!3!ĦĆĆ!ĦĆ2!!!ööæĶĶÖ !'c2Ė!cĖ!!B!!Ħ!æcĦĦĆB !&Æ!!sBĖ!!3!ĦcĖc!R !'BB!Bs!RB!sRsRRc !'ĆĆĆsĆĆ!B !'cĖcBcR!!ą!ĖBRĖRR!!ĵ!ÆæcBö!2!ĵ!c!ĦBĦö!B!!öĖĆĖĆĖ!!ĵ! s&öss !)ĆĶĆĆĖĖ!ĦB2öĦĖĦĖĦ!!3RcæcBæc!!3!ĆB¥Ħc¥!!C!!RR!cB!ĦĶ!öĶĦöRĦöĶ!Ħ !&c!cB2ĦB!!!ss!scR!Ħĵ´1 b(!!!BĦæĦĦĆ !&RĖĖ!ĖĖ!!Ħ!¶R!¶2!¶!!B !&ĆcĦBBB!B!!!öBĶĆĶ!!ĶĦĥõÕÕõĖĖõĵ!R!¶ssR !&2c!cBc!BB!ÖĆĖÖĦĶö !)¥Ė2ĖĶĦ!!C!æcĆĆBĦ!Ķ!!ĦĖĦĶĦąą!Ė!öĦööĦö!!ą!ĆĖBĶĆĆ !&RĦ¥RcsR !'B!æĶĖBĖB !&s2Bs2c!!!ee¸È¸§¸ø!B!!B!BĆB!ĦBRÆ¶csÆÆ2ĦCBĖBæĦĖæö!!Ħ !&¥ccĶcR!!ĥ!ĶĖRĖöĦ!2Ħ!cBBÖ2cst!!sRĦRcR!!!Õ1bbb¤¤b!ĥ!sĖ¶cccs!!B !&æĆĖBĖö!Ħ!!BĦöĦBĖ2BdB¶c¥ĆÆc !&ööBĖöĆ!!!ąĥõĖĖööõõ!!öBÖöÖĖö !)Ķ2BĆBB!!!22RBR2R!!ą!¶ĶĖcĆĖ!!Ħ!!cBĶ2R!!ĦdĦ!ĥĥąąĦCĦ!sR!sssc!!C !&cR2c2 !'ĶĖ2ĶRĖ!!B!ssRĖcR!!d!cĦĖRRĖ!!d# e&§¸øĥd!öĖsĖöÖ2!!ĥ!!!scBBcBc !&ĦRB2Ėc!B2!ĦöĖ2ĆĦ!!ą!ĆĦĶĦĆĶ!!ĥ!¶¶¶ssÆstą!2Ķö2sRö !(´Å¤¤b¤bb!!!BĖĦĖĖĖ!!3!cssRBc!!B!RsRĦRs!!CB!ĦĦssĆ!!B!ĶcsBĦBs !(Cõõõ Ė&õĦ!ĦsĶssB !&ĦĖöĖĦĦ!!Ħ!ĖöĖRĖĦB!ĥ!sssö!s !&sĦöö!öĦ!!2!!!ąCĦ! ĥ&Ħd!Bö!öĖĦ !&ĦBcĶB!!!BRÆÆÆsÆs!!C!öĖ!BöĖ !&öĶssBBĖ!B3!!ĦeC§e§§§ødĥ!Ħ!ĦBc!!!ĵ!cĖĖRB!!B2´ 1'bbĖĥ!sRĖRsR !&sBĖöĖRs !)ssÖ¶c¶RRĦ!RB¥cĆc!Ħ!!Ć2ĶĆĆ!!!3Ħĥąąąĥõõĥ!!öĦĦöĦö !&öĦcBBöĖ!!ĵ !&Ć!ĆĆĶ !'ÖRĆæĦö!!Ķ!RRRss2!!ĵ!Ħ! Ħ&!!Ħ!¥RR¥R¥!B!!¥cĆcB¥B!!3 !&BRsRsB !&Öö2ssR!!!BĖöĖĖöĖ!!3¸§§ÈÈ¸¸Ø!B!æĆRææĖ !&ææ!ĦĆæĦ !(2ĦBĖĖĖĦ !&¶BĖöĖ!!BĦ!ssRR¥B!!ĵĖsssÆccstĦ!ccæc¥Ė !&csRĖB¥R!Ħĵ !&BöĦBĦ!!!Ķ!¥ĦccĦĦ!!R!BĖĖĖĦĦ!ĦĶBR¥RĖR¥!!dBĆöRĖæR2ĦĶ!2öĶc2ĆĖ2BĶ !'BsRRR!!Ķ!ĶcĆĦcs!!3!öĦBĦ!s2ĖĦ!ĖæĖ!Ėæ!!ą!¥BRB¥R!ĦĶRRÆcRR¥¥!!2!!B!ĦBööĶö !&ĆĦcBĦĖ !&BsRRRÖ !& c&!c!!B!æĖö!öö!Ķ!´1A b'¤!3 !&ÆĦccBs!!2!ĶĦĆĆĦĖ!Ħĵ!BööĶÖ¥!!B! Ć&cĆ!ĖĦ!B¥ĶRsR!2!CĥĕõõõĖĖÕöĵ !&ÆĦĆ!ĦĖ!!2!sc!ccR!!Ķ!ĦccB¶Ħ!R!!!BBsĆ!!!Ķ!cæ¥ĆæĦ!B2ą Ħ&!ĥĥĦĥĖ!!!2¶RRĆ2B !&öĆcĆĆĦ !&ĦĆ!ĦÖĆ!B2!sRĦöBB!ĥĶ!ösæRsR2B2e §&eeuø!B!!C!ÖĶĖ!ĖĆ2!B!cc!ccBB!!!RRĆ2¥¶!!3!ööB!!Ħ!CB!2öcöĖö!Ħ!BsææsææÖÆt !'BĦBcBs!B!RÆ c'!!Ħ!ĶĖ2ĖæĖ!!ĵ!RBĦR2B!R2!Bc!RBc !&söösöö!!!C !&Ħ!ĦĆĦĖ!!2´11bb¤¤¤ĖB!ĦBRB¶Ħ!ĦĶ!ĶĦ!!ĖĦ!!2!ĆĦĆĶĆĆ !&Ė¥c2B¥2Ķ!ą!!ĥ!¥BsBsR!!32ĥĥąĖöåÕĥĦ!2ĦĖĦÖs!!!B2RRĖRR!B!!BBcĶcc!!C!Ħæ!æĦĦæ!!B!!!2ĆĦöĦöö!!ĵĖCĦĶĥĥĖCĦd!2s2s!Ö !&ĖĶĖRĖĖ!!C!2ĆĆ2ĶĆ!BB!¥cĆBcB¥ !'Ħ!BR2!RR!!Ėe#¸uu¸Ø·Bą!ĦöĦöB¥!!Ħ!c!cĖcc!!ą!ĖBRĶĖR!!RBæĆ!BĆææ !)RĶBRĶB!Ħd!RB¶BsBstR!R2!RRæ!!d!ĆĶĖBĖĖ!ĦB!R2ĖBRĦ !&ccB!Bcc!B!!!B!ÖĦĖĖĦĖ!!ąB¶sĖsĖRR!3!ĶBRĶB¶B!ą!BR2Ķ2R!!Ħ!ĦĦc2ĦR!ĦĖ!ĆĦBĆBĆĆ!!2!!!2s¥R¥RĦ!!B!öĖ!Ė!2Ė!ĵ!ĦĖĖĦĖÖĦ!B!ĦĖĦ!ĦĖ2!B!RĶĦĆ2Ć!!Ħ!cĦĦc!cc!!3 !&öæĖæĖBB!!!cB!R¥BR!Ė!¥R¥RĦcĖ!!!RB22RB!!Ħ!ĦsRBRs!!ĥ!ĆcBĆBBĆ!!ĵ !&cccBcĦ !&Ć2RĖæĦ!!B!æ2Ħ2B!R!!!ĖĦB2ĶĖ!!d!ĦĖöĦĶö2!!!sĆ2sæĶs!!Ķ!!!RR2Rsc¥!!Ħ!cĖĖ2RĖĖ!!RÆ c'B!Ħ!c2Ė2Ħ!!!ąRÆ¥ÆÆcÆ!!Ħ!öBĶĶcöö!Ħ!!!C´Õµrrbbb!d!Ć2RBĶRR!!´ b)!d!ĆBcĦccB!d´ b)!B!csĦĆĆ¶c !&",
);
rawImages.push(
  "#c##t S*#uÈøĘØĘĘĨt###tSS#SSS#¸ØØøØØĘĨt#t#SSt#t#t#¸ĈØØĈĨĨĈĨttĦ!sħ#CCC··×!s!RĦĆBĆöĶ!!dt#CCtC¦!!!ĶR2BB!!!RķdCC#t#×Ħs!ĖRRĦööĦ!!ö!!ö!Bc¶cBĶBB!!!B!!s¥2!R!¥RÖRÆc2B!!2ĶĖ22Ħ!!Ė!sc¥cccsBö!s!BcRRc!!s!!R!RRĖRĖc!!!BĖĦBĦöĶ!!B!ĖRöR2sc!!2ĶĦ2ĖĖĶ!!s2BsRBss!!s!öĖĦĆĖ!ö!!ö !'Ė!Ķ!Ħ !&BRĶBc2!!!2ĶĦ!ĦöĶ !&B2B2RR!!Ħ!!ööĦĖö!!ö!!RĖcsBs!!s!!!cĆBcĶcR!!Ħ!BĶc2ĦĦ!!Ħ!s2css!!!R!öĶĖĶĖ!!!B!ĦBsBĦs!!R!sĖs!öĆ !*¶ĦĖBĆĶ !&Ć!ö!22!!ĖBöĶĦöĖ !'RRR2RĖ !&sRĖRsĖ!!Ė2ĆsĆös!Ė !)Ħ2ĶĖ2Ķ !&cRRĶĦĖ!!s!sRRs22!!B!!ĖĦBĦR!!Ħ!ööBööB!!R!cĆcsĖcR!!Ħ!!Ė!öR!cRB !&ĦöĶ2cR!!ö!ö2öĶĖĶ!!Ħ!ĖBĶĶĶ !&B!B2BsĦ !&öBĦöĦĆĦ !'R!¶ĆcĦĖĶ!!B!2B!ĖöĖ!!s!sĦsĦs2!!B!cBcBc!!!B!RĶö2öĶ !&RBĖRsc !*æBĆĦRĦ !&ĖRĶ2sR!!Ħ!ĆĦöĦöĶ!!!2s 2' !&ĦBsĦsB !&ÖöRĖöĦĖ !)cBsc2B !&¥ĖccĖ2 !&R!cBs !&å µ)!!!ĶĖöĶöĖ!!Ė!¶sBsRBs !(Bs2!2!2 !&æĦööĦĆ!!B!ĖBĆBöĦ!!ĦB Ħ*!!RsBRsB!!ĥ!ĖĦöĦBöö!!Ė!!!å µ)!!!R!Bs!R !&RĶBĶsR!!ĖöBĖBĖ!!!ĖĦ!ĖĖ2Ėö !'sBB2Ėss !) Ħ'!!!Ħ!ĦcBĶc !'Ė2ĶĖöĖ!!ĥdķt#tC·¦R!!cRĶsc!!!C!öĖR2ĦöĶ!!s!! Ė(!öĦöBBs 2'!!!2ĖĦĶRBB!!!2sÖÖsÖcsBB!ĦöĦĖĆĦ!!R!RRĆöRsĦ!!Ħ!!Rdddt·Cç×RĦå µ)!Ħ!¥BsĶR!!!C!sööcöö !&Ħ2sĦs2!!Ė!ĖĖBsĶĆ2 !'B!RR¥!!!BB!ĖĦĦ!! Ħ&!!ĖRĖRĖĦ !&öR!öR !&2scĆs!c!!s2sRB!RcB !'Ħ!ccĆc¥R!!!RĖ!ĦĦĖĖĖBĖ!RöĦĦĦB !&cĶRRBs!!Ħ!öö2ööĖ!!öå µ* !(Ć!BĦĦ !&3dCCCtÇ×ĦR!ĖccĖB!!!RBĆĦĦĖĆö !&Rs!ss2!!RĖ Ħ+Ė!!!2cĦBBc2 !&ÖRÆÆR2sB!!RĆĦsR2 !'RĶRĶR !&ĖĖRĖĖB!!ĖR!!!BĖ!Ė!Ė !'ĆBĦ!ĆĖ !&ösĆĆ¥c !&ĆBĦööĶ !&sĖcBc2 !&BĶĦĦ2!!!R33CtStCt¦R !'cBcĶcB!!!2ĖĆB!öĦ!!Ė!2RBBsĖ !&ö2ĆĆĦĆ !&Ħ2ĖsĖö !&s¶c2ÖÖcsB !'ĆĆĆĶĆ!!!B!¶RĶRRR!!s!¥ĖRRĖR!!B!BRc2!c!!Ė!sRsĆRs!!B!!Ė!söös !(Bs!BccĦ !&öĖ2ĖĖĶ!!Ħ!æĦĦö2Ė !&ĦĆĆ!ĦĆ !&ööĆĶĶö !'c2Ķ!cĶ!!R!!Ė!öcĦĦĆB !&¶!!sBĖ!!B!ĖcĖc!R !'BB!Bs!!R!sRcRRc!!!2!ĆĆĆsĆĆ !)RĖcBc2!!ö!ĖBRĖRR!!Ħ!Æöc2Ć!!!Ħ!c!ĦBĦö !&öĖĖĖĆĖ!!Ħ! s&öss !)ĖĶĆĆĖĶ!!R!ĆĦĖĦĖĦ!!B22¥2!¥2!!B!ĆBsĦcs!!B!!RR!cB !&öĶĦöRĦö!!Ė!!!2R!cB2Ħ !&cs!sRR!!öå µ)!!!BĦöĦĦĖ !&RĖĖ!ĖĖ!!Ė!s2!s2!s!!R !&ĖcĦBBB !'öBĶĖĶ!!RĖĦĦööĦ!!Ħ!!R!ssRR !&2c!cBc!!R!öĦĖöĦĶĖ !)sĖ2ĖĶĦ!!BBæcĆĆBĦ !&ĖõĥĥĖöö!ö!öĦĖö!ö!!ö!ĆĖBĶĆĆ!!!BRĦs R& !'R!öĶĖBĖB !&s2Bs2R!!!dd§§§Çt×!R2!B!BĆB!!R2sc2Bss!!B!ĖBöĦĦĆö!!Ė !&sccĶc2!!Ħ!ĶĖRĖöĶ!!Ė!RRRÖĖcsB!!sRĦRcR!!!ą µ)!Ħ!sĖscBcs!!R !&öĆĖBĖĖ !&BĦöĦBĖ!!s!¥RsĆÆc !&ööBĖöĆ!!!öĦĦ !&ĦĦ!!öBöööĖö !)Ħ2BĆBB !&2RBR2R!!ö2¶ĶĖcĆĖ!!Ė!!cBĶ2R!!ĖsĖ!ĦĦööĖBĖ!sR!ssRc!!B !&cR2c2 !'ĶĖ2ĶBĖ!!R!ssRĖcR!!s!cĦĖRRĖ!!sķdCCCtt×Ħs!öĖsĖöö2!!Ħ!!!2c 2' !&ĦRB2Ħc !&ĶöĖ2ĆĦ!!ö!ĆĦĶĦĆĶ!!Ħ!s¥¥ccÆsBö22Ķö2sRö !(åÅ µ(!!!BĖĦĖĖĖ!!B!RssRBR!!R!RsRĦRs!!B2!ĦĦssĆ!!R!ĶcsBĦBs !(BĦĦĦ !&ĦĖ!ĦsĶssB !&ĦĖöĖĦĶ!!Ė!ĖöĖRĖĦ!!Ħ!sssö!s !&sĦöö!öĦ !(öBĖ! Ħ&Ės!Bö!öĖĦ !&ĶBcĶB!!!R2sssBsB!!B!öĖ!BöĖ !&öĶssBBĖ!!B!!ĖSħS#d·CÇsĦ!Ħ!ĦBR!!!Ħ!RĖĖRB !&å µ)!Ħ!sRĖRsR !&sBĖöĖRs !)¥¥æ¥!ÆR!Ė!RBsRĖR!!!BĖ2ĶĆĆ!!!BĖĦööö Ħ&!BöĦĦöĦö !&öĦRBBöĖ!!Ħ !&Ć!ĆĆĶ !&2ÖRĖöĦĆ !&BRRss2!!Ħ!Ė!ĥĥĖĖ!!Ė!sBRsBs !&sRĖR2sB!!B !&RRsRs2 !&Öö2ssR !&ĦöĖĖöĖ!!Bddt¸¸tt¦!R!öĖBööĦ !&öö!ĶĖöĦ !(BĖBĖĖĖĶ !&¶BĖöĖ!!!Ė!csRRsB!!Ħ!scc¶ccsBĖ!cRöcsĖ !&csRĖBsR!!Ħ !&RöĦBĦ!!!ĥ!¥ĦccĦĦ!!s!BĖĖĖĶĦ!!!2RsRĖRs!!s!ĆĆRĖöR!!Ė!2öĶc2ĖĖ !*BsRR2 !&ĶcĆĦcR !&öĦBĦ!R!!Ė!ĖöĖ!Ėö!!ö!sBBBsB!!!2!s2!!RR!!B!!R!ĖBööĶĖ !&ĖĦcBĦĶ !&BsRR2ö !& c&!c!!R!öĖĆ!ĆĆ!!!å µ* !(ÆĦccBR !&ĦĦĆĆĦĖ!!Ħ!BööĶös!!RB Ć&cĆ!!Ė!BsĶBcR!!!B Ħ'!!Ħ !'BÆĦĆ!ĦĶ!!C!sc!ccR!!!2ĦccBsĶ !'BBsĆ!!!ĥ!RösĖöĦ!!!ö Ė&!ĦĦĖĦö !&¶RRĆ22 !&öĆcĆĆĦ !&ĦĆ!ĦöĆ !&sRĦöBB!Ħ!!ĆsöRsR!!Rdtddd33C×!R!!B!ÖĶĖ!ĖĖĶ!R!cc!ccB !&RRĆ2ss!!B!ööB!!Ħ!BC!2öcöĖö !&cææsææÖsB !'RĦBcBR2!!2s 2'!!Ė!ĶĖ2ĖöĶ!!Ħ!RBĦR2B!!!2Bc!RBc !&söösöö!!!B !&Ė!ĦĆĦĶ!!Bå µ)!R!ĦBRBsĦ !&ĶĦ!!ĖĦ!!R!ĆĦĆĶĆĆ !&Ėsc!Bs!!!ö!!Ħ!¥BsBs2!!!BĦĦĦ!!ĦĦĦĖ!2ĦĖĦöR !&2RRĖRR !&BBcĶcc!!B2Ħö!öĦĶö!!R !&ĖĦöĦöĖ!!!öBĖ!ĦĦĖBĖs!2s2s!ö !&ĖĶĖRĖĖ!!B!2ĆĆ2ĶĆ !&scĆBc2s !'Ė22R2!RR!!ödķdCCtÇdRö!ĦöĦöBs!!Ė!c!cĖcc!!ö!ĖBRĶĖR !&öĆ!BĆöö !)RĶBRĶ!!!s!2c¶Rc2sBs!R2!RRö!!s!ĆĶĖBĖĖ!!R!R2ĖBRĦ!!!BccB!Bcc !'R!ÖĦĖĖĦĶ!!ö2¶cĖcĖR !&ĶBRĶ!s!!ö!BR2Ķ2R!!Ė!ĦĦc2ĦR !&ĆĦBĆBĆĆ!!B !&ssRsRĦĶ!R!ĆĖ!Ė!2 !&ĦĖĖĦĶö!!R!ĦĖĦ!ĦĖ!!R!RĶĦĆ2Ć !&cĦĦc!cc !)ööĖöĖB2!!!RB!Rs2!!ö!sRsRĦc !&RB22RB!!Ė!ĦsRBRs!!Ħ!ĆcBĆ22Ć !)cccBcĦ !&Ė2RĖöĶ!!R!ö2Ķ2B !'ĖĦB2ĶĖ!!s!ĦĖöĦĶö !&sĆ2sö!s!!Ħ!!!2R22R2R!!Ė!RĖĖ2RĖ!!!2s 2'!!Ė!c2Ė2Ħ!!!ö2sRss2s!!Ė!öBĶĶcöö !'BåÕ µ(!s!Ė2RBĶR!!!å µ)!s!ĆBcĦcc!!så µ)!R!cRĦĆĆsc !&",
);
rawImages.push(
  "#c#Ć# Ħ*Ć$uØø¸øøĸSĆĆĆ#ĦĦĆĦĦĦĆe¸¸Ø¸¸øĸSĆ#ĆĦĦ#Ć#Ć#ĆDè¸¸èĈĈèĨS#Ć!d#Deeu§§Ĉ!dBcĦĆBĆæĶ!!ee#§§ÈuØ!!!ĦR2BB!!!B#§eeC§Søĥd!ĖRRĦööĦ!!ą!!ą!RsÆc¥RBt!!!B!!s¶!!B!ÖsÆ2¶c2C!!BĶĖ22ĦĶ!ĦBss¶sscstą!¥!RsRRs!!d!!BBBRĖRĖc !&ĆĦBĦöĶ!BCBĆcöc2scR!!ĦĦ2ĖĖĶ!!d!BsRBss!!d!æĖĖöĖ!æ!!ą !'Ė!Ķ!Ħ!!!BRRĶBcR!Ħ!!ĶĦ!ĦöĶ !&R2B2RR!!ĥ!!ööĦĖö!!ą!!RĖcsBs!!d !&ĖBcĶccR!ĥ!BĶc2ĦĆ!!ĥ!¥2c¶¶!!!B!öĶĖĶĖ!!!C!ĦBsBĦs!!BBsĖs!öĆ !*¶ĦĖBĆĦ !&ö!ö!22!!Ħ!æĶĦÖö !'BRR2RĖ !&sRĖRsĖ!!Ħ!ĆsĆös!Ė !)Ħ2ĶĖ2Ķ !&sRRĶĦĖ!Bd!¥Rc¥2B!!C!!ĖĦBĦR!!ĥ!ööBööB!!B!cĆcsĖcR!!ĥ!!Ħ!öR!cRR !&ĦöĶ2cR!!ą!æ2æĦĖĦ!!ĥ!ĦBĶĶĶ !(B2BsĦ !&öBĦöĦĆĦ !'B!¶ĆcĦĖĦ!!C!2B!ĖöĖ!!d!,ÐĐÐĐàð^Òŀ,ĠcBc!2!CBRĶö2öĶ !&RBĖRsc !*æBĆĦRĦ!B!!ĆRĶ2sR!ı^]2B!2RBĶĶ2R!!ĀðÀà !&ĦBsĦsB !&ÖöRĖöĦĖ !)cB¥cBB !&¶ĖccĖĐÐ!!222RB!!ĖĆĦ2BĶ22B2À^!¶RĖöĶöĖB!Ħ!¶¥R¥RR¥ !(ss2BcBc !&ÖĦöÀð!222ææĆ!2!Ķ!ĶöĦĖĆĦ2B22!±RRscRsB!ĖĦ!ĖĖæĖRææ!!Ħ!!!´µµ b'Ħ!!c!ŀ!!!ÖĖ2!BĶĶĦæöĦ!!Ħ!ĶöĦĆöĦ2Ķ}ÀBRRĶ !'sBB2Ćss !) õ'ĖĖĖĥ!Ħŀ!RRĖBBö!ĦĶ!!!Rccc2Ħ2!ĦĦ2öĦ2!ĦÀ!2RB!!B!öĖR2ĦöĶ!!d!! Ħ(!ąĥąCRĐĖ!!æĦĦĖ!cccĖ!¶RĆĦ!ĆcRcĖ!ĦR!!222Ð!!R!RB!RRĆöRsĦ!!ĥ!!Bee§§È§ĈĈBĥŀ!!!Ħ!ĦcccĦĦĦ!BĆ!!2B!Ħ!ĆcccBB!BB!ĶÀ!!!BC!ĖĖBsĶĆ22 !&C!cB¶!Ķ!BtÒĖRRĦĖ!cĶĦĶRĦĶsĆ!!sR!scBcĦĆ!!ÖĶĦĶĶ2ĖÀ!!Ĥ!RÆ¥sR¥¶s !'ĥBssös¥R!^!!Ė!ĖĶcĆ2ĦĦ2¥sĦ !&ĖĖ!Ė!BĦRR2Rö2ĦĆ!B2!!!R´ b* !(ö!RĦĦ!àĦ!BR!R!RRRssĖĖ!!R7ī!ĻĻ2B!Ħ¥R!ĶB!ö2BĶR!Ð!!BC õ+Ħ !&sĦBBcRĦĶ!öæĆB¥ĦBĶĦĶRBīĻī!-Ħ^!ċěċBĦĖĶ!ö!!ĆBĦæ2ĖÀ!!RC!222!Ħ!Ħ !'öBĦ!ĆÀ!!Ķ!ĵBĦĶ2Ħ!RĦīĻ!!!-Ķ2Ħ^!!!ċīBĶ2!2c!ö2R!2Ħ!Ĥ×CeTTTe¸ØB !'sBcĶc!BĖö!!!ĶĆ!!Ė!7 !'Ħ!!!Ħ^ !&ě!Ė¥cĦ!!!2!RR`!2ĆÆÆsĆĆcÆC !'öĆĆĶÐĦ2!!2t22!!BBī !'ĦĻõĦ!!Ħ^!!!Ėë!!!Ħ!!ĆĶĆæ2Ķ!!!2!¶ÖÖ¶!2 !'¥!Bc !&ĵRĶ!Bs!2Ļ !&-=ĖĖ(ĕĦ!!Ħ^!!R!êĶ2¥2R!!Ķ!Ķ!?2!R2Ė!cĖ!!B!!Ħ!æcĦðBBĦ !&Ć!ĖĶī !&-ĶĶ±!!(ĕĦ!!Ħ^!!RCÊĆĖRĦ!ĆBB!!!2!!!ĆsĆĆ!B !'cĖcĦĶ!Ć!t2Ķ!!BĻ !&-Ķ!ĶĶ±!!(ĕĦ!!Ħ^!!R!ÚB!Ķ!!!R!Ķ !&2söss !)ĆĶĆĦĦ!c2!ĆRs!B !&-Ķ!!!ĶĶ±!!(ĕĦ!!Ħ^ !&Ć2scR!Ħ!BB!!!BĶRĦöĶ!Ħ !&c!c!ĶĖ2RĶ¥B22 !&-Ķ !'ĶĶ±!ŀSB!!Bċ!!CBBĆĦ2B22!!!Ð2!!R2!¶!!B !&ĆcĦ!!!Ė2BĦĶ!!ě!!-Ķ !)ĶĶ^tB!!Bċ!!-RtĻ!ĶĖĖĶĶĦĶ!!!22ĖĦĶö !)¥Ė2!2BBĦĶ !(-Ķ !&B !&Ķ2!!!Bċ!!Đ!^!!!ĶBBĶĶ !'ĶĶRcsR !'B!æĶĖ22ĖĦ !)-Ķ !&BċĦĦ !(Bċ!!Đd2Ħ^!!RĖĦ !)222Ėæö!!Ħ !&¥cc2Ė !*-Ķ !&Bċ!cĕĦ !&Bċ!!Đd2!!Ħ^RĆ !+Ķ!Ķcc¶!!B !&æĆĖĶ !+ěĦ!!!Bċ!ĖÛ !(Ħ^!Đd2!!!BċĖ !,2Ķ!ĖBĆ !)Ķ2BĶ !,'õĦBċ!ĖąŀSB !'Ħ-t2!!!Bċ !/2!R!2!!C !&cR2!!!ĦąB2ĖĆĖn!X2ċ!Õą^SB!!B !&2 !&Bċ!= !/2ĖĦ2!!ĥ!!!scBB!!!ĵdĖöR !'Ļ!Õ!^SB!!BċõĶ !(Bċ!ĖĦ !-ĶĶĶ2Ħö !(´Å¤¤!!cCĦ2!ĶRB!!!ĖĖ!^SB!!Bċ!XąĶ !&Bċ!Ė!Ķ!cRBBRB2!¼!222BRs !(Cõõõ!!2Ķ!!cĖö!Ć=!R !)Ħ^!Ė(ąĶ!!Bċ!Ėĥ~!RĶĦĖĶ!ĶĦĦ!!Ķ!ĶĶ!Ħ!!2!!!ąCĦ!cBĶcBõĶ2!!!B!!RdċĕĦ!!!Ħ^R!(ąĶBċ!Ėĥ!ĦBBĶĦ!!Ė22!!!2!!ĶĆĖ!B3!!ĦeC§eĬ2ĦBĖ!!!c!R!^!!RdċĕĦ!!!Ħ^R!(!ċ!ĖĥĦÂRRöR2RĦĦ !(Ķ2Bss !)ssÖ¶ !&SĖ2!Ħö!Ķ-!!Rd(ĕĦ!!!Ħ^R!ċ!ĖĥĦâ2ĶĖ2ĆRĦ2!2!ĩ!!!2ĶĖÖĖ!!ĵ !&Ć!ĆĆXBĶsĦBõĶĶ!!Ħ!^!!R!(ĕĦ!!!Ħ^!ĥĖ!ĦâĦ!!ĶĦ!!Rc¥Ķ2!Ķ!Ķ!!B¥B!!3 !&BRsRs!ĦĦsĖ!!2c!!R!-!!RR(ĕĦ!!BÛ!!ąĥâĦRöĆB2RĦĦ!ĖĖĉ!!!2!!ĖæĦ !(2ĦBĖĖĖy!!2!3ĦB2ĶB!ĖB^-!!RXĕ!Bċ!ĥĦâ²Ħ!!!ĶĖR22Ħ!ĶB !'Ķ!2¥R!Ħĵ !&BöĦBĦ!B2!s¥cĦæBĦ2B2Ė!^M^!XBċ!~¡òĶBRcĶc2R!ĦB¥ĶRÜ !&Ķ!!2ĆĖ2BĶ !'BsRRR«B!ĦĖ!ĖcÖĖĖööRR!!Ė-^Ķ-- !&æĖ!2ĦĶ2ĶĦ2Ė!¼!!D2!222R¥¥!!2!!B!ĦBööĶö!ċ!!R!RĖc!Ķ!BĶæöB !&RR!R!!BĖĖĶĖsĶBc!ĦĶ2!!! ¤& b&¤!3 !&ÆĦccBs!!gRĖĖBRĆcĖ2!ö!2öc!!öĖ!öĆĦĆ!2!!¶2B22ĶRÌ!!!Ħ!ĦĦĦĖõĖĖÕöĵ !&ÆĦĆ!ĦĖ!!2¼!!!B!ĆcRĦ!2!!Ħc!!ĶĖ!!Ħ!ĦR!ĦĦ!ĦĦ!2Ì!!!DBĦ!!Ėĥ!ĥĥĦĥĖ!!!2¶RRĆ2B!!!ĖìR!!¥cĆĶRcĶĦR!ÖĆ2ĶĖ!ĦĶccĆĦĖ!!ĶĶĶ¼!2Ķ!!ĦėķķCeeeuø!B!!C!ÖĶĖ!ĖĆ2!BÖ!¼!ĖĖR!Ħ2ĆRc!!!ĶBBcccRĶ2!ĶsBĶ!BÌ22!2!Ħ!BsææsææÖÆt !'BĦBcBs!B!RĖ2Ì!!!¶RĶ!ĖĦ2B¥cĖ!Ķ2ĆĖBB¥sBĶ2ìÜ2Ķ!ĶĶ!B!!söösöö!!!C !&Ħ!ĦĆĦĖ!!2´r1¤77!ĶĶĶ¥¥c!Ķ!2!ĦBBscBĶĦĶĶ!ĉ!ĶĶ2Ķ2!!ĦĖ!Ė¥c2B¥2Ķ!ą!!ĥ!¥BsBsR!!32ĥĥå!!ùĉ!!ĶĶĶĖĦ!!scBĶĦ2ĶĶĦĶÌĉ!Ķ!!!2ĶĖĶ!!!Ħæ!æĦĦæ!!B!!!2ĆĦöĦöö!!ĵĖCĦĶÕÕDDĹĹÌĶĦ!ĶĖĦ22ĶĖ!!ÌÜČì!!D!!!ĶĶĆB!BB!¥cĆBcB¥ !'Ħ!BR2!RR!!Ėe#¸uu¸#CDDĶÜìüìüÜÌĉīììÌĶĶ!Ķ!!!Ħ!!ĆĶRĖ!!RBæĆ!BĆææ !)RĶBRĶB!Ħd!RB¶BsBs!!Ħ!2!!!2!!!Ķ!Ķ22!2!D!!Ć Ė&Ħ !&ccB!Bcc!B!!!B!ÖĦĖĖĦĖ!!ąB¶sĖsĖRR!öÖĦĶĶ2ĶĶ!!!Ķ2!Ķ!ĶĶĶ!!ÖĦĖc2ĦR!ĦĖ!ĆĦBĆBĆĆ!!2!!!2s¥R¥RĦ!!B!öĖ!Ė!2Ė!ĵ!öĖ!Ķ!!ĶD!ĶĶ!!Ķ!ĖĶ!ö!RĶĦĆ2Ć!!Ħ!cĦĦc!cc!!3 !&öæĖæĖBB!!!cB!R¥BRĦĖ!¥ĶĶ Ė&!ÕÖ Ė'Ķ!!ą!ĦsRBRs!!ĥ!ĆcBĆBBĆ!!ĵ !&cccBcĦ !&Ć2RĖæĦ!!B!æ2Ħ!!!B!!!ĆĖĶĶĦĖ!Ħd!ĦĖöĦĶö2!!!sĆ2sæĶs!!Ķ!!!RR2Rsc¥!!Ħ!cĖĖ2RĖĖ!!RÆ c'BĦĦ!c2Ė2Ħ!!!ąRÆ¥ÆÆcÆ!!Ħ!öBĶĶcöö!Ħ!!!C´Õµrrbbb!d!Ć2RBĶRR!!´ b)!d!ĆBcĦccB!d´ b)!B!csĦĆĆ¶c !&",
);
rawImages.push(
  "#c##t S*#uÈøĘØĘĘĨt###tSS#SSS#¸ØØøØØĘĨt#t#SSt#t#t#¸ĈØØĈĨĨĈĨttĦ!sħ#CCC··×!s!RĦĆBĆöĶ!!dt#CCtC¦!!!ĶR2BB!!!RķdCC#t#×Ħs!ĖRRĦööĦ!!ö!!ö!Bc¶cBĶBB!!!B!!s¥2!R!¥RÖRÆc2B!!2ĶĖ22Ħ!!Ė!sc¥cccsBö!s!BcRRc!!s!!R!RRĖRĖc!!!BĖĦBĦöĶ!!B!ĖRöR2sc!!2ĶĦ2ĖĖĶ!!s2BsRBss!!s!öĖĦĆĖ!ö!!ö !'Ė!Ķ!Ħ !&BRĶBc2!!!2ĶĦ!ĦöĶ !&B2B2RR!!Ħ!!ööĦĖö!!ö!!RĖcsBs!!s!!!cĆBcĶcR!!Ħ!BĶc2ĦĦ!!Ħ!s2css!!!R!öĶĖĶĖ!!!B!ĦBsBĦs!!R!sĖs!öĆ !*¶ĦĖBĆĶ !&Ć!ö!22!!ĖBöĶĦöĖ !'RRR2RĖ !&sRĖRsĖ!!Ė2ĆsĆös!Ė !)Ħ2ĶĖ2Ķ !&cRRĶĦĖ!!s!sRRs22!!B!!ĖĦBĦR!!Ħ!ööBööB!!R!cĆcsĖcR!!Ħ!!Ė!öR!cRB !&ĦöĶ2cR!!ö!ö2öĶĖĶ!!Ħ!ĖBĶĶĶ !&B!B2BsĦ !&öBĦöĦĆĦ !'R!¶ĆcĦĖĶ!!B!2B!ĖöĖ!!s!,àĠàĠðàMnİ<ĐcBc!!!B!RĶö2öĶ !&RBĖRsc !*æBĆĦRĦ !&ĖRĶ2sR!==,!2!22!!!ě2!!ððÐð !&ĦBsĦsB !&ÖöRĖöĦĖ !)cBsc2B !&¥ĖccĖÅà !'2!!!ĦĖ-ě2!ě!B!àM!!ĶĖöĶöĖ!!Ė!¶sBsRBs !(Bs2!2!2 !&æĦöÐĀ!ě22ĆĆĦ!ě!!!ĶĦMĦĖ-ě!!ě!MÆ¥sBRsB!!ĥ!ĖĦöĦBöö!!Ė!!!å µ)!!!R!İ!!!ıĖ!!BĶ!MĆĆĦ!!ĖĶĶĦMĦĖMě!ÀÐ2cRö !'sBB2Ėss !) Ħ'!!!Ħ!Ħİ!22M2!Ć!ĦĶ!!!Rccc2Ķ2!ĶĦ!ĆM!!ĶÐ!!¥!2!C!öĖR2ĦöĶ!!s!! Ė(!öĦöBBĠĶ!ĖĖĦĶĶ!BccĦ!72ĆĖĦ2cRBĖ!ĶR!!22!Ð!!c!!R!RRĆöRsĦ!!Ħ!!Rdddt·Cç×RĦİ !&ĶĦBcc!ĦĦ!ě=!!BBĖĖĖ2cBc2ě !'ÐĶ!!ĤB!ĖĖBsĶĆ2 !'B!RR¥!!!BBnĶ22!!!c2ĦĶBĦĶĻ=!!c2!2!RĦĖ2!!ı !'Ħà !&2sRB!RcB !'Ħ!ccĆc¥R!M!!Ķ!ĖĶcĆ2ĦĦ!cRM !&ĶĶRB!!Ķ!ě!RĆ!ĶĖ!B !&2ą µ* !(Ć!BĦĦ!à!!22!R!ěRěcRĶĶ!!2īě!ĉī!2!Rc2!!2!Ć2B!ě!Ð!!!2 Ħ+Ė!!!2cĦBBc2ĶĶ!ĖĖĦ!cM2MĶ!22ěùù!MĦpĤěěě!!ĶM!Ć!!Ć2ĶŁěĶÐ!!!B!!BĖ!Ė!Ė !'ĆBĦ!Ćà!!!ĶĖB!!!Ķ!2ĶùùĤ!TMĦ!ĦpĤ!!ěě2!!!2c!Ć2R!2Ķ!ĔÇ·CtStCt¦R !'cBcĶc!2ĦĆ!!!ĶĖ!!Ķ!ĉ!!TT!Ħ!!!ĦpĤ!!!ě!ĶcRĦ !'ě2p!2Ræc2ÖÖcsB !'ĆĆĆĶàĶ!Ķ!2¥!2!!22ù!!T!!!ĻĦ!!!ĦpĤ!!!ě!!!Ħ!!Ć!=Łě!!µ!!!söös !(Bs!Bc !&ĦRĶ!!R!!ù!!T!==!27Ħ!!!ĦpĤ!!!ī!!c2R!!Ķ!M!!×!!2Ķ!cĶ!!R!!Ė!öcĦð22 !'Ė!Ķ!ù!!T!=ĦĶ=Ķ!7Ħ!!!ĦpĤ!!!ěĦĶRĦ!ĆBB!!_µ!µBĆsĆĆ !)RĖcĶ!!Ć!¥!Ķ!!2ĕ!!T!=Ħ!ĶĶM!!7Ħ!!!ĦpĤ!!!ě2!Ķ!!!2!!!Ĕ!×!söss !)ĖĶĆĦĦ!c2!ĖBR!ĕĪ!T!=Ħ!!!ĶĶM!!7Ħ!!!ĦpĤ!!BĖ!ccR !(µµ!!sĦö!!Ė!!!2R!c!ĶĦ!RõĵąĕĕĪ!T!=Ħ !'ĶĶM!ıB!!!Bù !&BĖĶ!2!õĕĕĦ_Ĕ×!!Ķ!s!!R !&ĖcĦ!!!Ħõ!Ķ2BB!T!=Ħ !)ĶĶ-B!!!Bù!D-Ĥ!ī!ĶĦĦĕBĦ!B!!µ!!ĦĶĖ !)sĖ2!2BBd!t!!!T!=Ħ !&B !&Ķ !&Bù!Dı!pĤ!!ĶBBĖC !'×!2RRR !'R!öĶĖ22ĖĦ !'Ċ!=Ħ !&BùĶ !)Bù!DıB!ĦpĤ!RĖĦ !,ĦĆö!!Ė !&scc2Ė !*=Ħ !&Bù!RĶ !'Bù!DıB!!!ĦpRĆ !.Bcs!!R !&öĆĖĶ !+ī !&Bù!DěĶ !'ĦpDıB !&BùĖ !,µ!!!Ėö !)Ħ2BĶ !,'Ħ!Bù!D!ıB !(Ħ-B !&Bù !.×!!!Rc!!B !&cR2 !&Ķ!!C#>!!GĦù!D!ıB!!!B !+Bù!p !22!!Ħ!!!2c22!!!Ħ2dĖ2!S!!!7DD!ıB!!!BùĦ !)Bù!DĦ !1Ħö !(åÅµµ!!R2Ħ2!!2!!!Ķ!!!ıB!!!Bù!7Ħ !'Bù!D!Ķ!cRB¦ĥB !&µ!!ĦBs !(BĦĦĦ!!!Ķ!!RĦĖ!-İ !+Ħp!!7Ħ!!!Bù!D!M!RĶĦĖ!SSS!!!×!!B !*öBĖ!RB!cBæ!2!!!S !&7Ħ !&ĦpĤ!7Ħ!Bù!D!!ĶB!ĶĦ!!Ķ!!!Ċĉ !&Ėö!!B!!ĖSħS#ļ2Ķ!Ė!!!R!2!M !&7Ħ !&ĦpĤ!7!ù!D!!M22ĖB2RĦĦ!!Ċ !'ĖRs !)¥¥æ¥ !&cĖ2!!Ė!!= !&7Ħ !&ĦpĤ!ĻDD!!M!!Ķ2ĖRĦ2!ě!!Tµ!!!BöĖ!!Ħ !&Ć!ĆĆH2!cĦBæ!Ķ!!Ķ!M !&7Ħ !&ĦpĤ !&MĶ!!ĶĦ!!Bī'Mù!××!!Ķ2sB!!B !&RRsRs!ĶĶcĖ!!2R!!2!= !&7Ħ!!!Bù !&MĶ2ĖĖB2RĦĶ!MĶ !(ĶĖöĦ !(BĖBĖĖĖy !&BĦ!!!2!Ķ2M=!!!7Ħ!Bù!D!MMĶ!!!ĶĖR!2Ħ!Ķ2 !(ĖBsR!!Ħ !&RöĦBĦ!22!ccB!ĆěĶě2!Ķ!MMM!7Bù!p=M!!2ī!R2R!Ķ2'M2ī !(c2ĖĖ !*BsRR2«!!ĶĶ!ĖcıĖMĆĖ22!!Ķ=M!`` !&ĆĶ!!ĶĶ!ĶĦ!M!ù!!T!!!Ķ!!RR!!B!!R!ĖBööĶĖ!ě!!2!RĖc!Ķ!B!ĆĖě !&22!2!!BĖM!Ėc!2R!Ħ!ĉ!!! µ+ !(ÆĦccBR!!©2ĶĶ!RĆcĖ2!Ć!2-ī!!ĆĶ!ĆĦ!Ć!2!!7 !'Bùµ !&ĶĶ!ĦĦ!!Ħ !'BÆĦĆ!ĦĶ!!C¼ !'ĆcRĦ!2!!Mī!!ĶĶ!!Ħ!ĦR!ĶM !'¼ĉ×!!!Ķ!ööĖ!ĦĦĖĦö !&¶RRĆ22 !&Ì2!!ccĆĶRcĶĦB!ıĦ2ĶĖ!ĦĶccĆĦĖ!!ĶĶ!¼µµ !&ķ#ddd33C×!R!!B!ÖĶĖ!ĖĖĶ!RĖ!¼!ĶĶě!Ħ!ĆRc!!!ĶBBcccRĶ!!Ķcě!!2ùµ××!!!Ķ!cææsææÖsB !'RĦBcBR2!!ĖĶĶ¼!!!7R!!ĖĦ!ěcRĖ!Ķ!ĆĖ2ěcRěM!Ì¼ĉ×!µ!!TĦ!söösöö!!!B !&Ė!ĦĆĦĶ!!Båµµ¤ĉĉ!MĶĶccB!M!!!Ħ2ěcRěM!!M!ùµµ!!!×!×!!!Ėsc!Bs!!!ö!!Ħ!¥BsBs2!!!BĦĦ!D!Ĥù !'Ķ!!!cRěMĶ!M!Ħ!īù!×× !)B2Ħö!öĦĶö!!R !&ĖĦöĦöĖ!!!öBĖĦĦDD!ĉĉ¼!Ķ!ĶĶ!!!MĶ!!īī'ī !,Ķ!!!scĆBc2s !'Ė22R2!RR!!ödķdCCSS¨!!Ķ¼ Ļ&īīùùÌĻī!!××!!T !(Ė !&öĆ!BĆöö !)RĶBRĶ!!!s!2c¶Rc2s!!Ħ! ×' !&×!×!µµ !*ĖĦ!Ķ!BccB!Bcc !'R!ÖĦĖĖĦĶ!!ö2¶cĖcĖR!!DĆ !&µ!!!TĶ!×µ××× !'öĦĦĦR !&ĆĦBĆBĆĆ!!B !&ssRsRĦĶ!R!ĆĖ!Ė!2 !&ææ!!×!×!!Ķ!!×!!!×TĶÖĦĶĦĆ2Ć !&cĦĦc!cc !)ööĖöĖB2!!!RB!Rs2!!ö!sRĶĖĆĦĶ!ĶĶ !&ĖĖĶ!ö!ĦsRBRs!!Ħ!ĆcBĆ22Ć !)cccBcĦ !&Ė2RĖöĶ!DR!ö2Ķ2B!!DĦöæöĖĖĶĖ!Ķs!ĦĖöĦĶö !&sĆ2sö!s!!Ħ!!!2R22R2R!!Ė!RĖĖ2RĖ!!!2s 2'!!Ė!c2Ė2Ħ!!!ö2sRss2s!!Ė!öBĶĶcöö !'BåÕ µ(!s!Ė2RBĶR!!!å µ)!s!ĆBcĦcc!!så µ)!R!cRĦĆĆsc !&",
);
rawImages.push(
  "#cz-ŀ-jjzjz ½-zŀŀ--½½j½½zz½½½j ½( Í'ÝÍÍÝíÝÍÝÝÝÍÍÍ^^^æ!_3!ĊĊĶ!ĶĦ !-p!!2!!!ĦĦĶĶĖĦĦR !( Ķ(222!2B2!!222o!!c!!_!BBĊĊĊú Ċ& !*3ĵ!ú!!!Ķ222ĶĶĖĖĦĖĦ!ĦĦĖĖĦ! Ķ&!!!Ķ !*Cs2!_N>o_o² >& Ħ'!B2_S22úĚúùúĊĚĚùĊĪĚ2BĦĶéĊĚĊ ú'ê!ê!!!ĶĶĶĖ.!]!s!2Ķ!Ķ2BĦ!ĶĶĦĶĶĶ!!Ħ!B2NN !&3 !&3B!NB!!ù3o__NN>ooo!oĶĶĦĶĶÚéùĖ!!!2B222!ĦĶĶ!Ķ2ùùùéé!ĦĦBBĶ>N¡²_oN>_oNNB2 !'ĶBĶĶ!ĶĶ2ĶĶĶĖĦĦĦĥ!Óo!!!s!B!Ķ!Ķ!ĶĶ!ù!3¢¢¢ĶĶ!!!2!BĖĦRB2R!ĶĶ!!!2!p2ĊĚê !'ĶĶĶĦ Ķ&!3ĖĶ!!ĖĖ!!B2ĶĊéùùB!3oĶĦĦ2RB!Ħ!ĶĦ2B2ĦĶĦ!!2B2!!B2_¡N_22B !' Ķ&Ě!!ĶR!ĖĦĦ!!ĦĶĊĥ!2Cú!oĶĶ2cB!Ħ!ĶĶ!!B2!B2BBRB !&ĦĶ!!2!ĶĶĦ!ĶĶĶĦ!!!c!¢ĵĚú!ĦĶ !'ĥ!23!B3!Ķ2RĦĖĦBĦ !*B!ĦĖĖĦĖĶ!B2BĦĶĶ!!ĶĦ !'ĚĉêBĶ¢N2!Ķ2BĦ!Ķ!¢23!B2R!!2!Ķ2!!Ķ!!2Búê!!ĦĖĦĶ!ĶĶĦĶ2BĦĶ!!222BĦĶ!ĶùĵÃ_Ħ2!R!!R!Ħ !&ù3!2!>o!2!RRBĶĦR22BúĶNĶĦĶĖĦ!Ķ!!!ĦĶĦ!!ùĊĊBB !(CĦĶ!!ĶĦ!!ĦB!B2!ù3222!Īúĺ&ĺêĚĚ2Ķ!BRRĕ!!Ħ!Ķ!BĚB2!Ķ!ĦĶĶ!!_¡Ė!!R !(2N!!ĪĶ!s!!!2!¢o__NN_oo¡¡¡o_B2RRBĦ!ĶúĚĪ!BĚ!úĚĪ2BĶ!!ù!ùĖR2ĦĶĦ !'Ķ2!ĺĶĦ!!RBR!!! B'Ħ!ĶĦĦĦĶĶĦB!!º¹!²o>Ķ2Ě!BB!!Ěú!!ù!3Ãc2ĖB2 !'Ċ2Ķ !)RĶĶ2ĶĦ!!ĦĦBÊÊÊ¹¹ĆĦĶ!Ħ©Ķ¢Ã !-oo !(ĶĖ!Ħ2c22pĥ!ĊĪĚ!!ĵ !&Ķ !'Ħ!úÉĵĵĵpp!Ķ2!Ķ!2BĦ!Ķ2!2!!N>No22!!CC2ê!ĶĦ!2!!B2p__NN !(Ħ!ĶB2!!Búĵ!333ĚĪ2!!2!R2úĪĊ2B2Ċ_!ĚĪĚúê!2!!!2BĊĶBĪÚêúĊBRBB!Ķ!!3!!!ĶĶ!!!ĶĦ!!!3o²²¡oĶ2B!Ħ_oo!oRB¡BĪo>No²²!R!_¡o_>&Ī>_o2ĶúúúĚĺ&!!!Č!öĖĖĦ!B2 !&o!ĖĖĦĦ2B2!!ĦĦĦ>ĖĶĶ!!¡BRB!Ķ!!ĶR!!!ĦĶ.>ĶĦĶĦĕĦĦĦłNN_!!ĥö Ķ&Ħ!BB!2!úĶ2RBBB2!Ė Ķ(ĦĶĦ>ĆĖĖĖĦĶĶ22ĦĶĦ!B22B2BúĕC2RR!Ė!!!BĆ!Ķĉĉ!ĶĦ!Ħ!23ĵĊúêúĊ2!ĶĶ ù'!ĶĖĖĶ !&ĶĦĶĶ!B2B22RR!B!ĕC!B¡¡R!!Ė2!!!ĉ!322B!BĦoop___¡o!ĶĖù Ķ&!ùù!!Ķ!!2R2!!!Ķ!RBBB2!!ÉĖ!!B¡!!!R!R!!B!!3_BĶĖ !&B222B!ĶĆĖùĶ2³³2¢¢pĶĶ2ĊùéúĚúúúĊĚĊê Ê&É!ù!22úú!Ė!!Ċ!!d!!!2Ħ!2ĦĦ!!!BRRB!ÉÙĊ?¢!ĶĶ!BBĶ!!Ċĵ3S²²âÂ¡¡o_ooĶĥĕĶ3C!ĦĦĶĶêĺĊĊĶĖ!]!3!!Ķ2!B!!Ħ!2B2ĦÊĦBo!Ķ!ùùC!Ħ!!2ĵ3R¡ĦĆĖöĦ!!2!êĥĦ222Ķ3B!¡¡¡__!!_Ħ!Bo!úùĊĪúúĊĚ!2!!úĵ!3ĆB2!CCBĦé!2!!2¡ĶĦ!!B !)2!!ĥ!BĦĦÚÚ!Ė!!!Ċĵ!RB²o¢²_oo¡¡2!ĶĶ !&B2ù3!B !'2C2Ú! B&ĖĆ !&3223CBĦ!B!!ĦR !&Ķ!!R!BRĶÚÉúÚêêêĶĶ!3!!2!CR¡_>Ķ!!!úBĶĶúúĊêê2B !'3!ĵĶĶ2B!22ĊĊĊ!!!Ķ!!!22ĶÚĵ3!!oNo!!o!B!ĶĚ!_ĦĖĶ!CĪĚ2Ħ_2!2!!!ĪĚúêêĶĵĵ!!ĵĶ!!²_>__>>!!2!!!B!Úĵ!2²oĖĶ!ĶĦĦB3ĵĚNBĦĶRĚĚ B&_Ħ.>>o¡¡²¡¡²¡_`p¢!!!2!ĦĖĶĦĦB!222 !)C¡ĖĶ2R!2Ķ!o²C2ĚĦĪRĊ22!>_>Ħ222B2!ĦĶĶĶĖĶ!!ĖĦp !'2!ĶĶĦB !(ĦĶ !&2!!Ħ !&Ħ!¡2!B_Ċ!!2Ķ!ĆĶB2RcBĦĆ!!!ĦĦ!R2B2ĶpoĦ!Ħ!!!2B!!!3 !'_3ĶêĚĺĪĪ2!2!BĦ!22!Ċ!Ķ2ĶĶĚ2!!ĶĦĦĦ!BBĦĦ !&RĉĊ2ĶĶĵĦ!B!!!B!!2!!!ĦĶ22___>>o¡!ĶRRBc2_o!!Ħ!!o!ĶĺĺĪR!ĦĦ!!Ħ!ĦĦB!!!SĵĊ2!p!Ċúĺ&ĺ!B !'Ķ2ĶB22B2ĪúêĦ2!2!!22!_ĶĶ!Ħ!NN___Ħ!ĶĶĦĖ!ĦĶĶ!ĦĦĦNS!ĊĊĊ !&Ķ!úú2!!!ĖĦĖĦ!BBĊĪąĦĦêÚêÚÚêêúĊúĶĵĶ!ĦĶ!Ħ!ĦĶĶ!!ĶRĦĶ!22B!ĶĶ>oBBB!Ķ!22o_.Ķ2!!ĦĶĶĶĦ!ĊĦąCĥ222!oo >&N23!2ĊĪĚĊê!!!22R!!!2B !'2ĶN¡²B!!!oĶĖB_!2!Ķ!!2ĶĦĶĥĶ2¢N>>>ĖĖĶ!Ķ!Bo²!Ķ!___¡!!!BB!ĦBRB!!2B22Ķ2!ĶĶ²BĶĖÚúĪĊĊ !(Ķ2ĚĕĶ!õÉÉ ù'RBRB!!!_!2ĊĊĊêĊĚĚêêê!ĦĦ!ĦĶ!!!Ķ2Ķ!!ĶĶ 2,!2!22B!!!Ķ!2B!3ÃppĖ!ê!!ĦĦ!B22 !(BBBĪĪB!B222B2!2!Ħ!Ķ_²¡__ooo.!!B2Ķ!!ĦĶ!!22!32êĚĚĚê!êêĊ!!.! 2)Ķ__>_ĊĊ22!!!BB!ĶéÉêúêú!ĶĆĶĆĶ!!!Ķ2BÚĵ2!2!!32¡_¡2 ĥ&NNĶĶ2>! 2)ĦĦĶĦ__ĶĶĶ!!ĦĦéù!3NN_¡22c!B2!!R2 !)232¡ĦĶúĕ!!CCĚĪĺĺ!Ķ>__ >'BB2!ĦĖ2ĶĶĶĦĶé!!3o2ĶĦĦ22ĶĶĦ!2Č!sB!ĵ!!2232!ĦĶ!Ķ!!C2RRB>.!2B22 B'22!ĶĶ2Ķ!ĦĦĶù!!3!ĊĚĪĚĊêêúĊĶĶ!ĥ!!R23!3SSRB!Ċ2!ĥ!!!BN.NB2Ķ !&ú2BBB!Ķ!!!BĖĦĶĶù !&Ò²oN>.>o_>!!!Ħ !(2ĶÂ__B!Ċù!!CRNĦ !'ĶĦĶ!¡!ĶĶĶ !&2!ĪĶĶĶ`pp!!ĶĶúú22!!2 !*2!3!2ÊĊ!.BB3!!!ĖêBB!!Ķ22B2ÊÊÊ ê&úĚĪĚúĦĊĉ Ī& !&Ħ2ĚĚĪú!B2ĪĶB!!!Ķ2!BÂo_!R.ĖĵC!!R¡Ħ!Ħ!!!B2Ê!!_NNo ¡&o!!ĵ! N&ÃĵĶĦ!!²²¡oĶĖB!!C !(ĦºêêĖĖ!ĵCBC!ĖêĊĚ!Ė2B2!!!_!Ķ!!Ķ!!ĶĦĦĵ3CĪĪBBúpĦĶB2ÚêÚÚÚĚĊ!!]!!!22BB¡_N!ĚĚSB>BBBRRNB2ĶĦ22!² !&Ħ!!!ĦĶ!!22oÂR !'222!!!oN!ĶĶ !&Ķ!Ħ !&Ě!22>Ķ>>>..!ĦB2s2!²!!22BB2!Ķ!!_3¡ÂR!ĖúĦéúĊĖĖĖ_oBú2!!Ķ!!!Ė!¡BĖÚĊĚ !'2!Ķ!BBĦB!c !&Ħ!!BĦ!Ķ !(êÊĖĖ !&BB__o!!_RĪ!!ĵ!!Ė!Ķ!¡BR¡__!Ķ.!BB2BĦĦB222ĶĶĦĦĶ!ĶĖĶĦ!!2!!!__N!ĦúĦĵ!oN!2BĦĖ!_ !-¡ĶúĚĚ22ĪĚĦĖ!!BB2!2ĦĦĆĖ Ķ&!!ĶĦĶ!B2!2ĶĶĦĶĦĵĶCÚú2!!BR!!_!Ķ !&ĦĦĖĖĶ¡¡o 2'ĚĪ!ĖĖĦĖ!2!ĦĶéùĉĉĉùùĊúêÚêB2!2!Ķ!NĶCBBBĚĚ Ċ( !&ĖĦ Ķ&ĦĶ!2_ >&2!Ě22!BêÊÊéé2Ķ3 p&oo¡Ò²!!ĶĶ!222¢oooN>N.>__>_ !'Ķ!ùù2ĶĖĖĶ2B!ĶĶ>22ĪĪĚúĶĦĵĶ!ĶC_ĖĖ Ķ&ĦĖBBB2!2BB22!!ĦĶ!Ċ2B!ĦB!!ĵ !&ù!!éùùúÚĶ2BR2!>!oo¡oNĵĶ!p!!ĖRcBB22!ĦĦ2BB2ĶĦ!!ĶĶĦĶ!ĚĶ!Ħ!B!ÚąĦ3!!ù!!!33322êÚê2BRRoB2!Ħ!!!p !(BBRB!!Ķ!!BB2BĦ!22!!2Ķ!ĊĚú!ÚĕĦSB !'dRRR B'! 2&ĦĶĖĶéĶ¢22!ĥĺĶĦĖĦĖ2B!!!2!BBĦĶĶ!!!2BB !&ÚĕBSB2 !&C_>..>.>oo !(Ķ!é!!!2R2!ĵ!!!ĚĚ!!!2!!2!2B22!ĶĶĶĦoB2!!2B3o>!Č !&êĊĚĚĊĚBĶ!22!!Ķ !&22!!ĦÃ2!ĉĚĚ!!ÚÚé¹©ºÊêúĚĺĺB222B!o¡¡¡!!!Ī2!ĥ!!!¡_N_¡²²222 !&ĶĶĦ!2!!Ċ!B!¢p3 !+2!!2¡¡¡!ĪĪĪ!ĊĊ!!!¡C_!Ī!Ć",
);
rawImages.push(
  "#cÍ^M^½½Í½ÍÝ í+ÝÍMM^^íÝ½ÝíÍÍÝíÝ½ í-tíít¦tí¦ttííí±±±æ!_2!ĊĊĶ!ĶĶĶ !,o!!2!!!ĶĦĶĶĦĦĶBĶĶ !+yðð2ĔĤÎĔ2!ððð_!!c!!_!R2ĊĊĊ ú&Ċ !*2Ķ!ê!!!Ķ222ĶĶĦĦĶĖĦ!ĦĦĖĖĦ!!yyĶT!!TĶ !)CĐ2!_>No_o²_NN> Ħ'!B2_B!2ĊĚúúúĊĚĚúĊĪĪ2BĦĶêĊĚ Ċ'<,T_Ķ!!yyyĦ.!°yĐ!2Ķ!Ķ2BĦ!ĶĶĖĶĶĶ!!ĶĶB2__ !&2 !&2B2>2!!ú2o__>>>_ĬĬ!ĬyyiĶĶêêúĖ!!! 2'!ĦĶĶ!ĦBúúúêê!ĶĦB2ĶNN¡²_oN>_oN>22 !'ĶBĶĶ!!y2ĶyĶĦĶĶĶĦ!Âo!!!Đ22!Ķ!Ķ!ĦĦ!ú!2¡¡¡ĶĶ!!!2!BĖĦBB2R!ĶĶ !'o2ĊĚê !'Ķy! Ķ'!2ĦĶ!ðyy!222ĶĊêĊĊR!2oĶĖĖ2BB!Ķ!ĶĦ222ĦĶĦ!!222!!B2_¡N_22B !&ĶĶĦĦĦĚ!!ĶR!yĦĦ!!ĶĶĊĦ!2Bú!oĶĦBcB2ĦĶĶĶ!!22!B2BBRB2!!!ĦĶ!!2!ĶĶĦĶ!y!Ķ!!!s!¡ĶĚĊ!ĦĶ !'Ħ! 2'!ĦBRĶĖĦBĶ !&2!!!B!ĦĖĖĦĦĶ!B22ĦĶĶ!!ĶĶĶ!Ķ!!ĪĚêBĶ¡N!!Ķ2BĦ!Ķ!¡22!!2R!!2!Ķ2!!Ķ!!2BĊĊ!!ĦĖĖĦ! Ķ&!2ĶĶ!! 2&Ķ!!ĶúĶÂ_Ħ2!R!!R!Ħ !&ú2!22N_!B!ÎRBĶĦB22BĊĦ>!ĦĶĖĶ!Ħ!!!ĶĶĶ!!úĊĊBB !(BĦĶ!!ĶĦ!!ĦB!B!!ú 2&!ĚúĚĺĪ_ĊĊ2Ķ2B2ÎĆ!!Ħ!Ħ!2ĪR2!Ķ!ĶĶĶ!!_¡Ė!22 !(2N!!ĪĶ!Đ!!!ð!¡o__NNooļļĊĊĬ_B2ĀÎÞ¾!ĶĊĚĪ!2Ī!ĊĚĪ2BĶ!!ú!úĖR!Ħ2Ħ2 !&Ķ2!ĺ!ĶĶyðBĀ!!!2BBB2Ħ!yi¾¾y!Ħ2!T>Ê!²_>!BĪ!22!2ĪĊ!!ú!2ÂR!Ħ2 !(Ċ2Ķ!!ĶĶ!!yðĶy2ĶĶ!ĶĦĶBÚÚÚÊÊĖĦĶ!iĠĶ¡Â !+2!_N !)Ħ!ĶðĐ!2oĦ!ĊĪĚ!!Ķ !&y !'Ķ!úÊĶĶĶoo!Ķ2!!!2BĦ!Ķ2!22!_>>_ !&BB2ê!ĶĖ!Ĥ!!B2o__NN !'ðy!!22!ĶBúĶ!222Ěĺ2!!2!B!úĪĊ2B!ĊN2ĚĪĚĊĊ22!!!BBĊĦRĪ_<ĊĊBRBB!Ķ!!2 !(2!ĶĶ!!!2¡¡²¡_Ķ22!Ķ_¡o!_BðĬBĺ_>NoĬĬ!2!_¡__>6Ī>__!! ú&Ěĺ!!!ìðXĖĖĦ!B2 !&¡ĶĦĖĦĦ222ĶĶĶĦĦ>ĦĶy!!_BRB!y!!2B!Ķ!ĦĶ.>ĶĦ!ĶĆĦĶĶ>___22ĥXĶĦĦĶĦĶBB!2!êĶ2 B&2 Ķ,y> Ė&Ħ!yð!!ĶĶ!B 2'ĊĖB2BB!ĦĶ!!2Ć!ĦĚĚ!ĶĶ!ĦĶB2ĶĊúúĊĊ!!!Ķ ú'!ĶĦĖĶ !&ĶĦ!y!!2B!!BB2B2ĆB!BļĬB!!ĖĶ2!!Ě!2B22!2Ķ_oo___N_!ĶĦú Ķ&!úú!!Ħ!!2R2!Ķ!!2BðĀÎð!!ÊĖ!!2ļ!!!B2R!!B!!2¡2ĶĦĶ2!! 2&B2ĶĖĦúĶ2²²2¡¡oĦĦBĊúĊĊĚ ú'Ċ<,_ŀÚÊ!ú!2!,,!Ħ2!ĊĶĶd !&Ħ!2ĶĦ!!2BBBð!ÚÚĊ>¡!ĶĶ!BBĦ!!ĊĶ2BĬļHĪ(ļļ___ĦĦĖĶ2B!Ħ2!!<ĺĊĊĶĶĶ°!2!!Ķ2!B!!Ħ!!ĀðyÚĦBo!Ħ!úúB!Ħ!!BĶ2R_yXi{i2!ð!êĦĦ222Ķ2B!ļļĬN_!!_Ķ!2o!êúĊĪĊúĊĪ!ðĔ!ĊĶ!2Ć2B!BBBĦê!B!!2Ĭ!Ħ!!B!!2 !&2!!Ħ!BĦĦŀ,!ĦĶ!!ĊĶ!ĀB¡o¡o__o¡_!!Dy !&2Bú2!B !'2B2<!BBððĖH !& 2&BBĦ22!!yB !&ĶĶyð2BB2ÚÊúÚúú<y!!2!!B!BR¡_>Ķ!!!úBĶĦúúú,<2B !'2!ĶĶĶ 2&!ĊĚĚ!!!Ķ !(ÚĶ2!!oN_!!N!B!ĦĚ!_ĦĖĶ!BĺĚ2Ħ_B 2&!ĪĊ,<ĊĶĶĶ!!ĶĶ!!Ĭ_>_N>>!!2!!yð!ÚĶ!2²oĖĶ!ĶĦĶR2ĶĪNBĦĶRĚĚ222B_ĖĲ.>_ĬĬļĊĊļ__No¡!!!22yĖĶĦĶB!!22 !)B¡ĖĶ2R!!Ķ!N²B2ĚĦĪRĊBB2No>ĖBB2Bð!yĶDDi!!!ĖĖo !'2!ĶĶĦ22 !&ðyĶ !&2!!Ħ !&ĶĶ¡B!B_ĊĶ!ĶĶ!öĶR2RĐðyX!!!yĦ!RB2BĦooĦĶĦ!!!222!!2 !'_2ĶêĚĪĪĪð!2!BĶ!!B!ĊĶ!Ķ!ĶĪB!!ĶĦyy!BðyyĶ!!!RĚĊBĦĶĶĦ!B!!!Ā !(y!!2___>N_Ĭ!222ðĐ!__!!Ķ!!o!ĦĺĺĪR!ĦĦ!!y!ĦĶ2ĶĶ!cĶĊB!o!ĊúĺĺĪ!ð!2!!ð!! 2&B2Ěú<y!2Ā!!ð!!_!Ķ!Ķ!NN___Ħ!ĶĶĦĖ!ĦĶĶ2ĶĶĦ>c!ĊĊĊ!!!Ķ!!<< !&iĦĦĦ2BBĊĊĖĶĦêêú ,&ĊĊĊĦĶĶ!ĦĦ!Ħ!ĦĶĶ!!ĶRĦĶ!2!2!ĶĶ.oRRB!Ķ!!!Ĭ_>!!2! Ķ&Ħ!úĦĦBĦ!222ooNN>>>B2!BĊĺĚĊê!!!22R!!!2B!2!!!2Ķ>_ļB!!2ĬyĦB_2!!Ķ!!2ĶĦĶĦĶB¡_>>.ĖĖĶ!Ķ!2_²!Ħ!___¡!!!BB!ĦBRB!!!222Ķ2!!yļBĶĦ,úĚúú!!2!!!Ķ2ĪĦĶ!æÊÊ ú'B2RB2!Ķ_!2ĊĊĊêĊĚĚêêê!ĦĦ!Ħ !&Ķ2Ķ!Ķ!y2BB 2'!2!2!222Ħ!!Ķ!2B!2ÂooĦ!êĶĶĦĶ!2!2 !(222ĚĪB!B!ð222!2!ĶĶ!_Ĭ___ĬĬĬ>!!22Ķ!2ĶĶ!!22!22êĚĚĚú!úúĊ!!>!! 2)ooN_ĊĊ!ð2!2B2!ĶêÚêú<Ċ!!XyXĶ!!2Ķ22ÚĶ2!2!!22¡_¡B Ħ&NNĶĶ2N 2)!ĦĦĶĦ__!yi!ĶĦĶêú!2NN_Ĭ!!Đ!B22!ð2!2 !'222¡ĦĶĊĆ!!BBĚĪĪĺ!Ķ>NN >'222!ĦĖ!!!ĶĶĶê!!2o2ĶĦyððy!Ħ!!ÜyĐB!Ķ!! 2&!ĦĶ!Ħ!!B2BB2N.!2B2! B'22!ĶĶ2!ĶĦĶĶú!!2!ĊĊĪĪĊ<<ĊĊĶĶ!ĥ!yð!2!2RcRB!Ċ2!Ħ!!!2_>NB2Ķ!Ķ!2Ċ!ĀðĀ !'BĖĶĶĶú !&8¡¡N..>__>!!ĶĦ !(2ĶĊ__B!Ċú!!BB_Ħ !'ĶĶ!!_!iyi !&2!ĺĶĦĦNoo!!y!Ċú22 !,yð!2!B_Ċ!.BB2!!!Ħê22!!Ķ222!ÚÚêêúúúĊĪĺĪĊĖĊĚ ĺ& !&Ė2ĚĚĪĊ!B2ĺ!B!!!y2!BĊ__!R.ĖĶB!!B¡Ķ2ĶĶ!!22Ú!2N_Noo___N!!Ķ!NN>>ÂĶ!Ħ!!ļļĬ_!ĖB!!C !(Ħ>êêĖĖ!ĶBBB!ĦêĊĊ!Ħ222!!!N!Ķ!Ķ!!!ĶĶĖĶ2BĺĺBBĊoĦĶB2<<<êÚĚĊĶ!°!!ðð!BB¡_N!ĚĚRB>B 2&_B2ĶĐĀĀ!² !&ĶĶ!ĶĶĶ!!2B_ĊÎ !)Ķ!!!oN!ĶĶ !&yBĦĶ!!!Ě!22>Ķ> N&!ĦBİĔĔĶ²!! 2' !&_2¡ĊÎ!¾ĊĖêúĊĦĦĦ__Bú2!!Ķ!!ðy!_2ĦÚĊĚ!!2!!2!Ķ!2BĦ2!Ķ!T2!Ħ!!BĶ !*ê_¾¾ !&RR__o!!_RĪ!!Ķ!!y!!!¡BB¡__!Ħ.!B222ĶĦ22!ĤTĶiĦĶ!ĶĖĶĶĶ!2!!!__>!ĦĊĖĶ!_>!2BĦĖ!_ !'ð !'o2úĚĚ22ĺĪĦĦ!2BB2!ð¾iXĖĶĦĦĦ!!ĶĶĶ!B2!2ĶĶĦĶĖĶĶBÚú2!!BR!!_!Ķ!!!Ķ Ħ&Ķ_oo2!!Ķ!Īĺ!ĖĖĦĦ!Ĥ!ĦĶêúĚĚĚúúĊĊĊúêB2!2!Ķ!>Ķ B&ĚĚ Ċ( !&y Ķ)!! N&>!!Ī22!BĊ_Úêê2Ķ2 o'_o(¡!!ĶĶ!22B¡oooN>N.>__>_Ķ !&Ķ!úú2ĶĦĦĶ22!ĶĶ>!!ĪĪĪĊĦĖĶĶ!ĶB_ĖĖĦĦĶĶĦiĀðB2!2BB22!!ĦĶ!Ċ2B!ĦB!!Ķ !&ú!!êúúúê!2BB2!>! _&NĶĶ!_!!ĖRcRR22!Ħi2ðB2ĶĦ!!ĶĶĦĶ!ĚĶ!Ħ!B!ÚĖĦ2!!ú!!! 2'êêê2BBB_Îð!Ħ!!!_ !(2BB2!!!Ĕ2ðB2BĦ!22!!2Ķ!ĊĪĊ!ÚĖĦRB !'B2BB222BB!!ððð¾yĦĶêĶ¡BB!ĦĺĦĖĦĦĦ22!!!Ĕ2ðBĦĶĶ!!!2BR !&ÚĖBRB !'B¡_>>N>N__ !*ê!!!2R2!Ķ!!!ĪĪ!2 !&Ĕ2!B22!ĶĶĶĦ_RB!!2B2o>2Ü !&êĊĚĚĊĚB!!ðð!!y !&22!!ĦÂ2!ĚĪĚĶ!êÚêÊ.>N,ĊĊĪĪB222B! _&!!!Ī2!ĥ!!!¡_N_¡¡¡!!ð !(Ħ!2!!Ċ!B!¡o2 !+2!!!ĊĊĊ!ĪĪĪ!ĊĊ!!!¡B_!Ī!Ć",
);
rawImages.push(
  "#c#Ć#Ħ.Ð Ħ'Ć$uØø¸øøĸSĆĆĆ#ĦĦĆĦĦĦĆe¸¸Ø¸¸øĸSĆ#ĆĦĦ#Ć#Ć#ĆDè¸¸èĈĈèĨS#Ć!d#=2ø^§§Ĉ!dBcĦĆBĆæĶ!!ee#§§ÈuØ!!!ĦR2BB!!!B#§eeC§Søĥd!ĖRRĦööĦ!!ą!!ą!YRRz¥RBt!!!B!!s¶!!B!ÖsÆ2¶c2C!!BĶĖ22ĦĶ!ĦBss¶sscstą!¥!RsRRs!!d!!BBBĺF0ĄĤÄĵA@ôôĔôÄÄ£1¥PÔĤÄĴäĤĤrÖńĔôĔääô£Ņ¥0ĔĔôĔĤĤÄ1Æ@ôR!!Ė!æ!!ą !*BRBRBĦĦĦ !HĆô!!sBs!!d !&Ė!Ķ!¦ĸØèÆĘØTeu ¸(§§§¸§¸ÈÈ ¸(§§u§uueuu§§§¸¸¸c!ĆĴ!2Ć !*¶!!!×Ą´´ĖÔôńĄä´´´ÔÔÔäääÔäÔÄÄ Ô(ääôäôôĄôôäääÔôĔTc!Ć!Ķ!Ė !)Ħ!!ĦÆRĖĶĖĦ22BBB2!ĦĦ22RBjYYIYsB !3ĦĆĔT!ĆĴ2cR!!ĥ!!Ħ!ö !&RRĦĦĶĶ 2'ÆzjIjR!Ķ !&ĭc!BjjsB !/Ħ!B!Ć!2Ħ !'B!¶!!!Ĕ§BR Ķ&!22Bĭ22!ĶĭR¯Ķ!Ķ!!ĭB!!!ĽIs2B2 !+Ħ!B!Ć !,æ!!!ĸÔĶBRĶĶcIIÆc+22B2ĶsĆ!Ķ2Ķ!!!R !&Ľs !(Ķ !'ĔT !&Ė !)c !&ĖĶ!BR¥ýĖ!ýcRl2!2BÝĶ!!Ķ2!!!Ľ !'ĽB !-Ħ!!!Ĵ!¥ !(ss !&ĦĶĦ!Rĝ2ĶĖ!ý!Ħ!22!2!!!2Ķ !3Ķ !&Ħ!B!Ć !&Ħ!!!´µ !&Ķ!!Ķ2;¿2ĶĖĦB!22! 2'Ķ2!|R !+cq!Rqð !(B!Ć !&d !&õ !&2B¥9c2ö22ĶĶÝ!}!22!!2!2!!öĽ !(+!B0!c@¡Ü !'ĔT!!Ĵ !(ĦĦĦ !'2ýĶýc2¯!!!ĶBĥ !&BĶ2 !,+ĽI!!!B!!Ķ !'Ħ!B!Ć !(Bee !&2Ė;!ĶýcĆ22Ķ!Í!Ķ!ĶĶB2Ķ!!|Ľ !'+Ľ!!Iĸ!m!ÌĖ !'Ħ!B!Ć!2 !&C!c !'ĖĆ!!!ýc¯22Ķ!Ħ!Ķ222Ķ2!!ö !'+Ľ !&Ć!ê!@qqR !&ĔT!!B!!R!!ĥBs !'2Ė+ĶĶ!CĦB2BĶĦĦ!ĶĶS2Ķ!!Ľ !&+Ľ !,¡¡@ !&Ħ!B!Ĕ¤ !(ö !'2!Ė!!!Üd2ĦĖBĝĆöĆĶ¼Ķ2![ !&+Ľ !'ğ !&¡yyø !&Ħ!B!Ć!B!B!!!s !(2Ė+Ķ!!ì!scĖ!cRBĦĶ2Ķ!č!!!+Ľ !'ğĦ !&y!!jc !&ĔT!ĆĦ!!C!!!ö !)2Ė!öĆ!!!Bc !&RĶĶ !'+Ľ !'ğĦ!c!¡!R!c!c !&Ħ!B!Õ !(s !(2!Ķ!RcĶ !)2!ĖĶ !&+Ľ !&ğ!IĽ!0!!!À!c!čc!!!Ħ!B!Ć !(ö !++!Ħ!ĶĶĶ!BB2!!RĖ!!![Ľ!!!;ğI!!ssĿ¡Ü!êcč!!c !&ĔT!Ć!!R!!!¥ !+Ķ !&ğĶ2 !'22!![č!!!+ĆI !&Ľ!!Ćøøc!!!č !&Ħ!!!ĦB!!Ħ!æ !+Ė;!Ħğ92Ķ!Ķ !&R!!č !&ĽR !)ã!!cč !*Ħ!B!Õ!B!!!c !)2!!Ħ!lĖ+Ķ2Ķ !/+Ľ !,) !&; !(B!Ć !'Ć !,ĖďÆ!öÿį !0Ľ !*+!j !&;æ !'ĔT!Ć !'c !)jjs!!!sj!B!!![;Ŀ[Ŀ[Ŀ[ !.öj !'æcj¥!!!Ħ!B !(Ć !)+!ĽjjjĽ!jĭ !&ýýÝýÝcĆ !++!!j !'Ŀj)!ĭ¥!!Ħ!B!µ !&¥ !)R !.ĦĦB!BĦÝ![ !*Ľ !*) !&ĭ¥!!ĔT!Ć!!B!æ !)č !.ĶB!!!ïÏcĆ !9ĭ¥!Ħ!!Ć !&¥ !;½½ !Fæ !*Ŀ !-2Ħ!!!Ħ!Ćc !9;æ!B!!c !&Ķ !*) !-BBĦ!ĦB¯!č !*+ !*Ŀ !&;æ!!TĔ!c !&c !))))įÿÿ+!ÿ; !&ll¯l¯Ćc !+Ľ!!ÿ !')ÿĿ!;æ!!B!Ħ!·!!!sc !)Ķ!ĨĖ!!öÿ!Ħ22!čĭ)č)č)č !.sÿ !'¥Ćÿæ!!!B!Ħ!B!!!´Å !)ĦĶĖRYÆ!sz9!!2!!Ķ!Ķ!Ķ !&+ !*Ľ!ÿ !&ĭ¥ !'TĔ!c !&Cõ !)ĨĖ!RĶĝR) !(Ķ2Ķ2Ķ2!Ķ!!Ľ+ !,Ŀ !&ĭ !(Ħ!c !&ąC !*ĸRč!!Iğ !&ĶĶ!ĶĦĶ2[Ķ2!!+Ė !)¨!!Ć[ !*B!Ħ!×!!!ĦeC !+R!2!!I !*Ķ2Ķýl!!!Ľcğ !&+!!cqqĆ!!![ !&B!!c !(s !+č22!!2!!!ĶĶ!!ĖRĶ!2č+!!!ĭIğ!!öö)ê°!¡Ć[!!Ć !&TĔ!c!Ħ !&Ć !)ĶR!ĖĖ!2!!!ĶĶ!!!R !'Ľ+ !&I!ğ+!ĸ!!!Ì!Ć![Ć!!!B!Ħ!D!!Ħ!!!B !*R2cc!!ĶĦĆ !&Ė!!!2!2!)+ !'IB!Ć!ê!Ė!Ć!Ć !&B!Ħ !&Ė!!2Ħ !(Ķcč!!!°!ĦĦBĶĆĆĖR!!2![Ķ2Ķ)+ !'IB !&ð!!ÿĆ !&TĔ!c!Ħ !'B !)R22!°ĥĶBR!lccR!l222ĝ2!2Ķ)+ !'I !&êððq !&B!Ħ!c2B !.cč2!2ĥ!!!ĶĶĦ!!!2!2!!!Ŀ!!2ĶĽ+ !,êêĨ !&B!Ħ!T!!!ĥ!B!Ħ !'RR2!!lĆýĶĦĶ!Ė!!22B !&sĶ!Ķ2!Ľ+ !&c!¡!ĨøøĖ !&TĔ!!b¤ !(Æ !&Ķĭč2!|öcĶĶĶ!| 2&!2 !&ý+!2Ķ!!Ľ+!!ğ0!ü!ÀR !'B!Ħ!c!ĦĦ!Ħ!!!Æ !'lB!|öRí Ķ&öc!2!!3 !(ĶĶĶ!Ķ!Ľ+ğ!!!Ħ!!2 !'B!Ħ!c!!!Ė!!!2¶!!!Ć!ÖğğÆ!ÝĦĶĶ!¯2č2!22ĵ2 !&s+Ķ!Ķ!Ķ!Ľ!Ħĸ!ĆĨê° !'TĔ!!4çç !&C!Ö!!!Ħ!2Ķ!!Ľ2!Ķ!!ĆB222!!ĶĶ!!!ĶíĖ !&2 !&Ćè!Ėøy !(Ħ!c!!B!ĥ !&B!!!å!2!!!;!Ķ!!¯Bc2 !&Ħ!ĶĶĶ !)ĶĶ !/B!Ħ!c !+Ħ!!!Cs!2!Ķö[!!¯Ćcč !&[ĦĶĶ!!ĶĶ!;!!!22+Ħ!Ķ!Ķ !)2!!!4!!Ķ!Ħ!!ĥ!¥!!!´¸!!ĶĦĦö+;ö !'ĶĶöcĶ!ĦĦĶ!!Ė222!+ö !.eĄ!c!!æ!!B!!!2Ć!!!¸ÔcĶĖ!B 2&ĶĆĶĶĖĦĿĖÍĶĶĶ!2KĦ!!!+ğö !&Ķ !)B!Ķ!c!!¥ !'Ħ!B !&2ĆĖ2BBB2ĶĶ!ĆďÿğįĖ!ĶĶ!2BKĆ2!įğĖĶ!!!Ķ!!!Ķ !'B!Ħ!4!!æ !)R!!B!ĖĖ¥¶R2ĶĶ!ĶĦĶĶ!!ĶĶĦğďďďÿæĦ !3BcTĔ!c!!Ħc!B!!!B!Ö!22ÔÇu¸B¸¸eeeu §' u&§u§§ ¸(§¸È¸¸§§§u§¸¸¸uTĔĦ!c!!ĆĆ!!2!!!2s!!Ķöå@Ôö´£äää Ô(ääôôäôää Ô(äÔÄÔÔäääôä Ô'ĆĦc4!Ħcc!!3 !&ö!!!¥2ĶĦĦ Ķ' !Fcu!!BBĆ!!ĵ !&cĢĒuee¸ķ#È Ø(ø33 Ø&èøèè33ØÈ¸§¸¸ÈØ33èèøèèØØø33Øu!!ĶæĶs!!Ķ!!!RÏ!ĔþBB!!Ħ !)Ħ!Ħ! B)!Ħ !+Ħ! B(!!Ħ!!!ĦĶcöö!Ħ!!!C´XceíbbbĦ!sÆöĖĖĆĦBĦ!¤ b)Ħ!¶æĦĦĆĦĦBĦ!¤ b)Ħ!¶Ħ2ĦĆĆ¶c !&",
);
rawImages.push(
  "#c##tS_İ S'#uÈøĘØĘĘĨt###tSS#SSS#¸ØØøØØĘĨt#t#SSt#t#t#¸ĈØØĈĨĨĈĨttĦ!sħ-2¸<··×!s!RĦĆBĆöĶ!!dt#CCtC¦!!!ĶR2BB!!!RķdCC#t#×Ħs!ĖRRĦööĦ!!ö!!ö!8!2jBĶBB!!!B!!s¥2!R!¥RÖRÆc2B!!2ĶĖ22Ħ!!Ė!sc¥cccsBö!s!BcRRc!!s!!R!RFºPĔĴÔŅŅ@ĄĄĤĄÔÔÔAbPĄĴÔĴäĤĄ1rĤĔôĤôôĄäQÅaĴĤĄĤĤĤÔAµ0Ą@22Ė!ö!!ö !*RcBRBĦĦĦ !GĶĖĆ!!¥Bs!!s!!!cĆ!Ħ!øĸ§¸ćè§$4e ¸-§¸§¸¸§¸§ ¸2s!ĖĴ!!Ć !*¶!!!côääõĔĤPĴô´´´ Ô*äÔäÔÔäÔä Ô0ôĤDs!Ć!ĶsĖ !)Ħ!!ĖcRĖĶöĖ22BBB2!ĦĦ!BBBħħħķķ÷c22 !*Ķ !(ĦöĤD!ĦĴ2!R!!Ħ!!Ė!ö !&sRĦĦĶĶ 2'÷ħzYçs!Ħ !&s·!Bćć¶B!!!Ķ2 !*Ė!BĶĆ!!Ħ !'R!¶!!!b4RR Ķ&!22BsBÐ!¼ts!Ħ !&RBRBB·ç¥!Ķ2Ķ !*Ħ!R!Ħ!ĶR !)æ!!!÷ĔĦRRĶĶR)ćç·Õ2BàÐ¼tĖ !'B!B!!!Bt¥2Ķ2 !+ĤD!Ķ!2!2 !(c !&ĆĶ!RRsýĦiRRCĖ!2Bà!ĥ !)t !&Bt22Ķ !+Ė!!!Ĵ !*Bs !&ĦĶĖ!sč!ĶĦiRRĖ22!22 !)RB !'B!Ķ !,Ħ!B!Ć!!!ĤĖ!!!åµ !&Ķ!!ĦC|Ā2Ķ!iBRĶ!222CB !&ĦB !(Ħ!!s}!R}À !(R!Ħ !&s !&Ħ !&2B·÷RCõð2Ķ!Ķ!Ħ!!!2!2 !&Ėt !'Ħõ!B,dsLdĜ !'ĤD!ĶĴ !&2!ĖĖĖ !'BìĦRRC!B!!«2 !'RĶ !'B !'õ·s!!ĥd!!Ħ !'Ė!B!Ć !(Rdd !&2Ć[¼ĶRRĖÐ2Ķ!«!Ķ!!Ķ!2!!!ĦR !'Õ·!·sļĦ,!ÛĖ !'Ħ!R!Ħ !(B!R !'Ėæ!Ķ!BR!Ð2Ķ!Ė!Ķ!22Ķ!!!ĖB !&Õ·!!!tö!õĶLÀáR !&ĤD!Ķ !(Ħ!c !'2Ė;ĶĶ2!ĖBààĶ!Ħ!!Ķ!2!!Ħs !&Õ· !(Ķ!2!Ħĥ± !&Ė!B!Ĵ`!!3!!!Ć !'2!Ć¼ĶĶBR!yiðRHyiĶBĶ !)Õ· !&Ħ¤!!2BdìÌª !&Ħ!R!ĆTT !&2c !(2Ė;Ķ!2B2ĐĠXBĠàà«Ķ2!!B!!!Õ· !'¤Ħ!2!CÛ!!¶R !&ĤD!Ħ !)Ć !)2Ć!Hi2!!!ĠĶB!2àĶĶ !'ö· !'bĦ!s!2!!!s·×B!!!Ė!BĶÅ !(c !(2!Ķ¼Āð!!!2!2Ķ2Ķ2«Ķ !&ös !&b!ć)!n!Sĵ±!·!BR!!!Ħ!R!Ć !(Ć !+;!ĦĶ !'2Ķ2!à«!!!Ħs!!!öbć!!Ġ¶iBûĖĵsB!!· !&ĤD!Ħ!2!!!Bs !+Ħ¼!!!bĶ22Ķ2Ķ!2!!!ĦB!!!ÕÕć !&·!Cöì¼·!!!B !&Ė!!Ķ !&Ė!ö !+Ė[¼Ħb÷2Ķ!2Ķ2!!ð!!B !&·s !)i!!sB!!!ö !&Ħ!B!Å !'R !)2!!Ć!ĖĖÕĶ2Ķ!2 !-Õ· !,× !&ą !(R!Ć !'Ė !,Ėďµ!ÖA¤ !0· !*Õ!¶ !&µö !'ĤD!Ħ !&2R !)ħħ¶!!!¶ħ!d!!!ööµĦÕĦöĦ !.Ö¶· !&ös¶ !&Ė!BĶ !'Ė !)Õ!·ħħħ·!ħs !&ìý¼·¼RĖ !+Õ!!ħ· !&µħ×·¶!!!Ħ!R!Å !&s !)C !/ĖR!yĖ¼BĦ !*· !*×!!!·¶!!!ĤD!Ć!!R!ö !)s !.ĥR!!!Ġð2Ķ !8·¶!!Ė!!Ħ !&s !;yy !Fö !*µ !-CĖ!!!Ė!Ķ2 !8ÕÖ!!R!!B !&Ħ !*× !.RĖ!ðRÐĦB !*Õ !*µ!!!ÕÖ!!!DĤ!c !&c !)ĀĀĀrAAÕ!Aö !&}lÐÕÐĖR !+·!!AÕ !&×AµÕÖ!!!B!Ė!Ç!!!2c !)ĥ!ÛĖ!!ÖA!ą22!ss×B·BsB !.¶ÖÕ !&söÖ !&R!Ħ2 !&åÅ !)ĖĥĖRć×!¶ķç!!2!!!Ķ!Ķ !'Õ !*·!Ö !&×s !'DĤ!B !&BĦ !)ĜĖ!¦¼cRÇ !)Ķ2Ķ2 !'·Õ !,µ !&d !(Ė!c !&öB !)ĦüRì!!÷b !&Ķ!Ķ2i!Ķ!Ķ!!!Õöö !(Ā!!öĦ!!!s !&B!Ħ2Ç!!!ĖSħ !+¦!Ð2!ć !'Ķ!ĶĶ!2Ķ2!!!··Õö!!!Õ!ĕs}ÀÕ!!!Ħ !&R!!B !(¥ !+ìÐB!2 !&ĶĶ!!iĀ!Ķ2Ķö!!!sćÕö!HÖÏĶnBCöĦ!!Õ !&DĤ!c !(Ć !)ĶR!iy2 !&ĶĶ!!ĶðĶ!2Ķ2sö !&ć!bĿ!Ĭ!ĥCÛ!Õ!Ħö!!!B!Ė!$ !(R !*¦ÐĠĀ!!!ĖXĶ!!Ķy!22Ķ2!!sÕ !&s·B!öĶĶ!!!ö!Õ !&R!Ħ2!!Ķĵ!!BĖ !(Ķcì!!!Ķ!Ė«àĶ8Xyð22Ķ2 !&·Õ !&s·B!!Ħĥ±!!Aö !&DĤ!B !)R !)¦ÐB!ĶĦ!RĀ!ĖĠĀð22Ķ2 !(·Õ !&s·!!!Ėą}Àá !&B!Ė!c !0cìB!2Ħ!!!Ķ¼!!!22!B!!!ö !&·Õ !&s!2B!22CÛ !&R!Ħ!$ !'R!Ė !'R¦Ð!!ĖĖRĶĦ«!å 2&Ķ !&sĦ !&·Õ!!!ös!S22ÜªĖ !&DĤ!2ppĶ!Ķ!!!Æ !&ĶĽìB!ĦõRĶĶ«!}B!22 !)õ !'·Õ!öÕ<Bļ2CR !'B!Ė!B!T !'BÆ!!!Ħ!°ð!ĦõCBĶ«ĶĶåd22 !+Ħ !'·ÕÕ!!Są2!B !'R!Ħ!c!!!ö !&¶!!!Ė!¤bb¤!ÜyyĦ!°Bs2 !+tõ !(·!ĦĬĕöüĥn !'DĤ!24ĉ×!R!!B!Ö!!!Ķ!2Ķ!!·2ĦĦ!!ąd2 !&Ķ !'BĦ !+öÌ!ĖÌª !(Ė!B!!Ķ !(R!!!ö!2!!!ÕĖĶ22°dR !.ĖĦ !'Ħ !.B!Ħ!c !&B !&Ė!!!B¥!2!Ķæ¯!2°ąRR !&ĖĖĶ !(õ !&ĦõĦ !-2!!24 !&ö!!Ħ!¥!!!´T!!ĶĦĦæ;+å !)õRĦ !&Ħ!Ħ!!!ĦõÖ !.eĄ!B !'R !&Ė!!!TĔ¥ĶĖ!B22BBĦĖ!!ĖĖÅö¼¼!!!ĦĖĦĖĦĦÕ¤Ö !.B!Ķ!c!ĶĶ !'Ė22 !&BæĖ2BBRBĦĦ!ÕQAr¤ö!ĶĶ!!ĦĖÕ!ĦbbÖĦ !/R!Ħ24!2ö !)R!!R!öĖ¶çcBĦĦ!ĶĦĶĶ!!ĶĶĦğğAAbµĦ !3BsDĤ!B!!Ħc !'R!Ö!BBĔøuTRTTeeeu §) ¸;uDĤĖ2c!!ĆĆ!!B !&s!!ĦæÄaĔµäÔäää ÔEöĦB4!Ħcc !)ö!!!ÆBĦĖĦ Ķ' !E2Rc!!22Ć !)cĂÒT44Dåõ¸ È)ąą È*ąą È*ąą È*ąą¸u4!!ö!s!!Ħ!!!2ð!£;ĶĶ!!DĖ !*DĖ !*TĖ !*DĖ !*DĖ!!!Ħcöö !'Bå7RèiµµµD!ÖÖöĖĖĆĦĶD!Õ ¤)DĶöæĦĦĆĦĦĶD!Õ ¤)D!öĦĶĆĆĆsc !&",
);
rawImages.push(
  "!c#ĥ!Ħ !QB !-C#µ!Ķ2Ķ !,2Ķ2 !-2Ķ2Ķ2Ķ2Ķ2Ķ2Ķ2 !52·#µ!{ÇIĶ!!!®Ç9!!2Ķ®ÇI !&ßs92Ķ2ĶßsIĶ2Ķ2ÏsI !&ď2I !&ď2I!!2Ķď2YĶÇ#µ!ĞÆÞ !&ĮÆÞ!!!2ĞÆî !&Į÷¬!2Ķ2Įç¬2Ķ2Ķľç½ !&:÷Y !&:÷Y !&kÇY2·#µĶ2Ķ !,2Ķ2 !)2Ķ2Ķ2Ķ2Ķ2Ķ2!!!}ì !.2Ķ2Ķ2Ķ2Ķ2ĶÇ#µ!Ķ2Ķ !*2Ķ2 !+2Ķ2Ķ2Ķ2Ķ2Ķ2ĶİVÃ» !02Ķ2Ķ2Ķ2·#µĶ2Ķ !*2Ķ2 !)2Ķ2Ķ2Ķ2Ķ2Ķ2 !&ĠFÓûĆ !*2Ķ2Ķ2Ķ2Ķ2!!!·#¤2Ķ !*2Ķ2 !-2Ķ2Ķ2Ķ2Ķ2Ķ2!ĠFÓûĦĦ !,2Ķ2Ķ2Ķ2Ķ2·#µĶ2Ķ !*2Ķ2 !'2Ķ2Ķ2Ķ2Ķ2Ķ2 !(ĠFÓ¦!VĦ !&2Ķ2Ķ2Ķ2Ķ2 !'·#¤2Ķ !*2Ķ2 !+2Ķ2Ķ2Ķ2Ķ2Ķ2!!!ĠFÓSÕç6 !)2Ķ2Ķ2Ķ2Ķ2!!·#µĶ !*2Ķ2 !'2Ķ2Ķ2Ķ2Ķ2Ķ2 !*ĠFÓt!F!!!2Ķ2Ķ2Ķ2Ķ2 !)·#¤ !*2Ķ2 !+2Ķ2Ķ2Ķ2Ķ2Ķ2 !'ĠFÓûĆ !)2Ķ2Ķ2Ķ2 !(·#¤ !)2Ķ2 !)2Ķ2Ķ2Ķ2Ķ2 !,ĠFÓûĆ!!2Ķ2Ķ2Ķ2 !-·#¤ !*2Ķ2 !)2Ķ2Ķ2Ķ2Ķ2Ķ2 !)ĠFÓûĆ!!!2Ķ2Ķ2Ķ2Ķ2 !*·#¤ !)2Ķ2 !'2Ķ2Ķ2Ķ2Ķ2 !.ĠFÓěæ2Ķ2Ķ2Ķ2 !/·#¤ !(2Ķ2 !)2Ķ2Ķ2Ķ2Ķ2Ķ2 !+ĠFÓěæ!2Ķ2Ķ2Ķ2Ķ2 !,·#¤ !'2Ķ2 !'2Ķ2Ķ2Ķ2Ķ2 !0Ġg³ěæ2Ķ2Ķ2 !1·#¤ !&2Ķ2 !+2Ķ2Ķ2Ķ2Ķ2 !-Ġg³ěöĶ2Ķ2Ķ2Ķ2 !.·#¤!!!2Ķ2 !'2Ķ2Ķ2Ķ2Ķ2 !12Đg³ěæ2Ķ2 !3·#¤ !&2Ķ2 !)2Ķ2Ķ2Ķ2Ķ2 !/Ġg³ěöĶ2Ķ2Ķ2 !0·#¤!!!2Ķ2!!!2Ķ2Ķ2Ķ2Ķ2 !12Ķ2Đg³ěæ2 !5·#¤!!2Ķ2 !)2Ķ2Ķ2Ķ2Ķ2 !1ŀF³ěöĶ2 !4·#¤!2Ķ2 !'2Ķ2Ķ2Ķ2 !12Ķ2Ķ2İF³ěö !22Ķ2Ķ·#¤2Ķ2 !)2Ķ2Ķ2Ķ2Ķ2 !12ĶŀF³ěö !6·#¤!2Ķ2!!!2Ķ2Ķ2Ķ2 !12Ķ2Ķ2Ķ2İF³ěö !02Ķ2Ķ2Ķ·#¤2Ķ2 !'2Ķ2Ķ2Ķ2Ķ2 !12Ķ2ĶŀFÓûö !32Ķ2¦#µĶ2!!!2Ķ2Ķ2Ķ2 !12Ķ2Ķ2Ķ2!!İFÓûö !,2Ķ2Ķ2Ķ2Ķ2Ķ·#¤2 !)2Ķ2Ķ2Ķ2 !/2Ķ2Ķ2Ķ2ĶŀFÓûö !/2Ķ2Ķ2Ķ2¦#µ!!!2Ķ2Ķ2Ķ2 !12Ķ2Ķ2Ķ2 !&İFÓûö !(2Ķ2Ķ2Ķ2Ķ2Ķ2Ķ2Ķ·#¤2 !'2Ķ2Ķ2Ķ2 !/2Ķ2Ķ2Ķ2!!!İFÓû!ö !,2Ķ2Ķ2Ķ2Ķ2¦#µ!2Ķ2Ķ2Ķ2 !/2Ķ2Ķ2Ķ2Ķ2 !(İFÓd!ºö!!2Ķ2Ķ2Ķ2Ķ2Ķ2Ķ2!!!¦#µ !&2Ķ2Ķ2Ķ2 !/2Ķ2Ķ2Ķ2 !'İVÃ3ÕçF !'2Ķ2Ķ2Ķ2Ķ2Ķ2Ķ2¦#µ!2Ķ2Ķ2 !/2Ķ2Ķ2Ķ2 !,İVÃS!V!2Ķ2Ķ2Ķ2Ķ2Ķ2 !)¦#µ!!2Ķ2Ķ2Ķ2 !/2Ķ2Ķ2Ķ2 !)İVÃûö!!!2Ķ2Ķ2Ķ2Ķ2Ķ2Ķ2 !&¦#ÅĶ2Ķ2 !/2Ķ2Ķ2Ķ2 !.İVÃûö2Ķ2Ķ2Ķ2Ķ2 !-¦#µ2Ķ2Ķ2Ķ2 !/2Ķ2Ķ2Ķ2 !+İVÃĜÕ!2Ķ2Ķ2Ķ2Ķ2Ķ2Ķ2 !(¦#ÅĶ2 !/2Ķ2Ķ2Ķ2 !/2ĠVÃĜÕ2Ķ2Ķ2Ķ2 !/¦#µ2Ķ2Ķ2 !/2Ķ2Ķ2Ķ2 !-ŀFÃĜåĶ2Ķ2Ķ2Ķ2Ķ2 !,¦#Å !/2Ķ2Ķ2Ķ2 !-2Ķ2Ķ2İFÃĜÕ2Ķ2 !3¦#µ2Ķ2 !-2Ķ2Ķ2Ķ2 !1ŀFÃĜåĶ2Ķ2Ķ2 !0¦#Å !-2Ķ2Ķ2 !/2Ķ2Ķ2Ķ2İFÃĜå !6¦#µ2 !-2Ķ2Ķ2Ķ2 !/2Ķ2ĶŀFÃĜåĶ2 !4¦#Å !)2Ķ2Ķ2Ķ2 !-2Ķ2Ķ2Ķ2Ķ2Ķ2İFÃĜå !6¦#Å !,2Ķ2Ķ2Ķ2 !-2Ķ2Ķ2Ķ2ĶŀFÃĜå !4Ķ2¦#Å !'2Ķ2Ķ2Ķ2 !-2Ķ2Ķ2Ķ2Ķ2Ķ2!!İFÃĜå !6¦#Å !*2Ķ2Ķ2Ķ2 !-2Ķ2Ķ2Ķ2Ķ2ĶŀFÃĜå !.Ķ2Ķ2Ķ2Ķ2¦#Å!!!2Ķ2Ķ2Ķ2 !+2Ķ2Ķ2Ķ2Ķ2Ķ2 !(İFÃĜå !3Ķ2Ķ·#Å !(2Ķ2Ķ2Ķ2 !+2Ķ2Ķ2Ķ2Ķ2Ķ2!!!İFÃĜå !*Ķ2Ķ2Ķ2Ķ2Ķ2Ķ2¦Sr!2Ķ2Ķ2Ķ2 !)2Ķ2Ķ2Ķ2Ķ2Ķ2Ķ2 !*İFÃĜå !/Ķ2Ķ2Ķ2Ķ·Sr !&2Ķ2Ķ2 !+2Ķ2Ķ2Ķ2Ķ2Ķ2Ķ2 !'İFÃĜå!!Ķ2Ķ2Ķ2Ķ2Ķ2Ķ2Ķ2Ķ2Ķ!·S¤Ķ2Ķ2 !+2Ķ2Ķ2Ķ2Ķ2Ķ2 !.İFÃĜå !)Ķ2Ķ2Ķ2Ķ2Ķ2Ķ2Ķ·Sr!!2Ķ2Ķ2 !+2Ķ2Ķ2Ķ2Ķ2Ķ2 !+İFÃĜåĶ2Ķ2Ķ2Ķ2Ķ2Ķ2Ķ2Ķ2Ķ2Ķ!·S¤Ķ2 !)2Ķ2Ķ2Ķ2Ķ2Ķ2 !2İFÃĜĥĆ!!Ķ2Ķ2Ķ2Ķ2Ķ2Ķ2Ķ2Ķ2Ķ·Sr2Ķ2Ķ2 !)2Ķ2Ķ2Ķ2Ķ2Ķ2 !,Ķ2ĶŀFÃd!ºĆĶ2Ķ2Ķ2Ķ2Ķ2Ķ !)·S¤ !)2Ķ2Ķ2Ķ2Ķ2Ķ2 !4İFÃ3ÕçF2Ķ2Ķ2Ķ2Ķ2Ķ2Ķ2Ķ2Ķ2Ķ·Sr2Ķ2 !)2Ķ2Ķ2Ķ2Ķ2Ķ2 !(Ķ2Ķ2Ķ2Ķ2Ķŀ6³t!g!Ķ2Ķ2Ķ !/·S¤!!!2Ķ2Ķ2Ķ2Ķ2Ķ2 !4Ķ2Ķ2ĠF³ļå!Ķ2Ķ2Ķ2Ķ2Ķ2Ķ2Ķ !(·Sr2 !'2Ķ2Ķ2Ķ2Ķ2Ķ2 !(Ķ2Ķ2Ķ2Ķ2Ķ2Ķ2ĶİF³ěĆĶ !5·SµĶ2Ķ2Ķ2Ķ2Ķ2 !4Ķ2Ķ2Ķ2Ķ2Ġ2Çěö2Ķ2Ķ2Ķ2Ķ !.·S¤!!2Ķ2Ķ2Ķ2Ķ2Ķ2 !&Ķ2Ķ2Ķ2Ķ2Ķ2Ķ2Ķ2Ķ2Ķ!!RĀiĦĶ !6·SµĶÿ2jĶ2!!ï2j !&ï2j !&ï2Y2Ķ2Ķÿ2jĶ2Ķ2ï2j!Ķ!!ÿ2Y !&ÿ2Y !&ÿ2Y!·S¤2JÇj2Ķ2Ķ¿czĶ2Ķ2¯cj2Ķ2ĶZÇzĶ!!!ZÇj !&*÷j !&*÷j !&*÷j !&*÷j!·SµĶ2Ķ2 !0Ķ2Ķ2Ķ2Ķ2Ķ2Ķ2Ķ2Ķ2Ķ !<·S !?Ė !C",
);
rawImages.push(
  "#c#ĦĦ ĆR Ħ.#!ÖÖæöæö æ+öæ ö* Ć2ĖĆĖĆĖĆĖĆĖ ö. !&®ğ2Ķ!!!®į!!!2Ķ®ğ !&2ßįĶ !&Ïğ !&2Ïğ!2Ķ2Ķďď2!2!!ÿď !'ÿď !(ÆÅĶ2!!!ÆÅ!!2Ķ2ÆÅ!!!2Ķrö2 !&¤ö !&Ķ¤ö2Ķ2Ķ2rĶĶ !&rĶ !'ÅĶ !'ĶJÞ22BBBZþBRBR!Jî!!2Ķ2:½Ķ !&:½!!2!2:ÍĶ2Ķ2Ķľj2 !&ľj !'Ďj2 !&2Ķ2sc¥¥ Ç&çç !'2Ķ2Ķ2Ķ2 !*Ķ!Ķ2Ķ2Ķ2Ķ2Ķ!Ķ !/Ķ !&Ķ2Ķ!Ćöö Õ&¤ !(Ķ2Ķ2Ķ2 !+2!2Ķ2Ķ2Ķ2Ķ2!2 !-2!2!!!Ķ2Ķ2!Ė Ħ( !)2Ķ2Ķ2 !,Ķ2Ķ2Ķ2Ķ2Ķ2Ķ !/Ķ!Ķ!!!2Ķ2Ķ!!!×¶¶s !)2Ķ2Ķ2 !+2!2Ķ2Ķ2Ķ2Ķ2!2 !-2!2!2!!!Ķ2Ķ !&µÖÖö!!Ė!!!2Ķ2Ķ2 !,Ķ2Ķ2Ķ2Ķ2Ķ2Ķ !/Ķ!Ķ!Ķ2!!2Ķ !'×¶¶s !'2Ķ2Ķs¥¥¥÷Ç÷ ¥(s¥çÇç¥s¥!2 !-2!2!2!2Ķ!!Ķ2!!Ħ!ĶµÖÖö !'Ķ2Ķ2!ÖÖÆQ¤QÖÆ Ö(bµbÖÖ !0Ķ!Ķ!Ķ2Ķ2!!2Ķ !'×¶¶s !'2Ķ2Ķ!!ĶĢccĢĢ2 !,2 !.2!2!2!2Ķ2Ķ!!Ķ2!!!Ķ!µÖÖö !&2Ķ2Ķ2Ħ!!©!â2º !*2!2Ķ !.Ķ!Ķ2Ķ2Ķ2Ķ2!!2Ķ !'×¶¶s !&Ķ2Ķ2!!Ķ!!â2º !*2Ķ2Ķ2 !,2!2!2Ķ2Ķ2Ķ2Ķ!!Ķ !(¤ÖÖö !&2Ķ2 !'â2º!Ò!!!BB!2Ķ2!2 !-Ķ!Ķ2Ķ2Ķ2Ķ2Ķ2!!2 !(ç¶¶s!!ĥ!Ķ2Ķ !&22º!Ò2!!×ć!2Ķ2 !.2!2!2Ķ2Ķ2Ķ2Ķ2Ķ!!Ķ!!!Ķ!!¤ÆÖö !&2Ķ2!!!2Ķº!Ò2Ê!!ąöĶĶ2 !/Ķ!Ķ2Ķ2Ķ2Ķ2Ķ2Ķ2 !+çÆ¶s !&Ķ2 !&Ķ2ööF6Ö!!öÅĶ2 !.2!2!2Ķ2Ķ2Ķ2Ķ2Ķ2 !,¤ÆÆö !&2 !'c R(ssscs c&¥¥¥ !(Ķ!Ķ2Ķ2Ķ2Ķ2Ķ2Ķ2Ķ !*Ķ!çÆÆs !*B!ĦĦĦĶĦĶĦĖĆ Ė) ö&2RR2!2!2Ķ2Ķ2Ķ2Ķ2Ķ2!2 !(2!!Ķ¤ÆÆö!!Ħ !&B¦ !&Ķ2Ķ2Ķ2 !.d!Ķ!Ķ2Ķ2Ķ2Ķ2Ķ2Ķ2Ķ!Ķ !(Ķ!!!Ķ!¥Ķ !)ĆåĦ!!!2Ķ2Ķ2 !.ĖåĦ2!2Ķ2Ķ2Ķ2Ķ2Ķ2!2!2 !(2!!ĦĦĦÖĶĦĶ !'BĦc!ĦĦĖĦĖĦ Ė/BĶĶĶ2Ķ2Ķ2Ķ2Ķ2Ķ2Ķ!Ķ!Ķ !'2Ķ!¥¥¶¥s¶¶c!Ķ !'·¶¥ c, R)!!2!2Ķ2Ķ2Ķ2Ķ2Ķ2!2!2!2 !&2Ķ2ĦĦĦĖĖĦöĆĆĆ !+ B)c¦c s(!!!Ķ2Ķ2Ķ2Ķ2Ķ2Ķ2Ķ!Ķ !*Ķ2Ķ !&2Ķ2 !5æR t( !&2Ķ2Ķ2Ķ2Ķ2!2!2!2 !*2Ķ2!!!2Ķsc ¥& Ç&2 !+¶ĦQbbrrÃ!!2!2Ķ2BRBsc· ¦&Ķ !+2Ķ2!!!2ĶĦÖÖÆÆÆÖµµµ!Ķ !+1ĆĆööææÉ !&Ķ2öÖææÆÖ µ&!2 !+Ķ2!!!2Ķ2!Ö!Ķ!!Ķ!ą!!2 !+Ç¥3æææAÃ !&2Ķ!ÖĶ!!2!!ą !.2Ķ!!!Ķ2Ķ!¶!!ĈÈ!Ķd!!Ķ !5B2Ķ2!¶!ĶĨĸB!d !.Ķ2!!!2Ķ2Ķ!!Ęc!!!Ķ!!2 !2É!!B!2Ķ!!BB!rĨB !/2!!!2Ķ2Ķ!ĶĘc!ĦÈÈÈĶ!Ķ !1ħÃ!tt!Ķ2!ĘĘĘ!!rĨB !12Ķ2Ķ2!÷c!!æÆÆ!!ĥ2 !,2 !(ĖÕÕ!2!ĶĕÅÅÅ!!rĨĶ !/2Ķ2Ķ2!!rÕ!!Æ¥cĆ !5ÉåÖ !(RR¦!!÷Ĵ!ĥ !.Ķ2Ķ2!!Ķ!rÕ!!ÔôĄ !42¢×ÖĖ!!!Ķrr¤!!ÇĤ !12Ķ2 !&Ķ!rÕĦ!!Ķ!Ħ !3Ķ !)Ķ!Ķ!Ç0!Ķ !/2Ķ2 !&Ħ¥!!rÄ!!ÖĶ !.2!BBB2§!!!2!!Ħ¥Ķ!@ń!!ÖĶĦ !,2Ķ2 !'QÆĶ!!!Ķ!¶ !1ttt2Ô!!2!!!QÆ!Ķ!!Ķ!¶ !.Ķ2Ķ !'dÆ s'cccĖ !,¶Ć Q&2Ħ!Ħ !&¦Ö¶¶¥¥¥sssĦ !,2Ķ2 !'2Ķ2Ķ !31ĥ Ć'ĦÕ !<Ķ2 !'2Ķ2Ķ2 !3Ç33ĖæææØ!!B2 !92 !'2Ķ2Ķ2 !- R*æą! R* !>2Ķ2Ķ2 !+R! d5B!BB !2Ķ !*Ķ2Ķ2 !+2dÕ¤µ¤µ¤µ¤ Õ' µ)ĆBd !32 !*2Ķ2 !,ĖåĖ2Ķ2Ķ2ĶsB!Bd!B !)ĖąĦ !.Ķ!Ķ!Ķ !)2Ķ2Ķ !,BĶ2Ķ2Ķ2ĶsĆĦBĆĥd !*2Ħ !/2!2!2Ķ !'2Ķ2Ķ2 !-2Ķ2Ķ2Ķ2!Ħ!CĦ !5Ķ!Ķ!Ķ!Ķ!Ķ!Ķ2 !&2Ķ2Ķ2 !-2Ķ2Ķ2Ķ2BĦ¥R!ÇdR· !22!2!2!2Ķ2Ķ2Ķ!!!2Ķ2Ķ2 !-2Ķ2Ķ2Ķ2 !8Ķ!Ķ!Ķ!Ķ!Ķ!Ķ2Ķ2Ķ2!!2Ķ2ĶÇ· !,2Ķç×2!2!!ĦBæĖ!ÅąĖÕ !.2!2!2Ķ2Ķ2Ķ2Ķ2Ķ2Ķ!!!22Bĕĵ· 2& R'csĖĶ¦ c'!!!ĥ !.Ķ!Ķ!Ķ!Ķ!Ķ2Ķ2Ķ2Ķ2Ķ2Ķ2!!!ĆĖĖĶĶåĖĖĖĦĆĆĆĖĖööĵĦą ö(2 !02!2!2Ķ2Ķ2Ķ2Ķ2Ķ2Ķ2Ķ2Ķ!!!2ĦĦ!!ĶĦĦĶ Ħ&ĖĖĦĦĶ!! Ħ&Ķ!2 !*Ķ!Ķ!Ķ!Ķ!Ķ!Ķ2Ķ2Ķ2Ķ2Ķ2Ķ2Ķ2Ķ !&Rss!!·ssc ¥'Æ¶¶!!d ¶&¥scBĆ2 !'2!2!2!2Ķ2Ķ2Ķ2Ķ2Ķ2Ķ2Ķ2Ķ2Ķ2 !&ĆĖĖ!!åĖĖĦĆ Ė&ööö!!ą ö*Ķ2!!!Ķ!Ķ!Ķ!Ķ!Ķ2Ķ2Ķ2Ķ2Ķ2Ķ2Ķ!Ķ!Ķ!Ķ !&2ĦĦĶ!ĶĦĶĦĦĖ Ħ(!!! Ħ)Ķ!!ĦĥĦ2!2Ķ2Ķ2Ķ2Ķ2Ķ2Ķ2Ķ2Ķ2Ķ2!2!2 !(Rss!ĦRsc¥¥¥s ¶'!ĵB ¶)¥scBö!Ķ!Ķ2Ķ2Ķ2Ķ2Ķ2Ķ!Ķ!Ķ!Ķ!Ķ!Ķ!Ķ !)ĶĶĶ!ĦĶ!ĖĦĦĦ Ć'!Ķ Ć.2Ķ2Ķ2Ķ2Ķ2Ķ2Ķ2Ķ2!2!2 !,Ķ !(ĶĦĶ2Ķ2 !*ĆĆ!!Ķ!Ķ!Ķ!Ķ!Ķ!Ķ2Ķ2Ķ2Ķ2Ķ!Ķ!Ķ!Ķ!Ķ!Ķ !'Ķ!Ķ!Ķ2 !&ÿď2Ķ2Ķ2ïÿ !'ïÿ !&2ïď!2!2Ķÿÿ2Ķ2Ķ2ïďĶ2!2!ÿď !'ÿďĶ!Ķ2Ķďď2Ķ !&ÅĶĶ2Ķ2!ĆĶ !'ĆĶĶ!Ķ!ĶÅĶ!Ķ!Ķ2ÅĶĶ2Ķ!ĶrĶ!Ķ!Ķ!rĶ!!Ķ!ĶrĶ2Ķ2Ķ2rĶĶ !'Ğj2Ķ2!!Ýz !'Ýz2!2!2ĎzĶ2Ķ2ĶĞj2Ķ2!!ľj !'ľY!Ķ2Ķ2ĮjĶ2Ķ!ĶĮY!!!Rçç×ç×ç ×3ç×ç×ç¦·¦·¦·¦ ·,Ç·Ç·Ç·Ç·Ç· Ç)!",
);
rawImages.push("#c Sc !Ņ !Ņ !Ņ !Ņ !Ņ !Ņ !Ņ !Ņ !Ņ !Ņ !Ņ !Ņ !Ņ !Ņ !Ņ !ĕ");
rawImages.push(
  "#c#ĦĦ ĆR Ħ.#!ÖÖæöæö æ+öæ ö* Ć2ĖĆĖĆĖĆĖĆĖ ö. !&®ğ2Ķ!!!®į!!!2Ķ®ğ !&2ßįĶ !&Ïğ !&2Ïğ!2Ķ2Ķďď2!2!!ÿď !'ÿď !(ÆÅĶ2!!!ÆÅ!!2Ķ2ÆÅ!!!2Ķrö2 !&¤ö !&Ķ¤ö2Ķ2Ķ2rĶĶ !&rĶ !'ÅĶ !'ĶJÞ22BBBZþBRBR!Jî!!2Ķ2:½Ķ !&:½!!2!2:ÍĶ2Ķ2Ķľj2 !&ľj !'Ďj2 !&2Ķ2sc¥¥ Ç&çç !'2Ķ2Ķ2Ķ2 !*Ķ!Ķ2Ķ2Ķ2Ķ2Ķ!Ķ !/Ķ !&Ķ2Ķ!Ćöö Õ&¤ !(Ķ2Ķ2Ķ2 !+2!2Ķ2Ķ2Ķ2Ķ2!2 !-2!2!!!Ķ2Ķ2!Ė Ħ( !)2Ķ2Ķ2 !,Ķ2Ķ2Ķ2Ķ2Ķ2Ķ !/Ķ!Ķ!!!2Ķ2Ķ!!!×¶¶s !)2Ķ2Ķ2 !+2!2Ķ2Ķ2Ķ2Ķ2!2 !-2!2!2!!!Ķ2Ķ !&µÖÖö!!Ė!!!2Ķ2Ķ2 !,Ķ2Ķ2Ķ2Ķ2Ķ2Ķ !/Ķ!Ķ!Ķ2!!2Ķ !'×¶¶s !'2Ķ2Ķs¥¥¥÷Ç÷ ¥(s¥çÇç¥s¥!2 !-2!2!2!2Ķ!!Ķ2!!Ħ!ĶµÖÖö !'Ķ2Ķ2!ÖÖÆQ¤QÖÆ Ö(bµbÖÖ !0Ķ!Ķ!Ķ2Ķ2!!2Ķ !'×¶¶s !'2Ķ2Ķ!!ĶĢccĢĢ2 !,2 !.2!2!2!2Ķ2Ķ!!Ķ2!!!Ķ!µÖÖö !&2Ķ2Ķ2Ħ!!©!â2º !*2!2Ķ !.Ķ!Ķ2Ķ2Ķ2Ķ2!!2Ķ !'×¶¶s !&Ķ2Ķ2!!Ķ!!â2º !*2Ķ2Ķ2 !,2!2!2Ķ2Ķ2Ķ2Ķ!!Ķ !(¤ÖÖö !&2Ķ2 !'â2º!Ò!!!BB!2Ķ2!2 !-Ķ!Ķ2Ķ2Ķ2Ķ2Ķ2!!2 !(ç¶¶s!!ĥ!Ķ2Ķ !&22º!Ò2!!×ć!2Ķ2 !.2!2!2Ķ2Ķ2Ķ2Ķ2Ķ!!Ķ!!!Ķ!!¤ÆÖö !&2Ķ2!!!2Ķº!Ò2Ê!!ąöĶĶ2 !/Ķ!Ķ2Ķ2Ķ2Ķ2Ķ2Ķ2 !+çÆ¶s !&Ķ2 !&Ķ2ööF6Ö!!öÅĶ2 !.2!2!2Ķ2Ķ2Ķ2Ķ2Ķ2 !,¤ÆÆö !&2 !'c R(ssscs c&¥¥¥ !(Ķ!Ķ2Ķ2Ķ2Ķ2Ķ2Ķ2Ķ !*Ķ!çÆÆs !*B!ĦĦĦĶĦĶĦĖĆ Ė) ö&2RR2!2!2Ķ2Ķ2Ķ2Ķ2Ķ2!2 !(2!!Ķ¤ÆÆö!!Ħ !&B¦ !&Ķ2Ķ2Ķ2 !.d!Ķ!Ķ2Ķ2Ķ2Ķ2Ķ2Ķ2Ķ!Ķ !(Ķ!!!Ķ!¥Ķ !)ĆåĦ!!!2Ķ2Ķ2 !.ĖåĦ2!2Ķ2Ķ2Ķ2Ķ2Ķ2!2!2 !(2!!ĦĦĦÖĶĦĶ !'BĦc!ĦĦĖĦĖĦ Ė/BĶĶĶ2Ķ2Ķ2Ķ2Ķ2Ķ2Ķ!Ķ!Ķ !'2Ķ!¥¥¶¥s¶¶c!Ķ !'·¶¥ c, R)!!2!2Ķ2Ķ2Ķ2Ķ2Ķ2!2!2!2 !&2Ķ2ĦĦĦĖĖĦöĆĆĆ !+BB c(¦cs R'!!!Ķ2Ķ2Ķ2Ķ2Ķ2Ķ2Ķ!Ķ !*Ķ2Ķ !&2Ķ2 !0 t'ĆRC !+2Ķ2Ķ2Ķ2Ķ2!2!2!2 !*2Ķ2!!!2Ķsc ¥& Ç&2 !&¡rrbbQĆµR !*2Ķ2BRBsc· ¦&Ķ !+2Ķ2!!!2ĶĦÖÖÆÆÆÖµµµ!Ķ !&ĊææööĆĆ !,Ķ2öÖææÆÖ µ&!2 !+Ķ2!!!2Ķ2!Ö!Ķ!!Ķ!ą!!2 !&_¥3Ćææ¥×õĦ !)2Ķ!ÖĶ!!2!!ą !.2Ķ!!!Ķ2Ķ!¶!!ĈĨ!Ķd!!Ķ !62Ķ2!¶!ĶĨ§B!d !.Ķ2!!!2Ķ2Ķ!!Ęå2!!Ķ!!2 !&ê !22Ķ!!BB!ÆuB !/2!!!2Ķ2Ķ!ĶĘå!!ĸ44Ķ!Ķ!d··¡ !2Ķ2!çDDs!ÆuB !12Ķ2Ķ2!÷å!!µµr!!ĥ2!ÕÕĖ !(2 !,2!Ķ!ĖĖĖ!!ÆuĶ !/2Ķ2Ķ2!!rR!!ÇÇÇĦ !'Öåê !6ÕÕÕ!!ÆÄ!ĥ !.Ķ2Ķ2!!Ķ!rR!!000 !&R¶B¡ !4Ķrr¤!!Æ´ !12Ķ2 !&Ķ!rR!!!Ķ!Ħ !'ĥ !5Ķ!Ķ!Æ´!Ķ !/2Ķ2 !&Ħ¥!!rń!!ÖĶ !(ë!!!BB2!!B !(2!!Ħ¥Ķ!r£!!ÖĶĦ !,2Ķ2 !'QÆĶ!!!Ķ!¶ !)~!!ttt!!C !(2!!!QÆ!Ķ!!Ķ!¶ !.Ķ2Ķ !'dÆ s'cccĖ !(Ħ Q&ĆµR !,¦Ö¶¶¥¥¥sssĦ !,2Ķ2 !'2Ķ2Ķ !/ Ć'ĥ !CĶ2 !'2Ķ2Ķ2 !.ċ æ'3×ÕĦ !'B2 !92 !'2Ķ2Ķ2 !- R*æą R+ !>2Ķ2Ķ2 !+R! d5B!BB !2Ķ !*Ķ2Ķ2 !+2dÕ¤µ¤µ¤µ¤ Õ' µ)ĆBd !32 !*2Ķ2 !,ĖåĖ2Ķ2Ķ2ĶsB!Bd!B !)ĖąĦ !.Ķ!Ķ!Ķ !)2Ķ2Ķ !,BĶ2Ķ2Ķ2ĶsĆĦBĆĥd !*2Ħ !/2!2!2Ķ !'2Ķ2Ķ2 !-2Ķ2Ķ2Ķ2!Ħ!CĦ !5Ķ!Ķ!Ķ!Ķ!Ķ!Ķ2 !&2Ķ2Ķ2 !-2Ķ2Ķ2Ķ2BĦ¥R!ÇdR· !22!2!2!2Ķ2Ķ2Ķ!!!2Ķ2Ķ2 !-2Ķ2Ķ2Ķ2 !8Ķ!Ķ!Ķ!Ķ!Ķ!Ķ2Ķ2Ķ2!!2Ķ2ĶÇ· !,2Ķç×2!2!!ĦBæĖ!ÅąĖÕ !.2!2!2Ķ2Ķ2Ķ2Ķ2Ķ2Ķ!!!22Bĕĵ· 2& R'csĖĶ¦ c'!!!ĥ !.Ķ!Ķ!Ķ!Ķ!Ķ2Ķ2Ķ2Ķ2Ķ2Ķ2!!!ĆĖĖĶĶåĖĖĖĦĆĆĆĖĖööĵĦą ö(2 !02!2!2Ķ2Ķ2Ķ2Ķ2Ķ2Ķ2Ķ2Ķ!!!2ĦĦ!!ĶĦĦĶ Ħ&ĖĖĦĦĶ!! Ħ&Ķ!2 !*Ķ!Ķ!Ķ!Ķ!Ķ!Ķ2Ķ2Ķ2Ķ2Ķ2Ķ2Ķ2Ķ !&Rss!!·ssc ¥'Æ¶¶!!d ¶&¥scBĆ2 !'2!2!2!2Ķ2Ķ2Ķ2Ķ2Ķ2Ķ2Ķ2Ķ2Ķ2 !&ĆĖĖ!!åĖĖĦĆ Ė&ööö!!ą ö*Ķ2!!!Ķ!Ķ!Ķ!Ķ!Ķ2Ķ2Ķ2Ķ2Ķ2Ķ2Ķ!Ķ!Ķ!Ķ !&2ĦĦĶ!ĶĦĶĦĦĖ Ħ(!!! Ħ)Ķ!!ĦĥĦ2!2Ķ2Ķ2Ķ2Ķ2Ķ2Ķ2Ķ2Ķ2Ķ2!2!2 !(Rss!ĦRsc¥¥¥s ¶'!ĵB ¶)¥scBö!Ķ!Ķ2Ķ2Ķ2Ķ2Ķ2Ķ!Ķ!Ķ!Ķ!Ķ!Ķ!Ķ !)ĶĶĶ!ĦĶ!ĖĦĦĦ Ć'!Ķ Ć.2Ķ2Ķ2Ķ2Ķ2Ķ2Ķ2Ķ2!2!2 !,Ķ !(ĶĦĶ2Ķ2 !*ĆĆ!!Ķ!Ķ!Ķ!Ķ!Ķ!Ķ2Ķ2Ķ2Ķ2Ķ!Ķ!Ķ!Ķ!Ķ!Ķ !'Ķ!Ķ!Ķ2 !&ÿď2Ķ2Ķ2ïÿ !'ïÿ !&2ïď!2!2Ķÿÿ2Ķ2Ķ2ïďĶ2!2!ÿď !'ÿďĶ!Ķ2Ķďď2Ķ !&ÅĶĶ2Ķ2!ĆĶ !'ĆĶĶ!Ķ!ĶÅĶ!Ķ!Ķ2ÅĶĶ2Ķ!ĶrĶ!Ķ!Ķ!rĶ!!Ķ!ĶrĶ2Ķ2Ķ2rĶĶ !'Ğj2Ķ2!!Ýz !'Ýz2!2!2ĎzĶ2Ķ2ĶĞj2Ķ2!!ľj !'ľY!Ķ2Ķ2ĮjĶ2Ķ!ĶĮY!!!Rçç×ç×ç ×3ç×ç×ç¦·¦·¦·¦ ·,Ç·Ç·Ç·Ç·Ç· Ç)!",
);
rawImages.push(
  "#c^ŀĀ=MMM=ŀŀİİŀŀ-= M(===ŀŀŀ-== M*== ŀ&-== M+==--ŀŀ- !)2 S&ĶĶĥĕĕĕĦĶ!!222SSC2ĥĥĦĶĶ !'22CC3!ĵĥĥĕĦĶĶ !'22B2C3 !'ĕĕĦĶ!Ķ22dS!!ĶĶĵĥĦĶĶ !&22SC2ĥĥĦĶ !'222C3!!ĶĥĥĥĦĶĶ !'22B !'ĶĶĥĥĦ2!!!2d!!!ĶĶĥĕĶĶ!!#ķ!3#3CeCĶĶ !(2!233!!ĶĶĥĥĥĦĶ !0ĶĥĦĶ!!!ĶSC !'22!3ĶĥĖ!ĥĕC!ĕĶRB !'Ķ!Ķĵĵ !&2!3 !3C22!ĶĶĕĕĥ!!CSu3ķ!!ĥ!!ą!!ąą!!ö!B!!ĶĶĶĥĵ!!222C3C2B2!!!ĶĶĶ !(CSSB2!Ķĕĕ!CSSe32Ķĕĥķ2!SS d)S!!ĶĦĶĥĵ3CC S&BB22!!ĶĶĕĥĥĥ !&RS2!!ĶĶĶ!SSe3!3ĶĥĖĕ!!Ķĩd2ĶĦ!ĖĖĹąĖA!!!22CC2!! Ķ,!! C&2!!!Ė å+3ĶĥCĕĥ!SdddR!!ĖĶĥĹĵĵ!y1ĖĖĖ å;!!!s ÷+Ķĥ!ą!SdĦĹĶĶĹ!ĹĵĵV!VV!! s& ÷;!!!Ħ ö+B!!Sd2Ħ!ģ%%!DDVV! D& Ħ& ö<!!!Ė å+!!S!ĦĹĥĵE!DDĦĦDDD Ħ&!ĖĖĖ å< !&tc R(¸2d!ĶĶĒVVDD!Ħ!!ĦĦĦ !' R&cct¦ ·'¦¦tcRRcct ·(t !&BSSSC2eTĶĖ!2Ķĵ!!DŅŅŅ A-'''«yyhWGGG!!22BCSC!ĶĥĕĦ !&B !(22BTĶĶĥBĹĹĵ!V!!2 ü92B !&22BCS2ĶĥąĦ !-ĶĦĥĵdĶ!!VV!DĦÆ}!À °3À!}ı!BB !'22C2!!ĵĦ !)ĶĶĦ#Ĥ!!!ĕ! D&Ħ!CcÀÌ!¶ ì/¶!ÌÀc !&B !(2C!!ĶĵĦ !'ąĕĕ32T!d!VD Ħ&!!RcĦĠ2Ć !/Ć2ĠĦñ !,ĶĶĕ!!23B !*ĶĦĥdĶĹ !+CcæÌĖĐ !-ĐĦÌæc !'Ħ!!ĶĦĕĥĕ!!23B !(dddĵĵ!!!Ń!!AQõĖ!!!RcĦĠ2Ć !-ĆĶĠĦñ !&ĖĦWGĕĥĶĶ!2CSB !)ĕĕ#Ņ!d!ĦĦ!!!ìÆåõĖ!!CcæÌĖĐ !+ĐĦÜæc !&åËxì!¦2CddSB !&Ħ !&SS!T!!ĖĵEDĦ!!ÆĦÆåõĖRcĦĠ2Ć !+ĆĶĠĦñ!!!x¼ĦÆ!!!tB !)ĕ !'ĕĕĦĦ!!EV !'æÌÆĦÆåõtcæcĦ !+Ħsæc!!x7ĦÆÌæ !&B !&ĦĕĕĶ !'4SĵĵdĶŃŃ !'Ķ°æÌÆĦÆµ×ĦiĶĐ !)ĐĶiĦñx7ĦÆÌæ°Ķ !'ĕĕĕąĥĶĶ !*3 !-¶BÀÖÌÆĦQ!ĠRĆ !)ĆRĠ!7ĦÆÌÖÀB¶ !(SSS d&C !&R!313!ĦĦĦ !(X¼¥RÀÖcìÆæ«Ħ !)Ħ«æÆìcÖÀR¥¼X !( Ķ)22!!!Ė!!å2!ĵĵEDĦ !(X¼¥RĆ°ĆÌ!Ķ !)Ķ!ÌĆ°ĆR¥¼X !'ĖĖĖ å+!!!s¤Ė÷!ĶVVD !,X¼Ü¶!°° !+°À!¶Ü¼X !)sss ÷+!!!Ħö!ç22!!!Ħ !.X¼ììì !)ììÜ¼X !,ĖĖĖ ö+!!!Ėå!!!ĹDDĦ !JĦĦĦ å+ !&R !'Ħ !K R,ct !&dA !X223B !&ąħ!!D !S2233B !&RS !TSSSCC22ĶĶ!!!Ėå!!!ı !MĖĖĖ å+!!!s÷!¤ĕĶ !2ĐÐ}}} !)}}°ÐĐ !,sss ÷+!!!ĦçRĆ!2ı- !-ĐÐ°Ö!ÜÜ !+ÜÌ!Ö°ÐĐ !)ĖĖĖ ö+!!!Ė!!Ħ!!ĦĦı !*ĐÐæĖcÜcÀ!2 !)2!ÀcÜcĖæÐĐ !'ĦĦĦ å+ !'ĵS!Ķ!!ĥ !(ĐÐæĖÌ¶Ć}Æ¥àB !)Bà¥Æ}Ć¶ÌĖÖÐĐ!!!RRR ·*t !(Ħ!!!ĥ!B !'ÖĦÌ¶ÀÆBė!HĖc !)cĖH!ıBÆÀ¶ÜĦÖ !(ĦĶ !(B !&A!ĥCĕ2Xy !'2Ü¥ÀÆBÆ×µBĀ2X !)X2ĀBxñıBÆÀ¥Ü2 !'ĵĶĶ !-Ħ!ĥ!2-ı !'¥ÀÆBÆ¦tõĆ¥ĆB !+Bö¥Ć!!ñıBÆÀ¥ !'CB2 !,Ħĥ!2!!!Ħđ !&ÆBÆ¦tRĖĆBHĶc !+c2HBx!!!ñıBÆ !'2 !)Ħ!!!R2SB3CąĶ!ĥB!!}Æ¦tR!!ĥĆ¥ÀRX !+XB°¥Ć !'ñı} !& Ķ*2!!!ĖååĶĥ !&y!!ħėtR!!!ĖĆBHĶc !-c2HBxĖĖĖµµĖāđĖĖĖ å+!!!s÷÷¥!ĥ!ĕBıĦ !*ĥĆ¥ÀRX !-XBÀ¥Ćsss÷÷ s( ÷+!!!ĦöööB!s!ĶĦĐ !)ĖĆBHĶc !/cĶHBWĖĖĖ ö2!!!ĖåååĶRėC!ĥ!B !(ĥĆ¥À!Ö }/Ö!À¥ĆĦĦĦ! å1 !&···B!ĥĥĕSC!!-ı!!!ÆìHÌ Ü3ÌHìhRRR ·/tt !& ą&ĦR!!Ķ!ı-Ħ!Đ!!Ķ m9ĶĖĖĖĶ ą)ĕĕĦĦ!BB !& d&BBss!R!Ħ !' ħ0 Ł-RRRBddd S&3!ĵĥąąĦ !+ĦĦ!QĶ2ĥ!ĥR-Đ !B 2&BSCSSC !' ą(ĦĦĦ!ĖSĥ!3Ħ!Đ !2 Ķ- !,222BB !& d(B!!Ħ!ĶSSąĥ!RŁŁ!!!-Đ !*ĶĖąą õ*ąĕĦĦĶĶ !/ ą+!!ĥ22SS!Ė!ĕĐ!-Ħ!Đ!-Đ !&2BSSdSSSCC22ĶĶĥĥĥĶĦĶĶ !, d*SŅĥ!1ĦĶĕSSĕ!!!Ħ!!!-Ħ!!-ė !(222B2 C&22ĶĥĥĥĶĦĶ !* ą&ĕĕĦĦ22ss!Qĥ!AĶC!C=ĥĥ!!ąĥ!-ąĥė!!ĕĦĦĶĶĶ!222B2C3C22ĶĥĥĥĦ !-ĶĶĥĥąąõĆĦĦRR!!ĥ!QĶtSSdSSS!SS!!2Ķ ĥ&ĶĦĶĶĶ!22B2CCS22!!Ķ !'R S,C2 Ķ&!Qss!!Ėĕĕ!Ķĕ2!ĕĕQ!ĦSSSCC22!!! Ķ& !&CCC2!ĶĶ!!!Ė å1ĕõĆĖĖĖĥĥ!B!ĥ!ĥ!!cĶĖ! å;!!!s ÷1Ç·¥ s&¶¶sQ¶¶sQ¶RRss ÷;!!!Ħ ö_!!!Ė å_ !& c&¦¦¦ ·&¦¦¦ c(t¦¦ ·)¦¦tccc¦¦ ·+¦¦ttcc R(t",
);
rawImages.push(
  "#c±^- ±'^^MM^^n ±,^^^n ±. ^&n ±/nn^^n !*RRccĶĶĦĆĖĖĦ !(RRRBĖĖĦ !+RR2!ĶĖĖĖĦ !+BBR2 !'ĖĖĦ !'cc!!ĶĶĶĖĦ !*RRBĖĖĦ !*BR2!!ĶĦĖĖĦ !+B !'ĶĶĦĖĦ !'c!!!ĶĶĦĆĦ!!!ķħ!#ħķRS3Ħ !+B22!!ĶĶĦĖĖĦ !1ĶĦĦ !'cB !'B!!#ĶĦć!ĦĖ#!Ėħ !+ĦĶĶ !&2!2 !3BB !&ĆĆĦ!!Bcdķħ!!Ħ!!Ć!!ĆĆ!!ć !(ĦĖĶ!!222B2RBB !/BccB!!!ĆĆ!BccS#!ĶĖĦħ2!RR c)R!!!ĦĦĖĶ2 R(BB !( Ė& !'cB !(ccS#!ķĶĦćĖ!!Ķùc2ĶĦ!ĖĖĉĆĖ1!!!BBRRB !0 R&B !& æ+ķĶĦ#ĖĦ!RcccR!!ĖĶĦĉĶĶ!%1ĦĦ æ< !& ¥+ĶĦ!Ć!RcĦĉĶĶĉ!ĉĶĶ%!%%!!BBB ¥< !/B!!Rc2Ħ!/ęę!!!%% !I æ+!!R!ĦĉĦĶĹ !/ĦĦĦ æ< !&cR B(t2c!ĶĶŃ%% !0 B&RRc ¥*cRBBRRc ¥(c !&BRccB2SCĶĖ!2ĶĶ!!! t0777xhhW 7& !&BRcB!ĶĦĖĦ !&B !*BCĶĶĦBĉĉĶ!%!!2 ü92 !)BRc2ĶĦĆĦ !.ĦĦĶcĶ!!%%!!!ć}!Ð °3Ð!}ġ !,R2!!ĶĦ !+Ħħĵ!!!Ė !)Ĥ·Ð¼!÷ ì/÷!¼Ð· !.R!!ĶĶĦ !'ĆĆĆ#2C!c!% !*sĖ=Bö !/öB=Ė° !.Ć!!22B !*ĶĦĦcĶĉ !+Ĥ·µ¼å- !--ą¼µ· !+ĦĖĖĆ!!22B !(cccĶĶ!!!O!!t¦D !'sĖ=Bö !-öĦ=Ė° !'ĦG7!ĦĶĶ!2BRB !)ĖĖķ1!c!ĦĦ!!!ìbĘD!!!Ĥ·µ¼å- !+-ąÜµ·!!!ĖĆÜhì!!cBccRB !&Ħ !&RR!C!!ĖĶĹ !&ćąbĘD!!sĖ=Bö !+öĦ=Ė°!!ĆČªąć !&B !)Ė !'ĖĖĦĦ!!Ĺ% !'µ¼ćąbĘDĤ·µ·ą !+ą×µ·!!Üªąć¼µ !+ĦĖĖĶ !'CRĶĶcĶOO !'Ħ°µ¼ćąbĘPĖ'Ħ- !)-Ħ'Ė°ÜGąć¼µ°Ħ !'ĖĖĖĆĦĶĶ !(Ķ!2 !-÷dÐr¼ćą¦!=¦ö !)ö¦=!Gąć¼rÐd÷ !(RRR c&B !'Ķ#Q2!ĦĦĦ !(Ļh×¦Ðr·ìćµWą !)ąWµćì·rÐ¦×hĻ !/BB !(Ħ2!ĶĶĹ !*Ļh×¦Õ°ö¼!Ħ !)Ħ!¼ö°Õ¦×hĻ !'ĦĦĦ æ+ !&BĖB!Ķ%% !-ĻhÌ÷!°° !+°Ð!÷ÌhĻ !)BBB ¥+ !(ħ22 !2Ļhììì !)ììÌhĻ !<õ2Ķ!ĉ !MĦĦĦ æ+ !&B2 !P B,Rc !&c1 !X222B !&Ćķ !V 2&B !'cĶ !ScccRRBB !(ķĶ2!` !MĦĦĦ æ+ !'BAĖĶ !2-ā}}} !)}}Àā- !,BBB ¥+ !&Ħ2!!2`` !--āÀr!ÜÜ !+Ü¼!rÀā- !;Ħ!!ĦĦ? !*-āµå·ÜsÐ!B !)B!ÐsÜ·åµā- !'ĦĦĦ æ+ !&2ĥC!Ķ!!Ħ !(-āµå¼÷Õ}b×đd !)dđ×b}Õ÷¼årā-!!!BBB ¥*c !&2!Ħ!!!Ħ !)rą¼÷Ðbdå!īås !)såī!ġdbÐ÷Üąr !(Ħ !)B !&1BĦBĖ2%% !'BÜ×ÐbdćPĘRŁBĻ !)ĻBŁRÜ°ġdbÐ×ÜB !'ĶĦ !.Ħ!Ħ!2`` !'×ÐbdćPĤDÕ×Õd !+dµ×Õ!!°ġdbÐ× !'RB !-ĦĦ!Ņ!!!Ħ? !&bdćPĤ!!öRīĦs !+sBīRÜ!!!°ġdb !/Ħ !&BcbCBĆĶ!Ħ!!!}ćPĤ!!!DÕ×Ð¦Ļ !+Ļd°×Õ !'°ġ} !.B !&ææĖĦ !&%!!õåĤ !'öRīĦs !-sBīRÜĦĦĦĖæĖñđĦĦĖ æ+ !&¥¥R!Ħ!ĖB` !+DÕ×Ð¦Ļ !-ĻdÐ×ÕBBBR¥RRBBBR ¥+ !)1!b!ĶĦŃ !*öRīĦs !/sĦīRÜ !9ææĦ2AħB!Ħ !*DÕ×Ð!r }/r!Ð×ÕĦĦĦĖ æ1 !&¥¥BBBĦĦĖRB!!`?!!!bìī¼ Ü3¼īìhBBR ¥/cc !&ĆĆĆĖĦA!!Ķ!``Ħ!Ń!!Ķ m9Ķ!!! Ć*ĖĖĦĦ!BB !&cccRBBbb!R!Ħ !' õ0 ı-!!! c*2!ĶĦĆĆĦ !.AĶ2Ħ!Ħb`Ń !FBRRccB !' Ć'ĖĦĦĦ!ĖRĦ!#Ħ!Ń !JBB !& c'RBBBĦ!ĶRRĆĦ!bOO!!!`Ń !+ĦĖĖ Ć*ĖĖĦĦ !1 Ć)ĖĦ!!Ħ22RR!ć!ĖŃ!`Ħ!Ń!`Ń !'BRR c&BB22ĶĶĦĦĖĦĦ !. c)RBAĦ!ĥĦĶĖRRĖ!!!Ħ!!!`Ħ!!`ħ !+BBRRBB22ĶĦĦĖĦĦ !+ Ć&ĖĖĦĦ!!bbBAĦ!1ĶB!BpĦĦ!!ĆĦ!`ĆĦħ!!ĖĦĦ !)BBR2B22ĶĦĦĖĦ !-ĶĶĦĦĆĆĖĦĦĦAAĦ!Ħ!AĶsRRcRRR!RR!!!ĶĦĦĖĖĦĦ !(BBRRc22 !+ c,R B(Abb!!ĖĖĖ!ĶĖ2!ĖĖA!!cccRRBB !-RRRB !) æ2Ć Ė&ĕĦ!1!Ħ!ĕ!!1ĖĖĖ æ; !& ¥2c R'bbRŅbbRŅb R& ¥; !g æ_ !& R& ¥, R(c ¥-cRRR ¥/ccRR B(c",
);
rawImages.push(
  "#cSĆĆ¶Bscc¥¶ÖĆtS#Ć¥B s&¶¶¶¥æĆtĦ æ1 Ħ&Ć Ħ-ĆĆ# !&.!B!Ķ !(B!!2BĢĲĒĢ!Ķ!B!ĆĖæ Ò&ò ¶'ÆÆÖs¥æC!!æ ¶)ÖCB !)Ģłc!!!B!!!C!!2Ħg6gVĦB !&ĖĲ 2&Ķ_ R&BB2c2!s!!Ė Ē&ĖĦBRsC !*ĖĂłĲ !)łĂĢĂĢ !'C!ĶĲ! 2(RR2R2łłĒĲĒ-Ò¡Ē Ķ&ĲBR¦ !*6!2B2VR !'Ģ! 2&ĂĂĲĲ!!!Ħ!B!222!ĶĢĢ.!!6V6222BB!! B&Ģ !&B !'2R!Ķ!RB·Ħ !+2BB6B!!Ķ!!2gVV!2&66Ħ2BĦBF©wī!!! g&w!!!R !(BFB2ÊBC !(B !&Ķ!6BBsĦ2!!!ĶĦâ!ĶłĲĢłĲĢłĲs!!!ÊB!Ăòòò !.2V© !*2 B(gRRC !'ĶĂĂ2!!!2B 2'!!!ĦtV!!22V !,ħħćć×··s !'6VVV©©©ccd !*B2!!!ĶĦĶĶ26F!!!B!RR!!!Ģòò± !)µµµÕö Ħ&ĖĖ!!ė···dddCC!!!õ!F& B-wsR×××Ħ!c!!BBBRBÛ !' B'!ĥ õ& ą&B s,Ħ!¶cÖFF w*ī×××ĦĦöĖĖ!6!wwwgV !(RR Ł(__²òBBBµµµÕÕÕ ö'Ė!·ć·ćć ×*ĦĦööĖĖĥĥĥĦBĦÒĦĆö !)đ2hhxhhxĪĺĊê¶ÖöBBBĦĦĦąµ =&_đġŁõõąąĥĵ1QµÕõõ ĥ&!CCdB!!âĂĒò±!!C!!!Ĳ.>.>sBs¥c2ĖöæsÖöBBB!ò!B R&BB¥¥cBĦĖöÖcBBBRc¥Ææ!!!2!!222BÛ !+22ĢłĲĒ.ssRc!ĆĖÆĆtB!22!!2wwVĶ2!s¥¶sNoo¡¶cs2!B!sRB !&BV !+2 !&22ĶĲĦBĦ>Nc!B!C !'gĆĖö2Ķ!ĦĶĖBF&F6Ħ!!BĶ !&B!!g!Ħ !-g V(6BĦ2Fg!R!!s !'òĲĲRĶĶ2BĶBĖĶBĒĢ.NĦ!B !&C!!Ă!g!!M !*ĶĖĖĖĶ!!ĶĒłĲĢòòĂĂ !+ĶĒłłĲĒ.!!B!gF&ĚBĦ !+Ķòò± !*ĶĒłł.ĶĶ!Ģ2!!2www!B !0ĶĢłĢĢĒĢĲłĢ. !+22B!!n±!!!gF6&6F&2!ĖVgggĶòĂĒ!!!©© 2+ B0 !)RBBV !(xĦĖ!2!22!Ħ2!ĦĦĆg !(ĶĶ g+ V.F2B !(ĶVV!!!ûÛ!!ĦĶ2!ĢĢĒĶ!B2Ħ!2BĦg©w!!!RÇ ÷& Ģ+ B, !)ĦââĒ !(đ2!2VV62!Ħ!RĶĶĦ!ĆöĖË!!¦ąµÕÕö ě)!!ĂĂ ò&Ă d& !)2cĦ!!n±!!!Ģ.ĲBĶĶ!ĦB2Ķ2ĦB!BBRR!!ĥBB!!ĥÕÕÕöĦĦ! ě&ī2!ĶĶ±±Áss!!!º!!!Ė !-ĂRBĦBĦĶĒĢłĲBBRĖB!ÕĆ ¡'²²æą Õ&ööĦĦûīB Ķ&M !' B&2Û!ûÛ !&ĶĶ!ĂĢłĢ.BVwº©2ĦĖR!!!â Ħ(ĶĒâÖööĦąąõõĖöěĶ!2ĶĶM!!!2FVVVg!ě !&W©ºÊºBBBº©2sB!ĖBBRB!!!Ħ! 2&!!2êöÖÖÆöB!!åMġĶ22ěĶ!ĦĖĥ2ĆöĖĖ !)dħ÷××ī22··¦ddds!sBt !&ºgĶBRgFĺssR2ĖĆÖC!Ħ&ĦĶ&ú1ĺĺbąĦ!BĦBB !) ö(Ë!nB s&·×··B !&âĒBĶĦĒĢł!ł>>oB!RC!!!Ħ!ĦĖĆöĶBBB!!ĦĦ !)µµrµĥĥĥ©ĶMMöĦĦĦ !*22 B'F2&!26BĢ !'R!B22BRC !/ĦĆĆĆ¶æÂÒºĶ!ÁĖõõÕÕÕĦĦĦ!&Ķ!Fĺ6F622ł2FĦ2B !(Ē.>>łĂ±CB!2 !+Ħ2ccĢòĶĶCÛĶ6r ¶'AbĖÖł2!ĒłĢĒĢĢBF6ĦBĒ!B !'2 B&gċ!!!2RsB !(ñRB!Fg&!!R2Ćá Ē&łBBą!22!2wgĶ!ĶĂĲB2Ħ2 !&Ĳ!!ĶĦĦĦĶĢ!!!BsBB !*ò2!!ĂĢ!!!©áSBRRRVB·dĶ2!!ĶòĂ2!!!ĶĂĲB2!-nò !.¶Ç÷×d !)©ĶĦBgF2!Bö!BgVVVĶĦ!sĒĶĶ !'22gVF&Ģ!īěÚB!!!2BBB2F!!!Ħĥööss !)2!!ĦBÛ!!~SĶòĶĖĶBB !)2wgVVĶ!ĦĒĶ!M!!VB!!ĶĦĦĶ2!!!CBĦąĥöĦĦ !'ĂĢs2 !+ĂĢĒĒĢs !(ĶòĂĂĂĒĒĲ2B!ĦMâ!ĺg222BB!!ÕR!CBB!ĥõõĖ !'ĶòĲc !&ªĺ©º!2B!Û!!! 2,!2B!!2!ĖĲ!öFggVFFĦĖõR!!²oĆ¥Cąą !'2V2Ħ !&2ĦĖwwgg!!Ħ!!Ķ!©gggVVVĶB 2'!ĦĲ2ĦĆĆòòĒĦ!Ħ!!!ĦBò.ÁĂ !(ĶĂĂc!!Ħá!Ħ!ĶĦöB!!!w!2!âĂĒĒĢĢRêºÛÛËě22Ķ!>Ħ!B6B!cĶ!!!C!!!2Ķ !&dgVg©ë·!s!!łĲĒĢĲB !&c 2&B 2&dt·sss!û!Ķ!!.ĲĒ.FV!Ķ!!!n!!2gwË!!!wccR !'^S!wÊº©s !&·'Ļīī ě&ĶR!==öööĖ!2!!!2BVĦĖĦ2!!~2ºwgĆĦsd!!s d&!!s=öR!Ģâòddd!!!Ė ö)-ÛĖMĖº ĥ&Ķ2!!!ĶĦò Ģ&òn2ëc¶æc !'× s'R=öRBBī2Ħ~sss!!åÅ µ&^^Ħ^^6VÖæĦĦĦ!2 !&2BBB22!!Û !&Ć !'Õ ö&-=ĖRBĖRöÛBĦöörrbÖÖæÖÖÖĊĊĚĚĚöööĖdBâ2ĺ!!2B2 V&Fwû!!!R!2 !(Õ^^^Ķ!RBĶB!!RºĶM^ââĒ.NN _'NNN_RsR!Â!2Ķ!!2VVĶĦĆĦĶ!!R!ĦÆ¥R !(òĦ Ė&öĖĶ2&!!Ħ!! 21ĶłĲĢ±!26 !'ĦĶĂłĲ !)Bccö !'ĶBRBBRBB&B !&2Ķ!2B2!2BR B)22B!2º!Ķ !&Ķ!!2!B !'Â¡_Ćąą !'2!ggV6ĖĲ2!!!B22º©wggĶĶĦ! w(B2ĶºĶÒ !&ĶĂ2ĦgVg !'âĦBR !)2!g!ĶĖĒ2 !'º''×××÷ć'ĻĻī ×(ěěÛÒ©ĦĢĲ!!ĶĶĢBĦĦöĦ !&Ė!2wĆ!×!!!2!!!âòĲBFgB!!×B Õ,--- Õ(ĥ!!2Ķ !'ĶĒĲĒłĢòn^~2!ĶâĢâM !&2gĶ!!g&Ħ!B!!ÕĦæÆÆÆÖÖæ²¡Òë!ĦÂöÆRcs¶F×2Ķ !(2BB22!!222!!222 !&V&Öò!BĂĢĲĂÒ!!!ĆöĂĂĒĂĂĂĶRÛsë!ĦòRcRB!R!º !'2B2 V&wěûÛ2!!wwwě!!!22.©© g&©º!!!ĦĲ!!wwwggF!!!2!B!!B!BB !)ĶĦĦĂĒĶĦ !(2ò !'Ħ22ĶĂĒĢ!ĦĶ!C !(©ĶĖĶĦĖ2ĥ!!2!ĦòĲĒĲĒĦ!Cg !&wVĦ2FĖ !'2B!wĦ !'cĲ!!ĶĦĒłB!!RĖ!!!©ĦĶ2Ķ22òÒ!!©Ħ!!BBB2 !*òĒBĦĒ. !'ºBĶòĒâM !+ĶĶĂâ !'ĺĂĢĢĶ2ĦĢ !&â!!2ĶgVg !*2BBB22B !'ĊB222 !(2!!22!2Ê!B!!!ł!!!2ĒĲ !(RĶ!!òĂĂ !(222!gggV !(2ĺ6ĺwě !&2!!2wwwg !,Ģ!!B2!!s!!!2 B& !(2gVFĖĦĦĖĦ !'2BĦ !-òòĂ!!R !*2RR22º!!!Ú!!VVFF !&R!!!ĦĖĶ!!Ķ !(BĦBB !(F2Ķwwwg !.Ħ6ĪF!!!B!B!ĶĆĆĖ !&ĪRV!BcR22RB!!ĖĥĦBĆĦ !*wº!ĦöĖ !-ĶĶĂ.!Ħö!Ë!6F2c¶¥ !&swc R)B×Ħ!!!¥s¶s !)æĖÒĒRĦ !*222BBB2R !'çÇ¦¦ddd!!ÇÇ× ·& ×'ĦĖĥ!!!ķ××× !)ĶwwBB !)&ggº©©©w!!ĥ!!Ħąąĥĥĥ!!ö!ąąõõĖĖĖ ö'Ėĥ!Ħ!Ħ µ'!",
);
rawImages.push(
  "#cSStĦÆĦæĆĦæĆĦ#tQQĆÆ æ&ĦĦĦĆ#SQt #1 t&S t-SS# !&Ē!ĦĆö!B !)BcòĂÂÒĦĦ!B!öĥÕ n&± Å'ÕÕÅQböĤ!!ö r)ÕĤB !)²ł2sĶĦ !)BĆºgëÛĦB !&öĂ 2&ĶĲ 2&!!2¥2 !&å ò&ĶĦcC!Ĥ !*ĖĒÒĲ!!!Ħ!!!Ă²òÒò !'Ĥ!ĥĂ 2)Rs2s2ĒĒÂĂ±p^-òĶĶĶ!Ă¥Cs !*V!2B2©!!R!!!â! 2&~~ĂĂ !'2!222!ĶòÒĢĖ!gÊg22ěīB!!BB22Â !&B !'BR!Ķ!ĦBtBń !*2BBgR!!Ħ!!2Fgg!2VggĶBcĆcºûĦĤ!!! Ê' !,¦ËB2Ëd·BĤ !&B !&Ķ!©BB!DB!!!cĦÒ!ĶĒĂòĒòÒĒât!!!ě22Â²²²C !,ĥĥûûRR !(2 B(ËCtĤ !'ĶÒò2!!!2ī 2&ě !&ĤÊ!!22Ú !+Ĥrrr ń&ĤĤ !&w©6©ûûûssń !&2!!!B2!!!Ķ=ĶĶě©Õ !'C !&Â~± !)$$$DD !+µrårńńńĤĤ !'gV ī-Ħttńńń!!s!!222Bī !( B&!! D' $& !/·c÷rÕ Ħ*Ĥńńń !(wĶººº©ö !(QQ đ(ıı= B&$$$DDD !)ĤrĤÕr ń* !(DDDĦc!ÂCĦĆ !)â2ºÊ ê&ÊÊwµrÕÕBBBĦĦĦ$÷?///ı/?`ddttt¦×Ę$ D)!ĤĤń!Ķ!nÒò±!!!Ĥ!!!âĂĂââBĦĦBĦĖĶöæQÕÕBBB!²Ķ B(īssB!!ĶĆÅbAAAQbbµö!!!C!!222ī !,22ÒĒĂÂĢsR2c!æĦµöĤBĶ2!22BëÛöĦB!s¥scĢłł.¶Bs2 !'R !&2ö !+2 !&22ĶâdBĦĲłB!R!Ĥ!!2!!ËĥĥåBĦ!ĶĦĖ2©V©VĆ!!cĦ !&B!!Ê!Ķ !-Û º(©!ĦBw©!B !*±ÒâRĦĦBdĦcĖĦ2ÒĂĢ÷Ć!c !&Ĥ!!Â!©!!D !*ĥĦĆĆ!CCĦ~ĒòòÒÒÒB !+ĶâĒĒò±Ģ!!2R©ºgrcĆ !+ĶÒ± !+ĶÒòĒĢĦĥ!â2!!2ÛÛÛ!!!22 !-ĶÒĒĂÒòÒòĒÒĢt !*22ī!!DD!!2ÚºÊVwºgBĦåÊºÛºĶ±Ás!!!w© 2+ ī.ě !*B22ö !(ºĖĖĆB!CB!ĦBĦ!ĥĆÛ !(c!F Ë* ö/ĖR !(ĶÛw!!!ĤĤ!!Ħ!Ķ!ââ±Ħ!BBĦĦCcĥw©Ħ!!!CµÕPPP s+ R, !'2!ĶnÒs !(âĶ!BÊÊwB!Ħ!¦!ĥĆĦĦĦõĤ!!P$$DD! Ĥ)!! B) ń& !)2R=!!DD!!!òĢòCĦĦ!ĆBCĥ!Ć B&t!!!DBB!! D& !& Ĥ'!!M!DDD !'û!!!Ħ !-±dcĆcĦąÂòĒĂCBtõ!!Dö -'==ö$$$DD !&ĤĤěMMM!D !' 2'!!ĤĤ !&ĶĶ!±ÒĒÒĢB©Ûċû!!õt!!!~ Ħ(Ķ±nõõÕĦ$$DD!!ĤĶ!ěM!D!!!ĥwºººË!Ĥ !&©úûěċīīīÛûC·R!õR!tB!!!Ħ! 2&!!2©ĆÖö¤õB!!Ę??Ķě!ùM!!!DCĆæĆĆ !)õrPńńĤ!!PńPńńń·!·BĤ !&wÚĶBRÚÊ©Ć!2ĶĶæÕĤ!!VĦĶµr¦FÕ÷$Ħ!B!BB !/Ĥ!D !'ĤńĤĤ !'ĂÂBĶĦÂÂÒcĒĲĲłB!!Ĥ!!!ĶÒB2ĦöĦBBR!!Ħ !*÷÷·÷DDD!!DD !.22 B'ÛCV!2©cÒ !'2û!!2!!Ĥ !'Ħ !)ĆæĦæröM !&D! D' !&wĶ! Ë'!ĥĒ2ËĆCī !'2~âĂĒĒòDĤB!2 !+âcBBònĶMĤĤ!Õ· r'·÷!Õò2! ±'ÁCºgąB± !)2 B&ÛĤ!!!Ķ¦¦R !(ĦBBcwÚº !&²² â&Ēc!$!22!2ÛwĶ!Ķ±âBBĦ2 !&Ă!!ĶĦĦĦĶs!!!cÇ!RB !)¡B!!²² !&ĆBBRRRw!·ńĦ2!!Ķ±ò2!!!ĶÒâ¦ě!p`n !+D!!·PPńĤĤ !(êĦĆcÚwě!!Ł!R©wwwB!!!ÒĶĶ !'22ÛÛÛË±!ĤùīB!2!2BBB2ö!!!ĦD !/Ć!c!!!ĆBĶÒĶĦĶ !+2ÛÛË©ĵĵąnĶ!D!!ÛB2!ĶĦĦĶě!!!ĤBĦ$D !*ÂĂccĦ !'2!!âòòâ·Ĥ !(Ķ±±±ÒÂÂâ2B!Mp!!Fw222Bī!!Ħ!!ĤBB!DDD !(ĶÒ·BĆĤ!!cêÚÊ!2B !' 2,!2B!!ě!=s!ĖºÛÛËöö!õD!!!=ŁÕbĤ$$ !'2ÕĦ !&wöĶ2ºÊ©© !'Ķ! Ë)Ķīěě!!ě!=Ă2Ćåå~~Áå!Ħ!!!ĦBÒĢDB!!!B!!ĶâĂc!!!²!Ė!BĖĆt!!!û!2!ÁÁ s&RĻ! Ĥ&!2Ķ!ĒĦ!cgB!!C!D!Ĥ!!!2 !'2ëººûě· !&âĂÂÒĒc !&R22ěěě !&ńĤĤ !&Ĥ!Ķ!!ĢĂÂĢººc !&`!!2©ĦĤB!!ÚRtt!ĤĤ!!DB2Êěċût!Ĥ!!ńĉù Ĥ(!!!DD!!!D!2!!!2BËĖĖ !&p2ûº©Ħ !'t ń&!!!Dıc!·nBńńń !-pĤ!p-!DDD!Ķ2!!!ĶĦ~ââÒÁB!ěùsæöĖĖ!Ĥ!!ń !(DıRīBĤě=p !'ĘĘ ÷&OOĦOO©ÊÕöĦĦĦ!2 !&2BBB2ě!!Ĥ !&R !'D !&p`-Rī-Ļ!ĤīĦ!!ĘĘ÷ÅÅæÖÖÖ66FFFöööåńBn2F!!2B2ûûËËöĦ !&2!B !(÷OOOĶ!ĻīMB !&Ķ?O~~ÂĢĢĢ Ĳ'ĢĢĢĲ2R¦!M!ěĶ!!2ûËąõåĥ !'Ħç·C !(ÂĦ Ė&ı-ĶěÕ!!Ħ!! 21ĶĒĂÁD!ěö !&ĖĥĶ²Ēâ !)Rss !(ĶBRBBRBīÕ !'2Ķ!2ī2!2 ī+2ěě!ě!!Ķ!!!ĵĦĖ!2 !)M-ıQ$$ !'2!Êgº©-âC!!!B22ÛËöûċě!!! Ħ(ě!!!M !'ĶÂBĶ©Ë© !'nĦBRB !(2!ÊĆcĆÂ2!!D!!ċĉĉPPPńń Ĥ& ń(ĤĤĤ!û=ÁĂ!!ĶĶÒcĶąĆ !'Ė!2ºB!ń!!!2!!Ćâ¡ĂBºËR!!ńB D,!!p D)!!2Ķ !'ĶÂĂâĒÁB!Dp2!ĶÂânD !&2Vc!2ëgĆ!B!!DĦöµµµÕÕö=-!!p!MörQbQrÕńěĶ !(2BB2ě!!!ě2!!22ě !&ÛVĶ¡22~âĂÁ !&ĖÅÂÂÒ²²~ĶĻĤ!ùĦĦ~cB2B!t !)2B2Ë©göĦ!ĤĤ2!!ººĦĤ!!!ĥ2Ă©Ú©ë©Êû !&ąĂ!2ûÚÚÊÊÕD !&BC c&B !)ĶĦĦ±â !*2Ò !'ĦC2ĶĂÒĂą!!!Ħ !'2ÚĕĆĶĦĆC !'Ħ~ Â&Ħ!Ĥë !&ëÊ!2ËĦ !'ěB!º !(sĂ!!ĶĦòĂĦ !(2ÚĦĦ2ĶBB±!!pěĶ!!BBB2 !*~Â!Ħ±Ģ !(BĶÒÒnD !+ĶĶòn !'VÂâòĶBĆâ!!!ùnĶĶ2ĶûËº !*2BBB2ě !(©B22ě !(2!!22!2û !'òĶ!!¦ÂĂ !'Ħ2!!!^±Ò !(222!ûûËö !(æ©©©ĦĤ !&2!!2Vºº©Ė !+~!!B2!!!BB!2 ī& !&222ċûËõĖ!ĥ !(2!ĆĆ !*Ķ!ĒÒâĆ !,2ĻĻěě !&ī!!öÕÕÕ !&B2!!õąĦ!!Ħ !(RĆcc !(º2!Vºwgc !-=örÕ!!!ě!B!ĥĦĆĦ !&º2Ûõ!BBĥĥB !&DĦdĦĆ !*Vw!ĦĦBĆ !,ĶĶ~ĢCĦ!!Ĥ!wËCd×· !&CÛR t)RBĤ!!!sc×t !*còò!Ħc !)B22BBBě !(µPPPńńń!!PPP ń+Ĥ!D!!!µńńń !)ĆwVBB !)wÛÛÛËËËö!!D!!Ħ$$DDD !&$$DD !+D!Ħ!Ħ $'!",
);
rawImages.push(
  "#cz-ŀ-jjzjz ½-zŀŀ--½½j½½zz½½½j ½( Í'ÝÍÍÝíÝÍÝÝÝÍÍÍ^^^æ!_3!ĊĊĶ!ĶĦ !-p!!2!!!ĦĦĶĶĖĦĦR !( Ķ(222!2B2!!222o!!c!!_!BBĊĊĊú Ċ& !*3ĵ!ú!!!Ķ222ĶĶĖĖĦĖĦ!ĦĦĖĖĦ! Ķ&!!!Ķ !*Cs2!_N>o_o² >& Ħ'!B2_S22úĚúùúĊĚĚùĊĪĚ2BĦĶéĊĚĊ ú'ê!ê!!!ĶĶĶĖ.!]!s!2Ķ!Ķ2BĦ!ĶĶĦĶĶĶ!!Ħ!B2NN !&3 !&3B!NB!!ù3o__NN>ooo!oĶĶĦĶĶÚéùĖ!!!2B222!ĦĶĶ!Ķ2ùùùéé!ĦĦBBĶ>N¡²_oN>_oNNB2 !'ĶBĶĶ!ĶĶ2ĶĶĶĖĦĦĦĥ!Óo!!!s!B!Ķ!Ķ!ĶĶ!ù!3¢¢¢ĶĶ!!!2!BĖĦRB2R!ĶĶ!!!2!p2ĊĚê !'ĶĶĶĦ Ķ&!3ĖĶ!!ĖĖ!!B2ĶĊéùùB!3oĶĦĦ2RB!Ħ!ĶĦ2B2ĦĶĦ!!2B2!!B2_¡N_22B !' Ķ&Ě!!ĶR!ĖĦĦ!!ĦĶĊĥ!2Cú!oĶĶ2cB!Ħ!ĶĶ!!B2!B2BBRB !&ĦĶ!!2!ĶĶĦ!ĶĶĶĦ!!!c!¢ĵĚú!ĦĶ !'ĥ!23!B3!Ķ2RĦĖĦBĦ !*B!ĦĖĖĦĖĶ!B2BĦĶĶ!!ĶĦ !'ĚĉêBĶ¢N2!Ķ2BĦ!Ķ!¢23!B2R!!2!Ķ2!!Ķ!!2Búê!!ĦĖĦĶ!ĶĶĦĶ2BĦĶ!!222BĦĶ!ĶùĵÃ_Ħ2!R!!R!Ħ !&ù3!2!>o!2!RRBĶĦR22BúĶNĶĦĶĖĦ!Ķ!!!ĦĶĦ!!ùĊĊBB !(CĦĶ!!ĶĦ!!ĦB!B2!ù3222!Īúĺ&ĺêĚĚ2Ķ!BRRĕ!!Ħ!Ķ!BĚB2!Ķ!ĦĶĶ!!_¡Ė!!R !(2N!!ĪĶ!s!!!2!¢o__NN_oo¡¡¡o_B2RRBĦ!ĶúĚĪ!BĚ!úĚĪ2BĶ!!ù!ùĖR2ĦĶĦ !'Ķ2!ĺĶĦ!!RBR!!! B'Ħ!ĶĦĦĦĶĶĦB!!º¹!²o>Ķ2Ě!BB!!Ěú!!ù!3Ãc2ĖB2 !'Ċ2Ķ !)RĶĶ2ĶĦ!!ĦĦBÊÊÊ¹¹ĆĦĶ!Ħ©Ķ¢Ã!!~ !*oo !(ĶĖ!Ħ2c22pĥ!ĊĪĚ!!ĵ !&Ķ !'Ħ!úÉĵĵĵpp!Ķ2!Ķ!2BĦ!Ķû!2!!N>No22!!CC2ê!ĶĦ!2!!B2p__NN !(Ħ!ĶB2!!Búĵ!333ĚĪ2!!2!R2úĪĊ2B2Ċ_ÝĚĪĚúê!2!!!2BĊĶBĪÚêúĊBRBB!Ķ!!3!!!ĶĶ!!!ĶĦ!!!3o²²¡oĶ2B!Ħ_oo!oRB¡BĪû>No²²!R!_¡o_>&Ī>_o2ĶúúúĚĺ&!!!Č!öĖĖĦ!B2 !&o!ĖĖĦĦ2B2!!ĦMĦ¬ĖĶĶ!!½BRBMĶ!!ĶR!!!ĦĶ.>ĶĦĶĦĕĦĦĦłNN_!!ĥö Ķ&Ħ!BB!2!úĶ2RBBB2!ĖĶĶëĶëĶĦĶĦ>ëĖĖĖûĶĶ22ĦĶĦ!B22B2BúĕC2RR!Ė!!!BĆ!Ķĉĉ!ĶĦ!Ħ!23ĵĊúêúĊ2!=Ķ ù&~!nĖĖn!~~±±nn^n±2B22RRnB!ĕC!B¡¡R!!Ė2!!!ĉ!322B!BĦoop___¡o!Ķ!~ î&!~{!!Û^!ûċÛÛëûëûRBBB^^ĶÉĖ!!B¡!!!R!R!!B!!3_BĶĖ !&B222B!ĶĆĖĦĦ{ûû{û!pĶ^±B{éúĚúúúĊĚĊêÊŁ|lk!ù!22úú!Ė!!Ċ!!d!!!2Ħ!2ĦĦ!!!BRRB!É~Ċ!!Înnîn!^nB!2þþ í*ÍÍ!Ýíþ3C!ĦĦĶĶêĺĊĊĶĖ!]!3!!Ķ2!B!!Ħ!2B2ĦÊĦ{oÛ!!!B¿ěûûB!{|ÏěëËċËÛûëë!¯{JZk2Ķ3B!¡¡¡__!!_Ħ!Bo!úùĊĪúúĊĚ!2!!úĵ!3ĆBċB!!čĦén!!þýÝ~ÁÑ~BM !(2!!ĥ!BĦĦÚÚ!Ė!!!Ċĵ!RB²o¢²_oo¡¡2!ĶĶ !&Ñ2ù¯BB2Ñî!!222!ÛËÛċBëĆ!!!Í3223CBĦ!B!!ĦR !&Ķ!!R!BRĶÚÉúÚêêêĶĶ!3Ď!ë!CRû2ĶĶ!!22!Ķ!±ÁÁnM±~ !'3!ĵĶĶ2B!22ĊĊĊ!!!Ķ!!!22ĶÚĵ3!!oNo!!o!{!ĶĚ!_ĦĦĶĶĦ !(ĶĶĶ!22Bnn!!ĵĵ!!ĵĶ!!²_>__>>!!2!!!B!Úĵ!2²oĖĶ!ĶĦĦB3ĵĚNBn±ĦĖĦ!B !&ĶĶĦĶûċīěċċċ!îp¢!!!2!ĦĖĶĦĦB!222 !)C¡ĖĶ2R!MĶ!o²C2ÁÍĶĶĶ !)ËËÛûċ!ĦĶĶĶĖĶ!!~Ħp !'2!ĶĶĦB !(ĦĶ !&2!!Ħ!ī!!Ħ!¡2!¿ċĶ222!ĦĶ22ÑÑcBĦ-!!!ĦĦ!B!!2ĶpoĦ!Ħ!!!2B!!!3 !'_3ĶêĚĺĪĪ2!2!BĦ!ýB!Ċ2BBB!B !&ËĦ-!ěBĦĦ!!!ûB!Ċ2ĶĶĵĦ!B!!!B!!2!!!ĦĶ22___>>o¡!ĶRRBc±!Û!!!|¯ë!!!¯¯ë!Ħû!!Ħ!ĦĦB!!ûBĵĊ2!p!Ċúĺ&ĺ!B !'Ķ2ĶB22B2ĪúêĦ2!2-M!ë!_Ķ!!Ħ!B!!ÝÝ-Mn~~~n^~n!ĦĦĦÛî!ĊĊĊ !&Ķ!úú2!!!ĖĦĖĦ!BBĊĪąĦĦêÚêÚÏĦĆ=MM½ĶÍ!Ħ!!!ëËċċ !&ÛÛÛû2B!ĶĶëoBBB!Ķ!22o_.Ķ2!!ĦĶĶĶĦ!ĊĦąCĥ222!ooĦ û&Ï¯Ķ2n!!¿ê!!!ûë!ë!~~B !'2ĶN¡²B!!!oĶĖB_!2!Ķ!!2ĶĦĶĥĶ2¢N>>>Ė-ċ!Ķ!Bo²¿Ķ!!!ÍÍM!!BBëĦB2!!!2B22Ķ2!ĶĶ²BĶĖÚúĪĊĊ !(Ķ2ĚĕĶ!õÉÉù~ùù¾RBRB!M!_!Ħ!¿¿¿ßĚĚ^~~ÁĦëěĦĶ!!!Ķ2Ķ!!ĶĶ 2,!2!22B!!!Ķ!2B!¯ÃppĖ!ê!!ûĦ!B!! Í'ýB¯¯¯ĪB!B2=2B2!2!Ħ!Ķ_²¡__ooo.!!B2Ķ!!ĦĶ!!22!32êĚĚĚê!êêĊ!!.Bß Ï'||__>_ĊĊ22Ļ!!BB!ĶéÉêúêú!ĶĆĶĆĶ!!!Ķ2BÚĵ2!2!!32¡_¡2 ĥ&NNĶĶ2!! 2)ĦĦĶĦ__ĶĶĶ!!ĦĦéù!3NN_¡22c!B2!!R2 !)232¡ĦĶúĕ!!CCĚĪĺĺ!ë>__ >'BB2!ĦĖ2ĶĶĶĦĶé!!3o2ĶĦĦ22ĶĶĦ!2Č!sB!ĵ!!2232!ĦĶ!Ķ!!C2RRB>.n2B22 B&n22!ĶĶ2Ķ!ĦĦĶù!!3!ĊĚĪĚĊêêúĊĶĶ!ĥ!!R23!3SSRB!Ċ2!ĥ!!!BN.NB2ën!!!ú2BBĻ!Ķ!!!BĖĦĶĶù !&Ò²oN>.>o_>!!!Ħ !(2ĶÂ__B!Ċù!!CRNĦ !&~!ĦĶ!¡!ĶĶĶ !&2!ĪĶĶĶ`pp!!ĶĶúú22!!2 !*2!3!2ÊĊ!.BB3!!!ĖêBB!!ĶûûB2ÊÊÊ ê&úĚĪĚúĦĊĉ Ī& !&Ħ2ĚĚĪú!B2ĪĶB!!!Ķ2!BÂo_!R.ĖĵC!!R¡Ħ!Ħ!!!n2Ê!!_NNo ¡&o!!ĵ! N&ÃĵĶĦ!!²²¡oĶĖB!!C !(ĦºêêĖĖ!ĵCBC!ĖêĊĚ!Ė~Bī!!!_!Ķ!!Ķ!!ĶĦĦĵ3CĪĪBBúpĦĶB2ÚêÚÚÚĚĊ!!]!!!22BB¡_N!ĚĚSB>BBBRRNn2ëĦ22!² !&Ħ!!!ĦĶ!!22oÂR !'222!!!oN!ĶĶ !&Ķ!Ħ !&Ě!22>Ķ>>>..!ûB2s2!²!!22BB2!Ķ!!_3¡ÂR!ĖúĦéúĊĖĖĖ_oBú2!!Ķ!!!Ė!¡BĖÚĊĚ !'2!Ķ!BBĦB!c !&Ħ!!BĦ!Ķ !(êÊĖĖ !&BB__o!!_RĪ!!ĵ!!Ė!Ķ!¡BR¡__!Ķ.!BB2BĦĦB222ĶĶĦĦĶ!ĶĖĶĦ!!2!!!__N!ĦúĦĵ!oN!2BĦĖ!_ !-¡ĶúĚĚ22ĪĚĦĖ!!BB2!2ĦĦĆĖ Ķ&!!ĶĦĶ!B2!2ĶĶĦĶĦĵĶCÚú2!!BR!!_!Ķ !&ĦĦĖĖĶ¡¡o 2'ĚĪ!ĖĖĦĖ!2!ĦĶéùĉĉĉùùĊúêÚêB2!2!Ķ!NĶCBBBĚĚ Ċ( !&ĖĦ Ķ&ĦĶ!2_ >&2!Ě22!BêÊÊéé2Ķ3 p&oo¡Ò²!!ĶĶ!222¢oooN>N.>__>_ !'Ķ!ùù2ĶĖĖĶ2B!ĶĶ>22ĪĪĚúĶĦĵĶ!ĶC_ĖĖ Ķ&ĦĖBBB2!2BB22!!ĦĶ!Ċ2B!ĦB!!ĵ !&ù!!éùùúÚĶ2BR2!>!oo¡oNĵĶ!p!!ĖRcBB22!ĦĦ2BB2ĶĦ!!ĶĶĦĶ!ĚĶ!Ħ!B!ÚąĦ3!!ù!!!33322êÚê2BRRoB2!Ħ!!!p !(BBRB!!Ķ!!BB2BĦ!22!!2Ķ!ĊĚú!ÚĕĦSB !'dRRR B'! 2&ĦĶĖĶéĶ¢22!ĥĺĶĦĖĦĖ2B!!!2!BBĦĶĶ!!!2BB !&ÚĕBSB2 !&C_>..>.>oo !(Ķ!é!!!2R2!ĵ!!!ĚĚ!!!2!!2!2B22!ĶĶĶĦoB2!!2B3o>!Č !&êĊĚĚĊĚBĶ!22!!Ķ !&22!!ĦÃ2!ĉĚĚ!!ÚÚé¹©ºÊêúĚĺĺB222B!o¡¡¡!!!Ī2!ĥ!!!¡_N_¡²²222 !&ĶĶĦ!2!!Ċ!B!¢p3 !+2!!2¡¡¡!ĪĪĪ!ĊĊ!!!¡C_!Ī!Ć",
);
rawImages.push(
  "#cÍ^M^½½Í½ÍÝ í+ÝÍMM^^íÝ½ÝíÍÍÝíÝ½ííĈ í*tíít¦tí¦ttííí±±±æ!_2!ĊĊĶ!ĶĶĶ !,o!!2!!!ĶĦĶĶĦĦĶBĶĶī !*yðð2ĔĤÎĔ2!ððð_!!c!!_!R2ĊĊĊ ú&Ċ^ !)2Ķ!ê!!!Ķ222ĶĶĦĦĶĖĦ!ĦĦĖĖĦ!!yyĶT!!TĶ !)CĐ2!_>No_o²_NN>!ĦĦ^^!B2_B!2ĊĚúú^ĊĚĚúĊĪĪ2BĦĶêĊĚ Ċ'<,T_Ķ!!yyyĦ.!°yĐ!2Ķ!Ķ2BĦ!ĶĶĖÛĶĶëëĶĶB2__ !&2¿!!!2Í2>2!!ú2o__>>>_ĬĬ!ĬyyiĶĶêêúĖ!!! 2'!ĦĶĶ!ĦBúúúêê!Ķ^BnĶNN¡²_o½>_oċ>22!^!!^^^ĶĶ!!y2ĶyĶĦĶĶĶĦ!Âo!!!Đ22!Ķ!Ķ!ĦĦ!ú!2¡¡¡ĶĶë!ċ~^nMĦBBċR!ĶĶ!!=!ċo2ÏÏÏ !'Ķy! Ķ'!2ĦĶ!ðyy!222ĶĊêĊĊR!ýoĶĖ^2BB^Ķû2!2~n^~^~±2^Mī!B2_¡N_22B !&ĶĶĦĦĦĚ!!ĶR!yĦĦ!!ĶĶĊĦ!2Bú!ĆĶĦBěB2ĦûĶĶë!!22 !'~B!^^=^^=~n~~^^!y!Ķ!!!s!¡ĶĚĊ!ĦĶ !'Ħ! 2'īĦBRĶĖ^BĶnn!û!!!2!ĶĶĶÛëċûċ!ċěċëëÛÛÛëĶ!Ķ!!ĪĚêBĶ¡N!!Ķ2B^!Ķ!¡22!!2R!!2!Ķ2ë!Ķ!û2BÏ¿! Ķ'~ĶĶĶ=ī2ĶĶ!! 2&Ķ!!ĶúĶÂ_Ħ2!R!!R!Ħë!!!ú2!22N_!B!ÎRBĶĦBċnBĊĦ>ûĶĶ!Ķ!!±±~Rn~~n^~~~±~±nnnÍÝ^Ķ!!ĶĦ!!ĦB!B!!ú 2&!Ěú^ĺĪ_ĊĊ2Ķ2BěÎz!^Ħû!Ķ222!22!!!Ûû¿ëċÛûûëûûû¿Ïë2N!!ĪĶ!Đ!!!ð!¡o__NNooÕļĊĊĬ_B2ĀÎÞÙ!ĶÏĚĪ!222!2 !'Á±ý±^R!!2Ħ2 !&Ķ2!ĺ!ĶĶyðBĀ!!!2BBB2Ħ!yi¾¾y!Ħ^!T>¯!²_>Í222!2 !*Ķ!ċ^!!!B^±ÝÝĊ2Ķ!!ĶĶ!!yðĶy2ĶĶ!ĶĦĶBÚÚÚÊÊĖ^~BiĠ½¡ī!!~!ë!Ķ !*Ķ!Ķċ^ċ^!!!ċ!BĦ!ĊĪĚ!!Ķ !&y !'Ķ!úÊĶĶĶoo!Ûëû!!ÏB==n!!2¿!ĶĶ !'Ķ!Ė!êċĖ»!Îð!ċëû__NN !'ðy!!22!ĶBúÍ!222Ěĺ2!~2!B!=ïï!ě¿ĊN222 !(Ė2BÝ^±ÑĊ_<ĊĊBRBB!Ķ!!2 !(2!ĶĶ!!¯2¡¡²¡zĶ2û^Ķ_¡ī!¬ěðĬBĺë2 !)22!!!ÏÏ>__!! ú&Ěĺ!!!ìðXĖĖĦ!B2 !&¡ĶĦĖĦċ2~2ĦĶĶ=Ħ>!Ķy!!¬^ĖĶĶû¤ûûûċċċëÛ.>ĶĦ!ĶĆĦĶĶ>___22ĥXĶĦĦĶĦĶBB!2!êĶ2 B&ċĶBĶĶ2nn2n^×¬Ķ!2!!^×^^MĶĶ!B 2'ĊĖB2BB!ĦĶ!!2Ć!ĦĚĚ!ĶĶ!ĦĶB2ĶĊúúĊĊ!!!ÛnnĶ !'ĶĶ!22!!ëċĦċě2B!!BB2B2ĆB!BļĬB!!ĖĶ2!!Ě!2B22!~n_oo___N_!ĶĦn !&2!!!Ķ!22!!ë!Ķī!2^ðĀÎð!!ÊĖ!!2ļ!!!B2R!!B!!2¡2ĶĦĶċë! 2&B2ĶĖĦn!¯ċċ|ë!Û»Û!¯l¯ÏĚ ú'ï<,_ŀÚÊ!ú!2!,,!Ħ2!ĊĶĶd !&Ħ!2ĶĦ!!2BBB^!ÚÚĊ!Bý~Ķ!BċĦ!!¿Ķ2BĬļHĪ(ļļ___ĦĦĖĶ2B!Ħ2!!<ĺĊĊĶĶĶ°!2!!Ķ2!B!!Ħ!!ĀðċÚĦBoË»llúB!Ħ!nBĶ2R_yXi{i2!ð!êĦĦ222Ķ2B!ļļĬN_!!_Ķ!2o!êúĊĪĊúĊĪ!ðĔ!ĊĶ!2Ć~B!BBBĦêně!!2Ĭ!Ħ!!B!!2 !&2!!Ħ!BĦĦŀ,!ĦĶ!!ĊĶ!ĀB¡o¡o__o¡_!!Dy !&~ěú2!B!!!û!2B½<!B~ððĖH !& 2&BBĦ22!!yB !&ĶĶyð2BB2ÚÊúÚúú<y!!2!!ě!BR¡_>Ķ½±!úBÏĦúú¿,<2~ !'2!ĶĶĶ 2&!ĊĚĚ!!!Ķ !(ÚĶ2!!oN_!!N!B!ĦĚ!_ĦĖĶ!ïÏĚ2Ħ_B 2&!ĪÏ,<ĊĶĶĶ!!ĶĶ!!Ĭ_>_N>>!!2!!yð!ÚĶ!2²oĖĶ!ĶĦĶR2ĶĪNBĦĶRĚĚ222B_ĖĲ.>_ĬĬļĊĊļ__No¡!!!22yĖĶĦĶB!!22 !)B¡ĖĶ2R!!Ķ~N²B2ĚĦĪRĊBB2NoYĖBB2Bð!yĶDDi!!!ĖĖo !'2!ĶĶĦ22 !&ðyĶ !&2!!Ħ!!!ëĶĶ¡B!B_ĊĶ!ĶĶ!öěR±RĐðyX!!!y^!RB2BĦooĦĶĦ!!!222!!2 !'_2ĶêĚĪĪĪð!2!BĶ!!B!ĊĶ!Ķ!ĶĪB!!ÛĦyy!BðyyĶë!!RĚĊBĦĶĶĦ!B!!!Ā !(y!!2___>N_Ĭ!222ðĐ!__!!Ķ!!o!ĦĺĺĪR!ĦĦ!!y^^Ķ2ĶĶ!cĶĊB!o!ĊúĺĺĪ!ð!2!!ð!! 2&B2Ěú<y!2Ā!!ð!!_!Ķ!Ķ!NN___^!ĶĶĦĖ!ëÛĶ2ĶĶĦ>c!ĊĊĊ!!!Ķ!!<< !&iĦĦĦ2BBĊĊĖĶĦêêú ,&ĊĊĊĦĶĶ!ĦĦ!Ħ^^ÛĶ!!ĶRĦĶ!2!2!ĶĶ.oRRB!Ķ!!!Ĭ_>!!2! Ķ&Ħ!úĦĦBĦ!222ooNN>>>B2!BĊĺĚĊ¯ë!!2±R!!!2B!2!!!2Ķ>_ļB!!2ĬyĦB_2!!Ķ!!2ĶĦĶĦĶB¡_>>.ĖĖĶ!Ķ!2_²!Ħ!___Ín!!Bċ!ĦBRB!!!222Ķ2!!yļBĶĦ,úĚúú!!2!!!Ķ2ĪĦĶ!æÊÊ ú'B2RB2^Ķ_!2nĊĊ¿¿ĚĚêêê!ĦĦ!Ħ !&Ķ2Ķ!Ķ!y2BB 2'!2!2!222Ħ!!Ķ!2B!2ÂooĦ!êĶĶëĶ!2!Ï!ÍÍ!!!222ĚĪB!B!ð222!2!ĶĶ!_Ĭ___ĬĬĬ>!!22Ķ!2ĶĶ!!22!22^ĚĚĚú!úúĊ!!>!!2Ï! 2&ooN_ĊĊ!ð2^nB2!ĶêÚêú<Ċ!!XyXĶ!!2Ķ22ÚĶ2!2!!22¡ë¡B Ħ&NNĶĶ2N222ß½½2!ĦĦĶĦ½½!yÇċûĦĶêú!2NN_Ĭ!!Đ!B22!ð2!2 !'222¡ĦĶĊĆ!!BBĚĪĪĺ!Ķ>NN>ûBÍ>222~!Û!!ċĶĶĶê!!2o2ĶĦyððy!Ħ!!ÜyĐB!Ķ!! 2&!ĦĶ!Ħ!!B2BB2N.!2B2!BBû!±22~ÛÛ±!ĶĦĶĶú!!2!ĊĊĪĪĊ<<ĊĊĶĶ!ĥ!yð!2!2RcRB!Ċ2!Ħ!!!2_>NB2Ķ!Ķ!2Ċ!Ā!!n^!!!ċĖĶĶĶú !&8¡¡N..>__>!!ĶĦ !(2ĶĊ__B!Ċú!!BB_Ħ !'ĶĶ!!_!Ç!!!ċë!2!ĺĶĦĦNoo!!y!Ċú22 !,yð!2!B_Ċ!.BB2!!!Ħê22!!Ķn22!ÚÚê ¯&ĊĪĺĪĊĖĊĚ ĺ& !&Ė2ĚĚĪĊ!B2ĺ!B!!!y2!BĊ__!R.ĖĶB!!B¡Ķ2ĶĶ!ċ22Ú!2ÝÝÍÍÝÍÍ_N!!Ķ!NN>>ÂĶ!Ħ!!ļļĬ_!ĖB!!C !(Ħ>êêĖĖ!ĶBBB!ĦêĊĊ!Ħ222!!!ÝĦÛ !'nĶĖĶ2BĺĺBBĊoĦĶB2<<<êÚĚĊĶ!°!!ðð!BB¡_N!ĚĚRB>B 2&_B2ĶĐĀĀ!²Ćû!ë2!!!ÛĶ!!2B_ĊÎ !)Ķ!!!oN!ĶĶ !&yBĦĶ!!!Ě!22>Ķ> N&!ĦBİĔĔĶ²Łě22±!!!Ķ~±í2¡ĊÎ!¾ĊĖêúĊĦĦĦ__Bú2!!Ķ!!ðy!_2ĦÚĊĚ!!2!!2!Ķ!2BĦ2!Ķ!T×!2!!BÛë !)ê_¾¾ !&RR__o!!_RĪ!!Ķ!!y!!!¡BB¡__!Ħ.!B222ĶĦ22!ĤTĶċ^2!ĶĖĶĶëû2ë!!í_>!ĦĊĖĶ!_>!2BĦĖ!_ !'ð !'o2úĚĚ22ĺĪĦĦ!2BB2!ð¾iXĖÛÛĦĦ!!ĶĶnĶ~ë!!~~^ĶĖĶĶBÚú2!!BR!!_!Ķ!!!Ķ Ħ&Ķ_oo2!!Ķ!Īĺ!ĖĖĦĦ!Ĥ!ĦĶêúĚĚĚúúĊĊ¯¿¯BëëëÛÛ!>Ķ B&ĚĚ Ċ( !&y Ķ)!! N&>!!Ī22!BĊ_Úêê2Ķ2 o'_o(¡!!ĶĶ!22B¡oooN>N.>__>_Ķ !&Ķ!úú2ĶĦĦĶ22!ĶĶ>!!ĪĪĪĊĦĖĶĶ!ĶB_ĖĖĦĦĶĶĦiĀðB2!2BB22!!ĦĶ!Ċ2B!ĦB!!Ķ !&ú!!êúúúê!2BB2!>! _&NĶĶ!_!!ĖRcRR22!Ħi2ðB2ĶĦ!!ĶĶĦĶ!ĚĶ!Ħ!B!ÚĖĦ2!!ú!!! 2'êêê2BBB_Îð!Ħ!!!_ !(2BB2!!!Ĕ2ðB2BĦ!22!!2Ķ!ĊĪĊ!ÚĖĦRB !'B2BB222BB!!ððð¾yĦĶêĶ¡BB!ĦĺĦĖĦĦĦ22!!!Ĕ2ðBĦĶĶ!!!2BR !&ÚĖBRB !'B¡_>>N>N__ !*ê!!!2R2!Ķ!!!ĪĪ!2 !&Ĕ2!B22!ĶĶĶĦ_RB!!2B2o>2Ü !&êĊĚĚĊĚB!!ðð!!y !&22!!ĦÂ2!ĚĪĚĶ!êÚêÊ.>N,ĊĊĪĪB222B! _&!!!Ī2!ĥ!!!¡_N_¡¡¡!!ð !(Ħ!2!!Ċ!B!¡o2 !+2!!!ĊĊĊ!ĪĪĪ!ĊĊ!!!¡B_!Ī!Ć",
);
rawImages.push(
  "#cSĆĆ¶Bscc¥¶ÖĆtS#Ć¥B>Nos¶¶¶¥æĆtĦ æ1 Ħ&Ć Ħ-ĆĆ# !&B!B!Ķ !(B!ł2B&BĦòĒĲ!B!ĆĖæÒÒĶö ¶' Ò&²ÖæC!!æ ¶)ÖCB !(ĲĢłc!!!B!!!C!2B&BĦRB2F !&ĖĲ22Ħ!scRR>!BBBV!!s!!ĖĒĒĦĦĶĦBRsC !(6!©Ķc !*ĪĦĢĂĢ!g&!!C!ĶĲ!2wĦBĶ!R2!BVVFĶ!2µ·!ĒĶĶR!Ħ!Bc !+ÚöĦ!BR !*22RcĶB !&Ħ!Bw!BĦBBĂBV&ĦĖ!Ħ!2!!C!2BĒR2B2C!!B !'2Ė!BĦRB·Ħ !&.22B©Ė!!!B!!ĶgwĖĆB!!ĶBĶ22!BĦB2B!B!!!gVĖ2B!!!R !(BĶ!B¶BC !(BB2!!Ħ!!BBsĦ2ĦöĦcĦĢĢłF2ĂĢ2!BĦB!!!RB!!Ė2Ķ2 !-2BR !+w©©©öBRRRC !'ĢâĂ22!BĂ2BĲ!ĦBB!!Ħ!V!!!2Ģòò !*ħħćć×··s !)ĖĖ!sRccd !)BRB!VĦ22!!!BR!!!B!R2Ķ2!BBB !*µµµÕö Ħ&ĖĖ!!ė···dddCC!!!õ!!!©gVVV!ĶwgggssB×××Ħ!c2ĶĶ2BBF !( B'!ĥ õ& ą&B s,Ħ!¶sÖ22 R&¥RRB÷×××ĦĦöĖĖ!6Ħ2ĖĺĊĶ !( R,¶öĖBBµµµÕÕÕ ö'Ė!·÷·÷÷ ×*ĦĦööĖĖĥĥĥĦBłĶB!B2 !(.222B22BĶ!ĆæĆÖöBBBĦĦĦąµ=MMMB õ'ąąĥĵ1QµÕõõ ĥ&!CCdBĦBĶĦĦ2!!!C!!!..>.>sBs¥c2ĖöæsÖöBBB!ò22BBæ¥ssB¥cBĦĖöÖcBBBRc¥Ææ!!!2!BĶRĶĶ !,2B22R22ssRc!ĆĖÆĆtB!!2wwĆ!Ė2R2!s¥¶css¥s¶cs2!B!sRB2!2ĖRĶ !+22!!BĦĦB2ĦBĦ>Nc!B!C22w!ĆĶĶsĶ2Ķ!ĦĶĖR!!2BĦ!!BĶ !&B!Ē22!2 !*R2VFĦĦB!âĶBĦ2Fg!R!!s2g!Ć!łłĲRĶĶ2ĂĒBĖĶBĒĢs!Ħ!B !&C!!B!!2 !(ĺV&&ĶĖĶĂâĂ2Ē!2ĂĒĆĖĦd!!V!!ĲBFFĺĶłBĶ2B!!B!gw!!BĦ !(2!!ĲĖ !*ĶĂĂĦ22g2B2w!RB2c!R!B!Ė!!ĶĒĢRB2F!!wF!RR!ĶöĖB!B !+B2 !*Ē!BĶ!Ć!©wwĦĦĖw&ĖBĶ !(B22Ħ2ĶĦ2RĶĦ!ĶĖĦ2B!Ħ!2B !*F!Ķ !*B62!¥2ĦĆĖ!B2ĆcBĦ !)gggBBRsBBRsRR2R!RRsRB2B !)2BĶ !)&ĺ!ĢĢĒĶ!B2Ħ!2BĦ!s !&¥Ç ÷& Ģ+Bccc B( !)Ģ!ĦĶ !)2!2VV62!Ħ!RĶĶĦ!Ćö !&¦ąµÕÕö ě)!!ĂĂ ò&Ă d& !&B!!!BĦ !(>!!2BĶĶ!ĦB2Ķ2ĦB!BBRR!!ĥBB!!ĥÕÕÕöĦĦ! ě& ī&ě s'!!!g2!!ĖB !)Ĳ>!ĦRBĦBĦĶĒRłĲBBRĖB!ÕĆ¡ Æ(æą Õ&ööĦĦĦ !-ĶFF!R2 !*ĦĒĢĦ!B!BBV!º©2ĦĖR!!!âĦ æ(ĦæÖööĦąąõõĖ ö)Ħ!!!2!ĶĖRB !(ĪwºÊº s'2sB!ĖBBRB!!!Ħ2¥.>NNsĂĢöÖÖÆöB!!å~~ R'!ĦĖĥ2ĆĖ2Ė !)dħ÷ ×'··¦ddds!sBt !&©!gVVFĒBBsR2ĖĆÖC!âĆĆŁbŅ1AbbąĦ!BĦBĖ !) ö)!BB s&·×··B !&ĖĢ2ĒĂĲBBFĒĲ>oR!RC!!2!!ĦĖĆöĶBBB!łâR !)µµrµĥĥĥÕÕöööĦĦĦ !)2ĶFĂBcBBV!!R2gBB !'2!B22BRC !&cB !)ĦĆĆĆ¶æöĦ!ĥĥĥĖõõÕÕÕĦĦĦ!ĺ!ĂRgFFFĶĶB2gĦ !*Ē.N¶R!RCB!©F !*Ć2ccĒĂĦĖCC!ör¶¶NNæAbĖÖĦ2V6ĦĖĦĦĖĶVFĦĶ2RB !'2BgĶĖ !'Ć2RB !)RB!B2Ħ!!R!ĆáĒĂ!ºĶBBą!!Ķ2ĂĂ2BĶ2Ķ2ĦĶĦ !*Ķ!!ĶB !&BsBB !*ò2!6ĦBR!!!áSRcºĶ2B·dĶ!2!!RĶĦ!!R!!ĦB!BĦĥ !&2!!!Ħ !&¶Ç÷×d !)©âĦBgĦ!!Bö!BVV!2ĶĦ!sĢ>ĢBV62Ķ2BĦ!22Ģ2·!!2 !(ĂĲĂ!!!Ħĥööss !(â©!!ĦBd!!ĆGVĖĶĖĶâB !&gĖ2ĶB2ĶĦB!ĦĒw!M!!VBB22VĶ!!2!!CBĦąĥöĦĦ !&.BĢs2 !*BòĂĒÚRs!!!ĂłĲ2òĒĢĒòòĲ2!Ķ©ĖĦ!6&2!!ĦBR!ÕR!CBB!ĥõõĖ !'ĶòĲc !(ĦâĶ!B!d !&2V&! B(2©!!Ħ!!ĶĦĦ6VĦ2ĺ66ĖõR!!²oĆ¥Cĥĥ !&22w2Ħ !&2B!ºÊg!!!Ħ!2ĶĂłBVVFwgww!ĶRB!ĦĶBBĆĆĦĒRĖĦ!Ħ!!!ĦBò.Áâ!!!ºB©©ĖĶc!!ĦĆ!Ħ©ĶĦöB!!!g22BwBBcsBscc¦·d·!!!Ħ!BĦĦ6!RcĶ!!!C!!!2Ķ !&Ħ©ĆĖR··!s!!ĶĲĒĢĲB !&c222ĒĢĢĂĂĂCt·sss!!!ĶRĦ!BcĶĖĖĶĶ !(2gwË !'cR !'Ėo.wÊº©s !&·'Ļīī ě'sB!!ööö!Ķ!ĖĲĲBĖ2BBĶĂ !&ºwgĆĦsC!!s d&!!sö!ëcĢâòddd!!!Ė ö)-öö-ıÕ ĥ&!!BB!2RBĶ2Ė6!B!!c¶æc !'× s'Rö!!!ëīëÛ!!ss!!åÅ µ&-MĦ^^6VÖæĦĦ!Ķ!ĦF6ĦĶĖĶ!Ē> !)Ć !'Õ ö'Ė !'ö!ĥĥ!örrbÖÖæâĂBĺ Ě&öööĖdB !&Ķ!Ė!Ģ2âB!!Ħ!!!R!2 !(Õ^^^nnÅÅÅÕą!R!NM^âĖĦĦBc©©ĦsRc!c2RsR !&Ķ!22RĂVBBRF!!R!ĦÆ¥R !(òĦĖĖĶ2BĆĆöö!!ĦB!22ĢBcĦ!!ĦĦĆ!!>ĢłłĲĢ±C!!!ĲĒĖ!!BĂRĺ !)Bccö !'ĶBsBgĖ!cRB !&BºgFĦĦcĦĦĦĆcBĢ2Rc22B !&Ģ2BRĶg!F&B2 !'ÂöÖĆĥĥ !&RRggĖ2RĂ22!!!ºwĦRs¶¶cĢĲ.¡¶¶ÚÊ©wB2ĶÛ!!Ē!B&ĶĒ2ĦĢĶĦ2 !&âĦ2!!Ħ !'BgĖĦ!ĖĒêB !&B×÷×××÷ćh7Ļī ×(ěěÛ!ĥ !&2Ē©2BFĦ2Ħ !&Ė!!ĦĆ!·!!!g6ĦĖâ2!gÖ!B!!×Bõ Õ4ĥĥ!!!2!Ă2!2!2R2Ķ!B!!2!!BĶâ !'ĖĆĒ!âRĦĦĦB!!ÕĦæÆÆÆÖÖæN¡ÒtCCÂöÆRcs¶ö·!!Bĺ!!!ĦĶĦĶ !(2B!ĦĒ2 !'ĶĖ2!©ĶBĂĂÒ!!!ĆöĂĂĶĦ!ĦgRÛ!!!ĦòRcRB!R!!VĪ!2wĦ!ĦĲ2Ė !'2g!Ē!w !&2Ĳ.©©!Ħ!ºċÛ!!!ĦĲ!!R2ĦĶ2F!B!!!B!!B!BB !&ĒwĶĶâĲB!c2 !'âĖ!B !&Ħ2!ĶĂĢĢRĦĶą !)©ĶĶĂ2Ķ2ĥ !&ĦòĲĒĲĒĦ!C!ĢBĶĶ!BB6ĶĶ !'2V!Vg !'c!!!Ħ!¥cB!!RĖ!!!©ĦĶ2w22²Ò!R!Ķ!!BBB2 !&B&ĆĶ26&Ķ2!Ć !&º!B!Ėâ !'ÊĚêêÊöĶĦĦ !'ĺÒĢĢĶ2ĦòB !(2V6Fg !&&!łc222!2òc !'ĖòĲł2 !(ĆĆööĦĖBc!B!!!>R!gRĦ2!B !&BĶ!!2ĶĖ !&Ĳł2!!B!2!gB !'łB2gw !'ÂÂâ2ĶĶ2Ė !(Fgg!Ė2òº2!!B!!!2ĢĦĶB !&2!ĶâĂĂRĒĖ2Ħ !'Fwg !+2cĶ2Ķc!R !'ĖĦĖRĶwĖ2º!!!Ú!!Vc!2 !&B!B©©©!!cĶ !(BĆĦĦ !(wR2!B!2Ķ !(ĒĒĂĒĖ!B2F !'B!ĶĆĶĖ !&ĪBV !&©2RB!!ĖĥĦBĆĦ !*VÊĆĶĦ!Ħ !)BBBĲRĖ!!Ħö!!!6F2c¶¥ !&swc R)B×Ħ!!!¥s¶s !)æÖÒĒRĦR !)222B!2ĶR !'çÇ¦¦ddd!!ÇÇ× ·& ×'ĦĖĥ!!!ķ××× !)ĶwwBB !)ĺgg6VĦĶ2Ė!ĥ!!Ħąąĥĥĥ!!ö!ąąõõĖĖĖ ö'Ėĥ!Ħ!Ħ µ'!",
);
rawImages.push(
  "#cQSSĦÖæĆĆ#ÆĦSQQQSĆÖo¡ÂĦæĦĦ##SQt #1 t&S t-SSQ !&2cdĆĥ¥ !'B!Ă2B©Ćc²ÒÁ!B!öĥą~~åĥ Å' ~&MÕöĤ!!ö Õ*ĤB !(ĂÂÁÇ!Ć!B!!!Ĥ!2B©!BCB2©!!!ąĆâ22cö 2&Ģ!BBBË !'ĥ²²ĆĆĦĆ!C!Ĥ !(©!ûå!c !)FĦÂÂâ!Û©æ!Ĥ!!Ă!2º!2ĶR2s!BËË©Õöĥ$ń!²ĶĶ¦!Ė!!s !+ěõcĆ!t !*22BRĥ!B !'BËĦĆBBBĂ!ë©!ĥĆs2C!!Ĥ!2B~¦2cCĤ!!B !'Bõ!ĆctBĤ !'Ē222ûõĆĦcR!!dgËĥB!BcCBCĥC!!cæ¦R !'ÊëåBĦ !-C!c·BĤ !(B2 !&ĦBĦB!!ĥ!ĥĆĦBÂâÁ©ĥÂ±ĥ!Ć!ą !&B!!åBĦd !-ĥ!t !*dºûûûµ!ÇC·Ĥ !'Ăââ2!!!Â22âĆc¥Ćõ!!!º!!!Bâ~Á !* r&ńĤĤ !*õõ!×tssń !&cĆ!BB2!©Ć22!!c!C÷t!!!C2CB!BB !+$$$D !+PrrrńńńĤĤ!!!DĆ!cg©©©F!¦º©ËËttRńńń!!s2ĥĦCB!© !( B'! D' $& !/÷C·¦Ctt×tRttRPńńń !(ºĆBågFC !( Q,ÕõõBB$$$DDD !)ĤPĤPP ń* !(DDDĦ!ĂĦc!cĥ !(Ē222B22BĶ!ææ!ÕÕBBBĦĦĦ$÷?OOOA d&ttt¦×ĘĘ$ D)!ĤĤń!ĦcĦĖĆC!!!Ĥ!!!ĒĒĢĒĢsB¶cc2ööĆrÕÕBBB!²22BB××¶sR2!!ĶĆÅÅb Q'µöö!!!C!!ĦsĶĥ !,22C!Ć!dss2c!ĆCööĤB!!2ËË!ąöĦĶ2sc22¥ÇRs2BcłB !'R2!BöRC !+2!!!dB!!CĆc!ĢĢ!!R!Ĥ22Ë!ąĥBsBR!Ķ!2RöåĶĶR!!g!ĥ !&B!Ò!2!ĥ !*B!©Ë!ąddnĥc!C©Ë!ĥ!!!2Û!ą!âââdBcdÒĂBRĶRdĦBĦĦ !(Ĥ!!B!BC !(VëËËCĥĥÒnn2ÒĆCnÒ!ĥ!ń!!w!!Ăd©©©!Ć!åÊÊĶ!ĒBÁĢB!2!Ć !'2!!òö !*ĥnn!CCû2B2ºcĥB2!ĆC !&ą!ĶÁâC!åBĦ!ĶĦĖ2©!©gĆBR!c !*B2 !*²!Bĥ!Õ!©ºw!ĦĆº©ĥcĥ !&d!2!!!CBĦĦBdĦcĖĦ!CBcĦ!C !+Û!ĥ !*BºC!·ĥ!CB!ĦBĦ!Ħ!Ħ !(ËËË!!d¦¦d!¦C¦¦C!CC¦C!CR !)ącC !)gV!±±ÁCĂÁĦĆBBĦĦBtB!!!d P' Á+ R, !)âBĆĥ !)2!CwºËĥ©gBcĦ!¦!Ćõ !&P$$DD! ù)!! n) ń& !&B!!!B !)Ģ!!ą!Ħå!ĦĦ!ĆBCĥ!B!t!!!DBB!! D& !& ù+ !*©2!!Ė !*òĢ!BBc!ĦB!ĒdÁâĦBĦõ!!Dö= ö)$$$DD !2Cg©!RC !*Ħòâ!Ć!!BĦº!ûû¦!Bt!!!±Ħ µ(!ĖõõÕĦ$$ !0ĥ!CĦd !)FÚëċût×t×tdtR!õR!tB!!!Ħ2×ĒĢĲĲ¶n±ÖÖöÕõB!!Ępp !*DCĦåBĥ !)õrP ń)Pńńń·!·BĤ !&Ê!êÚëÊ²B2¶R2ĆĆÕ!!±ĖĖO÷·×÷÷÷$Ħ!BĦ!ö !7ĤńĤĤ !'C±C²nÒB2Ë²òĢł¦ !'2!!ĦĆæöCBBR!Ă¡s !)÷÷ĘĘ D' !/2ĥÛnBR22©!!R!Ë !)2!B22RĥĤ !&c !+ĆÅåÕööĦ!DDD! D(!!!V!nRÛËËËCĥB!Ë!ą !)ÒĒĲsĦ!!ĤB!ê©Ħ !)æ!cc²±ĥĖĤĤ!ö÷ÕÕııöÕ$!ÕĦCÚË!ĥą!ąCºËåĥ!t !(22©CB !'ĆCdR !)cBĦB2 !'ĥ¡²¡!ċĥ!!$!!ĥCnnC!ĥĦĥĦ!BĦĦ !)Ķ!ĦądĦ!!!B¦!R !*²CBºĦĦR!!!¡2RcċĥĆ!BńC!C!!RĥdĆBC!åBBcB!D !&2!BĦąB!!!·PPńń !)ûn!ĆÊB!!!ö!BËËåCc!Ĥ!±Ģ±!ÚËCą¦dåBcCâCĤ!!2 !(Ăââ!!!ĦD !,nû!BĦ!B!!!gºåą!ĥ¡t !&ÛĥCĥądĥ!¦C!~Ë!p!!ËBB2!©C !'ĤBĦ$D !)ĒBÁCdĦĦ!!!ĥ!ĦcÒâÒċ !'±âÁCâ~Â~~~Ò2!ĥě!Ħ!º©!!Ħ!BB!$!!ĤBB!DDD !)ÁÁcBĤ !&B¡Ķ!2!B !&2Ë©! B(2Û!!Ħ!!ąĆĆ©©Ħĥg©©õD!!!M-öµĤDD !(ûCC !&2!©ċÊg !'2Ķ±â!Fg©Ë©ËË!ĥtB!Ė!BBĆĦBÒBĆĦ!Ħ!!!ĦBÁĂpM!!!Ú2ûûõ !'æ!ĦcĥBĦRĤ!!Û222Ë!¦·tR·ssPrńĤ!!!ĦBBĦ!ºĦBBC!!!Ĥ !,ûĖõtRs !&ĶòÒââc !&R2!!ÁÁÁnnnĤĤĤ !)¦ĆĦBBĦĦ!Cĥ !)Ëûù!!!C!Rt!BĤ!!!łĒºċûût !&ń ù+ !*ĥ!åòĒBĆ!!dĥÂ !&ëËË!Õ!Ĥ!!R ń&Ĥ !&ùRânnńńń !-p!!p` D'!!cB!CcĦ!ąĦ© !&sÅą!d !&ń !, ù& !(ĘĘ ÷&/OĶ``©ºÕöĦĦ!C!ĆÛº!CBBBÂĂ !*ą !&D !/DD!!ĘĘ÷åÅæ¡Â!V 6&öööĥńB !&ĥ!å!ÒB¡B !(c!ĥB !'÷```ppĘĘĘ÷$!!!ıO`±ĥ!ĦB¥êÊ!¶R¥!¥2ssC !(CC¦nº!BBË !&Ħ·dCC !'ÒĦĖĖĶ!!ąąĦõ!!ĦB!22â!¥Ħ !&æ!!ĢÂĂââÁpĤ!!!ò~å!!!ÂB© !)Rss !(ĶBc2Ëĥ!dB !'Bû©©!Ć¥Ć!!æ¥cÂ2BB !)Ò2B¦ĥûBÊË!ą !'^õÕöDD !&RBËËĥCB±ĦC!!!ëËĖttt¦!âÒâłttěċûû!!!ù!!Á!B©ĥ²ĥ!ÂąĦĦ !&nĦC!ĥĦ !'2Ëĥ!!ąÒīd !&RPPńńńPrĹĉùù ń(ùùù!D !&C²ûCĦÊĦd !'Ħ!!ĦC!Ĥ!!!w©!ĦnCBÛÕąR!!ńB D7!!!2!n2!ĥĦCBĥB !&2!!Bĥn !'ĦąÂ!nĦĥ!dB!!DĦ ö&ÕÕöı=MĤĤĤMÕöQbrÕöĤ!!Bg !&¦ąBĦB !&2B!!² !(ĦĆ2!ûBĆ¡±M!!!ĖånnĥĦĆ!ê2ù!!!ĶÒĥBs!ĦR!!ËF!2ë!!ąâC !)Û!²!û !'òĒûû!Ħcċĉù!!!ąò!!CĦBĥC© !'2!cĆc!B !&Âëąą¡âB!ĦC !'nĥ!B !&Ħ!!Ķ±ÁÁdCĥ$ !)ûĥcÂĆĥCD !&ĶÒÒĒÒòĦ!Ĥ!âBąĦ!BBËĥBą !'Ú!ÚÛ !'×!!!Ķ!så !*û!CĆċcC^M!!!Ķ!! 2& !&BgĦBd©©ĥCB !'ě!!!ĥn !'û7īīěµBĆĖ !'V^±±cĥĆ^B !(2©gË© !&g!ĂBåBĆĦĥ²d !'ö²Òâ !(ąööÕÕĦ!cs !'ĢR!ÛCĆ¦!B !&BĶ!!ĦąC !&òĂ2!cĦB!!û !(ĂB2©û !'Òn±CĆcĦC !(ÊÛÛ!åB^ċ !*â!då !&2!ĶÂÂâBâĦĥ !(ºº© !+2scæĶ !)Ħĥ!ĥBBċĥ!ě!!!ě!!Ë¦!c !&B!BÊÊÊ!!dC !(d!ĆĆ !(ºR!ræBĶĥö !'Ò²n²BĆ!Ħ© !'B!ĥåąC !&FBË!ĦĆĦÊĥĥ !&DĦ!æcc !)Ëě!c!¥Ħ !)BBBÒ¦åd!Ħ !&ËËC¦·R !&¦ËRt·×·tttRń !&sÇtt !)ÕÕòò!æB !) 2&ąBĥt !' P&ńńń!!PPP ń+!!D!!!Pńńń !)Cw6B¥ !)V©©Ë©dBCõ!D!!Ħ$$DDD !&$$DD !+D!Ħ!Ħ $'!",
);
rawImages.push(
  "#cSĆĆ¶css¶¥ÖĆĦtS#Ć¥B s&¶¶¶¥æĆtĦ æ1 Ħ&Ć Ħ-ĆĆ# !&Ħ!BĶRRB·Ħ!!B!!2B2BĦ!!Ķ!d!ĆĖæ¶!c!cB ¶&ÆÆÖs¥æC!!æ ¶)ÖCB !(sR2csBC !&C!!2Ħ2ĦR2ĦB!!ö!ĖĦRæĆc!!!2RRBB2c2!s!!ĖĦĆĆĆĖĦBRsC !)22B !,ĦBĦB!!!R¦sąĶĖ!2BĆĆC!!!2R2B2 !&B!!ĦcccRBR¦ !)ħħćć×··sĦ!õ !&BĦBĦĶĶs¦söĦĖ!2!2Ķ !&B!!!ĶBĦ!c!C !'B!B !&B !& µ*ÕÕĦąą!!ĦBĦsR×¦söąĆö!2B!B!RB!!BĦ2BĦBB!µs!!!B!Ħ!Ħ!!!R!!! B, !'¥æ÷×÷¦¦ssöąæö!BB!!Ħ !'ĦBĶĦBĦ!Ö!!!2!ĆĶR2R !) R&B¥¥öC· !) ą'µµą!!!BB2Ħ !)B !*Ħt2!Ķ!!Ķ !+222R!RR !3æöB!2Ķ2!2 !(ĦBBĦ!!B!B!RBĶRĖBĦ !+2RR2 !' Ė&BBB !(æöBBB!B2Ħ !(2BĦĦB!!Ħ!ö!cB!Ħ2ĶĶ !+2!ĶBĶ !'ÖÖæsÖöBBB!!!ö!BBBĶĖĦ2B !'ĶĦBBĦ!!BĦ!B!!!Ħ22B !*2Ħ!!Ħ2 !&ÆBRc!ĆĖÆ!C !&B!2ĶBBB2Ė !&RĦB!ĦRBĦ !&ĦBBĦ2ĶĦ !*ĶB!!2Ħ !(BĦRcĶ!Ħ !'B2ĶĶ!2ĦĶR !'B!2BĦĦBĦ!!!dBB!ĖĶ !'C !&ĦB!Ķ !)Ħ22ĦBR!Rd !&ĶĶ!Ķ!RĶ!!B!!!2ĦĶ!2BĦB !&2!!BB2 !+2Ħ!B !)22!BĦ !(B!R!B2ĶĶB !'ĦĶBĦ!Ħ!B !&RB!!Ħ!2 !+2!!ĶB !(2ĦĶ2!!!B!!!BBĶ2ĶĶĦĦĦBc!!!BĦ!!!B!!Ħ !&B!!BĦ2 !+Ħ!2!2 !(22!ĶB!B !&cB!ĦB!R2B !'ĦB!!2!Ħ!B !&C!!ĦRĖ !+2!Ķ!Ķ !(ĶĶB!ĦR !'s!Ħ!!2Ķ2Rc·öĦBB!2BĦĦBĦ !*B!R !*2!2B2Ķ!!!Ė!!2BĶ!c !)s÷#¥ss¶c·öĥ!!!ĦĶ!2BĦB !*ĦĶĶ !*Ķ2Ķ!ĶĶ !(ĶĦ!ĦĦĖC !&ĦĦĥö·××··öĥĦ!cĦBĦ!Ħ!B!B !*Ħ2 !+Ħ!!ĶB!!!Ħ!!ĦB!BBRR!!!s¶sR Õ(ĥĦ!!ssRcRsRBB2B !&B!BRĦ !+s !,BĦ!BRĖB !'BBæssæ !)BBRBBBRRB !)ĦĶ2 !*sĆBĆBĆ!!!Ħ!!Ħ!ĦĆÖ!ÕĦ !&BcsscöÖ!·dB!!××·· d( !(B!Ħ !*ö2ĦcĶB !)B!!B !)2!ĶĶĦc!sµ!!B!!!BB s)!!!22Ħ!B !+Ħ!!ĶB!!!ĆR!!Ħ!!Ħ !)2Ħ!!BĦ!BĆ!·!!ĦĦĦ !0ĦĦ !+s !+RB!B!B !*B !-õõĖö !,22ĶBB !*sĆBĆBĆ !'ĖĦ!Ħ!Ħ !&B!!!Ħ!Ħ!R2B!!!CB!!åÅQQrÕ Ħ&Ėĥ2!ĶĦĦ !*ĆBĦB!c !'R!B!B !&ĥ!!!ĶBĦ2!ĶĶĦĶ !&Ħ!ĦöööÖs1AbbąĦ!BĦBB !*BBĦBĆ !'2 !'B !)ĶĦB2Ħ!ĦBĦĥ !&C!!ĶĶĦĦĖĆöĶBBB!!ĦĦ !*BĦcĦcĦ !&ĶĦ!ĦB!Ħ !)BBĦ!BĦB2cĦ!sC !&ĦBRB22BRC !0Ė!!B!B !'B!BĦ !+Ħ!R2!RĦĶĆĖö !)ĶRcRs!!!CB!2 !,RB!Ħ!Ħ !)ĦBĦ !*2!ĶĶĦĶ2ĦBĆ !,Ķ!!R!R!!!2RsB !)ĦĦ!!Ħ !(ĆB!ĦĖĖ !)2!Ħ!!2ĶBĦR !,2BĦ !'BsBB !*BBĦBB !(ĦĦ!BRR!CĖ !&Ħ!R2B!R2B !'ĥ !'Ħ!BĦ !&¶Ç÷×d !*Ħ!!ĦBd!!!Ėc!B!!B !)2!ĶĶĦĶĶĶĦĶ!!s !)B!ĦB !&Ħĥööss !'Ė×÷÷×÷×!ĥ!!!ĶB!ĦBBR!ĥ !&2Ħ!ĦBĦ!ĦBĦ!!!d!!!2B!Ħ!BĦ!!!CBĦąĥöĦĦ !/µööć××÷×·dĥ!Ħ !&BĦB2cĦBĦR!!!RĦ!!ĶĦĦB2!RĆÕR!CBB!ĥõõĖ !&Õ µ'Å!BBB!R ĥ'!Ħ !&ĶĦB!ĖĦR2B !,BĶĶĦĶBĖõR!R¶RR¥Cąą!!!Ħ æ'Öss¥Ö!!ĦĦBBB¥!!Ħ!!2!!Ħ2!ĶĶĦĶ!!!Ė!!!2BĦĶ!B!Ħ!Ħ!!!ĆcR2ĥ !*RRR!Ķ2RB !'¥¥Ræd !&BĦB2Ħ!ĦBĦ!!!RB!!ĶĦ!BĦ2Ķ!Ķ !)ĶCd !(B2R2¥sRB2 !(BĶR!!s!ĦĦBĦ!BĦB2c !'Ķ!!!2!B!BBĶ !&cĆ!!ą !*BĦBĦ!Ħ !)2ĶB!!!B!BBĶB!ĦBĶĖĦ!!!Ė !'2ĶĶĦĦ!2 !'¥BBĦsd !(ĦBĶB!B2B !&ĆÖB2R!!c!Ħ2Ķ!2B22BĦĥ!!ĥ!ĶĶ!2ĶĶ2!22 !(Ħ !-BĶB2ĶĦ!B !'ĆR·d !&ĆĖB2ĶĦĶĦ!B!!!ĦĦ!Ķ!!Ķ!Ħ2ĶĶ !(B2Ķ !+Ħ2ĖĦĶB !&d!ddĦåĥĥ!!R!!!Ķ2R2B2!Ć !&Ķ!!2!B2ĦB !(BĦĦ!Ħ !,RĶ!!B!!!ĥĖµbööÖ!B!B!B22Ķ!!ĦĶĶĶö!BĆĶĶ22!ĶBBĖ !&R!Ħ!2B !,2ĖBR!ĦĦ!!ĦĆæĖĆĆæÖ!Bc!æĶĶĦĶĖR22Ė !*22ĶĦB2 !'B!!ĶĦö !)BĦB2ĦĦ!B!!!Ć!!!cc!Ć !&Ħ!R2B!!Ħ2 !&Ķ!22BĶ!2!Ķ !'ĦBĶĶĶąs !(Ħ2ĦĦĶB !)c¥!2ĶĦĆ!!!2!ĶĶĦĶĖBĶ !(2!Ħ2Ħ22 !(2Ħ2B !,22B2!B !&B!2Ķ2Ķ2Ķ!Bö!2Ħ!ĦBĦBĦ2 !(2Ħ2!BĦĶĦ !'ĶBĶ!2 !+Ķ!Ė22ĦĦ!!B2!Ķ2ĶB2 !(BĦB2cBsR !(ĶBĦ2!B!B!!B!!BĦ!Ħ !*ĶBĶ2RĶĖ!B !'2ĶRĦĦ2Ćö!öĦs¶scRsc¦ !)Ħ!ĶĦ!!Ħ !'Ħ!2BĶ !'2BĶĦ2ĦĦ!B !'2!!BĖBĶĖĶĦB×ÖĖBdddt·s !)B2ĶB2!B !(BĶĦ !(22!!!2B!!B !&2!2!BĶB2B!!!·ć·sRR!ĦĦs!!!2!B!2!2ĶĦ !(BĦ!!2 !&Ħ22!!2BĦ!!!C !1öµµµ Õ'µ!C!Ķ!Ħ!Ħ2!!BĦ !'Ħ!2 !)cB!BĖĶ22B!!RĖ !0 c* !)ĦBĦĶ!2B !'B!!BĶ !+BĦĦ !+ĖĖĶĶĶB2Ħ !&Rs¶s¶s¶ !'22BĦB2ĦĶ !(ĦBĶĦ2 !)2Ħ!BBĦ2B!B !'22R2!!B !+BĦ !(ĶĦ!ĦĦBĶ !(2Ħ2BĶ !*BĶĦĶB !+Ķ!Ė!ĖĶR!!RRĖ!ĦBĦ!B !'2!B!B22B !(ĶBĶĦ !+Ħ!!BĦ!!R !(BĶBĶB !*BĦBĦ !)2ĦBĦĶ!!Ķ !'BĦ!BB !*BĶBĖ !,ĶBĶB2ĦĶ!!!R!!!BĦ!Ħ !'cccBcR22RB!!Ė!æRĆĦ !+Ħ22!B !+2!2!!BĶĦöBç¥22Rs¶¶ !&scc R)B×Ħ !&s¶s !*B2ĖRĦ !+ Ķ'ĦĶ !&ççÇ¦¦ddd!!ÇÇ× ·& ×'ĦĖĥĖö¥ķ××× !)ĶĦ2ĶB !/ĶB!!ĥ!!ąąąĥĥĥ!!ö!ąąõõĖĖĖ ö'Ėĥ!Ħ!Ħ µ'!",
);
rawImages.push(
  "#cQttĆ¶æÖÖæĆ#tQQttæ¶ æ&ĆĆĆæStQt S1 t5 !&Ķ!2 !.B!BĦ !(ĦÕ¤ Q&ńB Q&bbrQbÕ!!!Õ r)µ !*2!!s !,BĦBĦcBĦB !&ĖĦRRcR!!!2RRBB2c2!Ĥ!!ĆĦĆĆĆĖĦB·Ĥ !,ö !,ĦBĦB !)ĖĖ!22!2 !&2R222 !)ĦcccRB·B !*B!!R!ds !)BĦBĦĦĦBĦB!!ą!2!B!B!!!B !&BĦ!· !)B!B !,2!BĦ¦s!Ĥ !(ĦBĦ×·××÷!!!Ħ!2BĦB !'BĦ!BĦBB!DĤ!!!B!Ħ!Ħ!!!Ĥ !(BcB×s !)÷ħ÷×÷BB !'D÷ĕåĦBĦĦD!!!ĦB!ĦBĦ!r !'ĆĶc!c !-CCB !8DDÕµÕÕ !&B !+ĤB!Ķ !/µµPP Ĥ&!!D !+ Õ&ö !& D& !'ĦBBĦ!!B!!!·BĶRĆBĆ !+ D' !&Ęööö !)ÆæææÅÕÕö !+BBĦĦB!!Ħ!D!BB!Ħ!Ħ !1 D&!µµÅQµö !(Bc¥!Ħĥö!Ĥ !(ĦĦBBĦ!!BĦ !'ĦBBB !) 1&Abbö!Ĥ!¤BRc!Ćår!Ĥ !' Ħ&ĥöD!Ĥ!!!RĦB!ĦcBĦ !'BBĦBĦĦ !* 2&!Rs !'BĦBc !)BĦ!!BĦĦĥö !(B!BBĆĦBĦ !&dB!Ć !-2RB2 !)Ħ!BĦB¦ !(B !'Ćĥ !(BĦĦ!BBĦB !&R!!BB !,2!!BB !)B!BĦ !)Ħ!Ħ!cBB !(ĦĦBĦ!Ħ!B !&ĤB!!Ħ!B !*2Ħ!!Ħ !)BĦĦB !)ĦBĦ!! Ħ& !'BĦ!!!B!!Ħ !)BĦB !*ĶB !,B!!ĦB!!!Ĥ!!!ĦBBĦ!ĦBĦ !'ĦB!!B!Ħ!B !)ĦcĆ !+ĦB !+Ħ!c!Ħs !'BBĦ!BĦBB¦!!Ĥ!BB!BBĆĦBĦ !*B!c !+2Ħ!B !&ö!!BBĦ!¦ !(Ħ!cB!cĦĦåöD !&ĦĦ!BBĦB !*ĦĦĦ !+2!!Ħ !)ĦĦ!Ħąö !) Ħ&!ĦBĥ!!!cĦBĦ!Ħ!B!d !*ĦB !+Ħ !)ą!!ĦB!BdsĤ !&B!Ħ!!B!BĦ !&××·¦·×·ddRB !&B!BcĆ !+2 !,BĦ!dąö !'Ħ!cBB!cBB !'BBsBBBssB !)ĦĦB !*2!!BB !&Ħ!!Ħ!ĦåĦ!D !( Ħ)!!!Ĥ! Ĥ& !.B!Ħ !*Ķ2!!Ħ !*B!!B !(BĦ!ĦBĦ!ĦB !+ Ĥ)!!!B2Ħ!B !+Ħ!!!Ħ!!!ĆB!!Ħ!!Ħ!!!D!!!BĦBB¦ĦBĦ !,$DD !+ĦĦ !+s !+R!BB!B!!!Ĥ!!ĦĦB!ĆącBB !&Ħ÷÷÷$DrQQ¦×÷Ę!!C2ĶBB !*sĆBĦB !(Ė!Ħ!!Ħ !(B!!Ħ!!ĦĦĦ !&õææærQĦĦĦĖæÖ!D!R!ĶĦĦ !*ĆBĦ !(c!R!BĦBB!!!D!!!BĦBBĦ!ĦB !(ĶĶĦĦRBB22B !&BĦBB !*BB!B !'BÇd¦d¦dd !(ĦĦBĦ!BĦBB !)BRBRccRs !&B!!ĦĦ !*BĦBĦ!Ħ!!!× s*!D!!!BBĦB!ĦBĦĆ !)ĶRcBĦĦ!!R !2ĆĦĆ!BB !12!ĦB!! B' !+ĦĦ!BBĦ !(2 !,2BcBĦ !& 1)bö!ĤµĶ!!ĆBB Ħ& !,B!cĦ!BĦ!Ĥ!!!2c×B !)RB!Ħ!B !'Bc¥c¥R !(B!!ĦBcBBB!Ħ !*ĦĆc!ĦB !&B¥tB !*ĦĦ!!Ħ !'RĦ!ĦBĦĦ!!DĦ!!ĦBBBĦ!!ĦĦĆĖD !)ccĆ!BĦ !&×·ńĤ !*BBĦBB !'Ħc!B!!B!!Ĥ !' Ħ&ĆcBBĥ !&ĶB!!ĦĦB!ĦB !(DDĤĤ !)Ħ!!ĦĦ !'ĶB!ĦBds!!!2Ķ!!Ħ!cBB!!Ħ !'2ĦĦĦ!ĦĦ!BĦ !*D !(2!BĦĦ !)R!Ħ !&Ĥ!!!R!Ħ!! Ħ&ĆB !(B!B!!BB!cåDĤ !(DDD !'ĦBBB !(Ħ!BBĦ !&BR!!BBĦ!ĦBĦBĦ !'Ķ!BĦB! Ħ&BöDĤ!1r1Qb !'2!BBĦĦB !'B!ĦĦB !)BĦ!BĦBB¦d×t !&2BĦ!Ć!!!B!Ħ !'Ħc22 !)Ħ!¦¦C !'Ħ!BBĦs!!!Bc¦·÷××÷×·ssBB!!rc2Ć!B!BBĦBĦ!ĥ !)Ķ !'BĦBdsss!Ĥ!!RB!Ħ!B !&·tsB !)ĤĤĤ!!!d!ĶĦĦ!Ħ!B!cBĦ !&BB !)B÷×s !(c¦d×÷×× !&Ĥń Ĥ+!!!Ĥ!D !&BBBĦĦĆĆ!B !(22ĦĤ!!!× !(Ĥ!!¦ss !* D2!s!!2ĦĦĦ!B!BB !(Ħ !) Ĥ)!DDs Ĥ&öµbr·× !( ö+!!!2!!!B!!ĦBĦĦ !(BB !( D*!!! D&åæĖĆĆæböö!!Ħąµ¤¤¤ÕÕÕ !(2!Ħ!B!Ħc !(BĦĦ!õ !'ö µ'Õ !'Ĥ!Ć!!BccRåĥö !&RccR2Rĥ!Ĥ!2Ķ!B!BĦcBĆ !&Ĥ!Ħ!!B !(ą æ'ÆQQbµ !'Bc!!Ħ!Ć !'R!!ĦBĦ· !(Ħ!ĦBĦĦBB !'B!!ĦĆD !)RRR!Ķ2Rd!!!B!BĦ!!B!B!!!B!Ė!B!Ħ!r!!!BBĖĖBcĦ!!!Ħ !'ĦB !&Ĥ !'B2R2¥sRdR!!!2!!B!BBcĦĥ!BC!Ħ!!BBB !)2!ĆBĦBB !)Ħ!B !+BĦBĦ!Ħ !*ĦcĦĆĆc !-B!!!B!!2ĦB!BĦĦĦ !(B !-ĦBĦB!BRB!!!2!!BĆB!B !&R!!!Ħ !,ĶBĦB!B!B !&2BĦ!Ħ !*ĶBĦcBĦĦ !)BĦ!B!ĦĦ !*Ħ!!Ħ !)Ħ!ĦĦ!!Ħ !'Ħ!!B !(BBĶĦBĆĆ!B !)Ħc!ĦBBĦ!!ĤB!!!BBĦ!B !)B!ĦBB!B !(B!Ħ !(C2 !&c!!B !(BĆBB!BB !(B!ĦBĦ !'2!B!B!BĦĦ !(BĦ !*R2!!!cĆ !+Ħc Ħ' !'BĖĦBĦ!Ħ !&Ķ!Ħ!ĦB!!BĦ !&2Ħ !+BB!BĦĦBBd!!ĤD!!!B!BĦBĦB !'R2!!!B !*ĦBĦĦ!BB !'B!!B !,BĦĦ !+ĖĆĦ!ĦcB !'Ć!BĦBĦB !'Ķ2BĦBBĦĦ !(ĦB!Ħ !*2Ħ!BBĦR !+BcB !.BĦ !(ĶĦ!ĦĆBĦ !)Ħ!B !+BĦĦĦB !-Ć!ĆĦt!!Ĥ2Ķ!ĦBĦ!B !'2!B!BBBc !)B!Ħ !+Ħ!!cĦ!!Ĥ !(BĦBĦB !*BĦBĦ !)2ĦBĦĦ!!Ħ !&2BĦ!BB !*B!BĆ !,ĦcĦcBĦĖ!!!BB!!BĦ!Ħ !'Rs¦d¦¦CC¦t!!D2BccĦ !+Ħ!B!B !+B!B!!Bĥ!D!÷2!B·×÷÷!!!C¥×· s)BĤ!!c!!!÷× !*BBĆcĦ !+ Ħ) !&÷÷·BB !'s·ń Ĥ+!D!···rĤĤĤ !)ĦĦ!ĦB !/ĦB !/D!!! D- !' D'!",
);
rawImages.push(
  "#cSĆĆ¶css¶¥ÖĆĦtS#Ć¥B s&¶¶¶¥æĆtĦ æ1 Ħ&Ć Ħ-ĆĆ# !&Ħ!BĶRRB·Ħ!!B!!2B2BĦ!!Ķ!d!ĆĖæ¶!c!cB ¶&ÆÆÖs¥æC!!æ ¶)ÖCB !(sR2csBC !&C!!2Ħ2ĦR2ĦB!!ö!ĖĦRæĆc!!!2RRBB2c2!s!!ĖĦĆĆĆĖĦBRsC !)22B !,ĦBĦB!!!R¦sąĶĖ!2BĆĆC!!!2R2B2 !&B!!ĦcccRBR¦ !)ħħćć×··sĦ!õ !&BĦBĦĶĶs¦söĦĖ!2!2Ķ !&B!!!ĶBĦ!c!C !'B!B !&B !& µ*ÕÕĦąą!!ĦBĦsR×¦söąĆö!2B!B!RB!!BĦ2BĦBB!µs!!!B!Ħ!Ħ!!!R!!! B, !'¥æ÷×÷¦¦ssöąæö!BB!!Ħ !'ĦBĶĦBĦ!Ö!!!2!ĆĶR2R !) R&B¥¥öC· !) ą'µµą!!!BB2Ħ !)B !*Ħt2!Ķ!!Ķ !+222R!RR !3æöB!2Ķ2!2 !(ĦBBĦ!!B!B!RBĶRĖBĦ !+2RR2 !' Ė&BBB !(æöBBB!B2Ħ !(2BĦĦB!!Ħ!ö!cB!Ħ2ĶĶ !+2!ĶBĶ !'ÖÖæsÖöBBB!!!ö!BBBĶĖĦ2B !'ĶĦBBĦ!!BĦ!B!!!Ħ22B !*2Ħ!!Ħ2 !&ÆBRc!ĆĖÆ!C !&B!2ĶBBB2Ė !&RĦB!ĦRBĦ !&ĦBBĦ2ĶĦ !*ĶB!!2Ħ !(BĦRcĶ!Ħ !'B2ĶĶ!2ĦĶR !'B!2BĦĦBĦ!!!dBB!ĖĶ !'C !&ĦB!Ķ !)Ħ22ĦBR!Rd !&ĶĶ!Ķ!RĶ!!B!!!2ĦĶ!2BĦB !&2!!BB2 !+2Ħ!B !)22!BĦ !(B!R!B2ĶĶB !'ĦĶBĦ!Ħ!B !&RB!!Ħ!2 !+2!!ĶB !(ueee§DĸÇ÷ĸĸÈ§Tu e'T4¦Ęè§ee§e§R!Ħ !&B!!BĦ2 !+Ħ!2!2 !'¸ð l?ð4RB !&C!!ĦRĖ !+2!Ķ!Ķ !(å¦ ý=¦å !,B!R !*2!2B2Ķ!!!Ė!!!y ´& !9y !-ĦĶĶ !*Ķ2Ķ!ĶĶ !* Ø&´ !;BB !*Ħ2 !+Ħ!!ĶB!!!Ħ !& ´&Ø !'Ĕ!Ĕ !&Ĕ!Ĕ!Ĕ!Ĕ !)2B !&B!BRĦ !+s !. Ø& !=B !)ĦĶ2 !*sĆBĆBĆ!!!Ħ !& ´'!!!Ĕ !(Ĕ!T !.ddd !(B!Ħ !*ö2ĦcĶB !+Ø!Ø !*T !&Ĕ!!!T !* s&!!!22Ħ!B !+Ħ!!ĶB!!!ĆR!!!Ø!Ø!Ø !)Ĕ !(T!Ĕ!T !2ĦĦ !+s !. ´'!!!T !(T!!!Ĕ!!!Ĕ !/22ĶBB !*sĆBĆBĆ !+Ø!ØØ!!!Ĕ!T !&Ĕ !'T!T !(Õ Ħ&Ėĥ2!ĶĦĦ !*ĆBĦB!c !*Ø´Ø´´!!!T!Ĕ !,Ĕ!Ĕ !(Ć1AbbąĦ!BĦBB !*BBĦBĆ !'2 !&Ø!ØØ!!!Ĕ !*T !/ĖĆöĶBBB!!ĦĦ !*BĦcĦcĦ !&Ķ!!! ´' !.Ĕ !/22BRC !0Ė!!B!B !+Ø!Ø !(T !6Rs!!!CB!2 !,RB!Ħ!Ħ !*Ø´Ø´Ø !'Ĕ!T !,T !+R!R!!!2RsB !)ĦĦ!!Ħ !,Ø!Ø !*Ĕ !*T!Ĕ !)BĦ !'BsBB !*BBĦBB !,´´´ !&T!T !(T!!!Ĕ !,BĦ !&¶Ç÷×d !*Ħ!!ĦBd!!!Ė!!!´ØØØ´!!!Ĕ!Ĕ !&T!Ĕ!!!T !,ĦB !&Ħĥööss !'Ė×÷÷×÷×!ĥ !(Ø´´´Ø !)T!!Ĕ!!!T!Ĕ!T !*BĦ!!!CBĦąĥöĦĦ !/µöö!!!´ØØØ !&T!!!Ĕ!!T!!!Ĕ!!!Ĕ!!´ !&2!RĆÕR!CBB!ĥõõĖ !&Õ µ'Å!BBB !& ´&!!!Ĕ!!!T!!Ĕ!!!T!T !&s !&ĶĦĶBĖõR!R¶RR¥Cąą!!!Ħ æ'Öss¥Ö !& Ø& !)Ĕ !(Ĕ!Ĕ !&ö !'B!Ħ!Ħ!!!ĆcR2ĥ !*RRR!Ķ2RB!!!Ø !+T !&T !,s !&Ħ2Ķ!Ķ !)ĶCd !(B2R2¥sRB2!!! ´' !'Ĕ !&Ĕ !,Ė !&B!BBĶ !&cĆ!!ą !*BĦBĦ!Ħ !(Ø!Ø !5T!!Ħ !&ĶĦĦ!2 !'¥BBĦsd !(ĦBĶB!B2B!!!Ø!Ø!Ø !)T !&T!T!!!Ĕ!!c !&2!22 !(Ħ !-BĶB2ĶĦ!B!!! ´'!!!T!!!Ĕ!!T!Ĕ!Ĕ !(Ć !&Ħ2ĶĶ !(B2Ķ !+Ħ2ĖĦĶB !'Ø!!ØØ!!!Ĕ !(Ĕ !'T !&B !&2ĦB !(BĦĦ!Ħ !,RĶ!!B !&´!!´´ !2Ĕ !&Ħ !&BBĖ !&R!Ħ!2B !,2ĖBR!ĦĦ!!! Ø'!!!T!T!T!!T!T!T!T!T!!Ø !&ĶĦB2 !'B!!ĶĦö !)BĦB2ĦĦ!B!!!´´´!´ !=2!Ķ !'ĦBĶĶĶąs !(Ħ2ĦĦĶB !&ðØØØ!Ø !8ð!!!Ħ22 !(2Ħ2B !,22B2!B!!¦å l=å¦!!BĦĶĦ !'ĶBĶ!2 !+Ķ!Ė22ĦĦry ý?yĴ!!B!B!!B!!BĦ!Ħ !*ĶBĶ2RĶĖ!B!Å0 Ĵ+Å0 Ĵ*00ååP Ĵ'!ĖĦ!!Ħ !'Ħ!2BĶ !'2BĶĦ2ĦĦ!B !&Bö¶ĆĦöĖöööbB÷cĶc¦¦¦×××ö!!ĦÖ¥ÖĖĆĶB2!B !(BĶĦ !(22!!!2B!!B !&2!2!BĶB2B!!!·ć·sRR!ĦĦs!!!2!B!2!2ĶĦ !(BĦ!!2 !&Ħ22!!2BĦ!!!C !1öµµµ Õ'µ!C!Ķ!Ħ!Ħ2!!BĦ !'Ħ!2 !)cB!BĖĶ22B!!RĖ !0 c* !)ĦBĦĶ!2B !'B!!BĶ !+BĦĦ !+ĖĖĶĶĶB2Ħ !&Rs¶s¶s¶ !'22BĦB2ĦĶ !(ĦBĶĦ2 !)2Ħ!BBĦ2B!B !'22R2!!B !+BĦ !(ĶĦ!ĦĦBĶ !(2Ħ2BĶ !*BĶĦĶB !+Ķ!Ė!ĖĶR!!RRĖ!ĦBĦ!B !'2!B!B22B !(ĶBĶĦ !+Ħ!!BĦ!!R !(BĶBĶB !*BĦBĦ !)2ĦBĦĶ!!Ķ !'BĦ!BB !*BĶBĖ !,ĶBĶB2ĦĶ!!!R!!!BĦ!Ħ !'cccBcR22RB!!Ė!æRĆĦ !+Ħ22!B !+2!2!!BĶĦöBç¥22Rs¶¶ !&scc R)B×Ħ !&s¶s !*B2ĖRĦ !+ Ķ'ĦĶ !&ççÇ¦¦ddd!!ÇÇ× ·& ×'ĦĖĥĖö¥ķ××× !)ĶĦ2ĶB !/ĶB!!ĥ!!ąąąĥĥĥ!!ö!ąąõõĖĖĖ ö'Ėĥ!Ħ!Ħ µ'!",
);
rawImages.push(
  "#cQttĆ¶æÖÖæĆ#tQQttæ¶ æ&ĆĆĆæStQt S1 t5 !&Ķ!2 !.B!BĦ !(ĦÕ¤ Q&ńB Q&bbrQbÕ!!!Õ r)µ !*2!!s !,BĦBĦcBĦB !&ĖĦRRcR!!!2RRBB2c2!Ĥ!!ĆĦĆĆĆĖĦB·Ĥ !,ö !,ĦBĦB !)ĖĖ!22!2 !&2R222 !)ĦcccRB·B !*B!!R!ds !)BĦBĦĦĦBĦB!!ą!2!B!B!!!B !&BĦ!· !)B!B !,2!BĦ¦s!Ĥ !(ĦBĦ×·××÷!!!Ħ!2BĦB !'BĦ!BĦBB!DĤ!!!B!Ħ!Ħ!!!Ĥ !(BcB×s !)÷ħ÷×÷BB !'D÷ĕåĦBĦĦD!!!ĦB!ĦBĦ!r !'ĆĶc!c !-CCB !8DDÕµÕÕ !&B !+ĤB!Ķ !/µµPP Ĥ&!!D !+ Õ&ö !& D& !'ĦBBĦ!!B!!!·BĶRĆBĆ !+ D' !&Ęööö !)ÆæææÅÕÕö !+BBĦĦB!!Ħ!D!BB!Ħ!Ħ !1 D&!µµÅQµö !(Bc¥!Ħĥö!Ĥ !(ĦĦBBĦ!!BĦ !'ĦBBB !) 1&Abbö!Ĥ!¤BRc!Ćår!Ĥ !' Ħ&ĥöD!Ĥ!!!RĦB!ĦcBĦ !'BBĦBĦĦ !* 2&!Rs !'BĦBc !)BĦ!!BĦĦĥö !(B!BBĆĦBĦ !&dB!Ć !-2RB2 !)Ħ!BĦB¦ !(B !'Ćĥ !(BĦĦ!BBĦB !&R!!BB !,2!!BB !)B!BĦ !)Ħ!Ħ!cBB !(ĦĦBĦ!Ħ!B !&ĤB!!Ħ!B !*2Ħ!!Ħ !)BĦĦB !)ĦBĦ!! Ħ& !'BĦ!!!B!!Ħ !)BĦB !*ĶB !,BBu4uķçĉçØ¸uTuuTTTuTçĉççØTuTu T&ućç !'ĦcĆ !+ĦB !+ĦTÀ }BÀĉ !&B!c !+2Ħ!B !&ö!!B!ĦB ì@BĦ !'ĦĦĦ !+2!!Ħ !)Ħ!!Ì! Ô& !;Ì !)ĦB !+Ħ !)ą!!Ħ!!!Ô¸¸!¸ !'Ĕ!Ĕ!Ĕ!Ĕ!Ĕ !2B!BcĆ !+2 !,B!!!¸ÔÔ!Ô!!!Ĕ !>ĦĦB !*2!!BB !&Ħ!!Ħ !& ¸& !+T!!!T !4B!Ħ !*Ķ2!!Ħ !.ÔÔÔ !(T!!!Ĕ!!!Ĕ!!!1ôôô1 !*B2Ħ!B !+Ħ!!!Ħ!!!ĆB !'Ô¸¸¸Ô !'Ĕ !'T !&1åÕÕ!å1 !,ĦĦ !+s !+R !&¸!!!¸ !)T!!!Ĕ !&å!·!!Õå !)C2ĶBB !*sĆBĦB !(Ė !& Ô' !)Ĕ !+ÕÕ!Õ !)D!R!ĶĦĦ !*ĆBĦ !*R !&¸¸¸!¸ !'T !)T !&·!·· !+BĦBB !*BB!B !*B!!!ÔÔÔ!Ô !'Ĕ !)Ĕ!!¦·!!Õ!¦ !)B!!ĦĦ !*BĦBĦ!Ħ !'ĦĦ!!! ¸'!!!T !'T!T !&ķ¦!··¦ķ !6ĆĦĆ!BB !'B !&Ô !)Ĕ !)Ĕ !'ķuuuķ !,2 !,2BcBĦ !'2Ħ !' Ô& !)T!Ĕ !4Ĥ!!!2c×B !)RB!Ħ!B !'Ħ !' ¸& !)Ĕ!!!T !5B¥tB !*ĦĦ!!Ħ !(Ħ !&¸ !)T!T!T!!!Ĕ !5×·ńĤ !*BBĦBB !'Ħc !& Ô& !&Ĕ!Ĕ!Ĕ!!!T !'Ĕ!Ĕ !/DDĤĤ !)Ħ!!ĦĦ !'ĶB!!! ¸&Ô !'T !'Ĕ!T !)ĴĴ !.D !(2!BĦĦ !)R !& Ô& !&T!Ĕ!!!T!!!Ĕ !)CĦ !'DĤ !(DDD !'ĦBBB !(Ħ !& ¸'!!!Ĕ!!!T!Ĕ !-ķ !)DĤ!1r1Qb !'2!BBĦĦB !'B !& Ô' !)Ĕ !6Ħ !&Ħc22 !)Ħ!¦¦C !'Ħ !&¸!!¸¸ !8B !/Ķ !'BĦBdsss!Ĥ!!RB !&Ô!!ÔÔ !8C !'Ė !&BB !)B÷×s !(c¦d×!!! ¸' !+T!!!T !)1ĥ !.22ĦĤ!!!× !(Ĥ!!¦ss !'ÔÔÔ !&T!!!T!Ĕ!!!Ĕ !)ĥĦ !-Ħ !) Ĥ)!DDsĤĤĤ!!!Ô¸¸¸Ô!!!Ĕ!!!Ĕ!!!T !+4B !-BB !( D*!!!DDD !(Ô !.Ĕ !7BĦĦ!õ !'ö µ'Õ !'Ĥ!!!¸!!¸¸ !8Ħ !*Ĥ!Ħ!!B !(ą æ'ÆQQbµ !'ÔÔÔ!Ô!!!T!T!T!T!T!T!!!T!T !/B!!ĦĆD !)RRR!Ķ2Rd !&À¸¸¸!¸ !8T!!À !)ĦB !&Ĥ !'B2R2¥sRdR!!!BĦ }@ĦB !)Ħ!B !+BĦBĦ!Ħ !&¤Ì ìBÌ1 !(B !-ĦBĦB!BRB!!!ä 1*b¤`bb 1(b¤`¤b 1+!ĥ!!!2BĦ!Ħ !*ĶBĦcBĦĦ !(¤ååĥåååĥõ!!!bµåååąąµ!!!õÅµÅååąåąąå !'Ħ!!B !(BBĶĦBĆĆ!B !'2!!BĆB!B !&B!!!BBĦ!B !)B!ĦBB!B !(B!Ħ !(C2 !&c!!B !(BĦ!B!ĦĦ !(B!ĦBĦ !'2!B!B!BĦĦ !(BĦ !*R2!!!cĆ !+Ħc!Ħ!!Ħ !'BĖĦBĦ!Ħ !&Ķ!Ħ!ĦB!!BĦ !&2Ħ !+BB!BĦĦBBd!!ĤD!!!B!BĦB!B !'R2!!!B !*ĦBĦĦ!BB !'B!!B !,BĦĦ !+ĖĆĦ!ĦcB !'Ć!BĦBĦB !'Ķ2BĦBBĦĦ !(ĦB!Ħ !*2Ħ!BBĦR !+BcB !.BĦ !(ĶĦ!ĦĆBĦ !)Ħ!B !+BĦĦĦB !-Ć!ĆĦt!!Ĥ2Ķ!ĦBĦ!B !'2!B!BBBc !)B!Ħ !+Ħ!!cĦ!!Ĥ !(BĦBĦB !*BĦBĦ !)2ĦBĦĦ!!Ħ !&2BĦ!BB !*B!BĆ !,ĦcĦcBĦĖ!!!BB!!BĦ!Ħ !'Rs¦d¦¦CC¦t!!D2BcĆĦ !+Ħ!B!B !+B!B!!Bĥ!D!÷2!B·×÷÷!!!C¥×· s)BĤ!!c!!c÷× !*BBĆcĦ !+ Ħ) !&÷÷·BB !'s·ń Ĥ+!D!···ÕĤĤĤ !)ĦĦ!ĦB !/ĦB !/D!!! D- !' D'!",
);
rawImages.push(
  "#c #aĦĆ!ĝ @'íĝĭÍ @&íĝĭÍ @&íĝĭÍ@@@0íĝĭÍŃĳĳģĳ@@ĳăēģģíĝĭÍŃŃ00íĝĭÍ@@@b!!2Ï !&BSĶ !'BSĶ !'BSĶ!!!Ķ!BSĶ!Ķ!ĶĶCÿ!!22!2BSĶ !'BSĶ !/(ąĦÝ !&(ąĦÝ !&(ąĦÝ!Ķ!!(ąĦ¼!Ķ!!ąYĕĦ2!22(ąĦ¼!3!!(ąĦÝ !)2 !&tz¬ !'tz¬ !'tz¬ !'djiĶĶ!Ķ!ĶąĦ2!2!!RXi!3!!!dj¬ !*cÿďï!ą õ6 ą'Ė!Sdtt¦tdSSCC! Ė& ą(õõ!Ïÿď!!!3ÇĶÇÿdR B9tĠĀß Ï' ß'CdR B+!!BSĶ!!!8öĦ!2ßÐ à) S& C(2C2C2Ġï B-!¬Ķ!3 S*!!!(ąĦ!!!ß8¬!C !.Ķ !'ĵ3ĵ3ĵİRĶ8HHHXXXĶB!Ķ¬!!!2 !-tz¬ !2Ý !*ĵ3ĵ3ĵPÊÊĊäÔÔÔÄÄÄc!!z!!!2 !(¯!¯ !;Ķ !&ĵ3ĵ3ĵ3ĦĦ Ė+ÊĦj!!!2 !(¯Ý¯Ý !7Ý !)ĵ3ĵ3ĵ3ĵĵõĆĆĆĖĖĖĦĦĶĦj!!!2 !(¯Ý¯Ý¯ !:Ķ!!!ĵ3ĵ3ĵ3ĵ3%6ĨĸĸĨĨĨĘĘĈù!!22 !(¯Ý¯Ý¯Ý !+cÿď !*Ý !)3ĵ3ĵ3ĵ3ĵC¿Đ Ā*ïïïßßß !&¯Ý¯Ý¯Ý¯!!!Ïÿď!!!3ÇĶ !-Ķ !&ĵ3ĵ3ĵ3ĵCÿs B0 !&¯Ý¯Ý¯Ý¯!!!¯BSĶ!!!8öĦ !)Ý !)ĵ3ĵ3ĵ3ĵu¦ |1 !&¯Ý¯Ý¯Ý¯ !'(ąĦ!!!Ï8¬ !,Ķ!!!ĵ3ĵ3ĵ3ĵ3ĖB µ&ÕõĖ !&ĖĖ !'¯Ý¯Ý¯!¯!!B!!!ĀĦĶ!!!2 !-Ķ!!!ĵ3ĵ3ĵ3ĵ3ĵ!Ķ¦!!!BtR !'sĖ!!!¯Ý¯Ý¯!!B!B !&B !0Ý !'ĵ3ĵ3ĵ3ĵ3ĵ3!!r!!!²MM^^!!ĥbą!!!Ý¯!¯!!BĦB !&B !3Ķ!!ĵ3ĵ3ĵ3ĵ3ĵ3ĵ!ĶcĶ!!Ėęęċ !&R !&¯ !&BĦB !6Ý !'3ĵ3ĵ3ĵ3ĵ3ĵ3!!Ķ!Ķ !'Ķ!!ĦĦ !*BĦB!!!2 !+cÿď !)Ķ!!!ĵ3ĵ3ĵ3ĵ3ĵ3ĵ!ĶcĶ!ĶĥĳĳıĶ!õĦ×Ħ !(BĦB!!!2Ķ !&Rc!!!3ÇĶ !&Ý !'ĵ3ĵ3ĵ3ĵ3ĵ3ĵ3!Ķ¥!Ķ!ÛÊÊÊwµĆ!b !(BĦB!!!2Ķ2!!!¦ÇĶ!!!8öĦ !(Ķ!!ĵ3ĵ3ĵ3ĵ3ĵ3ĵ3ĵ2ĶcĶ!Ķ!Ķ !(R!!!Ė!B!B!!!2Ķ2 !&(öĦ!!!ß8¬!!!Ý !&ĵ3ĵ3ĵ3ĵ3ĵ3ĵ3ĵ3!ĦĦĖĆĖĆĆöööĆĆĆĖĖµĖ!B!!!2!2Ķ2!!22!ßõ !.Ķ!ĵ3ĵ3ĵ3ĵ3ĵ3ĵ3ĵ3!ĵ ĥ&ĕĕZĕZZJJJ::*ĦB!!!2Ķ2Ķ2 !(222 !/3ĵ3ĵ3ĵ3ĵ3ĵ3ĵ3!2Ķ2 !&¯Ý¯ !(BĦB!!!2Ķ2Ķ2 !(22 !.Ķ!!ĵ3ĵ3ĵ3ĵ3ĵ3ĵ3!2Ķ2 !&¯Ý¯ !&B!BĦB!!!2Ķ2Ķ2!!!2!3!2!22 !+Ķ!!ĵ3ĵ3ĵ3ĵ3ĵ3ĵ3!2Ķ2 !&¯Ý¯ !&BĦBĦB!!!2Ķ2Ķ2!!!2Ķ!!2!2 !'cÿď !'ĵ3ĵ3ĵ3ĵ3ĵ3ĵ3!2Ķ2 !&¯Ý¯ !&BĦB!B!!!2Ķ2!2!!!2Ķ!!2!22SS!!!3ÇĶ !'3ĵ3ĵ3ĵ3ĵ3!3!2Ķ2 !&¯Ý¯ !&BĦB!!!2!2Ķ2 !'2Ķ2!2¯2!Cs !&8öĦ !'ĵ3ĵ3ĵ3ĵ3!!!2Ķ2 !&¯!¯ !&BĦB!!!2Ķ2Ķ2!!!2!2Ķ2Ķ2Ķ!!!åĶĥ!!!ß(z !&ĵ3ĵ3ĵ3ĵ3!!!2Ķ2!!¯!¯ !(BĦB!!!2Ķ2Ķ2!!!2Ķ2Ķ2Ķ2Ķ2!!!RÕĦ !'ĵ!!!ĵ3ĵ3ĵ3ĵ3!!!2Ķ2!!¯Ý¯ !(BĦB!!!2Ķ2Ķ2!!!2Ķ2Ķ2Ķ2Ķ2Ķ!Ķ!!Ķ !'ĵĶ!!!3ĵ3ĵ3ĵ3!!!2Ķ2!!¯Ý¯ !&B!B!B!!!2Ķ2!2!!!2Ķ2Ķ2Ķ2Ķ2Ķ2Ý!ĶĶ!Ķ !'Ķ!!!ĵ3ĵ3ĵ3!!!2Ķ2!!¯Ý¯ !&BĦB!!!2!2Ķ2!!!2!2Ķ2Ķ2Ķ2Ķ2Ķ2 Ķ) !&Cd!!!3ĵ3ĵ3!!!2Ķ2!!¯Ý¯ !&BĦB!!!2Ķ2Ķ2!!!2Ķ2Ķ2Ķ2Ķ2Ķ2Ķ2Ķ2ĵ!!ĶĶ !&cÿď!!!ĵ3ĵ3!!!2!2!!¯Ý¯ !&BĦB!!!2Ķ2Ķ2!!!2Ķ2Ķ2Ķ2Ķ2Ķ2Ķ2Ķ2Ķ!!Ķ!Rc!!!3ÇĶ!!!3ĵ3!!!2 !&¯!¯ !&BĦB!!!2Ķ2Ķ2!2!2Ķ2Ķ2Ķ2Ķ2Ķ2Ķ2Ķ!Ķ !&¦ÇĶ!!!8öĦ!!!ĵ3!!!2 !&¯ !(BĦB!!!2Ķ2!2!2Ķ2Ķ2Ķ2Ķ2Ķ2Ķ2Ķ2Ķ !)(öĦ!!!ßĻi!!!3!!!2!!¯!¯ !(B!B!!!2Ķ2!!!2Ķ2Ķ2Ķ2Ķ2Ķ2Ķ2Ķ!Ķ !*ßåĶ !.2!!¯Ý¯ !&B!B!!!2!2Ķ2!!!2Ķ2Ķ2Ķ2Ķ2Ķ2Ķ2Ķ !5C !'2!!¯Ý¯ !&BĦB!!!2Ķ2Ķ2!2!2Ķ2Ķ2Ķ2Ķ2Ķ2Ķ!Ķ !)Ķ !'ĦĦ !&C !'2!!¯Ý¯ !&BĦB!!!2Ķ2!2!2Ķ2Ķ2Ķ2Ķ2Ķ2Ķ2Ķ !+Ķ2Ķ!!ĦĦ!Ý !+2!!¯Ý¯ !&BĦB!!!2Ķ2!!!2Ķ2Ķ2Ķ2Ķ2Ķ2Ķ!Ķ !)Ķ!Ķ2Ķ2!!!ÝÝ !&cÿď !'¯Ý¯!!B!BĦB!!!2Ķ2!2!2Ķ2Ķ2Ķ2Ķ2Ķ2Ķ !)Ķ!Ķ2Ķ2Ķ2Ķ!!ÝÏÿď!!!3ÇĶ !&¯!¯!!BĦB!B!2!2Ķ2!2Ķ2Ķ2Ķ2Ķ2Ķ2Ķ!Ķ !'Ķ!Ķ2Ķ2Ķ2Ķ!Ķ !&BSĶ!!!8öĦ!!!¯ !&BĦB!!!2Ķ2!2!2Ķ2Ķ2Ķ2Ķ2Ķ2Ķ !)Ķ2Ķ2Ķ2Ķ!Ķ !)(ąĦ!!!ß8¬ !)BĦB!!!2Ķ2!!!2Ķ2Ķ2Ķ2Ķ2Ķ!Ķ !'Ķ!Ķ2Ķ2Ķ!Ķ !)3!!tz¬ !.BĦB!!!2Ķ2!!!2Ķ2Ķ!Ķ!Ķ!Ķ !'Ķ!Ķ2Ķ2Ķ!Ķ !=BĦB!!!2!2!!!2Ķ!Ķ !+Ķ!Ķ2Ķ2Ķ!Ķ !?BĦB!!!2 !'2Ķ !+Ķ!Ķ2Ķ2Ķ!Ķ !/Ħ!Ħ!2 !/B!B!2!2!!!22!Ķ !)Ķ!Ķ2Ķ2Ķ!Ķ !-Ħ!Ħ!ĦBĦB !+cÿď !(2!2!!22ĶĶ !(Ķ!Ķ2Ķ2Ķ!Ķ !+Ħ!Ħ!ĦBĦBĦ!Ħ!Ħ!!!Ïÿď!!!3ÇĶ !-ĶĶ !'Ķ!Ķ2Ķ2Ķ!Ķ !+Ħ!ĦBĦBĦ!Ħ!Ħ !*BSĶ!!!8öĦ!!!222 !.2!2!2! 2.R2R2R2 R+!!2!(ąĦ!!!ß8Ķ!! tS¥ďĀ!tz¬ !&Ï2! cT¦·B !*2!µµ¤Õå¤¤¤bb¤ÕåbbbĜĜ¤ÕåbĜbbbµÕåÕÕÅÅµµÕåÅµ¤¤b¤Õå b'¤Õåö !,ĶĶBSĶĦĦĦ!ÝBSĶ!ÝÝ!!BSĶ!¯!BRRdĶ!ĦĶĶĶBSĶĦĶĦĦ!BSĶ !&ÝBSĶ !+ĶĶ!!(ąĦ!!ÝÝ!(ąĦÝ !&(ąĦ!!BBB8ĕĦĖĶĖĖ½(ĕĦĦĦÝÝÝ(ąĦ Ý&!(ąĦÝ !* 2&İĶ!RRßßßİĶ! ß'İĶ!RR2ĶĦĀĖ!22RRßĠĦ!RRßßßİĶ! ß'İĶ! ß'!!! R`!! ;`ľ!",
);
rawImages.push(
  "#c #aĦĆ!: ĝ'Ľ::ĭ ĝ&Ľ::ĭ ĝ&Ľ::ĭĝĝĝčĽ::ĭýííÍíĝĝíĳ@ÍÍĽ::ĭýýččĽ::ĭĝĝĝľ!!!B !&tc !(tc !(tc !&Ķ!tc!!Ķ!ĦÝBÇ!!S¯!Btc !(tc !0ĜĶĶĶ !&ĜĶĶĶ !&ĜĶĶĶ!Ķ!!ĜĶĶĖ!Ħ!!HµĖ½¯!B2ĜĶĶĖ!2!!ĜĶĶĶ !)3 !&ÿÕĕ !'ÿÕĕ !'ÿÕĕ !'ïÅõĶĦ!Ý!Sz½¯!B!!ßµõ!2!!!ïÅĕ !*2dd·! Ħ& Ė+ ö)j z'Ķ!cc ÿ&ïcc2! ¬' z(jj!Bdd!!!Rc!2·B2!22B2B2B2B2cRcRcRcßïßßßïRsRR B&RRRcsğÿß Ï+!!tc !&ÕĶĶ!!SBRBR B&2B 2&!2!2Ķ2Ķ!!Rtd C,!ĖĖĶ2 R*!!!ĜĶĶ!!!SÕĕ !*2Ķ2!!Ķ2Ķ !&Ķ2Ķ!!RSĶµÕÕÕåååĶ!!ĶĖ!!!2 !-ÿÕĕ !0Ķ2Ķ!Ķ2Ķ !&Ķ2Ķ!!ÊÚ¨¹ĺĚĚĚĊĊĊ2!!ą!!!2 !(2!2 !5Ķ2Ķ!Ķ2Ķ !&Ķ2Ķ!!!Ħ Ķ,¨!õ!!!2 !(2Ķ2Ķ !4Ķ2Ķ!!2Ķ2!!!Ķ2Ķ2!!!ĶæöööĆĆĆĖĖ!Ķõ!!!2 !(2Ķ2Ķ2 !42Ķ2!!Ķ2Ķ!!Ķ2Ķ2Ķ!!!òĂâòââÒâÂÒo¡!!22 !(2Ķ2Ķ2Ķ !+2dd !(Ķ2Ķ!Ķ2Ķ!!!2Ķ2Ķ !&BBtdtdtdtdtdddSSS !&2Ķ2Ķ2Ķ2!!!Bdd!!!Rc !(Ķ2Ķ!Ķ2Ķ !&Ķ2Ķ !&BdS 20 !&2Ķ2Ķ2Ķ2!!!2tc !&ÕĶĶ !'2Ķ2!2Ķ !&Ķ2Ķ !&þĎ Z1 !&2Ķ2Ķ2Ķ2 !'ĜĶĶ!!!BÕĕ !'Ķ2Ķ!Ķ2!!!Ķ2Ķ !&2Ėc Õ&ö !/2Ķ2Ķ2!2!!2!!!ďõĵ!!!3 !(Ķ2Ķ!Ķ2Ķ!!Ķ2Ķ2!!!2Ķ!Ħ·!!!s !.2Ķ2Ķ2!!2!2 !&2 !-Ķ2Ķ!Ķ2Ķ!!Ķ2Ķ2Ķ!!2Ķ!!!A!!!===MM!!!µö!!!Ķ2!2!!2Ķ2 !&2 !.2Ķ2!2Ķ!!Ķ2Ķ2Ķ!!2Ķ!!!ĦsĦ!!Ćĉĉě !&d !&2 !&2Ķ2 !4Ķ2Ķ!Ķ!!!2Ķ2Ķ!!!Ķ!!2!!Ħ!Ħ !'Ķ!!öĥ !*2Ķ2 !&2¯ !)2dd!!!2Ķ!Ķ2!!!Ķ2Ķ2 !'2Ķ!Ķ¦Ħ!ĦĦŃŃġ!!!ĥ·ĥ !(2Ķ2 !+CC!!!Rc !&Ķ!Ķ2Ķ!!Ķ2Ķ2Ķ !&2Ķ2!Ķb!Ħ! ú&ºÕÕ!b !(2Ķ2 !+tc !&ÕĶĶ!!!2!2Ķ!!Ķ2Ķ2Ķ !&2Ķ2Ķ2ĶcĶ!Ħ!Ħ !(s!!!ĥ!2!2 !)2!!ÅĶĶ!!!SÕĕ!!!Ķ!Ķ!!Ķ2Ķ2Ķ !&2Ķ2Ķ2!ĦĦĖĆĖööÖÖÖæææööÕĥ!2 !-B!RĆ !-Ķ!!Ķ2Ķ2Ķ !&2Ķ2Ķ2!Î ¾&®®¾®¾¾®®®{{:Ķ2 !0322 !+Ķ2!Ķ2Ķ2Ķ !&2Ķ2Ķ2!2Ķ2 !&2Ķ2 !(2Ķ2 !+3!32!32 !-2Ķ!2Ķ2Ķ !&2Ķ2Ķ2!2Ķ2 !&2Ķ2 !&2!2Ķ2 !+3ĵ3ĵ!22 !.Ķ!!Ķ2Ķ !&2Ķ2Ķ2!2Ķ2 !&2Ķ2 !&2Ķ2Ķ2 !+3ĵ3ĵ3 !+2dd !'Ķ2Ķ2!!!2Ķ2Ķ2!2Ķ2 !&2Ķ2 !&2Ķ2!2 !+3ĵ3ĵ3!22 !)Rc !'Ķ2Ķ2Ķ!!2Ķ2!2!2Ķ2 !&2Ķ2 !&2Ķ2 !+3!3ĵ3ĵ3 !'Rc !&ÕĶĶ !&2Ķ2Ķ!!2Ķ2!!!2Ķ2 !&2!2 !&2Ķ2 !+3ĵ3ĵ3ĵ3ĵ!22!!õĶ !&SÅą !&Ķ2Ķ!!2Ķ2!!!2Ķ2!!2!2 !(2Ķ2 !+3ĵ3ĵ3!3ĵ32Ķ!!!CĖ !(Ķ!!!Ķ2Ķ!!2Ķ2!!!2Ķ2!!2Ķ2 !(2Ķ2 !+3ĵ3ĵ3!!232Ķ2ĶĶ !*ĶĶ!!!2Ķ!!2Ķ2!!!2Ķ2!!2Ķ2 !&2!2!2 !)3!3ĵ3ĵ3ĵ!2Ķ2!2 !(Ķ !'Ħ!!!Ķ!!2Ķ2!!!2Ķ2!!2Ķ2 !&2Ķ2 !+3ĵ3ĵ3!3ĵ32Ķ2 !' Ķ&ĵ !&Bs!!!2!2Ķ2!!!2Ķ2!!2Ķ2 !&2Ķ2 !+3ĵ3ĵ3!!232!2 !&ĶĶ!!ĵĵ !&2dd!!!Ķ2Ķ2!!!2!2!!2Ķ2 !&2Ķ2 !+3ĵ3ĵ3!!2Ķ2 !(Ķ2!Ħĵ!CC!!!Rc !&2Ķ2!!!2 !&2!2 !&2Ķ2 !)3!3ĵ3ĵ32!2Ķ2 !&Ķ!Ķ2ĶĶ!!tc !&ÕĶĶ!!!Ķ2!!!2 !&2 !(2Ķ2 !)3ĵ3ĵ3!32Ķ2!2 !&Ķ2Ķ!Ķ !&ÅĶĶ!!!Sµõ!!!2!!!2!!2!2 !(2!2 !)3ĵ3ĵ3!!2Ķ2 !&Ķ!Ķ2Ķ!!ĵ !&Rõĵ !.2!!2Ķ2 !&2!2 !+3ĵ3ĵ32!2Ķ2 !&Ķ2Ķ!Ķ!!ĵ3ĵĶ !,B !'2!!2Ķ2 !&2Ķ2 !+3ĵ3!32Ķ2!2!!Ķ!Ķ2Ķ!!ĵ!ĵ3ĵ3 !&ĶĶ !&B !'2!!2Ķ2 !&2Ķ2 !)3!3ĵ3!!2Ķ2!!!ĶĶ2Ķ!Ķ!!ĵ3ĵ3ĵ3ĵ!!ĶĶ!Ķ !+2!!2Ķ2 !&2Ķ2 !)3ĵ3ĵ32!2Ķ2!!Ķ!!2Ķ!!ĵ!ĵ3ĵ3ĵ3ĵ3!!!ĶĶ !&2dd !'2Ķ2!!2!2Ķ2 !)3ĵ3ĵ32Ķ2!2!!Ķ2Ķ!Ķĵ!ĵ3ĵ3ĵ3ĵ3ĵ3ĵ!!ĶBdd!!!Rc !'2!2!!2Ķ2!2 !)3ĵ3!32Ķ2 !&Ķ!Ķ!!ĵ3ĵ3ĵ3ĵ3ĵ3ĵ!ĵ !&tc !&ÕĶĶ!!!2 !&2Ķ2 !)3!3ĵ32!2!2!!Ķ!Ķ!!ĵ!ĵ3ĵ3ĵ3ĵ3ĵ!ĵ !)ĜĶĶ!!!SÕĕ !)2Ķ2 !)3ĵ3ĵ32Ķ2 !&Ķ!Ķ!!ĵ3ĵ3ĵ3ĵ3ĵ!ĵ !*B!ÿÕĕ !.2Ķ2 !)3ĵ3232Ķ2!!Ķ!Ķ!!ĵ!ĵ3ĵ3ĵ3ĵ!ĵ !=2Ķ2 !)3ĵ32Ķ2!2!!Ķ2Ķĵ!ĵ3ĵ3ĵ3ĵ!ĵ !?2Ķ2 !'3!3ĵ32Ķ2!!Ķ!Ķ!Ķĵ3ĵ3ĵ3ĵ!ĵ !/Ķ!Ķ !12!2 !'3ĵ3ĵ32Ķ2!!Ķ2Ķĵ!ĵ3ĵ3ĵ!ĵ !-Ķ!Ķ!Ķ2Ķ22 !*2dd !,3ĵ3!3!!2Ķ!Ķ!Ķĵ3ĵ3ĵ!ĵ !+Ķ!Ķ!Ķ2Ķ2Ķ!Ķ!Ķ!!!Bdd!!!Rc !,3ĵ3!!22!Ķ2Ķĵ!ĵ3ĵ!ĵ !+Ķ!Ķ2Ķ2Ķ!Ķ!Ķ !*tc !&ÕĶĶ!!! 3(!3!!2ĶĥĶĵĶ!3!3! 3.C3C3C3 C+!!2!ĜĶĶ!!!SÕĵ!! c-Rctct cC¦tt!ÿÕĕ !&B3! 2Uc2 !*3!ööåĆĆåååÕÕåĆĆÕÕÕÅÅåĆĆÕÅÕÕÕö Ć(ööĆĆĆöååÕåĆĆ Õ'åĆĆĕ !,ĵĵtc!ĶĶĶ!Ķtc!!ĶĶ!!tc!!2!2Ccč!!ĶĶĶĵcc!ĥĵĶĶ!tc !'Ķtc !,ĵĵ!!¤ĶĶ!!ĶĶ!¤ĶĶĶ !&¤ĶĶ!!2C2Å¯ĶĥĵĥĥĦ¤ Ķ)¤ Ķ(!ĜĶĶĶ !* 3&¦Ć!CCSSS¦Ć! S'¦Ć!CC3ĶĶdĆ!33CCS¦Ć!CCSSS¦Ć! S'İĆ! S'!!! 2`!! Į`č!",
);
rawImages.push(
  "#c #aĦĆ! *`K!!ĥõ ąZĥĵĵ !&Ķ2BĦz j&XXH(8HHXXjjzj z&ĆĆĦ2BĦĆĦĦĦĶĦĶĦ Ķ&!Ķ !(2!22tSC !'BÇĶ !'ĵ!ĶĦ22!2!3!2Ķ2!!!¯!!¦ÇĶ!B!!2Ķ2Ķ2!!!2Ķ2 !'2Ķ2!!Rc !(Hµ2ĦĶ !(2!!2!3!!Ķ !&¯!!!ċö2Ħ!!2Ķ2Ķ2!!!2Ķ2 !'2Ķ2!!!¤Ķ !(ĐzYÝ!!!ĵ!ĶĶ!2 !&2!!2 !)ĠÅĆB!2Ķ2Ķ2!!!2Ķ2 !'2Ķ2!!!2RÕĕĶ !12!2!32Ķ22!!!¯!!!BĦB!!2Ķ2!2!!!2Ķ2 !'2Ķ2!!!2Ķ!2 !+ĶÿĕĕĆĆĖĦĖĖĆĆõåõ å' X&8X888(8(( H&XiXjjjzzjĆö Ė&ĦĦ!!22 !)dĀ! 2* B7!222Ķ !&2!¯¯!B!!2 !&2Ķ !(Ķ!!!BB2BRRRdddS d&ðððĐðĐĐĐĠĐĐĠĠĠİ Ġ'ĐĐďÿÿÿsssRcRRR!22Ķ2 !*cRĶ !'3!2Ķ2!!!¯!!BĦB!!2Ķ!2!!2Ķ2 !'2Ķ2!!!2!2!2!2!!!2 !.Ķ22!3!!Ķ2!!!¯!!B!B!!2Ķ!2!!2Ķ2 !'2!2!!!2Ķ2!!!2Ķ2!!!3 !'Ķ !'22!3!!!2!!!¯!!B !&2Ķ22!!2Ķ2!!!2!2 !'2Ķ2!!!2Ķ2!2!3ĵ !)ĵ!d!2 !'2!!!¯!!BĦ!!!2Ķ2!!!2Ķ2!!!2Ķ2 !'2Ķ2!!!2Ķ2!2!3ĵ3 !)Ķ2!2!!3!!2 !(BĦB!!2Ķ2!!!2Ķ2!!!2Ķ2 !'2!2!!!2!2!3!!!3 !)ĵ !'3!!2Ķ!!!¯!BĦB!!2Ķ2!!!2Ķ2!!!2Ķ2!!!2!2!!!2!2!!!3ĵ!2 !+Ķ !&3!!2Ķ2!!¯!BĦB!!2Ķ2!!!2!2!!!2Ķ2!!!2Ķ2!!!2Ķ2!!!3ĵ32 !+ĥ!!!c!!!2Ķ2!!¯!BĦB!!2Ķ2!!!2 !'2!2!!!2Ķ2!!!2Ķ2!!!3ĵ3 !/2!!3!2Ķ2 !&BĦB!!2!2!!!2 !'2 !'2Ķ2!!!2!2!3!3!3 !(ĵ !(2!!!]]L] L&ćçćççç ×( Ç( ·(¦· ¦& t&ct c'2!ĵĵ3Ķ !&2!!! 2S!tS!3ĵ !*üüü Č&QQrQr¤r¤¤¤µ¤ µ&Åµ Å( Õ&åÕååöåöå ö)õĆĥ!ĵ !(ððð!!2Ķ!!¯!BĦB2Ķ2!!2Ķ2!!!2Ķ2BBB!!2!!!2!2!3ĵ3!3 !(ĵ3ĵ!333 !&ĶRc!!2Ķ2 !'B2Ķ2!!2!2!!!2Ķ2BCC!!2!!!2!!!3ĵ3 !(ĵ!ĵ3ĵ!C22 !'BÇĶ!!Ķ2!!¯!B!!!2!!2 !'2!2!tc!!2!2!2!!!3ĵ3 !(ĵ3ĵ!ĵ!ĶRc !(Hµ2Ħ !&¯ !&2!!!2 !'2 !&bĶ!!!2Ķ2!3!3ĵ3 !&ĵ!ĵ!ĵ!!ĶĶ2¤Ķ !(ĠzIÍ!2!¯!!B!2!!!2 !'2 !'¥åĕĶ2!2!3ĵ3ĵ3 !&ĵ3ĵ!!!ĶĶ!2ĶcÕąĕ !&B ď&ïïcccBR B&2 B- C&33CC2C2C 2'C! 3&CCC!22BBBĥB!jjjzzz ¬( z( j' Y( H( 8. H* Y(jC !Ņ !e Ġ4 İ< Ġ4ĥ!ĥĕĕĕ ĥ/ĕĕĕĥĥĶĥĶ !(ĶĶ ĥ& ĕ) ĥ) ĕ,!Ħ!!SSS!ĦĦĶĦ Ķ(!Ķ2!2!3ĵ3ĵĶĶĶĥ!!2!ĶĶ!Ķ!Ķ! Ķ*ĦĶĦ! Ķ&ĦĖ!2Ė !&cs!!!2Ķ2!!!2!2!2!2!3ĵ3!3!!ĵ!Rc !&Ķ!Ķ2Ķ !'Ķ!Ķ2Ķ2Ķ!!ĶĶ!¦ÇĶ !'ČĶ!!2Ķ2!!!2Ķ2!2!2!3ĵ3 !&ĵ!!µĶĶ!!Ķ!Ķ!Ķ !'Ķ2Ķ2Ķ2Ķ!ĶĶ!!!(ö2Ħ !&ÿÅąĶĶ2!!!2Ķ2!2!2!3ĵ3!!ĵ!ĵ!Ķ!RåĥĥĶ2Ķ2 !&Ķ!Ķ2Ķ2Ķ!ĦĶĶ!!ĶĶĶßåĆB !(2Ķ2!!!2Ķ2!2!3!3ĵ3!!ĵ!ĵĶĶ2Ķ!Ķ!Ķ!ĶĶĶ!!ĶĶ2Ķ2Ķ!ĶĶĶ!!!ĶĶ !-22Ķ2SS22Ķ!ĶĶĦĦĕĦĕĦĕĕąĖĆĆĖĖöĆĆĖæööözjjYjjYX8 H)( 8(!ĦĦ !(2!c!CCB 2) !( 2&BB22RRBBÏ¯¯ ¿&ÐSSCC B&RRRBBB!Ħ !-cĥĵ!22C2CCCBB2 B'2B2 B&2BBBcRc R&ßßßï ð&ĀĀàĐð !/2!2!!!3!3ĵĵĵĶĶ2Ķ!Ķ!Ķ2Ķ!Ķ!ĶĶ!!Ķ!Ķ!Ķ!!!Ķ!Ķ!Ķ!!!Ħ!ĦBĦB !*2!2!2!!!3!3!!ĵ !'Ķ!Ķ2Ķ2Ķ!!ĶĶ!!!Ķ2Ķ!!!Ķ!Ķ2Ķ !'ĦBĦBĦBĦ !+2ĶB!!!3ĵ3!!ĵ!Ķ!Ķ!Ķ!Ķ2Ķ!Ķ!ĶĶ!!Ķ!Ķ!Ķ!!!Ķ2Ķ!Ķ!!!Ħ!ĦBĦBĦ!Ħ !-BĶ2!!ĵ3ĵĵĵ!Ķ!Ķ!Ķ2Ķ2Ķ!!ĶĶ!!!Ķ2Ķ!!ĶĶ!Ķ!Ķ!!!Ħ!ĦBĦBĦBĦ !&Ķ!!ÝÝ!!!32!2!!!3ĵ!Ķ!Ķ!Ķ!Ķ!Ķ!Ķ!ĶĶ!!Ķ!Ķ!Ķ!Ķ!!2Ķ!!!Ħ!ĦBĦBĦBĦ!Ħ !)Ý!Ķ !&Ķ!!3!!ĵ!Ķ!Ķ!Ķ2Ķ!!!ĶĶĶ!Ķ!Ķ2Ķ!Ķ!Ķ2Ķ!Ķ!Ħ!ĦBĦBĦBĦ!Ħ !& Ý&!!!Ķ !'2!3ĵ!!!Ķ!Ķ!Ķ!Ķ!!ĶĶ!!!Ķ2Ķ!Ķ!Ķ2Ķ!Ķ!Ħ!ĦBĦBĦBĦ!Ħ !&ÝÝÝ!!!Ķ!!Ķĵĵ!!!2!!ĵ!!!Ħ!Ķ!Ķ!!!ĶĶ!!Ķ!Ķ2Ķ!Ķ!Ķ!Ķ!Ħ!ĦBĦBĦ!ĦBĦ !&ÝÝÝ!!!ĶĶĶĵ!!ĵ !)Ķ!Ķ!!2Ķ !&ĶĶ!!!Ķ2Ķ!Ħ!Ķ2Ķ!Ħ!ĦBĦBĦ!Ħ!!!Ħ! Ý&!! Ķ&ĵĵĵĶ!!!ĶĶ !&Ķ!Ħ!!!¦ ·' Ç'×Ç××ç×çt¦¦Ç¦Ç¦Ç¦ Ç* ï(ÿÿÏÏ à&d!Ķ !'Ķ!Ķ2Ķ! 25 s3 ×*÷÷÷RRÝĥ !,Ķ! µ' ¤' r&QrQr Q, Č& ü& ë)ÛÛëëëHHĕ!R !(ĵĦBBB!!!ĶĶ!!ĶĶĶ!!!ĦBĦ!Ħ !(ÝBBB!ĶĶĶ!ĵĵĵ!!! Ķ& !-2C !&d33!!ĶĶ!!ĶĶ!!!Ħ!Ħ!Ħ !(ÝÝÝÏRc!Ķ ĵ&!! Ķ& !/CĐĀß!!!Ķ!s!ĦĶ!ĶĶĶ!!Ħ!ĦBĦ !(ÝÝÝ!ĶĶ¬SĶ!ĵ! Ķ' !. 2'ŀçB !'(ö!!ĶĶ!ĦĦ!ĦBĦ!Ħ!!! Ý& Ķ&ĵĵõ(ĦyĶĶ° !+ 2)!!!33ċö2Ħ !&ÿååĖĦĦ!!!Ħ!Ħ!!!ÝÝÝ!!ĶĶ2ĵĵĵ!!cĵXĶ!!Ü! 2*!! 3*!!d(IÍ !&BcRRscB c& R& ß'ïïß Ā) Đ( Ā, ï0ĥ!!;;;KKK [( lSľ!",
);
rawImages.push(
  "#c #aĦĆ! :`[!!Ķą ĕZĶ !(Ķ2CĦĆ æ&YYI(8IIYYææĆæ Ć&ĖĖĦ2CĦĖĦĦĦĶĦĶĦ Ķ&!Ķ !(2!22S2 !(Ç¦ĵ !'Ý!Ķĥ23!2!¯!BĦB!!!2!!d¦ĵ!2!!2Ķ2Ķ2!!!2Ķ2 !'2Ķ2!!Rc !(ĜĶ3ĶĦ !(2!!2!¯!!Ħ !&2!!!(ö3Ķ!!2Ķ2Ķ2!!!2Ķ2 !'2Ķ2!!!ÅĶ !(ÿ¤åĶ!!!Ý!Ķĵ!3 !&B!!B !)ÿõą2!2Ķ2Ķ2!!!2Ķ2 !'2Ķ2!!!3RõĶĶ !13!2!¯BĦBB!!!2!!!2Ķ2!!2Ķ2!2!!!2Ķ2 !'2Ķ2!!!3ĵ!3 !+Ħc¼¼ąąĕĦĕĕąąyXy X' H&8H888(8(( H&YjYæææĆĆöĖĆĖĖĖĕĦĦ!!2 !*dĐ! 2* B7!333Ķ !&B!22!2!!2 !&2Ķ !(Ħ!cdCC2CSSSààðÐ ð&ĀĀĀĐĀĐĐĐĠĐĐĠĠĠİĠ ğ&ďď¶¥sscccRdRSS!22Ķ2 !,Ķ !'¯!BĦB!!!2!!2Ķ2!!2Ķ!2!!2Ķ2 !'2Ķ2!!!3!3!3!2!!!2 !,c!ĵ32!¯!!ĦB!!!2!!2!2!!2Ķ!2!!2Ķ2 !'2!2!!!3ĵ3!!!2Ķ2 !+Ħ !'32!¯!!!B!!!2!!2 !&2Ķ22!!2Ķ2!!!2!2 !'3ĵ3!!!2Ķ2!2 !,Ý!!!2 !'B!!!2!!2Ķ!!!2Ķ2!!!2Ķ2!!!2Ķ2 !'3ĵ3!!!2Ķ2!2 !-Ķ!!2!!¯!!B !(2Ķ2!!2Ķ2!!!2Ķ2!!!2Ķ2 !'3!3!!!2!2 !/Ý!2!!!¯!!BĦ!!!2!2Ķ2!!2Ķ2!!!2Ķ2!!!2Ķ2!!!3!3!!!2!2 !(3 !+Ķ !&¯!!BĦB!!2!2Ķ2!!2Ķ2!!!2!2!!!2Ķ2!!!3ĵ3!!!2Ķ2 !(3 !+Í !)BĦB!!2!2Ķ2!!2Ķ2!!!2 !'2!2!!!3ĵ3!!!2Ķ2 !52!!¯!BĦB !&2Ķ2!!2!2!!!2 !'2 !'3ĵ3!!!2!2 !52!!!ććçć ç&×Ç×ÇÇÇ ·( ¦( t(ct c& R- !,2!!! 2S!c !.QQQ r&¤¤µ¤µÅµÅÅÅÕÅ Õ&åÕ å( ö&Ćö Ć/ĖĖ2 !*ïïï!!BĦ!!2!2Ķ22Ķ2!!2Ķ2!!!2Ķ2CCC!!3!!!2!2 !9ĶRd!!BĦB !'22Ķ2!!2!2!!!2Ķ2C !&3!!!2 !<d¦ĵ!!ĦB!!2!2!!!2!!2 !'2!2!Rc!!3!2!2 !4ĶRc !((ö3Ķ !&2 !&2!!!2 !'2 !&¤Ķ!!!2Ķ2 !3ĶĶ2ÅĶ !(ğåÅĖ!B!2!!2!2!!!2 !'2 !'¦ĆĶĶ2!2 !2ĶĶ!2Ķdõĥĥ !&C¦¶¶¶ccRRRBR B&2 C- 2& !5222!22CCCĶB!HHHYYY j( Y( H' 8HHC !Ņ !e İaĥ!Ķĥĥĥ Ķ/ĥĶĶ !3 Ķ0 ĥ,!Ħ!!CCC!ĥĥĵĥ ĵ(!ĵ3!2 !/ĶĶ!Ķ!ĵ! ĵ*ĥĵĥ! Ķ&ĦĖ!3Ė !&Rc!!!2Ķ2!!!3!3!3!2 !,Rc !&Ķ!ĵ3ĵ !'Ķ!Ķ2Ķ2Ķ!!ĶĶ!Ç¦ĵ !'¤Ķ!!2Ķ2!!!3ĵ3!2!2 !-ÅĶ!!!ĵ!ĵ!ĵ !'Ķ2Ķ2Ķ2Ķ!ĶĶ!!!ĜĶ3Ķ !&cåĕĵĶ2!!!3ĵ3!2!2 !,Ķ!dĆĶĶĵ3ĵ3 !&Ķ!Ķ2Ķ2Ķ!ĦĶĶ!!ĶĶĶïÅą2 !(2Ķ2!!!3ĵ3!2 !-ĶĶ2Ķ!ĵ!ĵ!ĵĶĵ!!ĶĶ2Ķ2Ķ!ĶĶĶ!!!ĶĶ !-22Ķ2t333ĵ!ĵĵ ĥ*ĕĕąąĕĕõąąĖõ Ć&ööÖææÖY9III H&( 8(!ĶĶ !(2!!c!ĵC 3) !( 2&BB22BB22B22 R&ßßß¿¿ C&SSSBBB!Ķ !/C! 2)CC3 C'2C2CBBB2BBBRBR B&RRcs ï&ÿÿïĐĀ !/2!2 !+ĶĶ2Ķ!ĵ!ĵ3ĵ!ĵ!ĶĶ!!Ķ!Ķ!Ķ!!!Ķ!Ķ!Ķ!!!Ķ!Ķ2Ķ2 !*2!3!3 !0Ķ!ĵ3ĵ3ĵ!!ĶĶ!!!Ķ2Ķ!!!Ķ!Ķ2Ķ !'Ķ2Ķ2Ķ2Ķ !+3ĵC !,Ķ!Ķ!ĵ!ĵ3ĵ!ĵ!ĶĶ!!Ķ!Ķ!Ķ!!!Ķ2Ķ!Ķ!!!Ķ!Ķ2Ķ2Ķ!Ķ !-CĶ2 !*Ķ!Ķ!ĵ3ĵ3ĵ!!ĶĶ!!!Ķ2Ķ!!ĶĶ!Ķ!Ķ!!!Ķ!Ķ2Ķ2Ķ2Ķ !&Ķ!!ĶĶ !&2!2 !(Ķ!Ķ!ĵ!ĵ!ĵ!ĵ!ĶĶ!!Ķ!Ķ!Ķ!Ķ!!2Ķ!!!Ķ!Ķ2Ķ2Ķ2Ķ!Ķ !)Ķ!Ħ !&Ķ !)Ķ!Ķ!ĵ3ĵ!!!ĶĶĶ!Ķ!Ķ2Ķ!Ķ!Ķ2Ķ!Ķ!Ķ!Ķ2Ķ2Ķ2Ķ!Ķ !& Ķ&!!!Ħ !'2 !(Ķ!ĵ!ĵ!ĵ!!ĶĶ!!!Ķ2Ķ!Ķ!Ķ2Ķ!Ķ!Ķ!Ķ2Ķ2Ķ2Ķ!Ķ !&ĶĶĶ!!!Ħ!!ĦÝÝ !,ĥ!ĵ!ĵ!!!ĶĶ!!Ķ!Ķ2Ķ!Ķ!Ķ!Ķ!Ķ!Ķ2Ķ2Ķ!Ķ2Ķ !&ĶĶĶ!!!ĦĦĦÝ!!ÝĶĶ !'Ķ!Ķ!!3ĵ !&ĶĶ!!!Ķ2Ķ!Ħ!Ķ2Ķ!Ķ!Ķ2Ķ2Ķ!Ķ!!!Ķ! Ķ&!! Ħ&ÝÝÝĶ!!Ķĵĵ !&Ķ!ĥ!!!c t' ¦'·¦··Ç·Ç·ÇÇ×Ç×Ç×Ç ×* ç( Ç&İİÿïà!ĵĶĶ !'ĵ3ĵ! 2Lssccc!!ĶÍ!ĦĶĶ !(ĵ! Õ' Å' µ&¤µ¤µ ¤, r& Q& Č&üüüëëûëëī8iĕ!222 !&ĥCCC!!!ĶĶ!!ĶĶĶ!!!Ķ2Ķ!Ķ !(Ķ222!ĦĦĦ!ÝÝÝĶĶĶĥĵĵĥĶĶĶ !'2BCCà !&S !&ĶĶ!!ĶĶ!!!Ķ!Ķ!Ķ !(ĶĶĶBRÇ!Ħ Ý&ĶĶĥĵĵĥĶĶĶ!! 2*Ðďďc!!!ĶRc!ĥĶ!ĶĶĶ!!Ķ!Ķ2Ķ !(ĶĶĶ!ĦĦĆCõ!ÝĶĶĶĥĵĥĶĶ! 2( 3*!·B !'¤Ķ!!ĶĶ!ĶĶ!Ķ2Ķ!Ķ!!! Ķ& Ħ&ÝÝyµĦjĥĵĵĵ!!2CC 3)!! 2&¿¿«å3Ķ !&cÅõĖĶĶ!!!Ķ!Ķ!!!ĶĶĶ!!ĦĦBÍÝÝĶĶB¼Hĵ! 3( 2) ¿& ¯&!!àæÅĖ !&CdRRcRB R& B& R'ssRďÿÿďď Ġ' ď( ÿ) s0Ķ!!ľľľ+++ ;( KSĝ!",
);
rawImages.push(
  "#c #c! ąa !& B] !'Ħ æ'ÖæÖæ Ö& Æ+ÖÆ Ö(æÖæÖæÖæÖæÖæÖæÖæÖæÖ æ*Ć !.2Ķ2Ķ!!!ĶĘ!!Ĩ !&2Ķ2 !'2Ķ2Ķ2Ķ2Ķ2Ķ2Ķ2Ķ2Ķ2Ķ2 !3Ħ2c!Ķ2Ķ !&Ę2!!!Ĩ!!2Ķ2RRsss¶¥¶¥¶¥2Ķ2Ķ2Ķ2Ķ2Ķ2ĦBc!!!Ħ2c !-ĦĖĖĶ2Ķ2!!!Ĩ2 !'Ĩ2Ķ2ĶĖĖöĦĘĈĈĦĆÖ!Ķ2Ķ2Ķ2Ķ2Ķ2ĶĦĖĖ!!!ĦĖĖ !-BĦĖ2Ķ2Ķ!!ĨĶ !)Ĩ2 !'øĆĖĶĨB!!2Ķ2Ķ2Ķ2Ķ2Ķ2BĦĖ!!!BĦĖ!2 !+BcBĶ2Ķ!!Ĩ !*2!$!Ķ !&Ķ!Ķ !&Ķ2Ķ2Ķ2Ķ2Ķ2!BcB!!!BsB2Ķ !-Ķ2Ķ!!!@Ħ !*Bń !(ĦĦ!ĶĦ!Ħ2Ķ2Ķ2Ķ2Ķ2 !*2Ķ2Ķ2 !-2Ķ2 !&PĶ !'2Bń !(aR!!ńĖ!!Ķ2Ķ2Ķ2!2 !*2Ķ2Ķ2Ķ !+Ħ2c2Ķ!!!Ķ!PĶ!!!2Bń !&ĦĦĦĆń0ĤĖ!2Ė2Ķ2Ķ2 !,2ĶĶ!cĶ2 !+ĦĖĖĶ!!!Ķ2!!PĶ!2Bń !&BRBRBR2B22ĶĶĶ2Ķ2 !,2Ķ2ĶĖĖ2Ķ !+BĦĖ2!!!2Ķ!!!P2Ķń !'2Ķ2Ķ2Ķ2Ķ2Ķ2Ķ2Ķ2 !,2Ķ2Ķ!!Ħ!2 !+BRBĶ!!!Ķ !'Ķ2 !(Ķ2Ķ2Ķ2Ķ2Ķ2Ķ2Ķ2 !,2Ķ2Ķ2BRB !-Ķ2Ķ!!!Ķ !(2 !)2Ķ2Ķ2Ķ2Ķ2Ķ2Ķ2 !*2!2Ķ2Ķ2Ķ2 !/2Ķ2!!Ķ2 !&22 !)2Ķ2Ķ2Ķ2Ķ2Ķ2Ķ2 !*2Ķ2Ķ2Ķ2Ķ2 !0ĦBc!!2Ķ!!BĶ Ė+ĆĖĆĖĖĦĖĦĖĦĖĦ Ė+ĆĖĆĖĆ2Ķ2!Ķ!R !,ĶĦĖĖ!!Ķ !&sc R(cRcRcRRBRBRB R+cRcB2BcĶ2!!ĶĖĖ !,2BĦĖ!Ķ !&ĶĦBs2!!!2Ķ2Ķ2Ķ2Ķ2Ķ2Ķ2 !*2Ķ2ĦĶ2BĶ2 !&2Ķ !,ĶBR2Ķ2!!!2ĶĶĖĦc2!2Ķ2Ķ2Ķ2Ķ2Ķ2!2 !*2ĶĶĖĶ2B!2 !&BB2 !,2Ķ!!2Ķ!!!Ķ2!!ĖĦcRĶ2Ķ2Ķ2Ķ2Ķ2 !,2ĶĶĶ2BB !6Ķ!!!Ķ !&2 !&ĖĦB¶B2Ķ2Ķ2Ķ2 !,2ĶĶĶ222 !72!!Ķ !&2 !'2ĖĆĆcB2Ķ2Ķ2 !*2!2ĦĶĶ222!Ķ!R !4Ķ!Ķ2!!!2!!!ĶBsĶ2ĶĦĆcB2Ķ2 !*2Ķ2ĦĶĶR22!!ĶĖĖ !62ĶĦ!2 !&ĦĖĖ2Ķ2ĶĦĆcB2 !*2Ķ2ĦĶ2RĶ2 !&2Ķ !&2R !0Ķ!¥ĦĶĶ!!!BĦĖĶ2Ķ2ĶĦĆc¥B !(2Ķ2ĦĶ2BĶ2 !&BB2!!!2BĖ !/Ķ!!BsĦĦĶ!22c22Ķ2Ķ2ĶĦæĆcB !&2ĶĶĦĶ2BĶ2 !+2RBĦĖ!!!2 !*Ķ2!!B!RBĦĶĶ2Ķ2Ķ2Ķ2!2!!ĦĆcB!!2 Ķ&BB!2 !+2BĦĖĶ!2!2Ķ !*2Ķ!2!!!2BĦĶĶ2Ķ2Ķ2 !(ĦĆc¥BĶĶĶ2B2 !-2BĦĶ!!!Ķ2Ķ2 !*Ķ !(22BĦĦĶ2Ķ2!!!Ħ2c!!ĶæĆcĶĶ222!Ķ!R !(2RBĦĶ2!2!2Ķ2 !-2!!!2Ķ22cBĦĶ2 !&ĶĖĖ!2Ķ2Ħö 2&!!ĶĖĖ !'2BĦĖĶ2Ķ2Ķ!!2 !-2 !&Ķ2Ķ2Ķ2BĦĶ !&2ĶĖ2Ķ2Ķ2Ķ222 !&2Ķ !&2BĦĶ!2Ķ2Ķ22 !/Ķ !&2Ķ2Ķ2Ķ2BĦĶ!!!BRRĶ2Ķ2Ķ2Ķ2 !&BB2!!!2BĦ!!2Ķ2!2 !12 !&Ķ2Ķ2Ķ2!2BĦĖĶ!!2Ķ2Ķ2Ķ2Ķ2 !+2RBĦ!Ķ2Ķ2 !32 !'2Ķ2Ķ2!!!2RBĦĶ2Ķ2Ķ2Ķ2!2 !+2BĦĖ!Ķ2Ķ2 !72!!Ķ2Ķ2 !(2BĦĦ2Ķ2Ķ2!Ķ!R !)2BĦĶ2Ķ2!2 !72Ķ!!2Ķ2 !*BBĦĶ2Ķ2!!ĶĖĖ !(2BĦĶ2Ķ2 !92Ķ2!2Ķ2 !(2!2ĦĶB2Ķ2 !&2Ķ !'2Ķ!cRĶ2 !92Ķ2Ķ!!2 !(2Ķ2ĦĶ2BĶ2 !&BB2 !&2Ķ2ĖĦBR !:Ķ2Ķ2 !*2ĶĶĖĶ2BĶ2 !-2Ķ2Ķ2ĦĦBcB !82Ķ2Ķ !)2ĶĶĶ2BBĶ2 !+2!2Ķ2!2!!ĦĆĦBB !7Ķ2Ķ2 !(2ĶĶĶ222Ķ2Ķ!R !(2Ķ2Ķ2!ĶĶB!!!ĦĦBB !62Ķ2 !(2ĶĶĶ222!2!ĶĖĖ!!!2!2Ķ2Ķ2!!ĦĦĖ !&ĦĦBB !5Ķ2 !(2ĦĦĶ222 !'2Ķ!!2Ķ2BĶĖĶ!!!2 !)ĦĦBcB !32 !(2ĦĶ2R22 !'BB2!2!RBĦB2ĶĦ!!BR2 !(ĦĆĦBB !82ĦĶ2BĶ2 !)2!2!B!Ħ!!B2ĶĦ !.ĦĦBB !42ĦĶĖĶ2BĶ2 !)2Ķ2!BĦĦ !&B2!ĦĦ !-ĦĦBcB!!ĶĶ !-2ĶĦĖ2BBĶ2 !'2!2Ķ2BBĦ !)BB!ĶĦ !-ĦĆĦBB!!2Ķ !+2Ķ2Ć222Ķ2!Ķ!R!2Ķ2Ķ2B!Ħ !,B2ĶĦ !(ĶĶB!!ĶĦĦsĶ2Ķ2 !*2Ķ2Ķ222!2!!ĶĖĖ2Ķ2Ķ2BĦĦ !.B2ĶĦ !'ĦĦĖ!Ķ2ĶĦö2Ķ!Ķ !*Ķ2Ķ222 !(2ĶĶ2!2BĦ !1B2ĶĦĦ!!Ķ2!!Ķ2Ķ2Ķ!Ķ !-2Ķ2Ķ2 !'2BR22!BBĦ !3BRĶĦĖĶ22R!2Ķ!Ķ !0Ķ2Ķ2 !'2Ķ2Ķ2!BĦĦ !4Ķ!B2ĶĦĶ2Ķ!Ķ !)Ķ !+2Ķ2!!!2!2Ķ2!2!BĦ !3Ķ!Ķ2Ķ2B2ĶĖĖ !+Ķ2Ķ !*Ķ2!Ķ!RĶ2Ķ2!!BBĦ !1Ķ!Ķ2Ķ2Ķ2Ķ!BR2ĶĦ!Ķ!Ķ!Ė!R2Ķ2 !*2!2ĶĖĖ2Ķ2!!B!! B2RBRBRBRBRR22B2ĶĦ2Ķ2ĶĦĖĖĶ2Ķ !+2Ķ!2Ķ!2!!c B?ccRRRBĶ2Ķ2BĦĖ2Ķ2 !*2Ķ2BRB !& Ć-öĆöĆöĆöĆ ö&æöæöæöæöæĖĦ!Ķ2Ķ2ĶRcRĶ2Ķ !*Ķ2!2 !0Ķ!Ķ2Ķ2Ķ2Ķ!Ķ!Ķ!Ķ2Ķ2Ķ2Ķ2Ķ2Ķ2Ķ2Ķ2Ķ2Ķ2Ķ2Ķ2 !9Ķ!Ķ2Ķ2Ķ2Ķ!Ķ!Ķ!Ķ2Ķ2Ķ2Ķ2Ķ2Ķ2Ķ2Ķ2Ķ2Ķ2Ķ2Ķ2Ķ2Ķ !*2 !-Ķ!Ķ2Ķ2Ķ2Ķ!Ķ!!!Ķ2Ķ2Ķ2Ķ2Ķ2Ķ2Ķ2Ķ2Ķ2Ķ2Ķ2Ķ!Ķ!Ķ!Ķ !4Ķ!Ķ2Ķ2Ķ2Ķ!Ķ !(2Ķ2Ķ2Ķ2Ķ2Ķ2Ķ2Ķ2Ķ2Ķ!Ķ!Ķ !0d ¦,·¦·¦·¦·¦ ·,Ç·Ç·Ç·Ç·Ç·Ç·Ç·Ç· Ç/¦Cdd!",
);
rawImages.push(
  "#c Qc! Da !& Ĥ] !'Ħ ÷'×÷×÷××ÇÇ ·+Ç·ÇÇ ×&ç×ç×ç×ç×ç× ç(÷ç ÷(ć÷$ !.BĦBĦ!Ķ!ĶĨ!!ĸ !&2Ķ2!2!!!2Ķ2Ķ2Ķ2Ķ2Ķ2 !'2Ķ2 !'2Ķ2 !+ĆC·!ĦBĦ!Ķ!!Ĩ2!!!ĸ!!2ĶBÇÇ×××µ¤µ¤µ¤2Ķ2Ķ2 !'2ĆS·!!!ĆC¦2 !,ĦåöĦBĦBĶ2!ĸ2 !'ĸ2Ķ2ĦÕÕµĦÇùùD$×!Ķ2Ķ2 !'2ĶĦåö!!2Ħåö !-BĦåBĦBĦ2!ĸĶ !)ĸ2 !'·ĖĖĶ×B!!2Ķ2 !'2Ķ2BĦå!2ĶBĦå!3 !+c¥cĦBĦ!!Ĩ !*2!$!Ķ !&Ķ!Ķ !&Ķ2 !'2Ķ2!c¥c2Ķ2c¶s3ĵ !-ĦBĦ!!!0Ħ !*2ń !(ĦĶ!ĶĦ!D2 !'2Ķ2 !&2Ķ2Ķ2!3ĵ3 !-BĦB!!Ķ!@Ķ !'22ń !(¤R!!QÕ !)2!2 !&2Ķ2Ķ2Ķ3ĵ3ĵ !+ĆC·BĦ!Ķ!Ķ2@Ķ!!!22ń!!2!ĖĖĖÕĴńĤå!Bö !&2 !(2Ķ2Ķ2!Ħ!¦ĵ3 !+ĦåöĦ!Ķ!Ķ2Ķ!@Ķ!22ń!!2!RcRcRcBRB2Ķĕ!!!2 !(2Ķ2Ķ2!3Ħåö3ĵ !+BĦåB!2!2Ķ!!!@2Ķń!!2Ķ!2Ķ2Ķ2Ķ2Ķ2 !'2 !(2Ķ2Ķ2!3ĵ!!ą!3 !+cccĦ!Ķ!Ķ !'Ķ2!!2Ķ2!Ķ2Ķ2Ķ2Ķ2 !'2 !(2Ķ2Ķ2!3ĵ3s¦d !-ĦBĦ!Ķ!Ķ2 !'2!!2Ķ2!!2Ķ2Ķ2Ķ2 !'2 !(2Ķ2Ķ2!3ĵ3ĵ3 !/BĦBĶ!Ķ2Ķ!!!22!!2Ķ2!!2Ķ2Ķ2Ķ2 !'2 !(2Ķ2!2!3ĵ3ĵ3 !0Ćd·2!2Ķ!!cĶ Ė&ĆĖĆĆĆöĆöĆĆĖ Ć( ö)æö æ&Õ3ĵ3!ĥ!s !,ĦĦåö!!Ķ !&ç¥ c(scscs c) s)¥s¥s·R2R·ĵ3!!Ħåö !,BBĦåĶĶ2!!!Ėõt×B!!!2Ķ2Ķ2!2 !'2 !(2Ķ2ĶCąĦBdĵ3 !&Bĥ!2 !*ĦccBĶ2Ķ!!2ĶĖÕĦ·B!2Ķ2Ķ2Ķ !(2 !(2Ķ2ĶĦåĦBd!3 !&ddC2Ķ !*BĦ!Ķ2Ķ!!!Ķ22ĶÕĦ··ĶBĶ2Ķ2 !'2 !(2Ķ2ĶĦĦBsd !+2Ķ2 !*Ħ!Ķ!Ķ !&22Ķ2!ÕĦBµtBĶ2 !'2 !(2Ķ2ĶĦĦBR3 !+2Ķ2 !+BĶ!Ķ !&22Ķ2!!2ÕÕ$ńtB !'2 !(2Ķ2ĖĦĦBR3!ĥ!s!!!2!2Ķ2 !,Ħ!Ķ2!!!22Ķ2Ħd×Ķ2Ħõ$ńt!!!22 !(2Ķ2ĖĦĦ¦R3!!Ħåö!!2Ķ2Ķ2 !-Ķ!2ĶĦ!22Ķ2!Ħåö2Ķ2Ħõ$ń¦!2 !)2Ķ2ĖĦB¦ĵ3 !&Bĥ!2Ķ2Bs !0Ķ!÷ĦĶĦ2!!BĦåĶ2Ķ2Ķõ$ń¤t !(2Ķ2ĖĦBdĵ3 !&ddC2Ķ2BBö !/Ķ!!BÇĦĦĦ!2BsB2Ķ2!!Ķõ÷$ńt !&2ĶĦĖĦBdĵ3 !)2ĶRcBĦå!!!2 !*Ķ2!!Ĥ!cBĦĦĶ2Ķ2Ķ2!!!2!!õ$ńt!!2ĶĦĦĦcd!3 !)2ĶRBĦĆĦ!2!2Ķ !*2Ķ!2!!!BBĦĦĶ2Ķ2!!!2 !&ą$ńrtĶĦĦBsC !+2ĶRBĦĦ!!!Ķ2Ķ2 !*Ķ !(2BBĦĖĶ2!!!2!ĆC·2Ķąć$ńĦĦBR3!ĥ!s !'2BsBĦĦ2!2!2Ķ2 !-2!!!2Ķ2BsRĖĶ!!2!!ĶåöĶ2!!ąĘBBR3!!Ħåö !&2BBĦĆĦ2Ķ2Ķ!!2 !-2 !&Ķ2Ķ2!2RĖĶ2!!!2Ķå2!!!3ĵCR3 !&Bĥ!!!2BBĦĦ!2Ķ2Ķ2B!!!2 !-2!!2Ķ2!!!2RĖĦ!!!sss!!!3ĵ3ĵ3 !&ddC!!2BBĦĶ!2Ķ2!2 !&2Ķ !*2!2!!!Ķ2 !&2BRĖöĦ2Ķ2!!!3ĵ3ĵ3 !*2RcBĦĶĶ2!2 !(2Ķ2 !+2 !&2 !&2!!BsRĖĖ2!!!3ĵ3!3 !*2BBĦĆĶĶ2 !(2!2Ķ2 !+2!!2 !(2 !'BRĖĖ!!3ĵ3!ĥ!s !(2BBĦĦ2Ķ2!!2!2!2!!Ķ2 !.2Ķ !'2 !)RRĖ!3ĵ3!!Ħåö !'22BĦĦ2Ķ2!!2Ķ2Ķ2!!!2 !-22ĶB!R!!2 !'2!2ĖĦR3ĵ3 !&Bĥ !&22Ķ!ńcĶ2!!2!2!2 !3ĶBĶ!!!2 !'2Ķ2ĖĦBdĵ3 !&ddC!!!22Ķ2ĆDĤc2!2 !7ĶBĶ!!!2!!!2!2ĶĦöĦBdĵ3 !*2!22Ķ2Ķ2ĖDĤńR !8BĶ !)2Ķ2ĶĦĦBsdĵ3 !* 2&Ķ2!2!!Ė$DĤB !7Ķ !)2Ķ2ĶĦĦBR3ĵ3ĥ!s!!!2!22Ķ2Ķ2!ĦĦR!2ĶĦDĤB !-Ķ !-2!!!2Ķ2ĶĦĦBR3!3!Ħåö!! 2&Ķ2Ķ2!!ąąö2Ķ2!ĦDĤB !+Ķ2 !,2!!!2Ķ2ĖĆĦBR3 !'Bĥ!22Ķ2Rĕåĕ!!!B!!Ķ2!!!ĦDĤńB !(Ķ2Ķ !+2!2!!Ķ2ĖĦB¦R3 !'tdC222cRĦdBĦą!!d·R2 !'Ħ$DĤB !&Ķ2Ķ !+2!2Ķ!!2ĖĦBdĵ3 !'2Ķ 2&B!ĦĶ!dBĦą!2 !,ĦDĤB!!!2Ķ!2 !+2Ķ2DĖöĦBdĵ3 !'2Ķ2!22BĦĦĶ!!!tB!ąõ !,ĶĖDĤńB!Ķ!ĶĶ !*2Ķ2!ĦåBcdĵ3 !'2Ķ2!BRBĦĶĶ!!!2Ķtt!Ħõ !*Ķ!!ĖĸDĤd!Ķ2Ķ !*Ķ2!!µBBCĵ3!ĥ!s!2!2!BB!ĦĶ!!2!2Ķ2!!tBĦõ !'ĶĖĦR!!ĶĖDPĶ2Ķ2 !*2!!!BBC!3!!Ħåö2!!!BBĦĦĶ!!2Ķ2!2 !&tBĦõ!!!Ķ!ąąĆ!Ķ2ĶĖĨ2Ķ!Ķ !-3BC!!!2!!Bĥ!2BBBĦ!Ķ!!2Ķ2 !*tBĦõõĶ!ĶB!!Ķ2Ķ2Ķ!Ķ!Ķ !-3ĵC!!!2Ķ2t¦S22BBĦ!Ķ2!2!2 !(Ķ!!Ķd¦ĦĆåĶ2S¦!2Ķ!Ķ!!!Ķ2ĥ !+3ĵ3!!!2Ķ2!2Ķ22BĦĦ!Ķ2Ķ2 !(Ķ!Ķ2ĶĶ!Ķ!dBĦõĶ2Ķ!Ķ!! Ķ&!ĥ3 !*3ĵ3!!!2Ķ2! 2&BĦ!!!2!2 !(Ķ2Ķ2ĶĶ!Ķ2ĶBtBĦÕå!!ĶĶĶ !&ĵ3ĵ !*ĵ3!ĥ!sĶ2!22ĶRBĦ !.Ķ! Ķ&2Ķ2Ķ2Ķ!t¦BĦõĶĵ!ĵ!å!s3ĵ !+3!2ĦåöR!22ĶR!! B/RRRcRcRcRcRccBRdBĦą3ĵ3ĥĦåöĵ !-2Ķ!Bĥ!22Ķ0 Ĥ?ńńs·¦dĵ!ĵCBĦå !-2Ķ2dtdĶ2Ķ2$$ĸ$$ ĸ(ĨĸĨĸĨĸĨĸĨĘĘĘćĘ ć&÷ć÷åõĵĵ!!!ĥs¥s!!Ķ !*Ķ2!B2!2Ķ2!!Ķ2ĶĶ!!!Ķ!Ķ2Ķ2Ķ2ĶĶĦĶĵ!ĵ3ĵ!!!Ķ2Ķ2Ķ2Ķ!Ķ!Ķ2Ķ2Ķ!Ķ2 !*2!2!!2Ķ2Ķ!Ķ2Ķ!!Ķ!Ķ2Ķ2Ķ2 Ķ&ĵ!ĵ3ĵ3ĵ!!!Ķ2Ķ2Ķ2Ķ2Ķ2Ķ2Ķ2Ķ2Ķ2Ķ !+2!!2Ķ2Ķ2Ķ!ĶĶ!Ķ2Ķ2Ķ2Ķ!ĶĶ!Ķĵ3ĵ3ĵ3ĵ!!!Ķ2Ķ2Ķ2Ķ2Ķ2Ķ2Ķ!Ķ!Ķ!Ķ !+2!!2Ķ2Ķ!ĶĶ!Ķ2Ķ2Ķ2Ķ!ĶĶ!Ķ!!!3ĵ3ĵ3ĵ!!!Ķ2Ķ2Ķ2Ķ2Ķ!Ķ!Ķ !0Ĥń000ń0ń000@0@0@0@0@@@P@ P'bPbP b&rbrbrbrb r/ń!ĤĤ!",
);
rawImages.push(
  "#c #aĦĦ! å`Ć!!! Ė_ !' Ħ.ĖĦĖĦĖĦ Ė& Ć&ĖĶ!ĶĖöĆöĆĖĶ!!ĶĆö Ć&ĖĆ Ė+Ħ !3Ķ2Ķ2Ķ2Ķ!!!Ķ!!!2B2ĶĦĦ2Ķ22B2!ĶĖĶ2!!!2Ķ2 !*2Ķ !*2cB !'Ķ2Ķ2Ķ2Ķ!!!ĶB¥B!c¥¶çķ3#3#ķR!ĶĶ¥R!!!2Ķ2 !)2sB2 !)ĆĖĖB !&Ķ2Ķ2Ķ2Ķ!!!ĶĦĦĖc!BĖĦĥ õ'ĖçĶöĦĖc!!2Ķ2 !)ĦĦĖBĶ !*ĦĖĶ !&2Ķ2Ķ2Ķ!!!Ķ!!ĦĖĶ!!!ĦĦ !)Ė!ĦĖĶ!2Ķ2 !+ĦĖĶ2 !)c!cĖ !&Ķ2Ķ2Ķ!!!Ķ!!B!BöĶĖ2!Ħ Ć'ą¤!B!Bö2Ķ2 !*2B2sĖ !+cĦ !&Ķ2Ķ2Ķ!!!Ķ !&BĦĶ2öÖÆÖÆÖÆÖÆ¶æ!!BĦ2Ķ2 !*2Ķ2BĖ !1Ķ2Ķ2Ķ!!!Ķ !(Ķ2Ķ2Ķ2Ķ2Ķ2Ķ2 !'2Ķ2 !*2Ķ2Ķ2 !1Ķ2Ķ2Ķ!!!Ķ !(Ķ2Ķ2Ķ2Ķ2Ķ2Ķ2 !'2Ķ2 !*2Ķ2Ķ2 !1Ķ2Ķ2Ķ!!!ĶcBB Ħ&ĶĦĶĦĶĦĶĦĶĦĶ Ħ(ĖĦ Ė(!!2Ķ2Ķ2 !&2 !-2Ķ2Ķ!!!Ķ!ĦRBc 2& !9R!2Ķ2Ķ2 !&2Ķ !-Ķ2Ķ!!!Ķ!!ĦĶ2ss!!! 27!R!2Ķ2Ķ2 !&2Ķ2 !,Ķ2Ķ!!!Ķ !&ĆĶĦsÆc!2!2!2!2! 2&B2 B&2ĶĶR!2Ķ2Ķ2 !&2Ķ2Ķ !+Ķ2Ķ!!!Ķ !(ööĆBccĶ2Ķ2Ķ2Ķ2!!!2Ķ2!!!ĶĦBR!2Ķ2Ķ2 !&2Ķ2Ķ2 !*Ķ2Ķ!!!Ķ !(Ķ2ĶöĆBccĶ2Ķ2Ķ2!!!2Ķ2!!!ĶĦB2!2Ķ2Ķ2 !&2Ķ2Ķ2Ķ !*2Ķ!!ĶĶ !(Ķ2Ķ2ĶöĆBccĶ2Ķ2!!!2Ķ2!!ĶĖĦB2!2Ķ2Ķ2!!2!2Ķ2Ķ2Ķ2 !*Ķ!!Ķ!RĦ !&Ķ2Ķ2Ķ2ĶöĆBccĶ2!!!2Ķ2!!ĶĦ!B2!2Ķ2!2!!2Ķ2Ķ2Ķ2Ķ2 !*Ķ!!Ķ!!2cĦ!!!2Ķ2Ķ2Ķ2ĶöĆBcc!!!2Ķ2!!ĶĦBR2!2Ķ2 !&2Ķ2Ķ2Ķ2Ķ2 !*Ķ!!Ķ!!!2scĦ!!Ķ2Ķ2B¶c2ĶöĆBcsR2Ķ2!!ĶĦB2!!2!2cB!!2Ķ22RĖ2Ķ2!!2 !*2¥R !&22ĦĦ2Ķ2ĦĦĖBĶ2ĶöĆBcBB2!!ĶĦB2!!2!ĖĦĖB!2Ķ22RĖĶĶ2ĶRB !)ĶĖĦĖR!!!B!2!!Ħ2Ķ!ĦĖĶ2Ķ2!öĆ!cBBĶĖĦB2!!2 !&ĖĶ2!2BRĦĖĶ2ĶĶĖ2 !+ĦĖĶ !'ĶB2!Ħ22!söĶ2!!!ĆĆ!BBĦBc2!22!!!R2sĦ!2c¥!Ė!2!!ĶĦĶ !*B!sö !'2Ķ22!Ħ22ö!2!!!2ĶĆĆĦĖRBĶ!2 !'22Ħ!2RcĆĖĶĶ2!BBcĶ !+Bö!!Ķ!!!Ķ2Ķ22!Ħ2Ķ !&2Ķ2!ĆöĶ2Ķ22 !'2Ķ2!RRcÆĖĶ!2!2!BĶ !/Ķ2!!!2Ķ2Ķ22!ĦĶ!!!2Ķ2!ĶĶ!2Ķ2 !&2!2Ķ2!R2cÆ2Ķ2!2 !3Ķ2Ķ!!!Ķ2Ķ2Ķ222!Ħ!2Ķ2!ĶRs¥s¥sss!2Ķ2Ķ2!B2ĶÆ2Ķ2!2 !3Ķ2Ķ2!!!2Ķ2Ķ2!2B2!ĦĶ2!Ķ¶çÇ·××÷÷!2Ķ2!2!c¥ĶĖ2!2 !5Ķ2Ķ2Ķ!!!Ķ2Ķ2!!!Ķ2R!Ħ!Ķ!ĶĥĥĥõõÕ!!Ķ2!!!ccöĖ2 !7Ķ2Ķ2Ķ2!!!2Ķ2 !'2ĶR!Ķ!2ĶĦtrtt!Ħ!2!!!RcöĖ2!!!2!2 !1Ķ2Ķ2Ķ2Ķ!!!Ķ2 !'2Ķ2ĖB!22!Ħ!$ńń!!Ķ!!!RsöĖ2!!!2Ķ2Ķ !12Ķ2Ķ2Ķ2!!!2 !'2Ķ2ĖRB22!!!µÕ÷÷!ĖĶ!!2!ĦsR!!!2Ķ2Ķ2 !1Ķ2Ķ2Ķ2Ķ !*2Ķ!ĖR2Ķ2!!!ĦĦĆæöĆąĶ!2ĶĦĖĦsB!2Ķ2Ķ2ĶĶ !02Ķ2Ķ2Ķ2 !)2ĶĦĦR2Ķ2!!!ĖĦĖĦĦĖĆöĶ2Ķ2!ĦĖös¶22Ķ2Ķ2!Ķ !/Ķ2Ķ2Ķ2 !)2ĶĦBR2Ķ2 !&2Ķ2!!!2Ķ2Ķ2!!!ĶĦöĦs22Ķ2Ķ!!Ķ !'Ķ !(2Ķ2Ķ2 !)2!ĦR22Ķ2 !&2Ķ2!!!2Ķ2Ķ2!!!2Ķ2ĦĖĦs22Ķ2!Ķ !'Ķ2 !(Ķ2Ķ2 !)2!ĖR!2!2 !&2Ķ2!!RcĦ2Ķ2!2!2Ķ2Ķ2ĦĖĦs22Ķ !&Ķ!Ķ2Ķ !(2ĶR¥R !'2!ĖR!2 !(2Ķ2!!Rs!ĦĦ2!2Ķ2Ķ2Ķ2Ķ2ĦĖĦs22!!ĶĶ2ĦR22 !(ĶĶĦĖR!!!Ħ!ĶĖc!2!!BcR!2!2!!RsĆĦBĦĦ2Ķ2Ķ2Ķ2ĶĶ22ĦĖös2B2!2ĖĶĖ2Ķ !(2!ĦĖĶ!2!ĶĖ2cĶ2!!ĖĆĖ22!!!2RsĆĦĶBBĦĆĦĶ2Ķ2ĶĦĦĖ22ĦĦösB2!Ķ!ĶĦĶ2 !)B!sö2!!æB2Ķ2 !&ĦĖĶ!!!2RsĆĦĶ2!RBĶĦĦĶ2Ķ2!ĶĦĶĶ!!Ħö¥sB2BBcĶĶ !*Bö2!!ĶB!Ķ2 !&cRsĦ!!2RcĆĦĶ2Ķ2ĶRcBĦĦĶ2ĶRBcĶ !&Ħö¥BĶ22ĶĶ2 !+2!!!Ħ!Ħ2 !&2ĶBĦ!!2RcæĖĶ2Ķ2Ķ2Ķ2BBĦĦĶ!ĶBĶ !'ĶĦÆ22Ķ2Ķ2Ķ !*2!!!2!!B!!2!2Ķ2!!!2Rcæ!!2Ķ2Ķ2Ķ2Ķ2BBĦĦ !(Ķ!Ķ2Ķ!2Ķ2Ķ2Ķ !*2!!!2 !'2Ķ2!2!2!2Rcæ!Ķ2Ķ2Ķ2Ķ2Ķ2Ķ!BBĦĦĦ!Ķ!Ķ2Ķ2Ķ!2Ķ2Ķ!Ķ !*2!!!2 !'2Ķ2!!!2ĶR¶cæ!Ķ2Ķ2Ķ2Ķ2Ķ2Ķ!!!BBĦĦĦ2Ķ2Ķ2Ķ!2Ķ2Ķ !02 !'2Ķ2!!!2ĶcsĆæ!Ķ2Ķ2Ķ2Ķ2Ķ!Ķ !'2RBĦĦ2Ķ!Ķ!2Ķ!Ķ !02 !'2Ķ2!!!2ĶccĦ!BBRBRBRBRB R*cB22ĦĦ!!!2Ķ !22 !'2Ķ2!!!2ĶR¦Cd ¦6Ç¥¥RĦĶ!2Ķ !22 !'2Ķ2!!!2ĶRs ĥ:BcÆ¥R!Ķ !82Ķ2!!!2Ķ2ĖÖÖÖæÖæÖæÖæÖæ Ö(ÆÖÆÖÆÖÆÖÆÆĖĦ !92Ķ2!!!2Ķ2Ķ2!!2Ķ2Ķ2Ķ2Ķ2Ķ !'Ķ2Ķ2Ķ2Ķ2Ķ !<2Ķ2!!!2Ķ2Ķ2!!2Ķ2Ķ2Ķ2Ķ!Ķ !'Ķ2Ķ2Ķ2Ķ2Ķ !<2RR!!!2Ķ2Ķ2!!2Ķ2Ķ2ĶĦ22 !&Ķ!Ķ2Ķ2Ķ2Ķ2BB !0ĶRB !*ĦĖĖ2!!2Ķ2Ķ2!!2Ķ2Ķ2ĶĦĶĖ2!!!Ķ2Ķ2Ķ2Ķ!ĶĦĖĖ2 !/ĦĶĖ2 !)2!ĦĖĶ!2Ķ2Ķ2!!2Ķ2Ķ2Ķ!!ĶĦĶĶ!Ķ2Ķ2Ķ!Ķ !&ĶĦĶ !0ĶĦĶ !)ĶRRsĦ2Ķ2Ķ2!!2Ķ2Ķ2Ķ!!BBcĦ2Ķ2Ķ2Ķ !(B2cĦ !/B2cĦ !)2!BĦ2Ķ2Ķ2!!2Ķ2Ķ2Ķ !&BĦ2Ķ2Ķ2Ķ !*BĦ !1BĦ !-2Ķ2Ķ2!!2Ķ2Ķ!Ķ !'Ķ2Ķ2Ķ2Ķ !F222!2!2!!!Ķ!Ķ !*2!2!2! 2A !' R_!!! ¦a!",
);
rawImages.push(
  "#c Sc! Ėa!!! ĥ_ !' Ć.öĆöĆöĆ ö& æ&öĦ!ĦöÖæÖæöĦ!!ĦæÖ æ&öæ ö+Ć !3Ķ2Ķ2Ķ2Ķ!!!Ķ!!!2RBĦĖĦ2Ķ22RB!ĦĆĶ2!!!2Ķ2 !*2Ķ !*B×c !'Ķ2Ķ2Ķ2Ķ!!!ĶB÷B!sµrµåąõąõå·!ĦĦ÷R!!!2Ķ2 !)2çc2 !)ĦĆÕt !&Ķ2Ķ2Ķ2Ķ!!!ĶĦĦÕ×!·$ !*ńĦæĦÕ×!!2Ķ2 !)ĦĦÕtĶ !*ĦĆĖ !&2Ķ2Ķ2Ķ!!!Ķ!!ĦĆĖ!!!D !*Ć!ĦĆĖ!2Ķ2 !+ĦĦĖ2 !)BB¥å !&Ķ2Ķ2Ķ!!!Ķ!!B!BÅĶµB! D(!×!B!BÅ2Ķ2 !*2BB¦å !+BĆ !&Ķ2Ķ2Ķ!!!Ķ !&BĦĶ2öQAQAQAQAtĆ!!BĦ2Ķ2 !*2Ķ22å !1Ķ2Ķ2Ķ!!!Ķ !(Ķ2Ķ2Ķ2Ķ2Ķ2Ķ2 !'2Ķ2 !*2Ķ2Ķ2 !1Ķ2Ķ2Ķ!!!Ķ !(Ķ2Ķ2Ķ2Ķ2Ķ2Ķ2 !'2Ķ2 !*2Ķ2Ķ2 !1Ķ2Ķ2Ķ!!!Ķ¥B2ĶĦĦĦĶĦĶĦĶĦĶĦĶĦĶ Ħ(ĖĦ Ė(!!2Ķ2Ķ2 !&B !-2Ķ2Ķ!!!Ķ!Ć¦sRR222 !9R!2Ķ2Ķ2 !&BĦ !-Ķ2Ķ!!!Ķ!!ĦĥC÷sB!! 27!R!2Ķ2Ķ2 !&BĦB !,Ķ2Ķ!!!Ķ !&æĥörćs!2!2!2!2! 2&B2 B&2ĶĶR!2Ķ2Ķ2 !&BĦBĦ !+Ķ2Ķ!!!Ķ !(ÖÅĘĤ×sĶ2Ķ2Ķ2Ķ2!!!2Ķ2!!!ĶĦBR!2Ķ2Ķ2 !&BĦBĦB !*Ķ2Ķ!!!Ķ !(Ķ2ĶÅĘĤ×sĶ2Ķ2Ķ2!!!2Ķ2!!!ĶĦB2!2Ķ2Ķ2 !&BĦBĦBĦ !*2Ķ!!ĶĶ !(Ķ2Ķ2ĶÅĘĤ×sĶ2Ķ2!!!2Ķ2!!ĶĖĦB2!2Ķ2Ķ2!!B!BĦBĦBĦB !*Ķ!!Ķ!cĦ !&Ķ2Ķ2Ķ2ĶÅĘĤ×sĶ2!!!2Ķ2!!ĶĦ!B2!2Ķ2!2!!BĦBĦBĦBĦB !*Ķ!!Ķ!!BcĦ!!!2Ķ2Ķ2Ķ2ĶÅĘĤ×s!!!2Ķ2!!ĶĦBR2!2Ķ2 !&BĦBĦBĦBĦB !*Ķ!!Ķ!!!C÷cĦ!!Ķ2Ķ2Bć¥2ĶÅĘĤ×Çc2Ķ2!!ĶĦB2!!2!2×c!!BĦBB¦ĆBĦB!!B !*2÷c !&B2ĦĦ2Ķ2ĦĦÕtĶ2ĶÅĘĤPdR2!!ĶĦB2!!2!ĶĦÕt!BĦBB·åĶĦBĦ·d !)ĶĦĦÕ·!!!Ĥ!2!!Ħ2Ķ!ĦĆĖ2Ķ2!ÅĘ!PdRĶĖĦB2!!2!!Ķ!ĦĖB!Bd·öĖĶBĦĶÕR !+ĦĆĖ !'ĶB2!Ħ22!cÅĶ2!!!ÕĘ!sdĦBc2!22!!!B2¦ą!B×P!å!2!!ĶĦĖ !*22cÅ !'2Ķ22!Ħ22Ć!2!!!2ĶÕĘöåRBĶ!2 !'B2ą!B·ĤDÕĶĶ2!cc¦ĥ !+2Ć!!Ķ!!!Ķ2Ķ22!Ħ2Ķ !&2Ķ2!ÕÅĶ2Ķ22 !'BĦB!··ĤĘÕĦ!2!B!Bĥ !/Ķ2!!!2Ķ2Ķ22!ĦĶ!!!2Ķ2!ĶĶ!2Ķ2 !&B!BĦB!·ńĤĘĥĦB!2 !3Ķ2Ķ!!!Ķ2Ķ2Ķ222!Ħ!2Ķ2!ĶcÇ÷÷ć÷÷÷!BĦBĦB!dńDĘĥĦB!2 !3Ķ2Ķ2!!!2Ķ2Ķ2!2B2!ĦĶ2!ĶėµPń Ĥ&!BĦB!B!×PDöĥ!B !5Ķ2Ķ2Ķ!!!Ķ2Ķ2!!!Ķ2R!Ħ!Ķ!Ħ !*ĦB!!!×ĤDöĥ !7Ķ2Ķ2Ķ2!!!2Ķ2 !'2ĶR!Ķ!2Ė !*B!!!·ĤDöĥ !7Ķ2Ķ2Ķ2Ķ!!!Ķ2 !'2Ķ2ĖB!22!D !(Ħ!!!·ńDöĥ !82Ķ2Ķ2Ķ2!!!2 !'2Ķ2ĖRB22!!!D !'Ė!!B!!ĤsC !8Ķ2Ķ2Ķ2Ķ !*2Ķ!ĖR2Ķ2!!!ööĘĘ$D!ĥ!BĦõ$!ĤsCC !'Ķ !02Ķ2Ķ2Ķ2 !)2ĶĦĦR2Ķ2!!!åąåąąÕµ÷ĦBĦB!õ$$ĤPRC !'Ķ !/Ķ2Ķ2Ķ2 !)2ĶĦBR2Ķ2 !&BĦB!!!BĦBĦB!!!õõ$!ńRC !'Ķ !'Ħ !(2Ķ2Ķ2 !)2!ĦR22Ķ2 !&BĦB!!!BĦBĦB !(õ$!ńRC!!!Ķ !'ĦB !(Ķ2Ķ2 !)2!ĖR!2!2 !&BĦB!!·×ĆBĦB !*õ$!ńRC !'Ħ!ĦBĦ !(2ĶR÷c !'2!ĖR!2 !(BĦB!!·ńĦĦĆB !,õ$!ńRC!!ĶĦBĦ·CB !(ĶĶĦÕ·!!!D!ĶĖc!2!!c×¦!B!B!!·ń$ĖBĦĆ !)ĦĦt!õ$$ńRR2!BĆĖÕRĦ !(2!ĦĆĖ!2!ĦĆ2cĶ2!!ĖæÕRB!!!B·ń$ĖĥcBĦöĆ !'ĦĖÕt!õõ$ńd2!Ħ!ĶĖĖB !)B!cÅ2!!rB2Ķ2 !&ĦĖĖ!!!B·ń$Ėĥ!!cBĶĦĆ !'ĶĖĖ!!!õ$PÇ B&·ĥĦ !*BĆ2!!ĥB!Ķ2 !&sR·ą!!B·Ĥ$Ėĥ !&c¥BĦĆ!!!BBRĥ !&õ$PBĦBBĥĦB !+2!!!Ć!Ħ2 !&BĦRą!!B·Ĥ$Ėĥ !)cBĦĆ!!BcB !'Ħõ×BBĦBĦBĦ !*2!!!2!!B!!B!BĦB!!!B·Ĥ$Ėĥ !+cBĦĆ !(Ħ!ĦBĦ!BĦBĦBĦ !*2!!!2 !'BĦB!B!B!B·Ĥ$Ėĥ !-cBĦĆĆ!Ħ!ĦBĦBĦ!BĦBĦ!Ħ !*2!!!2 !'BĦB!!!BĦdrĤ$Ėĥ !/cBĦĦĆBĦBĦBĦ!BĦBĦ !02 !'BĦB!!!BĦdPD$Ėĥ !1BcBĦĆBĦ!Ħ!BĦ!Ħ !02 !'BĦB!!!BĦdP!ĦĖ! C2ddB2ĦĆ!!!BĦ !22 !'BĦB!!!BĦdP!!ń P5R·çcĦĦ!BĦ !22 !'BĦB!!!BĦ·R $9!!!·÷¦!Ħ !8BĦB!!!BĦBÕ õ4ÕõÕõÕõÕõÕÕÕą !9BĦB!!!BĦBĦB !3ĦBĦBĦBĦBĦ !<BĦB!!!BĦBĦB !3ĦBĦBĦBĦBĦ !<B·¦!!!BĦBĦB !*ĦtC !&Ħ!ĦBĦBĦBĦBtd !0Ħ·d !*ĦĆÕR!!BĦBĦB !*ĦĖÕR!!!ĦBĦBĦBĦ!ĦĦöÕR !/ĦĶÕR !)B!ĦĆĖ!BĦBĦB !,ĶĖĖĦ!ĦBĦBĦ!Ħ !&ĶĖĖ !0ĶĖĖ !)ĦcRÇąBĦBĦB !,Bc·ąBĦBĦBĦ !(BB·ĥ !/BB·ĥ !)B!RąBĦBĦB !.BąBĦBĦBĦ !*BąĦ !0BąĦ !,BĦBĦB !/ĦBĦBĦBĦ !FBBB!B!B !0B!B!B! BA !' C_!!! Ra!",
);
rawImages.push(rawImages[rawImages.length - 2]);
rawImages.push(rawImages[rawImages.length - 2]);
// }
var wallCount = rawImages.length / 2;
// Decorations (Blocking) {
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !Ņ !Ĭĺ!!!wĊ' !(wĊ' !'wĊ'!!!ĺ !EúÖĪĺĺ!ö!7 ĺ'!ö!7 ĺ&!ö!7ĺÊĖG !EæĶĆĆcöąR Ć'cö¤R Ć&cö¤RĆRÖą !CútÆcBĦ!!æĦB!ĦĦĦ!!!ĦB!ĦĦ!!!ĦB!cRĪ !C¥c22ĶĆĶ!!d! Ć&!!!d!ĆĆĆ !&æĆ !Dt2S!!Ė!2R!2 !(R!2 !'R!t!!c !DĦB!Scc!2!2! c&!2!2!ccc!2!2cc!S !CĶB!!22s2! 2(s2! 2's2!2RR!B !CĦĖ!R222!! 2)!!! 2'!!!22R2 !B2!!R!BB!2!! B'!2!2 B&!2!2BB2 !DĦĦR !&222 !(22 !(22!!!B !DĕĕB!BS !'BBBS!!!2!BBS!!!2!!!2 !GC2B2!2 C&2B2!2CCC2B2!2CC22 !BĶĦĦ2R !&2 !*2 !)2!!!2 !F2! 2&! 2*! 2)!222B !DĶĶ2!22R3!! 2'R3!! 2&R3!!22!2 !BõĶĶB2BBC22! B'C22! B&C22!BBd !FS! 2&!! 2)!! 2(!!22B !DĶĶ2!BBcB2! B'cB2! B&cB2!BB!2 !Cö !(R2 !)R2 !(R2 !G¥2c2!ĶĦ222! Ķ&Ħ222!ĶĶĶĦ222!ĶĶ !EĖ!!!2 !' 2& !'222 !'2 !EĲ!tc!!2!ĦĶ !'2!ĦĶ !&2!ĦĶ!!ĶBñ !C#R!!!2BB2 !'2BB2 !&2BB2!!2ā !Dı!ÁÁÁ!!! Á(!!! Á'!!!_ēĶā !Fā!!!ÁÁÁ !(ÁÁÁ !'ÁÁÁ!!ā !Ņ !ÉD !]ĦĦ !bĖD!!Ħ !^ĥ!!D !_ĦĦDĦĖ !^ĦõĦĖĥ !]¤!ĦõĥĦ !_ Ħ& !^¤!ĦĦ !`¤!!¤ !`¤¤ !Ç",
);
rawImages.push(
  "#c Ņc !Ņ !þÅÅÅµµ !G µ8ĶĶ!2B !G2 c0!!22BBBc!ÂÂ² !GÇtĦ! t(Ħ!ttt!!2Â²²²o!ĖĖ)ç !X ''!WĜ !N¤Õ !5B !LĶĦ !3B !NĶ!Å !*Ħ µ'!µô³Ĕ !MĶ !*2 Ò,² !Kµ!Ķ !*2! ''!ĆĆ)) !FµµĶĦÕĶ!Ķ!µĶĦÕÅµ!!! đ'!22 !H2cRBB!!Ķ!cRBBRc!!! ¦'!¦¦ !HÇ t& !' t'!!! Ě'!ĚÛ !P2 !(2 !-¿ñġ !`ĦRB !a¦ !W õ'!õĴ|sąS !SÇ!! o'!oł!RCõ !LB !)· '*ösBą½ !]ñ!RCĬ !^ösBą !`2SIB !_B!!C !JĈ !&_ !/sB!ĥ !D ĸ(CĦ !&ąı !-~2!!!¯|ġ !A000!ç1!¥ !&S!.đđđááá Á&2Ķ¥bð!st !D0³2s2 !)ddd·ss ¶&ssRBcs !Føø¥¶s !'S R'tt d&c3ssR2 !CĸĸĸħħD!B !&B! Ċ) Ě&3!ttĬRd2 !A000³³³Aö !'Ī !& µ)¨ĵĦ!!z8Č !HĔ !&ú !&Õ2 c)!!!Ħ !X t' !&B !V2 !,n !aĦ !VN !*'2!!Ġ !aĦ!Ġ !D µ' !' ı'!!! đ'!đõ2!Ħ !E c' !' S'!!! t'!tt!!RĦ !DttĦ!t !'ĕĕĪĪĪ!N! Ù'!ÙÙÙ2Ė2 !FĦĖ !/ _,!2 !W 7'!7Ĝ9X6X !K2 !bB!t !`2 !`2!2 !, õ&Õ!Õ !Iµµ!Ķµ!22!ı!!ııı!R! _&¡!¡L, !G c(2!³ S(¦ S,2 !G t(2B Ī0ÕÕõõ !Nc_ !0xxWļĬ!!!ĥ !It7 !6Ę!Ħ !_öąö !`ąĦĥĦ !_Ħ!Ħ !^Ħą!¤Ħ¤ !]¤Ħ¤!¤ !_¤ !g",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !ÄÇÇÇ !_Ç!!!Ç !ÀÇ!ĶĶĶ!Ç !]Ķ!ĶĶĶ !_Ķ!!ĶĶ !ZÇ Ķ'!Ķ !<WW !? Ķ( !<WĦĦW !?ĦĦĦĶĶ !<ĶĕĕĶ !>ĦĶ.!Ķ!Ķ !:GąĦĦĕG !<ĶĶÑÅ.!Ķ !<ĦĶĦöĕG !<ĶR!ĶB !=ĶĶ!ĶĦĶ !>ĶĕĲ !;GĶ!!ĶĶĶĥ !<ÑĖĶĆ !=Ķ!!Ķ!ĆĦ !=Ķ!Ķ !=ĥ!Ķ!!ĆĖ !<R !CööĶæ !;Ă2!ĶĶ !?Ė Ķ& Ă' Ĳ&///???OOO```ppp`ĶĆĶ !FĆĆĖĖĖææöö å(ÕåõåĖĖĖĦĦĖĥ !HccRRR¥¥ss ¦(·¦t¦RRRBBRC !CR 2& g' 6&ĹĹĹĩĩĩęęęĉĉĉùùùĉ2c2 !Bss2¥ !;gĶ!2 !>C !&cR !<Ė!!2 !=2!22!cS !=2!2 !<ġ2!! 2& !<»!2 !?22!2B !>R2·6 !=B2BsCı !<2Ės2Ħ !<ġdBBSı !>»Sĺ !>2SS2 !=22!ĺ!!22 !;đBBđ !>B2!!2 !>đđ !>Å2BBB22 !^ 2' !] 2'!2 !¿Å 2( !^ 2& !^Å !&Å !^ Å& !Ņ !Ņ !Ņ !&",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !Ņ !Ņ !Ĕ3c !`#Qė !(CccC !Tccdc !'CA!!Ķ· !NO?!!!ė¥Bõ !&CA!!3ÆĆ3!!tStS !F`Ķõ?!Ē¥æò !*ħc·1!cdĶĖ2Ė¦S !&×ħħ!G'''!7' !4pĶBtõ¢!Ģ.! S'!!!AÖŅ!2!!ĦbĖbĖĦ !&Æo²³cBĥBGĶs'W'''Ě !-ç!2ĉĩtĆtĪ!Ċ! s&Rė!!c!CA3c!!Ė!ĖQ3!!3B!!!ĶctccRĆRBŁŁŁN !'tS¦ !'B!?õõc1ĊQĦ Å&RBėķB¥RĆRöcćsćsėĵ!!!c!!!ĦæĶĶĆĖĶB!W7'7ć·ĚSSĦ!Ė!!çB2Ė!ĩ××Ī!QėB !&ÅBcB!2ĶÇö!B2R2RB!!ÇcæúÚº!2RBRR!ĦĖ2Ķ2BgÚtRR!!Ħ¦!BB!2O?Ć!.ė!ÖB !'õõõ!2BB!Ħ!!!B!!t3ĖĆR!Cê!!öĖö2!ĖĶ!cR2cĂâĖĖĦĦc!!BCéB22c!Ė!ķ!ł !*ÅÅööĦcæ¶ĆsĆcBcB!ÆC!!!ĶRĖ!2pÆcăÂ¡_NæÖĦĦccRåçCR!éBRééĥBĲòBd #&CdC##öö2Ķc2cĶ¥!Rs2¥×sRĖ!RRBc2ĹĆĆ¨êêúĊBRB¶õõÅ!!R!!!éé!!!á!Ė!R B&ĦĆĦ!! B&cµBÕĶÕ¤¤ėħ!!v!BsB2cBccBĖ22õsÅcsc !&B !*&RĥRÙÕ ĥ&BBBŅŅĥĥąå¤!¤!µ!!!ô!!UĖRR!!cÁ!!!sđ2R>!!bÅb !0&&ù !(ĥĥĥ !1ôôÁñ Á'! Á&!ÁÁ!Á !ĐĖ !aĖ !bĥĥ !`Ħ!Ħ !aĦĦ !`¤Ħ¤ !a¤ !Ņ !Ņ !Ņ !Ņ !'",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !č33S !TS33 !)#Ķ!ĦS !RSĦ!Ķ# !'Sb!Ķ !VĶ!bS !&1!b!Q1d !Pd1Q!b!1!!!t!!!bććĆd !NdĆććb!!!t!!!ć!!!b!!Ķ ¦*!SS ¦*Ç!t ¦,Ç!t ¦+Ė!bb!!!ć!!!Ć!ć!!!bb! Ė)23ĦĦ Ė&ĶöĖĖĦÇ Ė-ötöĆ Ė*Bb !&ć!Ć !(ćć!!1ĖĖ 1&ĖĦQQQ 1&ĵQ11öĦA 1,ĖĖcA 1(ĖĖ1!!ćć !(22 !&ć!!bb !'Ķė !,ĶĶ !'ć !'bĶĶć !(bb!!ć !&22!t!!bćB !,22Ķ !,22 !&ėb!!ė!!ćBĶb !.Bćb!!t !&2!2b ć*2!b! ć+22!ćććQćććQćć!!2!ćħ ć&ħħććb2!2 !'22!2!!! 2+B!ė 2'c 2&!!222ė2cbė2B2!R!2A 2&AA22!!!2!22 !&ė222ė 2+!ć22RB22Ņ2R222ķĶ2R2RŅħ22Ħ222ć2ħ 2&ħħ22ė222ė!!!B !) 2.!ĆĖ!2ķ2Ė22!ĦR2Ć2Ķķ22BR 2+R 2& !)B! 2&B22B 2-BccB222R 2(c2B222Ė 2(R22RĆ 2- !&2!Ė!2Ķ 2&R222! 2.! 2'Ķ222c2BRR22ö22Ėc22B22!!!22!!!22!2R2!B222BĶ 20B 2&B22B22B22!ĖĦ22s22R222Ħ2!222!Ħ2 !&2!!!B 2&ĦĶ222!22B 2'B2Ķ2!22Ķ22B22Ķ222R!RB2B 2'R2B!!!2B!!!22!222! 2&RR222B22ĶB 2&Ħ2B2B22B22Ķ2BB2B22BĶĦ2Ħ 2)!2B2!22!!! 20BB22BĶ 2&R22BB22B22B2Ķ22Ķ2BB2R2R2B 2)Ħ222!!B2R 2)R 2'B 2&B2R 2'B222Ħ 2&B2RB2B 2'RĶ 2)R22!2B!!æ!!!22BBĦBBBsB232 B&ĦBBBcB232BcBc B&ĦBc232BBcĦRBBcBB22!!!2!!!2c 2'BBcBBBöĦĶRR B&cBBBĦB3R2BBRĦ!BBRcBĦ3R2BBĦcBRBĦBB 2)!! 2/sstBĦĦ 2&t2CR2RBB22ĶRRC2Ķ22RRBB22R22Ė2R 2)Ķ2!2!2!!!BBd333d333B!cd33d3õ3ĵ3dB!B3dC33ĵ3t3d3B!Bd 3&d333dBB!!!B!2¤22¥!BBRĖRRRĖRRR!!CRRRĖRtRdRĖ!ĤCRąRsRdRĖRĖR!!Cą R*ĖRBBĶ222B!BBĦ!R23R!BBsBBB!!s!BBsń B&s!!RBbBĦBBBsBsB!!s¦ B)ĖR32R2B2BR!BBB¦ĶdRBB !*ĦB!!!D !+D!B !+Ħ !*sBRdĶRcRB!!Ħ22ĵtĖB!! Ħ)!Ĕö Ħ+!ĖĖ Ħ&! Ħ'öô!! Ħ*!!BĖt!Ć22Ķ!!333!s!!Ħ Ĕ)ô!ń Ĕ+ô!ń Ĕ&ô Ĕ'ń!ô Ĕ+Ħ!!s!St3!Ħ!b!!RB!!!Ĕ !NĔĦ!!BR!!ĶĶ!!RsB!ĦĦô !QĦĦ!BsRĦĶ!!ĔĦĦĦ !SĔ!!ĦĦĦąĶ !&Ĕ!!!Ĕ !VĖ!!¤ !&ĔĔĔ !SąĖĖĖ !_Ķ !&ĶĶ ![Ķĵ!!ĵ !^ĶĶ !cĵĵĶĶ !] Ķ( !^Ķ!!!Ķ !]Ķ!ĶĶĶ!¤ !] Ķ' !]¤ĶĶĶ!¤ !aĶ !_¤ĶĶ¤ !`¤¤ !g",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !Ņ !AĚ !aĚBĚ!!' ![ĚNCd!úr' !T''!!!ÊöÊBbª!ħÆ !S'Åąh!h!B÷RSÕÇsÁ!!!êê' !MĥĖ×õhõ¶×ÅrÆĶAöW!!ê¦¦Ł !M>ėå¦ād×Åæ!B¶ÖsđWW¡RŁ !MĚg¤¦ĦËAö!¥oBė2QúąąWAW !2łł !;S2cåBAÆ!!tWĦ¥Ć!Çdd!ħđ !1âgg? ł' !3Ě!Bė¦¦!ėtąÇrrąĆė÷AĖµrĖ !3ĳ!ÅC Ö&ł !1ĚÆWRQQ!B2QĦrRĖĆ!ĆBķ!öĖÅ !1ł×s?êBsĶĶĶÆł !0NħB!÷#¤ĥĖÆ!!!Öç!cÁcŁsR¶h !1cùB!2SĊBR¥ !.ú7!!såRĥĆæ¥ŅtBçĖdBõĆhĆ!¡ćtā !3ùÒ22oĶĦö !-úæ!xúrd¤¶ĕćæ#¥ĆÕėcBtācõÊÊāā !5º!B c& !-oķR!!ĦĖ¦ķÇsćåĖĶæcbµõhĆtBĖć××···dd S+WĚd·Ò2! R&3 !-āāñ¦æcĖB!Bb×!÷ėÕsttõõc2¥ĦĶĦöĶ2cB2ĖĖĶ Ė(Ćöö!!2 !4'ıķ!sÅÅ!ķµåĶct·Âc×ē_//BBBs2ĶĶĶĦbbA b&BBb!!d!2 3& !/'ąúµBÕ¶¶ĆctSĖÕ!BbŅQÚÊÊbb¤µÕÕBBB2!!ħ333ħAAħBsB2 !'B !.Łd!ææ×ÖÖRÁcBåö2!h¥RĦõõËúú!!!µµÕ!ķ3¶cBBsSSsR!Ħ!2 B& !0cc÷¥Á2tĆËµc×ćRĶõ¦çsddĆccË !'ĕ¥cµµÕÕÕ!sssÕc!!B!!!B !/ā·¥á!CÅĦö3µõBÁĖÇcæ!R2ĆttÁ !(µµ !'Õ¡òµ !&2BBB2 !0áá !&åBs3×ÁhĖæĶ¥ĦÕ!Æāā !12!!!Ħ!!!222 !5ı×ėĶ!¥ĦËB!2ĶĆá·õµª !5pB!!!ĶĶĶ !5xcµ!ÕöBĦBsĶÅå!á··á !2B!pĦ2!!!22BB !4öæSc!ĕÖ!!ĦR>ÇËªÕB !3ùĦĶĶ2!! 2&û !4sĕĕÁ¦¦s2Ėõ!ËĶĖ!·Ħª !3RĦ22! 2&ù !5ñtt!āāá2ñtBÁ22!á!Bª !2ÉRB É&©û !7āā!!!h!!BöªááB!áĦá !3ÉÉ !'Ė$ !:x2Ħ!ásá!ªÁ!!á !UĆ!Ķh!á!!Ħª !<ç !=ıĶĶā !&BĦª !;¤Ħ !=āā !'áBá !?Ė !Bá !<ç !Å¤!!Ė !_çĦĥ!ĥ !`Ħĥ !_¤!!!Ħ !_¤ĦĦĦ !_ç¤Ħ¤ !_¤ç !b¤ !c¤ !Ņ!!",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !Ņ !ĳ33 !`3ĶQ3d !^QcħQĦd !Zc!!!R!ĦĶ !1S3· !Ho!!!B!2Ķd !1Q !I2!!Ķ!!!ĶĶ !/¦Ħ !JR/!!Ķ!!2 !/¦ö !KVĹ!ĶĶ !&t !-ĖĶ !OĶ!!2 !/Ėb !LĒ !&2!2!¦t S+b !Lc¨ !'2!!2!Ħ Ė)1 !LcoR !(2!!!B2 b( !MoR !'22!22BBB ė(!!!B!B !Gºc !*222B c)#ėė!ė !I&R !(2!R2B2 R)cRB !K·!Ķ!!22!2!RR c)scB!B !MĦ!!!2B b-RRR !Jcâ !&222 !1B !I¡© !'2!Ķ !-bR2 !NĶ!2!Bµ !02 !I2!!!Ķć !3R2 !Is!!Ķb2!B¤ !1R2 !H&!ėbćBc¤ !1dÕc !JĵķRĕ¤ !3D !Lĕĕ !Ņ !6Ħ !ąĖ !Äĥĥ !cĦ !ăĦ !aĦ!Ħ !`¤!!Ħ !`Ħ !cĦ¤ !`¤¤ !d",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !Ņ !Ņ !į±±Á !Qnn!!ÑÑnnÑ !(2Rđđ !Mnn¥cÑđB¶!!ĆÑđnÁ!Û!¥ÆĦñn !HđnnĦĦBcB!Ćs¥¥cB!ĆsÁÁs!!æ2û !+ i,ü !2nnÆcÆæ!cÆBcĦ¥ĆĆæB!ĆcsĖĦcĆ!ĶāN!!!«ī!!i Ć,Öü !0nû!Ææ¥öÆ¶ĆĦccĆ¥!ĦcĆĆcĦösscĆs!ĕN!!ĬĖ«iµĕ R+Ķ !/nnûā2ÖĖ!sĖĆ¶ĆBĦÖÆc¶!ÆĆ!ææĖ¥öc!!öĕnn!R!!B× c, !,ÑnMĦĦMææ¥ÖB¥Ėcc¶scööĖöææ¥¥¥RR!sösÖsö¥#!dscÇc R,B !+»cööĖ¥RĆc¶ösöÆcBcsĦ!ĖĖssæææÆ !'¥sc·å!!cRR 2- !-»GG'ć22ĖĖ!Rst Ö&ctö!ööö!! ö&!cĦöSĕS!s!!R 2-B !0úªWĖĖĖsöÅ c&!ŅssĦs!ö!sææsöB¶C!¦R!cScB 2- !4ssBĶĶR Ć'¥BB¶!öö¥ö!öcsĦÖĥĥú!!t!SSB 2*BSS !3 7'ĖcćccĆ!çcÖĦRRR!¥Ö¶Ö¶¶ææáúā!ğğ!3 C*3 !:WWŅÆ!ÆæÅ¦Çöö!Ķ3s¶Ė¶ææ!!ª!ĿĿ!!Ŀ !,BM !:ûûÆ!Æ!Åĵ¶ÇSdĵ!ĖĖæ!ª!ªá !( Ŀ+M+ !:±!!cĆĆ¶¶ĖĖbąą!ĶBssª!ª!ª !KÛ±n¶¶¶!!RRöRÇ' 7& !QÛBsĖs '&!!ú !WÛûWû !&'' !Ņ !>DĦ !ŃĖĦ !ÆĖ !Åĥ !`ĥĖ !ÄĦĥĦ !ÄĦ !aĦ!Ħ !`¤ !cĦ¤ !a¤!",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !Ņ !Ņ !Ĳ ċ- !Uċċ! Ķ*!! ċ&ě !Oċ!ĶĦ Ķ(!! Ķ(Ħċċě !Kċ!ĦĶ !) Ķ)!!ĶĶĶěěě !IĶ !' 2- !'Ķ!!ĻĻ !Dë(!Ķ !&2! 20!!Ķ!Ħ!Ĭ !CÑåR !&222! 22 !GÌ!ć 2'!22 !3B !EÖB! 2(!! B2S33 !G 2&!BBB !. 3&!!B !G B'! 30 !(B !Gd 3&dR c5R !DĦ!!RsRRR!B 23RR !Eå¦!c B' 2/BBBRR22c !D^Ġ2!R B& 21 R&c2ā !F2! R5 2&²² !F] 28]]Ł !I] 24]]] !M]] !- ]' !R ]- !ÐĦ!Ė !aĖ !cĥ !ÄĥĦ !ÄĦ!¤ !aĦ !Ã¤Ħ !Ć¤ !ń¤ !È",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !ï¤õõ !`ĦĖĖ !aĦĶ !ÂÅ!Ķ!Å !^Ė!Ħ!Ķ !Ą22 !uÇç !`ÇĆÆ !`ĖĦ!ç !_ĦA!Ć !^ÇĦ!AĆ !^ĦQ !eĶ !K22 !3ėė !O$ħÇ t/ĶcBė2 !OcBBĦĆĆ Ė,BQ !PBsBccB2 Ħ+!ħ !QBR B&RR 2) !QC!!BRscBBB c)!B !NR!CC!BBRs¶ss c)Rs !KBB!RR!CCCddd¦c s)2 !NBBB R*tt C'tB2 !P B, s'!cB !M ô2öĦ!!c !aC !_R!!RC !bR !K__ !2B!!!B !^µ !eB !aB !M22 !3Ė!Ĥ !ïB33 !^R !bÇ!2!ĺ !_2B !a2² !aBC !4Ħ !MÇĺĺ !6DĦ !ÃĦĦĖ !aĖĥ !_ĥĖĥĦ !_Ħĥ!Ħ !^¤!!Ħ¤ !_ĦĦĦ !`¤Ħ¤ !a¤!!",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !ßd !(ĎĎCC !Wľ !'Ď!ÏRRÇ !RÇdd[ĎÇtttĎ!çkkĿ!Ç !PdÆ½½ĎZcB½½!ç¤æ!Iď !PÇ½bl2ZĎcÖ[[[þ|ĮÎöĝæC !NÖ!¾kçĎb ×' ·*CCC !L××BÞb§ 2/ÇÇ·C !IÇBBBÞbÈ B2RçC !7ľ| !1öĶµÞBØ 25÷C !&Ď¯ !/ľk !3ý!!2¤ 26ćdlĎĎ¦¥¯ !-ckþc !3®b1!å C6!2!¦B!ç |&¯ !'cþþ¦ !*Ď|¦, !&Ķ®!¾Î!ö B6!2×B2!!2åååĶ||¯!|þ!¦2· !&ÇddïöæĽCÇħħ!!¾2 !8PďRcsc!c¥¦kkĭ!!Ćl¶¦¦2R !&Ç¬íĖÞ2::ľææccħ2!¾12£ B3£B!·RRR!!!2;+ÞĶcR2Ç¶cR·s!!!¬ĦĦ!!ą®Î®ýĦ¥Ćc[¾ !6aĶß!!dd!!!d¥¶ÆķÆ·÷÷2!··cĜ!!·Ħ!|ľõĦY9YĦĦ!A!čÎďď!Ħ !0a0Ķğ c&!dd2!!!ddd!cc!d!c2$!!!|[Į*ď K&ďĖ!ħB![*:!! @0ĶBćĮĮĮ22scc!cÇÇcccs22!ss2Ĝ!!|JK**2æ c&æ2!!Bl®Î¾! 21ħħ J&!!îþþľ *( Ğ)$Õ!íĞ)k¶2æ 3&æ2!R!Z!ĖĖJğğ×įį××ććįįğßććöÕÍÍ Ķ&*čk*½jjj½½ÝÝĞĞĞ::!Ħ !'ĶsÆ 1&ÆR!¶¦2ĦĦĦ!AĆ!!Ķkk::ööĆ!!ĖkKKK Ć&ąæĆ!ĖĆöĆ¥!æ!¤ąÕAAĞ!!!Õ!!!ďc{ÆķÆ{ !'222Ķ!ą{ĶÅÅÅĆ!Õ¤¤!JĥĆ ą)æ !'2!å!Ķ!ĶdöĦĶ!B!!!RB{!ğR*Ý*RBcd!2 !)2dddc !(¯! d'!Ė!Ķ!!·2ÕĦ#æ¶Ė¶!!Åår·!!!ÅR!2!dddþþ¥B!ÝR 2&!d!!scc!!RR!c!! Ý(ĖĆĶĶc!!çDėdçÇ÷Ç!sRĖĶĞ !&¤Yì)½ÝsÅÅAAą! R(!!ĞÍÝÝÝ½!RR!!! ï(÷÷cs !'ccc2üüc!·RÅ !*åÅ¤ì !) R'c!!CCC¿ßľd·2! 2*c÷·!!cccüüüì!!ü÷R¦R !2b÷!!dddÇ!îBs{{ììßcc! î+þ2c2!üüü !)ü÷c¦ !3½dd!ccþĮsĤôìì!!ì22ì ń,!2!ì !-½÷÷ !.l||ß!Bĝss22{J*L,,ď!!!ìì !-ììì !/ĮHľ !+l|Bc¶¬!ĦKbµYj!Ķµµąąæ¯¯¯ !Jl22RRY !&Ė !'æææ!Ħ¤Å¤Ď¯, !.¯¯!¯¯!¯¯!¯¯!¯î !*¯¯¯B2!Ėæ¯¯¯î¤!æĞĎ1A!!!æå!!BB!!ď¯¯¯ |'¯¯¯ÅĦ¯ÅĦ¯ÅĦ¯ÅĦ¯ÅĦY !&lll Ħ9!ç÷ÇÇ!!dRĦĦ!!22cR¥¥!!¥¦!¥¦!¥¦!¥¦!¥[!!!ýýýBBÆĦB!ÆBB ć0DR!RRķ!!·ćć÷÷ħħ÷÷××ÇB×BB×BB×BB×BB×ç !(ÝÝY !&R!! ļ&!!! c'ą! ·&!ą ļ( ü&ììççìççìççìççìççĞk !.ÖR¥Õ,!!!ļļļü!üüüÇc s&ĶY !.ļļ!ļļ!ļļ!ļļ!ļýĖ !+Kc!BĶæ!Rąď !(ü!!!üü Ķ&ü !<Ħ!Ħ!!Ďt!tKKc!!!BĶÆæĖ!ďďlttĎ !( ü& !>ĥ!!!ÏĵĞĞ!B Ħ'Ķ!ĦöÆŅŅÅ½½Ï !IĖ!!õ3®9å Å-!!!ÏZõ !G¤Ħ!ĥ!!õĆ3! ¾,!ÏZZõ !QõZ Ć,Zõ !Nĥ !cĦ !`Ħ !dĦ !aĦ !Ä¤Ħ !Å¤¤",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !Ņ !ĕ µ2brr µ.rµµ !>¤µĶĶc2 Ķ.2Ķ!2 Ķ,2!ĶĶÑ !2ç !+¤B2Ħ!ĦR s.R!!! s,RĶĶĶ !<µB!ÇĶĶ! t/ÇĶ!! t,Ć!Ħ!úá !0çBç !(µĶĖöQ2!Ķr b/!ĶĶr b+Ė2!Ķ !4B !(ĦĶĦ!!ĶĶ!B!! Ķ*!!B!!!B! Ķ)!!Ķ!!!R !/çBB!õ !&r!Ķ!RR!!Ķc¶¶ Æ*¶¶s!!!c¶ Æ)¶¶¶!ĶĶ !2CB !(ĶĶRçç!!! t0!!! t+æĆĖ !4B!!!Õ!!!Ķ!Rç !GB !7µ!Bs !82 !/22 !0BC!C!!ÕÕĆ!Ķærrr!22 µ0!!2¤ r*!ĦĖ !5R!!!ĦĦRR 2&R!!!2! Ķ-2!2!B 2,B222 !5BccB! s&R!!!Rc s-R2!¡R s,c !5B!!!ttR!ö!ttt2!2 t0!2! t+æĆĖ2!!t !7t!!Ć !&2 !A22 !5t !&ĶĶµ !5B!C !/BB !:¥2ĶµµB!Bõ Å/!!!õ µ*B!Ķ !7t !&×ĆcB22!2!! R/!B!! c-2 !=ĦRRR!!¢ _0o!! _.!NN !:×Ħ_!t!2! 70!o! 7,©º²Bc !;×Ċ_ı!2! õ/đcdéõ Õ+cBBBtĊ !;tĊĊsB! _/B!!__ ¡,N !6ĥ !+tt¢¢! C1! C.¦CCĊ !2Ħ !. ĺD !3ĖĦ !aĥ !`Ħ!!Ħ !`ĥĦ !aĦĦ !aĦ!¤ !_¤ !c¤¤ !Ņ !Ņ !Ņ !g",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !Ņ !þ¦d¦ !6 µ2brr µ-CrµµR !&¦döĆö !4¤µĶĶc2 Ķ.2Ę!2 Ķ+ĘĦøØØķ!!!döĆĶ2R !)ç !+¤B2Ħ!ĦR s.Ę!!! s+Ć!RRR2###ĆĶ2c¥ą !2µB!ÇĶĶ! t/!s!! t+!B s&Æ¶¶!2RąÕ !)çBç !(µĶĖöQ2!Ķr b.@ĄĶĶr b*a@ĔôĄĄ<ÕÕ¶¥R !-B !(ĦĶĦ!!ĶĶ!B!! Ķ*!!B!!!B! Ķ)!!Ķ!!!R!!Õ !,çBB!õ !&r!Ķ!RR!!Ķc¶¶ Æ*¶¶s!!!c¶ Æ)¶¶¶!ĶĶ !&ÕÕ !,CB !(ĶĶRçç!!! t*¸××¸¸v!!!tèèĨ t'¸ĘĖ !4B!!!Õ!!!Ķ!Rç !.t!ħħsæA!!!t!cµ !'B !'B !7µ!Bs !0c!!×dR!!2!Ö!× !'B!!!22 !0BC!C!!ÕÕĆ!Ķærrr!22 µ)@0qq³³@!!20´ĄĄ r'ĴĔĖ !5R!!!ĦĦRR 2&R!!!2! Ķ-2!2!B 2,B222 !5BccB! s&R!!!Rc s-R2!¡R s,Ø !(d3d¦ !+B!!!ttR!ö!ttt2!2 t-4ĘĘ!2!ĘÈĘÈøĨt¸è¸u!Ĉøø8##ĆĶĆæ##¦ !.t!!Ć !&2 !.bÅc!!!2R2RRµC¥RB!! c)B !&Ć !+t !&ĶĶµ !3dbB!CRBRRµtÆB!cc!RaaŁąąsR B&c !0¥2ĶµµB!Bõ Å,SĶS!!!ĴĴôĤµ@ĔĔĴĴP¶Ĥ !'µõ ĥ&å !*t !&×ĆcB22!2!! R,!RR!B!! c,a2 !=ĦRRR!!¢ _,ø¥RRo!! _.!NN !:×Ħ_!t!2! 7,åĖ!!!o! 7(y¼Üü©º²Bc !;×Ċ_ı!2! õ-q@]cdéõ Õ'qP0ĴcBBB!Ċ !;tĊĊsB! _/B!!__ ¡,N!!t !3ĥ !+tt¢¢! C1! C.¦CCĺ !2Ħ !. ĺDĖ !2ĖĦ !aĥ !`Ħ!!Ħ !`ĥĦ !aĦĦ !aĦ!¤ !_¤ !c¤¤ !Ņ !Ņ !Ņ !g",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !ý ħ- !QÇSSS·ħĦ! C+ !PÇöBBB2ĦBC R+ !Pö!2BB!BCR Ĕ*µ !OÇ !2ç !PĆ !1ç!B !NÇ !,TT!!!ç!B !OĦ !,ńń!!ç!BB !OB !,ĖĖ!ç!BBC !N¦ !/ç!BBC !N· !1BBCR !NĦ !0BBCR !OĶ !1CR !PĶ !3B !_B!B !Ņ !Ņ !öB !bB !bÕ2 !1Ħ !Q2 !/Ħ!!Ħ !PÅ !cĦ !/ĥĖ !bĥĖ !QB !/Ħ!!Ė !PÅ2 !+TT!!!ĥ !RR !+ńńĦ!Ħ!ĥ !QÅB !*ĖĖ!Ħ!Ħ!ĥ !QR !bÅB !+¤!Ħ!Ħ !SRB!2 !&TTT××··t· !QÅ!2!BC! Ė, !RÅÅÅ¤ń! R, !Wń Ĕ(µµÕÕ !_¤!Ħ !cĦ !`¤ !c¤ !Æ¤ !Ņ !d",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !Ņ !Nććć đ*Ç×çć !PñđđĦĖĆB Ė)<ĦĦĦıđđ !KñđBĖĖĦĶ!Ĝ R*!!ĶĜ!Ėđ×× !FÇÇ!ĖĖRRĶ!!Ħ ö*!!ĶĦ2RĖ,ĦÇ !DÇĶ!ĜB!ööBĶ!ĶB Ķ)2Ķ!!!Ć!RĶ!Ç !C2sĶ!ĶĦĶĶĠ!!Ķ !*İĶĶ!!ĦĦĖ2!2 !B×RdĶĶ!ĶRccĶĶ!· R(cc22Ķ!cs!LĶĶć !Cs!!BcĶĆĆ2B2å Ė(ĆĆ22!!ĆĆRR !G222ĆĦ222!! 2+ !&B!ĆĦ!2 !H22 !'2 !-B !K22 !&2!!!2 !.BBB!2 !EĦ!!2BccR!22tcc s&¥¥!22tcccR!2B !GB2!Ė2!!ąĖĖ Ć&öö2!!õĆĦĶ2 !H2!ĖĆĖ !' 2* !&2ĶĦĦ2 !L2 !& 2*!!!3 !HĶ!!2! 2'!BB2 !+BB !'2B !H 2& !& 2* !(2!!!C !BĦ!!B! 2'!!! 2+!!! 2& !FĖ!!3RRB2 !& 2* !&2RSSB !F2!!22SS!!!· S*!!!¥S3!ĵ!B !Dĥ!B!ĦĦĕĕ!!!æ ĕ*!!!æĕĕĕĦ!!R !AĶ !&B2 !&BBB !+BB !&2B !DĶ !'2!!B !-B!!! 2&!C !EBC!S222 !& 2* !&22CS !FĦ!!!ĕ3SS !& 2*!!!RSSBĦC !CÕĦĖB!!2ĥĕċ!C!Ķ C* !&ĦĦĦB!RĖ !B2RC!!S22!d!C Ķ*ċBC~Ė!!B!R !DÅĖ!LĦ!SS !/C!!BBBĦ!B !Eµń!BĦĦĦ !& B* !&ĦĦĦBĜ !HĚĚBBěC!!, Ħ)û!!!ĦBBB» !KĚĚAńLL B*!CP]ĶĦĚĚ !P Ě,AńĖĊĺĺ !Ņ !ċĦ !cĖĥ !_ĥĖ !bĥĥ !`Ħ!!Ħ !^¤ĦĦĦ !cĦ !_¤ĦĦ¤ !`¤¤!",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ndd¦Ç!CCC!tt×!33d¦Ç !Od2ĖöĆ×!A!tĵĖĆ×!ĶŅöĦÇ !NĖ!ĶĶĖö¶3¶cÇAĖ!Rbć2ĆĦÇ !L3!!B!ĶĦĖcõõ¥t!ĆÆC 2' !MQBsBb!!Ķ!ė!Ć!ĖĖÆsRcB2ħ !LħĶBs#B2!!2!!¶ĆĶæccRç× !NRshR¥s!ė !&¤ąĶĦĦĦrõ !MRRC!öåÅ!cRRcR!ė!¥ÖąÖĦ !L¶¶ds!!!3!cc¶R!ėc!!QėBĆ !Lææąö¶!ħ!!ĆõÅ !&Ħ!ħBBĦĦ !JtĦ!B!õs2!!ĵħ3Ėdc!!!B !&ç !IĖ !'gRc2ħ!!!ąB!B!B !QCú!BĆõ!R !&BcssR!!2 !LB!!!B !&2!!ĶdRĖ¥B· !PB!!dB!ķ!R !&ĆĦ!!!B !W2 !&cc¥B!BBBd !Jĥ¥cs!sd!!!Ħc!2!ÖĖæą!BB· !KtÆĆö!r!R!R!cc2!!ĖRĘąs·!ą !JĖB!!!B!!B!!ĆĶ¦ !'ĖÆµą !Pd!2RĆ!öÖąą !&ĖöĆÖĦ !Jĥ¥cs!s!Ćąæ!2Ķæ !(B22 !LæĆö!µ!ĶćR!!sBB !(2 !LCĦ!!!Ħ !'B !)2!2 !Oĥ !&B!22B!!!RR!2!!2c !LĦ !.¶Rc!Ķ2!2 !Qą !(2!ĦÇdąĶ2!ĶĆ !MĦ !(2B!!tĆbb!B!!Ķ !LB!Ħ!BĦcRR!!2!!Ħ2!!!2!Bc !LĶ !&RR¥¦2!2!2!R!!222C !JR !'ĦÖæöĥ !&Ķ2!!BRR·P !NodâQR!!2BB!!2!·¦öĆÅĘ !Jõ¥¶¦ss!!R!!RB!!2!2!!2!B !LæĆåöR!ė2sĦdd·!!2!!!BBB !MĖĦå!!cĶ!æbbb!c22!RBB !RRR¥ĦĦRR2!222!!××· !MĖ!BoĖæö·R!2B!BBB!µrrÕ !Lĥ!ĖĆåĖc!!BB2c!BBd!!BBB !M2!ĖĶcRR!22RtĖttRBcccC !MR!Ć!Ķ2B!××·ĖĥõÕÕ!CCCR !Må!B!÷¦rõõÕõĥĦĦ!·!sRą !OcR!Õĥ×ĦĦd!t··dńÕÕõdB !NµRssABBdRA!!ĖRĖttCsĤ !OµAA!AAńĔ!ĔĔńĔ!µÕ!ĤD !aD !ÅĦĦ !ăĥĖĖ !Á¤ĦĦĥĥĥ !`Ħ!Ħ !^¤ Ħ& !_¤¤Ħ!¤ !`¤¤!",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ndd¦Ç!CCC!tt×!33d¦Ç !Od2ĖöĆ×!A!tĵĖĆ×!ĶŅöĦÇ !NĖ!ĶĶĖö¶3¶cÇAĖ!Rbć2ĆĦÇ !L3!!B!ĶĦĖcõõ¥t!ĆÆC 2' !MQBsBb!!Ķ!ė!Ć!ĖĖÆsRcB2ħ !LħĶBs#B2!!2!!¶ĆĶæccRç× !NRssR¥s!ė !&¤ąĶĦĦĦrõ !MRRC·öåÅ!cRRcR!ėĶ¥ÖąÖĦ !L¶¶ds!!!3!cc¶R!ėBĶ!QėBĆ !LææąĦ!Rħ!!ĆõÅ !&Ķ!ħBBĦĦ !JtĦĶĦ!!!2!!ĵħ3ĖdB!!!B !&ç !IĖ !'2Rc2ħ!!!ą!!Ķ!B !QB!!2Ćõ!R !&B!!ĦR!!2 !LB2B !(2!!ĶdBBB!· !PBCB!2!ķ!R !&2BB!!B !QĤĖ2!!!2 !&c2sB!BBBd !Jĥ¥cs!P !&Ħc!2!æĶĖr!BB· !KtÆĆöĘ!2R!R!cc2!ĶöĦĘąs·!ą !JĖB!!!$c!B!!ĆĶ¦!!!Ħ!ĖÆµą !Oĥ!!2RĆ!öÖąą !&ĖöĆÖB !Jĥ¥cs·B!Ćąæ!2Ķæ !(B22 !LæĆöĤö!ĶćR!!sBB !(2 !LCĦ !&Ć !&B !)2!2 !Oĥ$!!!B!22B!!!RR!2!!2 !MĦ!Ė!Ķ !*¶Rc!Ķ2 !Qą !*2!ĦÇdąĶ2 !PĦ!!Ķ!!!2B!!tĆbb!B!!Ķ !LB!Ħ!!!cRR!!2!!Ħ2!!!2!B !MĶ !&RR¥¦2!2!2!R!!222C !JR !'ĦÖæöĥ !&Ķ2!!BRR·P !NdP!QR!!2BB!!2!·ĶöĆÅĘ !Jõ¥¶¦s!Ķ!R!!RB!!2!2!!2!B !LæĆåö×!ė2sĦdd·!!2!!!BBB !MĖĦå!!cĶ!æbbb!c22!RBB !RRR¥ĦĦRR2!222!·××· !MĖ!BdĖæö·R!2B!BBB!µrrÕ !Lĥ!ĖĆåĖc!!BB2c!BBd!!BBB !M2!ĖĶcRR!22RtĖttRBcccC !MR!Ć!Ķ2B!××·ĖĥõÕÕ!CCCR !Må!B!÷¦rõõÕõĥĦĦ!·!sRą !OcR!Õĥ×ĦĦd!t··dńÕÕõdB !NµRssABBdRA!!ĖRĖttCsĤ !OµAA!AAńĔ!ĔĔńĔ!µÕ!ĤD !aD !ÅĦĦ !ăĥĖĖ !Á¤ĦĦĥĥĥ !`Ħ!Ħ !^¤ Ħ& !_¤¤Ħ!¤ !`¤¤!",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !Ņ !Ņ !Ņ !&/ !a/ĵ !aĵöO !F Ĩ0 !-öĦ !AĨĨøØCCöĆ Ķ+dħħR !+/Ħ !=ØCCØøĖöåÅAAÅÕ¤ĆĆĖĖĶĶĶtÆĆĆv !+å!¶ !)?? !, Ĩ&øøØå!AÅ¤¤ÅĵQ!!Q1ĦÅÅÕĕąAçæĆĦ!!é !*Ħ¶!2 !&??ÕÕ???=== ø&ĖĶĶĶB!ÕĖA!Q!!!ħķ##CCcccBĦĖ¶Ä!ĎĎîîÎ M)Ò !)ÒµÕ!!2ĥĥ¶¶# t' S&×Ķ23C¦ÖÖÖ$ĸ$$ĨĨ ĸ&ÖsÖĨĎ ¥.¶Ç!3 !&ºćç··Btt××!O c(¶¶RBB÷4ĘĘĘĨ¥¥ c*èĨèl Ç/tcC2 !'ùùRRùùùĪĪĪĖ ¥'ÆsRRss! R& B/cÝÝÝ ½*ĺĺĺù22!2 !(ùù !) ¢'³³BBÇÇ! B3Ħ!!! B'ÃÃÃ !'B2 !7ĖĖ``ńńć !/ Ħ& !)¢¢ !*BB != `* !'³ ¢- !+Ķ!B2 !D `'Ė !6ùĶ!2 !Ã2Ķº !`º2 !bċ !ąĖ !ÄĦ!Ħ !Ąĥ !ąĦ !ÆĦ !`Ħ !ĆĦ !a¤!¤ !Ä¤ !d",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !Ņ !®ç !8ç !IÇ!ć !' ħ- !&Ç!ć !IĶ!!!ħħħ ö-ħħħ!!Ķ !IĶĶ!TħööæĶ Ħ,æööħĶĶ!!!ħ !EĶ!!ĖöĶĦĶB R(ss×!ĶĶĶöĶ!!TħĆ !FĶ!ĥĦĶ!!! Ķ(ĖĖRR!Ķ!Ķ!Ķ!BĆB !L2!!åć ç&!!cs2 !(B· !(¦¦¦··Ç !>222!!é3ķĆÖb!!ĆBB2 !&Ĥ·ń !'¦ĶĶĶĦĶĦÇ !<22B2!!ĖaqÅõ!!!¦CB2B!!!Ėń !'¦Ķ22Bs¥cB$ ç&$ ç&$ ç&$ ç&$ç!2!!B2 !&ĴĶ B&!BR!!B!!2 !)¦Ķ222BBĖĶĶĥ Ķ&ĥ Ķ&ĥ Ķ&ĥ Ķ&ĥĶ!2!C!!BĦB!åć ç&!!ńą!!B!2 !-2!öĦĦĦĆ Ħ&Ć Ħ&Ć Ħ&Ć Ħ&ĆĦ2ĶB!!BĆ¥!!é3Ć¶ġM!!Ę !&2ĶB !*22!R B<22!!B!!æ!!ĖaÅĕs!2 !(22 !)2!!!2B 2&d 2&d 2&d 2&d 2&d2 !)Ç!2ń!RRgg !3 2&C B&R B&R B&R B&R B&RBB!!RBB!ą!!Õ÷ ×& !'BBB !*2!2R!Rd B; !(c·!!é3Ć¶ġMB!!BB !.BR!BĖsCCCĤ C&Ĥ C&Ĥ C&Ĥ C&ĤC!2 !&dÕ!!Ė£õĵÊV!!R !'2 !)ÅcĆ!BĥöPss! s&! s&! s&! s&!s!!CBCCĥd!!@!BRRRB!õC !&BC !)bcĖĆĦĥĘö!Ė ô&Ė ô&Ė ô&Ė ô&Ėô !(C!!Bµ× ·&!!rR!CCB !,bRBdCssô !Bé3ķĆ¶M!!$!C!!!B!T$ !)bbńńôô !9B!R!RR!!!BĖ£äõŅgC!ń!!RRB!RBµ$ !FB!ĤB!RR!!aBB¦¦¦!!D!R!BCC!!cµ !EB !&BBB× ·& s&!!BBB!!!B!·c !IĤ!!! Ĥ, !&ĤRR!ôĤ· !ECB!ĖĖĤĤĤ !, Ĥ&ĖB !JRC!!!ĖĖĖ !-ĖĖĖ!!B !IĔRĔ !' Ė- !&ô!ô!DĦ !FĔ !8ô !eĦĖ !aĖ !cĥ !Äĥ !cĦ !aĦ !cĦ !aĦ !Å¤¤ !Ņ !ć",
);
rawImages.push(
  "#c Ņc !Ņ !°n±ġ !aB !1nn±ġ !`cB !QÑÑ ±. !Tsss B- !'ġ !K2!!SSR ¥- !&. !)dd !Fĺĺ 7.2 !&2 !&d3ĖĖÇ33 ñ@!!!ıı ñ. !'2!!!dŅQQ!ccB Ħ@!!!CĖ Ħ.!!B !(ąS33c!¶Ö ¥@!!!c×Ç ¥- !'3 !&ÕõRRbbb 7@!!!úúĺ 7- !&ÛH !(ÅÅ !Ädd !C2 !22 !+d3ĖĖÇ33 ñ@!2!ıı ñ.!!!B !'dŅQQ!ccB Ħ@!!!CĖ Ħ. !+ąS33c!¶Ö ¥@!!!c×Ç ¥- !,ÕõRRbbb 7@!!!úúĺ 7- !.ÅÅ !T2 !ndd !_d3ĖĖÇ33 ñ@!!!ııđ ñ- !+dŅQQ!ccB Ħ@2!!CĖĆ Ħ- !+ąS33c!¶Ö ¥@!!!c×Ç ¥-!B !*ÕõRRbbb 7@!!!úúĺ 7- !.ÅÅ !§2 !=dd !_d3ĖĖÇ33 ñ@!!!ııđđ ñ, !+dŅQQ!ccB Ħ@!!!CĖĆĆ Ħ, !+ąS33c!¶Ö ¥@!!!c×Ç ¥- !,ÕõRRbbb 7@!!!úúĺ 7- !.ÅÅ !V2 !ldd !EB !:d3ĖĖÇ33 ñ@!!!ııđđ ñ, !+dŅQQ!ccB Ħ@!!!CĖĆĆ Ħ, !+ąS33c!¶Ö ¥@!!!c×Ç ¥- !,ÕõRRbbb 7@!!!úúĺ 7- !.ÅÅ !Ädd !_d3ĖĖÇ33 ñ@!!!ııđđđ ñ+!!!3 !'dŅQQ!ccB Ħ@!!!CĖĆĆĆ Ħ+!2!!± !&ąS33c!¶Ö ¥@!!!c×Ç ¥- !&Rď !&ÕõRRbbb 7@!!!úúĺ 7- !.ÅÅ !Fġġġāāā Ñ* !'Ħ !PĦ!!! R* !RB!SS c. !&ªB !Nĺĺ '. !'Y !]R2c !O2 !1xW'ĺ !MËG' !5õ !ÅĦ !Ä¤Ħ !b¤",
);
// }
var blockingIndexMax = rawImages.length - wallCount;
// Decorations (Non-Blocking) {
rawImages.push(
  "#c Ņc !Ņ !Ņ !ÅÜ !a(ĖĬ !aæ !cBÌ !_R!!Ħ !_2R!æ !`2 !`H2!R !`222 !_B!2 !c2 !b2 !Ć2 !b2 !b2 !Å2 !Å2 !Å2 !bB !bĦ !bB !Ài !Ņ !'B !ą2 !ÁB !Ņ!ĆĦĦ !_ĆBĦĦ !`RRÖm !_sðm !_B !bR !aĀs] !a] !Ņ !Ë",
);
rawImages.push(
  "#c Ņc !`ÇÇ !`Ç!Ķ !cÇ !`Ķ !ÆĶĶ !^ÇĶ !ÆĶ !cĶ !Ņ !ÄĶĶ!Ķ !Í?? !`?ĶĶ? !^?ĶÕUå?O? !Zĩ2·ē¦!ĦĶĢ !Zĩ22BĶĵÕĆâ !X??BĕõRS×!© !W?ĶĶĦtt¤ęĕ¥ !W?ĶÕUåĦ!×?öÖòÒ !UĶ2·ē¦B!Ħ2Ççwº !UĹĩ224!!RĦĕęcĂ !R` !&ĩ40ĦĖĦÕæâ¡ĆĂ !QĖ!!Â//ėĸBRĶ···!cg !RłÂÆõõ/0BĦcRBB©gÒĂ !PBSÆöĦĆõÅĖõåĶąąââ!ĖĂ !OeeU·BctÇR×¦2dd©©!Rg !OĦ×ė2ttĹĸĦĆåõĦĦâĂºg !PĴ!!ęĹ2?ėĸąSöÕÕ!ĆĂ !Qĉ!!!ĲĶĶ?0Çc·¥©!cg !T?CÕµåĦĦµBSO©g !Uĩ2·×¦B!tĦµõòÒ !Vĩ22B%%BĹ¥Bwº !WĩĩĦŃŃĖOSæ !Z?ĶĖĦĵĕµ!â !X?ĶÕUåC3·c© !Xĩ2·ē¦222F !Zĩ22ĩęĩĩ !]ĩĩ !ù22!2 !ń2 !Ą2 !ăÅ2!22 !ă2 !aÅ!2 !aÅ!Å !aÅ!",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !ŁCCC !_CĦĦ2 !_c2!R !_ö2 !`¦!B !`ĦĶ !aĆRB !^d322å !&¦ !a3Ħ¦ !WąĵRB !&ĵĖ !Ząå !&3!Ħ !U333ddÇ !&ĵĵĖ !Uĵ!!ĖĖ!#R2ç!#Ķ !Vĵ!!!Æ !'Ņ !Xĵ!B¥2Ħ!B !]ĖĖR¥Ħ !]ĵÖĖĖĖ!!ç ![Ėc!ĖĶBBÇ !Y3öĆQBBöBĶ ![RdscçtĶ !Y¥!BąąæQrĖ !YĖ!öķd¥ė÷!b !Xą!!BÖæQrĦ !ZB!Ės¥Æ÷!# !YB!Ķ2Æ¥b¶ !Z2!!æAĦĦ ![åR!RSs¶cB !ZBccĕĕÖdc !Z2ĵą#ĈĖµ¦ !Zå!Çć!ħ× !^Ć!¤ !_ħąaĆ¤¤ !]B!!!Ć !cBą ![ą#ė!RBb !Y·CdĆĵĥõ¤ !Zö!Ćc !bB !_ss!å !_ÕÖ¥ !aŅå !Ņ !Ņ !Ď",
);
rawImages.push(
  "#c Ņc !`ÇÇ !ÃÇ!ĶÇ !`Ķ !dĶ !ÁÇĶ!Ķ !ÄĶ !ÆĶ !Ņ !Ņ !ĐxW !`xöĦ !_xÕåÅ7 !]xöĦĦæõ !]ĖĕĦö!Ħ ![xĶĆĦĦ!Ħ ![Ķĕ!!ĶĦö ![ĶĦ!!ÎĶ !YçÇ» !&úÎ !Y¤ĶĦ!B2BÒ !Zç2B2SB!Ė !Z¤ÅÑ!!RBĶ¾ !]22CB¾2 !]222C2Bs ![áB2BB!B !]2B2s!B !]á2BB¥t !^á2·Çı !_ácB !añđ !Ņ !Ņ !Ņ !Z2 !Ä2 !`Å2 !d2 !a2!2 !_Å !d2Å !ÃÅÅ!",
);
rawImages.push(
  "#c Ņc !hM^~Ñ !_2cBs !_B !ÂCd !_×·ĥą· !-CCC !OsR··R !,CRRRd !NA¤RR¤ !'ł?!!CR2BBcÇ !O¤¤ !'pV7TTæ!2!!!2 !VùĖ-ĔĔĖ !'2 !Xĉ!!µs222B¤ !]¤BBB¤ !_¤¤¤ !b 3&CC ![32BBB2BS !Y322 B&22¦ !Y2B !'BB !S ç'ÖB !Yp/â ¦'2 !)B !QùĹ7 s' !)2B !S ô'µB2 !&2 ![ 2(!B !YbR B'RRb !YbR c&Rb ![ b( !Ābb¤ !Wł? !'¤!BBÅ !UpVe ¤'BccBR !UùĖĤ ç'ÇÇ2o_ !Wĉ !)t77 !Ņ !^CSS t&· !YC2!R!2RsRħ !·łO!T$ !]p(ě$Ė !^ùń^ńńą !_ĉ!!bĥĕĕåõåÅ¤¤A !Ł3CStt¦¦· !Y322BB!2BBÇ !WC !*22Ç !a2¥ !N?ł`!!!çć¥ !Xpī(ċ$$$¦d!!csss¶RBBB !Nùń s)!ĖÆ÷×··××dB !GCS !)ôŁ ô'¥!t !(R !F×·ĥĕ· !)ù !'A !,A !DsR··R !0AĔ Õ(ĔA !EA¤RR¤ !2 b( !I¤¤ !ÊB !_R¥ÆC !_»G'Ī !Y",
);
rawImages.push(
  "#c Ņc !ÿCC !bR !aĥ !ft !^tĖ!tõ !^ĖR!Ė!t !]Ķ!!!Cõ ![3cÖ·!ĥ !Zt!!!ö!R !^ĵ!Ć!c3t !Yõ!!õ!!ÆĖ !Ytt!!!Ėæc¶ ![t!3RcÖÖÖ !Xõ!Ć3cR¶AAA !VCC¦Ćcc¶cö!cc !WĆRc2ĵÅsĶ!ħħ !VcÆĖĆcd!B!!BB !Vå!öQĖÇ!sBćsĶ !Wå!!æQė!ÇdR2 !Vdd!!BB¶cąÕæB !UdĖĶB!ĦĦöĆ!·¥ !UdĖ!!RķQĦB!!ą¶ĶS !UBscBćĶĖ!!¥ĦBĦ !TRR!!scæÆc!!!¶ !YBĆ¥Æ!d!Æ¥R !Są!ĶBB!b2RĖABĖs¥ !TąĶ¶ĖĖSc!!¶c¥çĶ !UĖ!æÆĆB!!·c!!µ !T3c!ĦBc!c·Qæ!!× !TĵB!cc¶öæQĦöĖbö !UæBB¶cA1sķ!Ö!Ķ !U¥!Bt!!ė!åQĶĆĦ !Vcs!!ė!Ė¦S !XÕ!Öb!!!RąĆ !YÕ!Ħ !&dĦ2cR !WĦĦR2Bö1!¶!B !VCĶĶĦ3#¥BsR×ç !UCR2cR¤õs#ėdÕ !UC!ĖsBBç!¶µõÕĦ !UR!R!!¥µ¶ĖöĆĖĦą !TĖ!Ė!!æBRĶĖöĆĖö !Tĥ!RöĶ!!c!!!Ķ !Wĥ !'¥R2R2ss !WB!!¥22ėÇcĶ !Wõ!2æ2B¶Å!¥¥Ė !WÕæ2RcĆ!Å !X3332ĕĦĖĦÖĦĖ!µ !WBĕ !&cĶĖĆć !Uĵ!!¦!ąĦ!cĆĶ !XĵRå!t2RĆ2 !Zå!tĖ !&2 ![ĖRcĆ !`c !bÖ!ccc!!b !Z¶Ć!ÖĦå !]ĆĖÖ!Ķ !]R2cc!!!Å !ZõĶĶå2 !_õõ!2c !_ttR !`õõÕÕ!!!",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !Ņ !Ņ !]^^Á !]~^^ĆcB ![~æ¥ĖB !^cS×sĶĆæ==± !Wá¥!!!ĵąĖĶĶö^^ !XĶ!!ScccRĦĦ^ !Y3ĦõĖĦĦR2Ė~ !UĶ!!s!3ĶĦĦõĕĵ !Yö !'333 !Z222RssR2B !X2!!!ĦĆĆĦ !YR !& 2' !XR c&RRR22 !Yæ Æ&RÆs22 ![ĦöĆ¶ĖBB !UĶ!!ÆææÖĖ222cz !Uĵ!ĖĖĖĦ222Rczĥ !Sªæ!ĥĖ2B2RBc»xĥ !UĆ!æ!Rcc»»x!!Ħ !Uë¥Ķs¶BB !(Ħ !Uë»xö2B !'Ħ !YxG7 !iĦ !a¤ !c¤ !Ņ !Ņ !Ņ !Ņ !Ë",
);
rawImages.push(
  "#c Ņc !Ŀt!·d· !ÁĖ!Ė!2 !^Ħ!çĨ$ ![t!b !bķ !`Ć!B!å!ń ![B!õ!ÅģÅ!d !YB!!c!!!3 !Zõ!C !a#!!c!!!B !]3!!#Rå ![ĦĖ3!!ą !Yt!!BBĵtŅ !]BAŅ!!· !ZĆCRħ!ħĵ ![B!ĖRħA3 ![B!2Ė23BÕ !Zõ!!Ħ!ö!3 !]ĦĿ!Ræ!C !ZĥcdĖĦ!Ķ ![3Ćļ¥BRcc ![QĖöĦ!ąĦ !Z2!2cBĖCą !YC!ėcöBc !]ĦĶöRĦĵA !Zĥ!!!B!ė!t !]22Ķcė ![sBcĆ2ïBĆ !ZĦĶĦ2Ķ3B !]cBĦR8Ħĵ !ZŀïĆB!Ħ !]ě9BBĖ!Ė !^BĦ!Rb !^ĖBBBė !_Ķ!!c !^BĖŅĶĶS !ZCcĆcė!!!¦ !ZĆ¥ĶB!Ķ ![ĥ!ĦĆĦ!Ħ !^Ė2R!BRå !ZcR!Ė!2å ![õ!RQ !_CĆ!!!Ė ![3!cŅė !_ĥĦ3!ąĵ ![ĵcĥ!ĵ# !]t !at!đ#õ!Ŀ# ![ĵR!#3C ![ĵėċŅ!!īŅ !Z3Q!!Ņĵ!c !Zõ!!!3 !_3 !&cĆ ![õ !d#ĵ!Ć !ÂŅ !Ì",
);
rawImages.push(
  "#c Ņc !ÁS !bĕ!S !ÃC!B !aS !aĦ!õ !^S !bĕ!bĶd !aĦ2 !^#!ćb !_,!Bć !_2!ĥB2 ![C!ī!!R !]Ħ !&õå !ZC!d!S !_B!!ĦS !^22!!Ķ !^B !'c !Zĥ!2!22!ġ ![2!!Ķ!!B !]å!2!!ċt !Zåt!2ĕ!!Ć ![Ħtĕ!!!Ķ !ZSBõ!# !_õt !&2 !ZBtõ!!C!c ![õcC!!!õ !ZõcĆ !aćS2!!!3 !Zt!ĶĦ !_õŅĦĶb !`ŅR!Ķ!ĵ !^ĕķB^3 ![3!!ĕ,ċĵ !^¦!ċC !]ĵ!Ħ!!!t !]¦Ć¦ !`ĥ!!C !^dć!Ħĥ!2 ![Ņ!!ĦCĥ ![cė!!!ĥ!å !ZĆ !cR2!!!c !]ą !&Ć !^R2B!3 !^B!B!ĵ !^åR!!3 !_Bå!} !bB ![c!!åt!» !]3d!õS3 !^Ķ!SĦĵ ![ć!!!ĦĵS !^2!cSĦ !aĕQ !`õ!!· !Z2!!!t!ć !]Bą!õcc !Z#B !&#RÕ !Yc2ĕ!d!ąÕ !Ząą !eą !'",
);
rawImages.push(
  "#c Ņc !Ņ !]t!·d· !^Ė!Ė!2 !^Ħ!çĨ$ !^b !`t!ķ !`Ć!B!å!ń ![B!õ!ÅģÅ ![B !)d !Yõ!!c!!!3 !]C !'B !Z#!3c!!Rå !ZŅĦĖ3!#ą ![#BBõ!Ņ !Zt!BAŅct ![Ć!Rħ!ħĵ· !ZBCĖRħA3 ![Bĥ2Ė23BÕ !ZõC!Ħ!ö !_ĦĿ!RÕ3 ![ĥcdĖĦ3ĶC ![Ćļ¥Bĵcc !Z3QĖöĦdąĦ !Zĵ!2cBĖ!ą !ZCėcöBcC !ZCĦĶöRĦĵA !Zĥ!!!B!ė !_22Ķcėt !ZsBcĆ2ïBõ !ZõĶĦ2Ķ3B3 !ZScBĦĥ8õĵ !ZŀïĆBtĥS ![ě(BBĖ#Ė !]3BĦ!Rb !]ĵõBBBė !]3CĶ!!c !^BĖŅĶĶ !]cĆcė!!S !ZCõ¥ĶB!Ķ!¦ !Yĥ3ĦĆĦ!Ħ !^Ė2R!BRå !ZcR!Ė!ĕå ![õ!RQ!d !^Ć!!ąĖ !]CcŅėd !]3ĥĦ3!ąĵ ![ĵ!ĥ!ĵ !_c!!!# !]tđ!õ!Ŀ ![tĵR#!!C# !ZĵėċŅ#3īŅ !Z3ĵ!!Ņĵ !]õc !'c ![3!!3!!Ć ![õ !&c !`ĵ!Ć !_# !bŅ !Ì",
);
rawImages.push(
  "#c Ņc !_Ç !bĆS !aĖ !bcĦS !]¦!!õQB !]ö!!#ė !^Q!!Ņc2 ![#!S!!!2 ![ŅćR!!RÕ ![#Råd!ÅC ![ŅR!ą!!ĥ !Zd!å!!c !]ą!!±!!C!C ![d !'ĥ !ZdĦÛS!!!t !ZĦBÇ1ħR!õ ![2æħBB !]ĥĶcRLĦ ![dC!!2!õ3 !ZĦR2Ė!Č!2 !ZĥĶĖĶĖB!2 !ZdŅRR2Ħ!2 !ZŅ!ĆRB]!ą ![ćB !`ķ¶!ööČtd !YÇB!Ħ!s!İą !YÅRĦ!ĖĖÿ ![ÇĖRB2ÿt¶ !ZÅİ¿ĦBt¶Rd !Zi)Rÿ!Rì!Ç !YĆ!Bt¶ÌĆc !YÇĖ!Ħ!!ĶĦĆ !YÖR2B¶RöĦcĆ !X¶ĖsĦ«ÌcBĆ !XcÅ¶ĖĖ!ĖĶBc !X3!!Ħ!BĦRc!ą !YÅRLĦBöĆ !Yõ!ÇcĖs2Q !_iæĆėĶĖ !ZĆĦösB !_Ķ2öccĶB !ZĖĆQbBRR2C !Y¶ !&ĦR!ĥ !]ėĦBĦæ !ZĆĵėc!ĦBm !Zą!cõĥBæ!C ![õ¦!!BÛĥ !Yc!!Ė!!L !_Ėġİüd ![¦!!ļĜ !]ė!¦R2ĦBĦ !ZBĖ!1!BĦ ![ĕRå!Rą!R !^32dcR ![å!õ!ąĶÅ !_å!2 !a¦åS !_C!!B !^CĦĦ!B !^Ħ!2!Õ !^sŅ2 !`õ !då!!!",
);
rawImages.push(
  "#c Ņc !Ôďď¯ !_ďÖÆĖ| !]ďÖĶĶ!ö| !ZďÖĶĶ!ĖYĭ| !XďÖĶĶ!ĖY!!ö¯ !VďÖĶĶ!ĖY!!ďR !VďÖĶĶ!ĖY!!ďR!Ķ¯ !SďÖĶĶ!ĖY!!ďR!BcĶď !QďÖĶĶ!ĖY!!ďR!BcĆ2 !Q,d2Ķ!ĖY!!ďR!BcĆ2R!} !J ß'ssçRĖY!!Î¥RBcĆ2RRd !K ·'ö!sç¥!!Îç¥ħcĆ2RRdc !K s(!!sçKď·¤!Å÷2RRdc !L ì)!!sç¥!!ŅÇÅRRdc!2ì !Hç !*ì!!sçBÇ!AĖRdc!2ì !Vs÷2çRRdc!2ì !Kç !*ì!!!s÷RRdc!2ì !Jç !-ì!!!cRdc!2ì !LB !-ì!!2dc!2ì !MBB !-ì!!s!2ì !]ì!!2ì !OCB !/ììì !Å Ç' ![ÇÇ 2'×ç !XÇ2BB R'2ħ !VÇBBB2 !'2Ħħ !V22 !_ÇB2 !-$ !M ħ(!B !UĦ ħ&ær!ĆææB !.2 !Hĥ!Ħ¶¶öc×ĦBcc2 !VĦ·ħħç ·(tR !,23s !GĦ! Ĕ,ńdR2 !)2B2ô !TBdSR2!!22Rddc !HĦ !.ôBRCSddSddBBô !G¤ !0ôBc R&BBńô !JB !/ôô B'ôĖ !Iç!B!!t· !- ô' !LB!!!õ!ç ![B!ćç·Į¯ !-mmm !MC!!¦×2¤ ,-ÅÅrm !Nbńń¥!rrr¤¤ÕÕąą!¤æÖĆr !Qdç÷÷÷çç··dd!çæĦĦĖm !P ļ/¥))ær !^ħĿď¥Ėm !]üR¥!¥ !Kĥ !4ħ!¥Ç !LĆ !3ü¥!!ü !JĦ !5ÇÇ !LĦ !5ü!ü !J¤!B !5ü !LBB !`ç !cB !bC !ąĥĦ !Ã¤Ħb !ab!",
);
rawImages.push(
  "#c Ņc !gË!!!Ë !:Ë!!Ë !<Ë !&ÁË !'ËËË !) Ë( !(ÁËËÁ !;ËÁ !*ÁËËÁÁÁË !&ËªĦĦĦĶĶ!ËË !(Á !;Ë !,ËÁÁ!!!Á!!!ËĦ2BBB22!!!Ë!!!Ë !(Ë »&T !0ËÁÁË !(ËËÁ !+ĶBă Á(!!!ËËËÁÁ !&ËĦĶ222vT !.ËÁ!!Á !)Á !+»2óĔ !(Á!!ÁÁÁ !'ËĦBáÁÁ!!vT !1ËË!!!Ë!Á !,2!v !,Ë !*ēÁ !3ËÁ!ËË!!!ËË!ó !,Ë!óÁ !,Á !(Ë!Ĕ !&Á !0ËËÁÁ!!Ë!!óĔ !Bó !4Ë!!Á!!Á!!!óv !8Ëó !)Ë!Ĕ !6Á !&ó!!!Á !7Ë!!Á !)ó !(Ë!óĔ !*Ë!Á !*v !-Ë!óĔ !(Ë!óĔ !(Ë!Ĕ !(Ķ !/Ë!!!ËËvó!!Ë !*ËËĶ !*ËĶ !*Ë!ó !(Ë !-ËĶĶĶË!ËÁÁ!vó!! Ë*!Ķ2 !)ËĶ2óĔ !/ËËĶĶ !+ËĶ!22!ËÁ!!ó!vó! Ķ& Ħ&Ķ2!óĔ !'Ķ!óĔ !*óĔ!!ËËÁÁ!!!v !*22óó!Á !&óóv!ă222 B&2!óvË !&»!2Ĕ !)Ë!!ËËËÁÁ!!22ĦĶË !&ËË!!óĔĔ !'ĔĔ!óóv !)óóĔ !'Ë!2ó !)Ë!óĔÁÁÁ !&Á2B!Ķ»»ËË!!óóĔ !+ĔĔv!óóó Á&ĔĔ!ÁÁ!!!ĶĶ !7Á! 2&!óóóĔĔ!!!ÁË !)Á!ĔvĔ !8Ë !/Á ó'ĔĔĔ !(ÁË !)ÁËÁ !/Ķ!!v !*óĔ !- Ĕ' !HT !&Ë !AË !(ËÁËË !.á!Ķ!vT!ËËĶ!óĔ !<ËÁ !)Á!ÁÁ !/BĶĶ!vË!!2óĔ !=Á!ÁË !8ÁB!ĶĶ!Ķ!óĔ !J Ë& !-Á222!ăóĔ !'ªª»ªª»ËËË !4Á !)ËĶĦĦĦ»ËËT !* Á&ĔĔ !&ªª!2!22!ĶĶ!T !1ËËË !(ËĶĶ!22!Ħ!vËT !0Ëª! 2+!vT !/ËÁÁÁ !(ĦĶ22!222Ķ!!vT !.ËĦ!222!! ó& !2Ë!Ë !)»!2!22!!22Ķ!!vT !,ËĦ!22!óóó Ĕ&ó !0Ë!ÁÁË !(ĶB22 ó(2Ķ!!vË !*ËĦ!22óóĔĔĔ !&Ĕ !/Ë!Á!!ÁË !&Ë2!óó!! Ĕ&ó2!!!ó !)ËĶ!B2ó!Ĕ !)Ë !( Ë& !/ËĶ2!!!ĔĔ !&ĔÁó !+ËĶ2B!óĔĔ!!! Ë'!!óĔ!ËË!óó!Ë!!Ķ !&ËÁ!!ËĶ!!ó!Ĕ !*Ĕ !+Ķ2!!!v !&Ë!!! ó&Ĕ!Ë!óÁĔĔÁ!Ë !&ËËÁ!Ë»Ķ!2 !7Ë!!ÁÁÁ!ËË!ËĶ!!ó Ĕ&!Ë!óĔ !&ÁĦªĶ!Ë!Á!!!222!óvv !3ËĶ2Á!!!ÁÁ!ËĦ!!óĔ !(óĔ !(22B!!Á !)ó!Á !,Ë!ó !(2Á !(Á!!2 !)Ë !+Ñ2!ÁÁ !)ó!!!ÁË !-Ĕ !0Á2Ħ !(Ë!óĔ !*Á !*óóv!Ĕ !,Ë!ó !'Ë!Á !+ÑB!vT!!Ë !6ó!vó !/ó!Ĕ !3Á!!vËË !(Ë !0vvó!Ĕ!!!Ķ !(Ë!!Ĕ !&Ë!Á !. Á)!vËËÁ !0óó !'ËĶ !/Ë!Á !6Á!ÁÁ !*ÁË !&Ë!!!Ĕ !/v!!!Ë !;Ë !,Á Ë&ÁĔĔĔ !.Á!!ËËË!!Á !+ Ë& !+ÁÁË !, Á& !*ÁB !)Á !'Á !*ËËĦĦĶ!Ë !(Ë!!!Á !( Ë' !.Á !* Á' !*ªĦĦ!2!ĶĶË !&ËÁ !*ËË Á&!Ë !/Ë !622B222!! Ë&!Ë !)Ë!Á !&Á !&Ë !+ÁË !3ª22ă!óóó2!!óÁÁÁ!Ë !'Ë!!Ë !'ÁË !@ËB2óĔÁĔĔĔó !(ÁÁË!!!Ë!óÁ!Ë !)Ë!Ë !,ËË !2óĔ !'ĔÁ!vT !&ÁË!Ë!óĔ!Á!Ë !'Ë!!!Ë !)Ë!Á!Ë !BÁ!!óĔ!!!Á! Ë&!!Á!!!T !'Ë!Á!ÁÁ !0óĔ !3Ë !)ÁÁÁ !*vTËË»Ë!Á !2Ë !-Á!vT !&Ë!!Ĕ !+ÁÁ !(v!Ķ!!Á !(ËËË !+óĔ !2Ë !3ó!!Ķ!Ķ!Ķ !)ËĶĶĶË !6Á!vT!ËĶĶÁÁ !-ËÁ!!ó!2!2!!!Ë !'Ķ!22!Ë !'Ë!!Ë !/f»Ħ!Ñ !4 ó&ă2Ħ!Ë!!!Ë!2ó !+ó!!Ë !+ËĶĦĶ!BÑ !.ÁË!!!Ĕ !'Ĕ!!Ħ!ËËË!2óĔÁ!!Ë!!!Ë!!ĔÁ!Ë !&ËËË»Ħ!BBÑÁ !0Á !& Ĕ'!Ñ2!ĦĦĶ!!!Ĕ!!Á!!ËËË!óĔ!!Á! Ë& !&B2!!Ë !=ÑááB2!!Á !&Á !&óĔ !&ÁÁ !'ÁÑ Á&!ËË !1Ë !.ÁÁÁ!Ë!!!Ë! Á&Ĕ !* Á& !(ÁÁ!Ë !&Ë !*Á!Ë !0Á!ËËË!Ë !-ËÁ !.ÁÁ Ë&Á !+ÁÁ !1 Á( !-Á !1 Á& !.",
);
// }
var pickupOffset = rawImages.length - wallCount;
// Pickups {
// Pickups (Health + Ammo + Guns) {
rawImages.push(
  "#c Ņc !`É !ÄÉÃ !_É!2ĉ !d¨ !]Ã!Ķ!!ã !ÃĖĉ !ÂÉ!Ķ !^É!!¤ ![##3Ĥ!!ç !Z#!!!Ć¦!!Ĵô !W#!!222!!!ĕ !Z22!BR!!ć!ĸ !V2R!2R2 !]2ĖĶBĖRs!!2!0 !V22Æ÷ĶÆ!!!2!¨ !VĕBBå2RĦ!!s!ã !WĕĆĆc2Ć!2eĘ !YåÆ!2!£!Öå !ZAåB¥Ħ!!!f ![$!Ħ !`ÃÈ!³B¦ !_¤¨¤Bă !`çã !_¨ã!!ĸ !ZÉ !&ãĨ ![Ã!c!#cą !`¶ćĖĆ !_Ö÷C !^ÄPèĦBą ![#cĖ!B!Ķ ![Bc!!qrĆ ![ĥĆ!!!sÆ !]e!!!öö !aŅõ !]¢!!ĸ !]É !'ĸ !aĖ !cĖĸ !ZÃ!C!r !_CB!!R !_BR !`ĥR!br !_ĘØĶ!ĕS !]Ĥ@ !aDĨ !_É!ãģ2B!ģ !ZÃ!!!ĕ2Ĩ !^dd¦BÓ !^ąąåµÉ !^¨!!fÃ !`5Ė¨ !aRc !^ã !bÉ!¶B !_Ã!Ãc¢ !^%!É¢ !_Ń!Ã!¨ !`f !dã !`ă!!!",
);
rawImages.push(
  "#c Ņc !`f !bă !_5!f !cf !b¥ !^5 !d5ă!!¨ !]ĥ !e¢ !aU !_ĳ!!ąU!ã !_Ć !aĥcÅU !bs !aBĦ !]ĸ!!!B !`d!SB !^C2!!!% !^2!cB2 ![0!B!c !`2!Ħ!B !]R !bcÃ!!¢ !Ã3!!¶ !]Ã!!2!¢ !]Ĩ !bd!!!¨ !^2!!A!Ù !]ē!!!Õ !_f!B!B !¿Ù!!!S !cS !]³ !Ņ !hR !^Éă !aÃ !&2 !]% !ćc !Ä¨ă !d2 !^B!!s !]Ù !'s ![³ !'2` !]2!!2 !b2 !bÓ` !^B!!ø !_Rã!R¨ !a2 !_Ã !etc !^É!!B¢ !aã !_Ã !'",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !Ņ !Ņ !ÅcS !`#M1CC !^°Ć!RRC !]ĆÆćĦĆBt !Z-csďBcĦ2 ![c!çB!R2 !ZĻ¥R!2!22 !Z-Bcļ!22B !ZBĖ¥Ė!BRc !Z¥ĖR!BBĦ ![»¥R!ĦĦBC ![cæďBB¦ą ![Čæ·}¦å !]ĕļÖ!ń !_å''!!Ħ !Ä¤¤ !Ņ !Ņ !Ņ !Ņ !Ņ !Ņ !i",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !Ņ¯¯ !`¯ĶĶ¯ !_ĶĦĶĶ !^¯ĦRĶ !a¥ľ!m !^Į{Ė !_þĦ!!2 ![µµĦB2 !]±!Ħ!Ħ!RR !Z&Ħ!BRcĶ !_q!!s !]..>àÀ !]łFR!!!s !^BB!!wR !ZÛ !'ĕ !bĖ !]ĲĚ !aÛ!!m !a&åįĖ !^èĈ!!çd !`ö !a·¥ !_Ķ!!æ !^3Æ!-ò-ą ![ĵö2!!¯d !]ąÅĖ¯!!½ !_÷·c !`üc½ !az!Ħ !aĦ !a¤!¤ !a¤ !Ņ !Ņ !Ņ !Ņ !'",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !Ņ !ÄC3d¦HÌ ![CĦ!!!sc !ZCĦ !`CĦ !`CĦ !aĦ !j2 !]× !a×B !aB !d× !_Ç!!B!Æ!B !ZR !&×B!2 !`2 !aÕ !]Ė !&ö !]Å!!Ħ!öĖ !_µ !`Ħ !bµĦ !'2 ![µ !ÂB !bĥB !bĥB !bĥB !&2 !]ĥBRRR2 !^ĥąRR=Ł !ÃĦĦ !bĦĦ !_¤!!Ħ !Ã¤ !Æ¤¤ !Ņ !Ņ !È",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !Ņ !Ņ !Ņ !Ĉďß, !_ßĖ!B !Y¯ßďďß·· !ZßÇRdd·ą!R !ZÖ!sc!d ![R3!öĆ!ą !]Ö!sc!d !_öĆ!!!¦R !YĦ¦BRcccR !YYrBB2!üüjj !Y ü' !Ņ!!!¤¤ !Ņ !Ņ !Ņ !Ņ !Ņ !Ì",
);
rawImages.push(rawImages[rawImages.length - 1]);
rawImages.push(
  "#c Ņc !Ņ !Ņ !ĹdÇć !_d2 !aĖĶ !aĵ !ēç !ķdĦĶ!$ !`Ķ !,ç !cB !],} !&ç !Rą[Æßń!!!¯ !YdčÆ¬$ß¯¯Ķ !_·çR !(B !XÕrĆ !`·÷c !'B !YÕr!ķą !&CB !WR÷·2× !^Çssììì !V¦c !&üìì !YBB2 !.ĥ !RB !'} !)Ħ !SĦ !(} !ZĦ !'ì !ÅR ![åĖ !&L !]Ė!2!!!ì !b} !`PĜĜ} !Z2 !&×!Ĝ}} !Z2!!µ!!ĜĜ} !W22!!L !^åB!ßìL !)BC !TåÅì!ì<!!L !_Ć<L!ì !^ļüìì !ÉĦĥ !bĦĦ !`¤Ħ !c¤ !a¤ !Ņ !È",
);
rawImages.push(
  "#c Ņc !ĸÏ !`#<îm$ !^Ĥ!Ĕ2P !_c !ÃdÈYèÍĘR !jçç !RąÔå{rPĖ !]ĦßÖL !*ç22 !a22ç !Â2 !cBB !c2 !_2 !Ĉ2 !·Ç!Ĝ !^ĵ!¤¶LD !_¬ !fu!$!$$ !Xß!!!öTĥ$ĥs !V§Lç+ĞĤ!õ!ĥ !&222 !PĥÔIÅkJD ![B !132 !PC !b¯ !(s··C !`ôôńC !Y2!!!Ĥ!!!ńô !U×^Ï2 !^?včB2 !]?2!!2C !.ĵĶ !Nõ!!CB !oĶĶĶ !WD ![R !'Ĥu !aĖĤ ![Ħ !&R !]Ķ !^dB!!Ħĥ!!!< !X2Bċ!¬Ħ!!!Ĭ !XB!ńóĥĶ !^Ķ` !*$ !VĉĶĶ !*P$$ !Uùé !+PP$ !V2àR!!!Ę !)22 !RàR !&P!!Ę !'32 !QR2C !(P !(2 !Q2!R!!!ĖĘ !ZYt!2!ô!ńĘĘĘń!Ķ !UĬüìì!!!ńńń !'Ħ !aĵĶ !_ Ķ& !_¤ĦĦ !aĦ !b¤Ħ¤ !a¤ !d",
);
// }
// Pickups (Treasure + Keys + Powerup) {
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !Ņ !Ņ !Ņ ![Ò !aÒKĒ !_ÒKçŀO !^º9¶¬ę ![Ò!!V(ę !)Ò !SÒKĒ!ÂČ/! Ò(KĒ !QÒKçŀĒ8¥¼Ē! c&KçŀO !Pº9¶¬VÁ×ĐV× t&®¶¬ú !QV¬ę!Ĺlù! ĩ(¬ę !Sę!!Òįł !)ę !VÒKçĐO !)ç !Uº9¶¬ę !*Ħ !UV¬ę !*B !Wę !+Ħ !b¤!ç !ÄĦB !bĦ !b¤ !a¤ !Ņ !Ņ !Ņ !Ņ !ċ",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !Ņ !Ņ !Ņ !ýòâè !`çêäâĒ !)`` !S?Ķ!u·ĦĒ !(rĦ !SĶĶ_İÅĦĶ?!!p!Ēúĕ !TĦBHÇ2Ė2?ĲĹpºo !TĵĵRLąR¶B!SÒ!Ò2 !W¬¦R3BRRt!ÇRC !SĖ!Rďĕ3R! R&ĖÇB !TĖ!Í¦R22ÉÉRÉsĆ !VdĀĦ2BÉ!!É!Ùc2 !SVº2«cBÙ !(BÊ !T¤BĐÉÙ !)Û !U¦ÙÙ !*ç !Æĥ !ÅĦ !cĦ !aĦ !a¤¤¤ !Ņ !Ņ !Ņ !Ņ !h",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !Ņ !c? !bB !bĉ !Y?? !'/!? !XHH? !&R!B !W?õĠc !&ĉ`ĉ !XĀĶö /'ĉ` !Wą·åÌ H&ě? !Zĥl İ&^!Ħ !WFÅê!B ü&BB!? !U&ÿó!Ü!æææX!ćB !T©ĦĖ¿!!æàĐĐ!!!Ė !VRR!!!«!Ü¥!!R !TâdRÍ!!!Ý!Yæ!!ĉ !UġBĀ!!!%RU¥ !XòRÆ!!!R !]·Æ!!!ēĖē !Yw9i!!!¯!ď !ZöĤ!!!à!°æ !YRD!!!«ÜÜ¥ !YĉS!°!!ææ° !Zĉ¦! Đ& !] ĉ(êê !bÂ !`/Ħ2 !`RĦg !`ĉ¤ĶĶ !bĶ !a¤ !c¤ !Ņ !Ņ !Ņ !Ņ !h",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !Ņ !Ņ !Ņ !]O`pp !^?¼iiipp !ZłÌĦĆö!«!pp !YĦĆĖ!2Ķ«2Ŀ!!ç !VĆĖ!cæĦ!2Ľ ![ĕĆcBĶi!` !XsRS!ĆĦ!!!+ç !Tł!&¯sÆccR2!!Ľ!Bç !Płł!/ł!;¯Ðà°Àà !UÖÖ!!ÖÖ !)ĶĶ !SººÖĹº¶ÝjX«Üì«!!!B !Sº!łÝ!!cR2Ķ2!Ď !YĦcRĦĖĦĶĶJ !YĦĶĖÖĶ2°!ĩ !YĥÖĆ!Ć!!þ !Z¦ccB¥°ĥI !X&¯s!2sÀĩ&&!!Ħ !V&¯ÿÀÐĩ !^&&Ĺĩ !)¤ !`¤Ħ !ą¤ !Ņ !Ņ !Ņ !Ņ !'",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !Ņ!!ç !¾/p !'B !ZB2 !aĶĦ¢OO³ !]Ķ!!ĦĦ !aBB !`2ccÙ !_ĶĆĆ³ !`ĦĦ !aBB !`2ęęÙ !ÀBB2 !`ĦĦĶ !`BB2 !`ĦĦĶ !bĶ !^`?2ĦĖp !]Ħ!RBĶĶ¢ ![ĶcùĉĶĶ !À2Ćp`22 !]B!ĖĖ22é ![ĉBBRRù !^ĉĉĉé !&Ħ !Å¤ !Ņ !Ņ !Ņ !Ņ !Ņ !(",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !Ņ !eç !ZBĿ !aï¦ !'B !Zz¤mïïm !_Ć½½ !aÏÏ !`cççü !_Ć¤¤m !`½½ !`cÏÏ !azzü !Àŀ¦2 !`(åĶ !`ŀ¦2 !`(åĶ !bĖ} !]<B!¬ÕÕm ![(ÏÿÏ½Ć !^çIz !Ã¤ğï !_ŀ½j½ÏcĖ ![ĬÿÿÿcSĬ!!Ħ !YIII9Ĭ !f¤ !Ņ !Ņ !Ņ !Ņ !Ņ !i",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !Ņ !ĳ ń) !YĴĤ Ħ&ĶĶĶĴń !VĤĶ !'ĶĶ!!Ķń !TĤ!!ĦĦĶĶ!!!Ķ!!Ķń !RĤ!ĖĖĶ!Ķ!Ķ!!!Ķ!!Ķń !PĴ!ĖĭNçãă`³ó !)ń !OĶĖĭh»RĶöĕ¤rłłO.`pĶ !OĴ!ĭhxBâõĖí!Ħ2Bą3ĕĶ`!ń !PxB¡ąĦYīĖĦĖĆĶĵ¦2B !Q;2BBBĦį=¶·B·Ħ!sĦB !+ç !H2Rúd!ąàöBB!Bt!ĥ !Q2RBĶÃ¥·S«RĦĆ!Bõ!C!!3 !QĦÙ2ĦüīĦÕ!õBScRB !*çB !E2!22!Ėæĵd=ĖBttSÆĶc2 !,ç !D$2!µ2²¥¦|ĀÖtBBs2ö2¨3ķ !O2!µúcÖÖ!¦Æùé¹U¹¨3 !+B !F$!2!r%%%ùÙ¨2!!2!!!ķ !P$!2 !+2!33ķ !R$!22 !'22!3ĵķ !T$!! 2'3!3ĵ$ !V$$ !&3ĵ!ķ$ !.Ħ !L $&ķ$$ !r¤ !`¤Ħ !ą¤ !Ņ !Ņ !Ņ !Ņ !h",
);
// }
// }
var totalTiles = rawImages.length - wallCount;
var weaponOffset = rawImages.length;
// Weapons {
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !Ņ !Ņ !Ņ !Ņ !Ņ !Ņ !Ņ !ćt c( ![¶d33ķħėcc !YbcR!BRcķħ !ZbcR!!!BR ![bcR !abcR !abcR !abcR !abcR !abc !bb !Ņ !Ņ !È",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !Ņ !Ņ !Ņ !Ņ !Ņ !Ņ !)ćħ !St c'C !'ćdC !SõÇ33ķėAcC!!!B !Vb¶!BcķėAc!!CďK !Ub¶!!BcķėcÇ!cõ !Vb¶!!!BBėB+åĖ !Wb¶!!!Bc!ĕ !Zb¶R!!!cĖ ![bcR !abcR!!B !^bcR!BRB !]bc!C2B !^b!¥C !acBC !`zsB !aÍc !`ĥĥÛ !_AAA !Ņ !Ņ !É",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !Ņ !Ņ !Ņ !Ņ !ĺt c'S!!!ħħ$ !UõÇ33ķė1cS!!C !Wb¶!Bcķė1·C!+= !Vb¶!!BcķR!Įåõ= !Vb¶!!!Bc+Ć!!Ķn !Vb¶R!!!ĥ!!B!2n !VbcR!!Ħ!!Ħĥå !XbcR!Ħ!!ĦĦĶõ¦¦ !Vbc!BB!!!Ħ¬Ķ !Xb! B&!ÝĶ!Ķ !Yd2RBBĶ !]ĝSSC2 !^ĥüěBS2 ![AAA!ěěB2 !aÅB22 !aB !aÅ!B !aÅ !cÅ !Ņ !Ņ !Ņ !f",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !Ņ !Ņ !Ņ !Ĵt c&3S!!ħħ$ !Võ¦ħħħ!13!!C !X¤ÆRRBħ2·CÏĮŀ !W¤s!BR22!bĦ!±^ !V¤¶R!Bc+ĦĦĶ!R^ !VbcR!då!!ĦÅÕ !XbcR !&ĦĦĶą^ !Wbc!B !(iÇÇÇ !Ub! B&!2¬ĖĦĦĦÇÇÇ !TdRBB!¬Ķ!Ķ!2!!!Ç !SĝSC2BĶ !&2ĶĶĦĦ !RĥĥõBSC !'ĦĦĦ !TAAHěõB !'Ķ!!Ķ !WHě !+Ķ !X2!!!Ķ !^å2 !bå22 !aå!2 !aB!2 !`ÅB!222 !^ÅBB !aÅ!B!2 !_Å!B !aÅ!B !aÅ !cÅ !Ņ !Ņ !È",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !Ņ !Ņ !Ņ !Ņ !ĺt c'S!!!ħħ$ !UõÇ33ķė1cS!!C !Wb¶!Bcķė1·C!+= !Vb¶!!BcķR!Įåõ= !Vb¶!!!Bc+Ć!!Ķn !Vb¶R!!!ĥ!!B!2n !VbcR!!Ħ!!Ħĥå !XbcR!Ħ!!ĦĦĶõ¦¦ !Vbc!BB!!!Ħ¬Ķ !Xb! B&!ÝĶ!Ķ !Yd2RBBĶ !]ĝSSC2 !^ĥüěBS2 ![AAA!ěěB2 !aÅB22 !aB !aÅ!B !aÅ !cÅ !Ņ !Ņ !Ņ !f",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !Ņ !Ņ !Ņ !e ŀ& ![=ŀŀ Ķ& !Z=ĕĆĶ!d2 !V T'9!ĖææąSC !TÇrrrõBB®ė!!æą !Sħħ!ĦĖĖÆQrrěė!!!ĥ !Qćææ¥ėc2Ķ¥××!Æ !TRĖĖĖæ!Ķ !)RR !RĖRRR¥!2 !)BB!2 !Qb¥¥æµ2cÖrńńDæ222 !SAA!ĦĦĦ!DDD!ö2233 !TÅc¥÷rĤĤĐß!S3 !WbAĔĖ~~µÖ2!BBB !Y»ĶĶ!B 2& !ZËË!BcBBB !]ËËËëëë !Ņ !Ņ !Ņ !Ņ !Ņ !ċ",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !Ņ !Ņ !gÇ !`¦ÇĦ !_¦Ķ!Ķ !^¦Ķ!Ħ !Yŀŀŀ=¦Ķ!2!2 !U=ŀŀĶĶĶĕ!!2!B !U=ĕĆĶ!d2!!2!B2B !O T'9!ĖææąSCĐ2B!2 !OÇrrrõBB®ė!!æą!!B22!2 !Lħħ!ĦĖĖÆQrrěė!!!ĥR222!2 !Kćææ¥ėc2Ķ¥××!Æ !&Ćİ B& !JRĖĖĖæ!Ķ !)RR !&B !MĖRRR¥!2 !)BB!2!!ĆĦĦĦ !Kb¥¥æµ2cÖrńńDæ222!!8ĦĦĦ !MAA!ĦĦĦ!DDD!ö2233!ĆĶĶB !OÅc¥÷rĤĤĐß!S3!!iĶĦĶĦĆ !ObAĔĖ~~µÖ2!BBB!!!2Ħ !T»ĶĶ!B 2&!22!Ķ !UËË!Bc B& !&Ķ !VËËËëëë!B!Ķ2 !^ÅBB!!2 !^¤BcBB !_¤BBB !`bcc !aA !cA !Ņ !Ņ !Ņ !Ņ !g",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !Ņ !Ņ !gd !`¦ÇB !_¦Ķ!Ķ !^¦Ķ!Ħ !Yŀŀŀ=¦Ķ!2!2 !U=ŀŀĶĶĶĕ!!2!B !LÉ !*=ĕĆĶ!d2!!2!B2B !Gĸ!!ÉQÉ!! T'9!ĖææąSCĶ2B!2 !H0Ĉ%bĦÆ!ÇrrrõBB®ė!!æą!!B22!2 !HĶÕ,ąÄħ!ĦĖĖÆQrrěė!!!ĥ,222!2 !FÉ%!!ËBĆ¥¥ėc2Ķ¥××!Æ !&Ćİ B& !EÉµÕĦ]RöĦĦæ!Ķ !)RR !&B !HÃ×·BČĖsBB¥!2 !)BB!2!2ĆĦĦĦ !FÃŃ!RÁĦcææµ2cÖrńńDæ222!!(ĦĦĦ !I2dļdÈA!ĦĦĦ!DDD!ö2233!ĆĶĶB !HĸaŃdBÆ!Åc¥÷rĤĤĐß!S3!!iĶĦĶĦĆ !G0!!ŃėÃ!!bAĔĖ~~µÖ2!BBB!!!2Ħ !LÃ !)»ĶĶ!B 2&!22!Ķ !UËË!Bc B& !&Ķ !VËËËëëë!B!Ķ2 !^ÅBB!!2 !^¤BcBB !_¤BBB !`bcc !aA !cA !Ņ !Ņ !Ņ !Ņ !g",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !Ņ !Ņ !&¦ !`¦tĶ !_¦Ķ !_¦¦ !`¦ĶĶĶ!!2 !T ŀ'=^!!!2!2 !Rŀŀŀ!!ĶĶĶĕõ!!!22!B !PŀĖĖĖĶĶ!d2!!!22B!B !Lç ć&čĽĝý!ææąSd!BBBĶR !LÇĦĆæÖÖö!BcÝsRĖĕ!tİ2!!2!B !F ħ&!!Ė!ĶĶĖĆĦĦcÇ!!!Ħ2!!2B!B !Fć æ&BB÷ės!R¥××µÆ !(ĐRB!BB !D$ Ė)ĥ!Ķ !/2!!cBB !Dń R)C!2 !)BB !&yĆĆĦĦĦ !Eb ¥&ĦĦåµ2¥¶tńńDæ22!!!8Ć!!ĆĖĖ !F A&!!ĦĦĦc!BD!µö223!!!ĦĦ!2ĶĶ !JÅBc¥ÇtrĤĤ×Ā!S3!B !&2ĶĶĶ !K¤bAńlnn^àĦ2!BB !&B!Ķ !QË!!222B222B!!B!!2 !RËË!22BcBB22!!!2!22 !R Ë' ë&B !b¤BB!B !_¤¤!!B !`¤!!B !`¤¤ !c¤ !Ņ !Ņ !Ņ !Ņ !Ê",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !Ņ !Ņ !Ċ¦ !a¦Ķ ![ŀŀ==¦Ķ !Y=ŀŀĶĶĕĕ!!2 !W=ĕĆĶ!d2!!2 !S T'9!ĖææąSCĶ2B !QÇrrrõBB®ė!!æą!ĠB2 !Oħħ!ĦĖĖÆQrrěė!!!ĥR22 !Nćææ¥ėc2Ķ¥××!Æ !&ĆİB !MRĖĖĖæ!Ķ !)RR !&B !MĖRRR¥!2 !)BB!2!2Ć !Nb¥¥æµ2cÖrńńDæ222!!BĦ !OAA!ĦĦĦ!DDD!ö2233!ìĶ !QÅc¥÷rĤĤĐß!S3!!iĶĦ !RbAĔĖ~~µÖ2!BBB !Y»ĶĶ!B 2&!22 !WËË!Bc B& ![ËËËëëë!B !aÅBB !a¤B !b¤ !Ņ !Ņ !Ņ !Ņ !Ņ !'",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !Ņ !Ņ !Ņ !Ņ !'tt !^tt3ĆB !Ztt3!ĵRķĕ !V·ććCĵĶQRėćÕė !Vsd!Bė!ė!c!!c !Vöą!¥¥cc!B !YÕbb¤sc¶cRÅ·c !Zbbb!Bcą· !^bbb!ą !abb !Ņ !Ņ !Ņ !Ņ !Ņ !Ņ !Ì",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !Ĉç !bĦ !aÇĶ !aĶĶ !aĶ2 !`Ç !bĦ!2 !Â·!!Ķ !_Ķ!2Ķ !_ŀ!!B !_åŀĦĖ !]tt½ļĖĖ !ZttĆĶæĆĶA !Wtt3ĆBQ2QQcd !Ttt3!ĵRķĕ#ĵ!tħė !P·ććCĵĶQRėćÕėRėtĆB !Qsd!Bė!ė!c!!c!cs¶ !Röą!¥¥cc!B !(Ö !RÕbb¤sc¶cRÅ·csRæÖĦ !Ubbb!Bcą·!!!æõÕ !Wbbb!ąĖÇ!Ė¶æ !ZbbRąÇRRĖ !]bbńÇc¶ !`ńbd !bń !Ņ !Ņ !Ņ !Ņ !Ņ !ċ",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !¸É !rç !bĦ !QĦ !0ÇĶ !PÉ!É !/ĶĶ !QĖ !0Ķ2 !Qą !/Ç !QÉĦĖöÉ !-Ħ!2 !PĖ !cĖą !-·!!Ķ !Pą]Ć !&ÉÉ !'Ķ!2Ķ !JÉÉ!!!ĖĆČ!µ!ÉÉö !(ŀ!!B !KöUÉvĦ2]Ħ!ĸbbąÃ !'åŀĦĖ !JÃ!ÕĦĦÅĖ!!ĆĖĖ!× !&tt½ļĖĖ !LB¤¤Ħ]!!<ĖR·Ã!!ttĆĶæĆĶA !IÉU¤öĖ]]!º] !&tttĆBQ2QQcd !HÉĖõc!]ü!!T!!!ÕĤBĵRķĕ#ĵ!tħė !FÉvöÕĦĶĶ!m!WąÛWôĶQ2ėÇÕėRėtĆB !DÉUUbb¤ö,,mººìRė¥2ė!ė!c!!c!cs¶ !EÃēēććçsļČüÒÒ}ĖQæ¶¥cc!B !(Ö !HÃós·BR2!ü!đd±nCBsĦRb·csRæÖĦ !JµtBRČc!!Ĕ!!!CØcBÆą·!!!æõÕ !GÉĦ·s2BR2Č!Ò!!!Ķ!¤bb!ąĖÇ!Ė¶æ !HBēÃ·ĦRBcČ!Č !)bbRąÇRRĖ !GÃÃ!!!ç¦dB!!!Č]ĦÅÉ !&bbńÇc¶ !KBãóB!2!2BČ]2ö !)ńbd !KÃ!!ód!Č2cBļ!ąÉ !*ń !P2!B!cRRd !YsB!Bd000s !Z¦!ds!!!ÃÃ !XÃRRRÃ !_BBB !at !bR !aÃ!Ã !aB !ąÃ !Ņ !Ņ !Ę",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !eç !bĦ !aÇĶ !aĶĶ !`ÇĶ2 !ÃĦ!2 !_Ç !bĶ!!Ķ !_Ķ!2Ķ !a2B !^-ð!ĶĶ !`B!Ħ !^««ĖĦ ![dttĦĦĖĖ !Ydt2ĆĶĆĆĶAĵ !Ut·3Ė¶BQ2QQcdÇ !Q¦¦t3BĕRķĦĕ#ĵ!tħė× !M·ććCĥĥĶQ2ėćÕ!ėRėtĆB !Osd!Bėė!ė!c!!!c!cs¶ !Pöą!¥Ö¥cc!B !)Ö !PÕbb¤Bsc¶BRr·!csRæÖĦ !S b&BB¶Å¦2!B!æõÕµ !UbbbcąBĖ¦BĶ¶¶Ö !Xbb!Rą¦RRB ![bbbń¦css !_ńbdB !ańb !Ņ !Ņ !Ņ !Ņ !Ņ !ċ",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !Ĉç !bĦ !aÇĶ !aĶĶ !aĶ2 !`Ç !bĦ!2 !Â·!!Ķ !_Ķ!2Ķ !_ŀ!!B !_åŀĦĖ !]tt½ļĖĖ !ZttĆĶæĆĶA !Wtt3ĆBQ2QQcd !Ttt3!ĵRķĕ#ĵ!tħė !P·ććCĵĶQRėćÕėRėtĆB !Qsd!Bė!ė!c!!c!cs¶ !Röą!¥¥cc!B !(Ö !RÕbb¤sc¶cRÅ·csRæÖĦ !Ubbb!Bcą·!!!æõÕ !Wbbb!ąĖÇ!Ė¶æ !ZbbRąÇRRĖ !]bbńÇc¶ !`ńbd !bń !Ņ !Ņ !Ņ !Ņ !Ņ !ċ",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !Ņ !Ņ !Ç}}RR !]m}ĜĶĕ2 ![m2Ĝ×û!| !Zm2ĜDßĈĀ« !Z2ĜD*åaÍd !Ym!!ĦåĜdÕÕ !]ÕĆ2åBd !Xt !&¦İĐSĵ !X¾!!!·ĶĆiąĦ !Wc½!!!Ýċýt¦¦ !WÕÕ!!!RB å& !Wŀŀ!!!ĎĠİĐðd !WYt!!!·××çZğ !XY!!!ÕĶĶĮ·[ !Xõ !&µûÍÝĞ !]·*ĀĖjĻ !Yü!!B·¿ZÿC !ZĶ$ĤB!·¯ç !ZüJDĤ!JÕ· ![ì*DńĜ·: !]ìôLDńĬ !_ìôĖĖ !Ņ !Ņ !Ņ !Ņ !Ņ !'",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !ĈŅ !`ÿŅĦ !_ÿiĦĶ !^ÿiĦĦĶ !]ÿHĖĦÇÇ ![ŅHĶ·!åå !YŅĕĦ¦ĶåBĶĦ !S}}RRŅcĖ2ĦåBĶĦ·Ç !Qm}ĜĶĕ2ĖKĐÐ2¦¦·ÇÅÅ !Pm2Ĝ×û!|ĐÌX¼·!ÅÅÕ22 !Om2ĜDßĈĀ«Xt·!ÅÕ22!Ķ· !O2ĜD*åaÍd·Õå!2!Ķ··2Õ !Nm!!ĦåĜdÕÕå2BĦ··2ÕÕ!Ķ !QÕĆ2åBdĐ¦d2ÕÕ!Ķ··Ç !Mt !&¦İĐSĵy!ÕĶ···Ç !P¾!!!·ĶĆiąĦĖÕ·Ç !Sc½!!!Ýċýt¦¦·! Õ+ !LÕÕ!!!RB å&Õ 2, !Lŀŀ!!!ĎĠİĐðdt 2, !LYt!!!·××çZğßà C+ !MY!!!ÕĶĶĮ·[*Rß 2* !Mõ !&µûÍÝĞÏ2¦ŀğßÏ¯¯ !S·*ĀĖjĻµ!!Rt×·¶¶ßß !Nü!!B·¿ZÿCij(ëÅ!Rtt¦c !OĶ$ĤB!·¯çĈï!Ħz¤ÅĆ!Rt !OüJDĤ!JÕ··¿įdß½zåÅĆĆ !Pì*DńĜ·:Õ:[,¬ßÏ½zåą !QìôLDńĬÏ!ÕcßtRßÏ½z !SìôĖĖüübĶçĵdtRßß !Zü!|c2dB2 ![Ć*ľcRdt ![ĬĆ*ľ2c !^ĬĆ*ľľc !^ĬĆ*!ľ !_ĬìĎ* !aĬì !Ņ !Ņ !Ņ !f",
);
rawImages.push(
  "#c Ņc !Ņ !÷é !ÅĖ !bĖ !aéĦé !bĖ !`ĖĕĶé !_Ė !aéĦĖĆĖ !.Ņ !QĕĦĕ !-ÿŅĦ !GÙÙÉ !*Ħ!Ė!!é !(ÿiĦĶ !HĆöé !'ĖĖmöĦ¹¹Ćé !&ÿiĦĦĶ !GĶĦąrUféé¹ĖĦ!ĶĕÅö2¢!!!ÿHĖĦÇÇ !GÃ¶!ĖÕõÆÆÅõĶ!Ķæöĕö!!!ŅHĶ·!åå !IS!ĆöååĖöĶ!m]!ĖÆEŅĕĦ¦ĶåBĶĦ !H¢ÆRBLĆĦĖĦm!ËěÖ¶¡?Ė2ĦåBĶĦ·Ç !IæSBüĄäô<Ûûsïē0ĖKĐÐ2¦¦·ÇÅÅ !HéB2R2¡!!ëc¥Bû!|ĐÌX¼·!ÅÅÕ22 !GéĆ¤ą!Rļ!#¥c·dĈĀ«Xt·!ÅÕ22!Ķ· !HĖRĖöĆĶ¡cc·*ĽaÍd·Õå!2!Ķ··2Õ !FéĆąöĖĦmmû!!ĦåĜdÕÕå2BĦ··2ÕÕ!Ķ !EéĆÕöĦ]m!Ė!!!ÕĆ2åBdĐ¦d2ÕÕ!Ķ··Ç !Dé!ÕöĦm!ĦĖ¨ !&¦İĐSĵy!ÕĶ···Ç !FéĆröĦmĦĖĦĶĐ!!!·ĶĆiąĦĖÕ·Ç !Héér¤öĦmĦĖêúú½!!!Ýċýt¦¦·! Õ+ !@éĆrĖĦĦmĆÚĊ!!åå!!!RB å&Õ 2, !@¢c÷çBBüc¡_!!dd!!!ĎĠİĐðdt 2, !A¢¢cçsBüRRoo²ï!!!·××çZğßà C+ !C¢c·sBüBB22X!!!ÕĶĶĮ·[*Rß 2* !D¢c·sBüBRRã !&µûÍÝĞÏ2¦ŀğßÏ¯¯ !G¢cts2ü!!R!!!·*ĀĖjĻµ!!Rt×·¶¶ßß !F¢¥tR2ü!!n!!B·¿ZÿCij(ëÅ!Rtt¦c !FéĆÅ!RcĜüêĆĆÕB!·¯çĈï!Ħz¤ÅĆ!Rt !FĖÕ!!R¦!!!ŅæĆÕ!JÕ··¿įdß½zåÅĆĆ !Eéö!R¦Ç!!Ą!!^ĆĦõĞ·õÕ:[,¬ßÏ½zåą !GSÇÆRĕĦoous±-æõõtÏ!ÕcßtRßÏ½z !FÆsÓ¢!ömļ8sČ!!nı÷Ö|ğ!ĶçĵdtRßß !E¢¢Ó!!!sĜç#×¥ü!üČ2RĆsĸü!|c2dB2 !K·ÇÆ¢R!2!2cstcÓp!Ć*ľcRdt !KcÆ¢!RS2!2Btă¢!!!ĬĆ*ľ2c !K¢¢¢!!!BBüBS¥ !(ĬĆ*ľľc !OOR2B2R¢ !)ĬĆ*!ľ !P¥B!BR !+ĬìĎ* !QSBSB !-Ĭì !POBRc !`R!2¢ !_¥!R !aS !aOs¢ !aR !bR !ÅO !Ņ !2",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !¸Ù !bĆ !bĆ !aÙ!Ù !`Ćą !aĆĶĆ !/Ņ !PÙ !)ÙÙ !'ÿŅĦ !QąĦĆv!!vÆ !'ÿiĦĶ !PĆĶ !&5Å!Ć!!!ÿiĦĦĶ !RĦ!Ć5ÕĖ!ó!!ÿHĖĦÇÇ !HÙÙ5 !&vĆĦm!!ÕL !&ŅHĶ·!åå !I¤s5!!!ĆąĦ!õµLü£!!ĕĦ¦ĶåBĶĦ !HĆ!µõ555ąĶm!Ņb«öR´ĥ2ĦåBĶĦ·Ç !HĦ!ĶĆÿsąĶĦûĻ·BÕzõą¦Đ2¦¦·ÇÅÅ !K2!¯ö,ĥc·ĖörýĶąąX·!ÅÅÕ22 !FÙU!!22üºĄûc·BÕqĕątðð!ÅÕ22!Ķ· !DÙvæĦĦ !&ÒÒc·Bľ´BĐðÏiX!2!Ķ··2Õ !CvĆĆąąÕöĖĶ!!û!!Ħ¤ððiXXĦĶĦ··2ÕÕ!Ķ !BvĆĆąöĖĦĦL]m5!!!:iiXĦĦĦ··2ÕÕ!Ķ··Ç !AvĆĥąĖĦLmm!!5¦!!!ÕĶĖĦ·ÇÇ!ÕĶ···Ç !BÙvĆĥööLm!!!ºº!Å!!!ö¦ÇÇÅÕÕÕ·Ç !DvvÆĆõöĦm!!ººº!!!2!!!sąąącRR! Õ+ !<Ù!Ćĥõ,Lm!!º !'¦R!!!KĠ ð' 2, !<³ccCtļĜĜ!!Ò !'åd!!!ĝ¬ÝÝ8HX 2, !=³ócctsRĜ!!ÒÒÒ !)öÕÅ!Ç·¦à C+ !?óóc¦dRĜü!!!ÒÒ!Å!!!ćĀcõõÕÕRß 2* !Aó!cdRcĜü!!!ĳ2!!!þćŀààRR2¦ŀğßÏ¯¯ !Dó!cdRRcĜČü!Ń!!!R2¦×sĀÐ!!Rt×·¶¶ßß !Cóóc¦dRR22ü!n!!BĞåRÇç×RĵëÅ!Rtt¦c !Eó!cCdB2mººĆÕĦB+õµµR¦¦Ħz¤ÅĆ!Rt !Fó!!õĦ!!ÒÒnĆÕĦR+ÇRÅµĶdß½zåÅĆĆ !KL ü&nĆÕ!RĮ+ÇRÅ,¬ßÏ½zåą !FvĆĥ2!ĜB×××Ĝ#-rõ!Rþ+ÇcßtRßÏ½z !Fc!!!R·÷cĳcBB!nıààĆ3+ĶçĵdtRßß !GÆ¦ÇÇĳóó!!R!!üü!!ĆõĆü!|c2dB2 !F³³óóó !'ĖRüc×ü!!Ħ!!Ć*ľcRdt !OótBBt!×Ĝ !&ĬĆ*ľ2c !Qc!s!ĳĳ·B!c!!ĬĆ*ľľc !QC!c!!ĳ·B !&ĬĆ*!ľ !R¦c!!!ĳ×c !&ĬìĎ* !Pócc³ !&ó !)Ĭì !Y³ !Yc³ !Ą³ !Ņ !Ņ !4",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !Ņ !Éÿ !aÿH !`ŅHĶ !^ŅĕĦ¦Ķ !W}}RRŅcĖ2ĦåB !Um}ĜĶĕ2ĖKĐÐ2¦¦ !Tm2Ĝ×û!|ĐÌX¼·!Å !Sm2ĜDßĈĀ«Xt·!ÅÕ2 !S2ĜD*åaÍd·Õå!2!Ķ !Rm!!ĦåĜdÕÕå2BĦ··2 !UÕĆ2åBdĐ¦d2ÕÕ !Rt !&¦İĐSĵy!ÕĶ··· !Q¾!!!·ĶĆiąĦĖÕ·Ç !Sc½!!!Ýċýt¦¦·! Õ' !PÕÕ!!!RB å&Õ 2( !Pŀŀ!!!ĎĠİĐðdt 2( !PYt!!!·××çZğßà C' !QY!!!ÕĶĶĮ·[*Rß 2& !Qõ !&µûÍÝĞÏ2¦ŀğßÏ !U·*ĀĖjĻµ!!Rt×· !Rü!!B·¿ZÿCij(ëÅ!R !SĶ$ĤB!·¯çĈï!Ħz¤Å !SüJDĤ!JÕ··¿įdß½z !Tì*DńĜ·:Õ:[,¬ßÏ !UìôLDńĬÏ!ÕcßtR !WìôĖĖüübĶçĵd !_ü!|c !`Ć*ľ !`ĬĆ* !aĬĆ !bĬ !Ņ !Ņ !Ņ !ĉ",
);
// }
var hudOffset = rawImages.length;
// HUD {
// HUD (Base) {
rawImages.push(
  "#J |Ņ |d!!! Ĝ2 ľ4Ğ !'Ĝ ±' Á<áoĶ !'Ĝ± oAÒĶ !'Ĝ± o@ÒÒĶ !'Ĝ± o@ÒēĶ !'ĜÁoo± ~) o6ÒēĶ !'ĜÁo± ~* o6ÒēĶ !'ĜÁo~~oo~ o:ÒēĶ !(ë¼ËË¼¼Ë ¼* w2Úě: !(2 ħ& ė<ķÇ !)2! 1+ !6cd !)2! 1+ !62d !)2 !*11 !62 !-ħ ķ' !82 !,ħ2 !&2Bķ !62 !,2!11!11AQ !62 !.r!ķ!Q11 !62 !,Q 1)A !62 !,ķc2 !&2c !6C !, ķ+ !63 !-A 1&ABķ !63 !,A 1(2B !63 !,1Ķcķķķ2Ħ1 !63 !,2 !(ĶĶ !63 !,ķcĖ111Ħ2c !63 !,ė ķ)ħ !63 !-ĖĶ !&ĶĆ !AA 1* !62 !,AĶķķ!!Rė !72 !02!!ĶĦ !62 !,ķ2ĆQ!QĶ !82 !,ė ķ)ħ !6B !-÷ħ ķ&ħ÷ !6B !*ė c0 Ç2B !*ĶAA!2 B( Q6ĴÅ !)Ķ!ħ ķ* !6ĕĶ !)Ķ!ħķ!!ķķ÷ !8ĕĶ !)Ķ!ħķķķħ ķ& !6ĕĶ !)Ķ!!ħķė!ėħķķ !6ĕĶ !)Ķ !@ĕĶ !)Ķ !@ĕĶ !)A Ć0 Å2ĕĶ !* ħ& ė<#Ç !H22 !)2 !@22 !)2 !@22 !)2 !@22 !)2 !A2 !)2 !A2 !)2!!!1A!!1A !82 !)2!!111A!11r !?2!A 1&A!1A !63 !,11! 1( !63 !,r11! 1& !73 !-Ar!!AAr !73 !-Q 1'r !73 !,Q 1)r !63 !,11cħ!!2ĶA !63 !,r!!ķħ!c!Ć !63 !,ħBcķķħ!!Ķ !Aķ21!!!2Bķ !AĖ!!1!!!2Q !A1Ķ!!!ħ2Ć1 !AQĦ !'ĆA !Aėc2 !&2 !Bķķ÷!!!ħķħ !A÷2!111Ć !82 !,AĦĆ 1& !82 !,AĶķķ!!Rė !72 !02!!ĶĦ !62 !,ķ2ĆQ!QĶ !82 !,ė ķ)ħ !62 !-ĖĶ !&ĶĆ !62 !,A 1* !62 !,1Ķķķ!ķķ !CĶ!ķķ!ķķ !Cħķ!!ķķ÷ !Cħķķķħ ķ& !Bħķė!ėħķķ !kħ ķ) !Aħ ķ* !62 !,ķķ!!ķ!!ķķ !62 !,ķķ!!ķ!!ķķ !62 !I2 !I2 !I2 !I2 !I2 !{ė c1 Ç1 !+ĶAAA Q=ĔÅ !)Ķ !@ąą !)Ķ !@ą !*Ķ !@ą !, 1+ !6ą !, 1+ !6ĕ !311 !6ĕ!Ć !(Q Ć*ĕĕ Ć' Å1ĕ!Ć !(2ħħħ ė'!B ė6#ÇĆ !(2! 1+ !6CdĆ !(2! 1+ !6C!Ć !(2 !@C!Ć !02Bķ !6C!Ć !2B !63!Ć !0Q !83 !, 1)!B !63 !, 1)!÷ !63 !, ķ+ !62 !,ķ2 !=2 !,A 1* !62 !.ķķ!ķħĦ1 !62 !)D !&ķķ!ķķ!Ħ !62 !)D !&QQ!!!2ķ !62 !)D!!ķ!!!2ķ!!Ķ !62 !)D!!2 !&2ķĦ1 !62 !)D!!11! 1( !62 !)D!!rĶ!ķ !&2 !62 !)D!!ħ2cķķ22cķ !62 !)D!!ķķ!!ķ!!ķķ !62 !,ķķ!!ķ!!ķķ !62 !.ėė!!ėħ !72 !-ķķķħ!ķķħ !62 !*ėcC S&CcSSccc Ç32 !*ĶA22A B( Q6ôĀ !)Ķ^ĲNN^ N&> ^6Āą !)Ķ^^>Ĳ^^>>Ĳ ^7Āą !)Ķ ^@Āą !)Ķ ^/ Ò' ^.Āą !)Ķ ^' Ò*wÛěÛªīÒ¡ ^+Āą !*^^^Ò¼+++¼¼¼ÜÜČČ7ªċWWW Ò(¡¡^Āą !)QŁŁoďÿÿÿďċċċÛÛ666ęęgęĉĉĉ6Ê Ú&ĊĊą !)2>`İĠĐĐĠ8Ĝ«7«7Ĳ«'ċī7«XG77«ĜHYYY8' !)2!CäôĄĔ^Ā;ğL+Cöc;ÿÿğ;ĿĿğğį}Đ<ŀ,ŀ !*2!CôäĄ^,}Ŀğ;ğtĻû;ÏÿğĿĿğ;ğğ;Ðn,ŀĐ !*2!CäôĄ,n}Ŀğ+ï!rh;ÏğğĿ]Ð+ğÿğ}n,Đ° !*2!CääĄ<n};ğğÏðń0Ď®Î];+ĐL+Ïğ}nŀĐ} !*2!CÔäĄďÿlĎÎÎ{+XJ¤åc!ğĞÐĿ;ÿğ}nĐ}+ !,CäpÉĶ_łAääÄäAŅQĵÅĶRŅ;ÎįÎþKLïà} !,C`Ė!o!_Öb1b¤sĦ¤Öæ¥t2¦ĖĶ1ÆĖtĶ¶ĕ !-ĆĦĶo¢CöĶ!Å!ĐsBB!ħąĕtæSÅb¥ĵårĕ !-ĶĶĶN!÷çÇBt+åeĆBÇķĦĦ×!cĶÅÖĶĖ¶A !-ĦĶĦą!ħėħ¦ç+}Ñ!sBc22ķ3RĦĆĖąæöö !-ĶĖĖÚÉöėtC¥!$¶!R!!Ħ !&Ė!!Õ¶bĶ !-ĶĶĆ©fVËīRsyìĬ!ĖĦåĆĖ1ĵĖscRÕĥA¤ !,ĥ2ĶöwºFĶR!ĦÌ¦ģBÖrQĵĦrĦĆs¦¶Q1Å2 !,ĥR!ĆĖúĶ!!!RöXĖĶæĖARSõ2ĕcC¤Ôöbą !,ĥÙRĦÊo!¶×ÇÇ¦¤Bç¶¥æĆ!åBõ!ÅQôr!ħ !,ĥ¸É²Ħ¹éÖķT§uħħćBÇ2ħ#ĭĎYÞ:í)XÌI !,ĥ¸§uIĬü¬Ľ)ĽIĐîćÇĥĦ{k¼IĭIIìļXÌĭ !,ĥ¸¸§(ļċXiÌÌì$3Z¾¾ĭĽĽXĜĽjIìļyyÌ !,ĥ¸È¸§TļXĜĜĽ!õnĭjIIIČ¼ĽI½IìHÌĽì !,ĥ¸¸ÈÈ¸¸§eĽI!-āĭ½j I&ĭIIĭ¼HI9j !-§¸ØØÈeĽĽI½Bsçĭ½jIĭ I&ĽČXÌIIĭ !-T§È¸eiìIIĽzBì)jIĽìĜĭ9ĽĭĜIIÌIĭ !*.''ĪY¬½ŁŁ^±ñññłññĲĲÁġĲł.. N&ĲÑn !*ĶĪĪĪĉĠ,yHİÿÿÿß¯¯<ŁàŀŀŀéÉÉÉęęęĺĺ6Ć !)Ķ ċ' ê& º&òáM±ò=ºê ċ+' !*Ķ ċ/ º' ċ.'S !*ċ Ě+ ċ6'S !*ċ Ě+ ċ67S !* ċ'Ě ċ:7S !*ċ Ě+ ċ67S !)ĺĆ ĕ+ Ć62d !)2 ħ& ė<#Ç !)2!!A 1) !62d !)2!A 1* !622 !-ķķ!ķķ !822 !-ķķ!ķķ !832 !/ķ !:32 !+ķķķtBB22 !732 !+ķ2 !=3 !,A11Q!!1 !83 !,1Ķ !'ķķ !63 !,ħBB2 !;3 !,ķķ!!ķ¥Q2 !73 !,ķķ!!ķ!!ķķ !A 1+ !62 !,111õĦĦĶĶ !72 !-ħ ķ' !82 !,2!ķė!!ķ11 !62 !. ķ'Qr !62 !,1ĦĦĶ !;2 !, 1'õĦĶ !72 !,11 !+1ĵ1 !+¥ŅŅ!!!2 !. ķ)!!ĵĵĵ !(¥1ŅĵĵŅ !0 ķ+!!1ĵ1!!!¥A1ŅĵĵŅA¥ !0 1) !)¥1ŅŅĵĵĵŅr !(2 !,Ħ! 1' !&¥AŅŅĵĵĵŅA¥!!1ĵ1!!!2 !,ķķ!!1!!ė÷!!ŅĵĵĵŅA¥ !'ĵĵĵ!!!2 !7ŅŅA¥ !*1ĵ1!!!2 !I2 !,ķķ !+ķ3ķ !+æ##!!!2 !,ķķ !+333 !(æķ#33#!!!2 !*ė c.SØ¸ÇÇÇC§¸ÈØØÈ§CÇÇÇ2 !*ĶA222 B( Q'ĕBRRcccRĦ Q(ĔÅ !)Ķ! ķ+!!æħ##333#ħæ!!ķ3ķ!!!ąą !)Ķ !'ķ !(#333#ħæ !'333!!!ąĶ !)Ķ! ķ+!!##ħæ !*ķ3ķ!!!ąĶ !)Ķ! ķ+ !6ĕĶ !)Ķ !&¥QQAA1 !6ĕĶ !,A 1) !6ĕ !*QĆĥĕĕĵĆĆĕ Ć' Å3ĕ !*2ħĶĶĶ Ħ& ė8#Ç !)2!!QQA 1' !6Cd !)2 !(¥QA1 !6C2 !)2 !@C2 !)2! 1+ !632 !)2!111õĶ!ħħķ !632 !+¥222 !;3 !,Ķ!!ĦArķ !83 !311 !6C !,1ĦĦĶ !;2 !1æėħķ !62 !, 1+ !62 !02Bķķķ !62 !,tB22ĶĦ111 !62 !,õĦĶĶ2cķķķ !62 !0ĶĆ111 !62 !T ķ+ !BA 1&AQ !72 !,2 !(2B !62 !.cķħėQ11 !62 !,ĕĦĶĶ !&2 !62 !,ķc2!ĶĆ1Ar !62 !, ķ+ !62 !, ķ+ !62 !I2 !-ħ ķ&ħė !@ėcC S(C3ccc Ç3 !+ĶA22ĖQQQ!BB Q6ĔÅ !)Ķ!ė ķ)ħ !6ąą !,÷ħ ķ&ħ÷ !Ďddd !AĶ !mĶ !@ąĶ !)Ķ !@ąĶ !)Ķ !@ąĶ !)Ķ !@ąĶ !)Ķ !@ĕĶ !)A Ć, Å6ĕĶ !* ħ' ė;#· !H2S !H2 !I2 !I2 !*2 !@2 !*2 !I2 !A2 !)2 !@32 !)2 !@32 !)2 !@32 !)2 !@32ą !(2 !@32ą !G32ą !G32ą !G3!ą !Ią !Ią !Ią !Ņ !Ņ !Ľ2 !I2 !I2 !I2 !I2 !I2 !I2 !I2 !Ņ !:2 !I2 !I2 !*ė c, Ç62 !)ĦW ©5 E-øè !(*Ë ú@fU× !'*Ë ú@fU× !'*Ë ú@fU× !'*Ë ú@UU× !'*Ë ú@UU× !'*Ë ú@UU× !'*ú º, U8× !'J s6 ×0!!",
);
// }
// HUD (Numbers) {
rawImages.push(
  "#2 ë* !-QŅ ĵ(ĦR 3'cĶĆ ĵ'ĆĶ2c333c2!ĶĆĵĵĵĆĶ!!!c332!!Rcė!!#¥cĦĆĵQ!!öĆĶ!!ĆĵĵĶ !&23332!!!ĶĵĵĵĶ!!2c 3&2!ĶĆ ĵ&Ķ2c3",
);
rawImages.push("#2 ë* !<QŅ ĵ(ĆĶ !&332 !'ĵĵĶ !'33 !(ĵĵ !( 3* !J");
rawImages.push(
  "#2 ë* !,QŅĵŅ !&ė#3s1ĵ!!ŅĵŅ!ķ3!!#¥2æĵĵ!!ĵæB333!rB!Ćĵĵĵ!÷Ħ!2c3¥1ĵ !&ĵæķ3!!ĶĖ2!ĵĵ!2c#Ķ!33cĶĆĵ!!ĵŅ!333!!3#ėQĵĵ!2Q!!ė33!Ķ",
);
rawImages.push(
  "!2ë !)ë !)ë!AĦĶ2#!ë !&ŅRėë!ŅĶBķ!Aë!!!ŅĶ!cë!ĵ!¥÷QĆêRė!!1Ħ2ë!ĵ!c!ĖĶÚBBė!!ĵ!ë!ĵ !&3Ú !'2#ë!QĆ!!cėĚĆ !&3!ë !)ëQĆ!!3!!",
);
rawImages.push(
  "#2 ë* !2rAŅĵ !&÷ħs¥QAŅŅĵĵææėħ##33!! ĵ&Ņ1c! 3&#ķĆ!ĵŅ1Q!!3!3#ķė!!ĵBr!!Ņĵĵ!ĦæĵĵĶ 3(2! ĵ(Ķ! 3*!!!ĵ !&",
);
rawImages.push(
  "#2 ë* !0Q1Ņĵ!!!ĵĆB#3ĵĵĵ!!Ćĵr33 !&3÷ĵŅBBc!1!3#ķBĆ!ķ!ĵĵ!ėB!ŅQ33!!B!#ėĵĵ!!Ė!ĵĵ!!ĵĵĶB33!!332Ħĵĵ!!ĵĵ2333!!332Ņĵĵ!!1!ħ#",
);
rawImages.push(
  "#2 ë* !.r1ŅŅĵĵŅŅĖķ##33#!Ħ ĵ(Ķ!2 3&2!ĶĶ ĵ&Ķ!!!2333BR¥¥#ĵA!ķħĖæĵ!ħ!!!ħ3!!ĵ Ņ&ĵ!33 #&3B ĵ)ķ 3)!1Ņ ĵ&!!ķ",
);
rawImages.push(
  "!2ë !)ë !)ë!ĵ!3!!!ë !)ë!ĵ!3!!!ë¥!õĶ!Ķ!ë!ĵ!3!!¥ĊĦĶ !'ë!ĵ!3!¥åÚ !)ë!ĵ!·!åĶÚ !)ë!ĵ !&2Ċ2ė !'ë!AĖ!2Rėë !)",
);
rawImages.push(
  "#2 ë* !.ĵĵĵA!!ĵĵ!2cħ!!3!!ĶĆĵAĵĵ !&cħ3!222!ĆĵĵRB!Ķ!B3!Ė!#3RĦĵ23ħ!ŅĖ!3ĶĵĵŅ!!!ĵ!22 !&3R Ķ&!3ĵĖ !(33R!!!3!!ĵĖ!!!A!",
);
rawImages.push(
  "#2 ë* !. ĵ&Ņ1!! 3&#ķ! ĵ)1 3)Ħĵ Ņ&ĵĵ!3 #&3!!ĵAr!!A!3¥RĖŅĵħ3ĵææĖĶ!ĵĵ !(3332 !&ĵĵĵĶ22B¥ 3&B!ĶæĵŅŅ1R##3",
);
// }
// HUD (Weapons) {
rawImages.push(
  "#: ëR !,ÐR !8ÐÐR !8}ÐR !8}ÐR !8}· !9}R !8;· !9t !9; !9+R !9· !9t !9; !9+ !·¼ !Ĳ Ð& !(ÐÐÐ !-ÐÐÐ !)ÐÐÐ !- ¼& !' ¼& !- ¼& !' ¼& !üÐ !9Ð !'· !3ì !'Ð !3¼¼ìĭ!!; !3Ė ¼( !5ĖÕ¼¼¼ !A",
);
rawImages.push(
  "#: ëR ![ÐÐÐ !7ÐÐÐ !5ÐÐ !8ÐÐ !8¼ !9¼¼ !9¼ !Ņ !FÐs !8ÐÐ·B !2Ð !&]Ð· !2Ð !&¼;° !7¼!; !7Ð !9Ðü !Qm!Ðs !/Ð !* Ð'·s !*Ð !+] Ð&· !)Ð !0;] !)Ð !1; !A¼ !9¼ !:¼ !9¼ !'¼¼¼Čĭ !&ĭ !0 ¼(ČĭĭČ !+¼Č!!Č!!!öÕ ¼&Õ !+ ¼' !(öÕÕö !,ö¼¼ö !±",
);
rawImages.push(
  "#: ëAQQQ ë0 !)ÐÐÐ !5ÐÐ !9Ð !8¼¼ !9¼ !=Ð !9Ð !j¼ !9¼ !~Ð!!!Ð !5Ð!!!Ð !RR !9Ð !9} !(ÐÐ !2 Ð* !2 Ð( !±Ð !) ¼' !-Ð !) ¼) !8¼¼ !KÐÐR !8RÐ !7¼!} !7Ð !1¼ !)Ð !1¼ !*}!ÐÐÐR !6 Ð& !9} !|Üĭ !8¼¼Üĭ!!ì !, ¼)ĦÕ ¼' !, ¼)!!ĦÕ¼¼Ė !>",
);
rawImages.push(
  "#: ë'QQëQQQëQQ ë1QQëQQQëQQ ë, !&Ð!!Ð!!!Ð!!Ð !/Ð!!Ð!!!Ð!!Ð !/¼!!¼!!!¼!!¼ !/¼!!¼!!!¼!!¼ !ēÐ!!Ð!!!Ð!!Ð !/Ð!!Ð!!!Ð!!Ð !G¼!!¼!!!¼!!¼ !'BÐÐ !6BÐÐÐ !'Ð!!Ð!!!Ð!!Ð!!BsÐ° !(Ð !- Ð&° !)Ð !-ÐÐ°] !íĭĝÜ !4 ¼* !2¼¼¼ÕåĦ¼¼ !J¦ !9Ð !9K !8¼ !9¼ !9Ð !9¦ !;Ð¦BB¦Ð !2K! Ð( !'ĝ !/K°°K !(Ü !9å !9Ħ !:ĝ !)ĝÜĝ !/Üĝ !'ĝÜ¼¼¼Üĝ!!!¼ !(å ¼)åĦå ¼)!!",
);
// }
// HUD (Keys) {
rawImages.push(
  "#2 Ċ'ĚĚĚ 2'!!ėĶ ė(!ħ !(cA !(Ćħ !(cA !(Ćħ !(cA !(Ćħ !(cA !(Ćħ !(ÇQ !(Åė !(Ç! c(ąc d)",
);
rawImages.push(
  "!2Ċ !&2!!Ě !(ėĊħ!!ĊéÓ.ë!!Ī>Ī>cĊħ!Ċĉ£èĤë!!»Ñ»ÑcĊħ!¬Ä=īÈ}ø¢é¢éßcĊħ!ĺéRĖĶo !'|cĊħ!íĄ$Baë !(ÇĚė!čń!!^ë !(Çëc !(īd !(",
);
rawImages.push(
  "!2Ċ !&2!!Ě !(ėĊħ!!ÁBĦËë!!Ñ»Ñ»cĊħ!áRRæ!ë!!ñxñxcĊħ!ÁĆċ¿$æÆí|óvËcĊħ!ÁRÖ¶ĖÆ !'GcĊħ!ġæBĦ¥ë !(ÇĚė!^ĆBĆGë !(Çëc !(īd !(",
);
// }
// Get Pysched {
rawImages.push(
  "!Ræ !(B !1B !0C !+åÕ !P·Õ !P·Õ!tcdP !K·Õ!×dsĤ !;Q !1·Õ!ĘP !M·Õ !P·Õ !P·Õ !P·Õ !0Q !A·Õ !,ÙĤĶĦĦ!cå !>·Õ !*ÙÖÅĖ!ĶĶĄ!Çµ !=·Õ !)ÙQõĖĶĶ!ĶĶ!ĶR¶µ !;·Õ !(ÙĆ@Ė!ĶĶ!ĶcĨ!ĔB¶µ !:æÕ !'ÙQõĦĶ!ĶĶ!ĥ!!!U!ē !;·Õ !&ÙöPĶĶĶ!ĶĶsÕ !A·Õ !&ÙQå!ĶĶ!ĶæR¶BB!CR!õ!Ħ!ĦĶ!2öĥ !1·Õ!!!ÙQõĶ!ĶĶ!ĶĶ!ĶĶĶRcå!!ÙĦöĦĦą1Ćöcå !/·Õ!!!Ù1ĕĶ!ĶĶ!ĶĶ!ĶĶĶĦb3ĥ!ÙĦöĦĦąĶĶçĥBÕ !.·Õ!!!UrĵĶ!ĶĶ!ĶĶ!ĶĶĶĦb3ĥ!ÙĦöĦĦą Ķ&Qµ !.·Õ!!!È÷aĶ!ĶĶ!ĶĶ!ĶĶĶĦb3ħńÙĦöĦĦą Ķ&Qµ !.·Õ!!È2#ĤĶ!ĶĶ!ĶĶ!ĶĶĶĦb3¶µĉööĦĦą Ķ&Qµ !.·Õ!!!tą¦Ķ!ĶĶ!ĶĶ!ĶĶĶĦb3¶µĉööĦĦą Ķ&Qµ !.·Õ !&tą¦ĶĶĶ!s÷2×2BR3RR!£!ć!Ķ¥ Ķ&Qµ !.·Õ !'CsĶĶĶ!RÕ !/CÇ Ķ&Qµ !.·Õ !'C¶ĖĶĶ!Bå !&·ctÕµ !&CÇ Ķ&Ņå !.·Õ !'ķæĖĶĶ!Bå !&ħQ¦ÕCÖr!CĵØ Ķ&Ņå !.·Õ !'#ööĶĶ!Bsr!!·¶Q3ĥ×Öĥ!2Ç3 Ķ&ĵõ !.æÕ !'#ööĶĶ!BRµ!!SöQ3ĥ×ÅĶ×ös3 Ķ&ĵõ !.·Õ !'ķħÕĶĶ!ĶRRµ×ÖĆQ3#Õ!!öRuą Ķ&ĕĕ !.·Õ !'SĖ¥ĶĶ!ĶĶcå·öĆĶsĥ!!¹öĦĦą Ķ&åŅ !.·Õ !'×ÅķsĶ!ĶĶBą!·öĖRĥ!ÙĦöĦĦąĶĶĶÕ1Ķ !.·Õ !(×ÅdĶ!ĶĶ!ĥ!!·ö!ĥ!ÙĦöĦĦąĶĶR1Çµ !.·Õ !)CRĶ!ĶĶ!ĥ!!×ĆĖ÷PÙĦöĦĦąĶĶÔ3ĥ !/·Õ !)·Öc!ĶĶ!ĥ!!$µö¶µùĆöĦĦąĶĶÔĶ !0·Õ !*2#RĶĶ!ĥ!!!×æĶ÷Pù¶ĦĦąĶÅ2ĥ !0·Õ !*×¶1!!3ĥ!!!$Aĵ3!!!ĶĦA!ķŅ !1·Õ !-3ĦAQ !A·Õ !P·Õ !2U£!!ĆĶĆĦ B&2B!µ !0·Õ !2Øąc!dąöĦRcdP!ĘąBr !/·Õ !1UńĖ!Ķ2Ņ!!ÉĦĖĖĦąĶŅBr !.æÕ !1tĆĶ!ĶĶ!A!ÉĦĖĖĦąĶ´×µ !.·Õ !0×!ÆĶ!ĶĶQĶ!ÉĦĖĖĦąĶŅĆõ !.·Õ !0×æĦĶ!ĶĶQĸńÉĦĖĖĦąĶA¶ĥ !.·Õ !0¦ĆĶĶ!ĶĶQÇµÉĦĖĖĦąĶŅÖĥ !.·Õ !/tĖ!ĶĶ!Ņ !'U!£§õćĦAµ !.·Õ !/dĦ!ĶĶ!Ņ×!ÖĵERPÅ3ÇĶĖrr !.·Õ !/ķR!ĶĶ!ĶĶsĕ!¹ôĥ!2ØĶĖæ!ń !-·Õ !/×Å3ĶĶ!ĶĶBŅ!C÷P!#çĶĦöĦń !-·Õ !0×¥BĶ!ĶĶQĶ¦·P!!ttĶĦöĦń !-·Õ !0Q×Åķ!ĶĶQÇdP!!×!3ĶŅĆ÷ń !-·Õ !2×Åħ!Ķ¶ÇP!!!SBĖ!Rõ !/·Õ !P·Õ !1×Æĵ !.×dP !/·Õ !0UĴĶĵDĦÕĦĦĶ22RBtB¶ĥÕ !/æÕ !/ØÕ!Ķ!ĶĶASąĘ÷ĦĖĦĦąĦąėĤ !.·Õ !.UńĶ!Ķ!ĶĶĶQĶ!ÉĦĖĦĦąĦĦÖń !.·Õ !-Uń!Ķ!Ķ!ĶĶĶQĸńÉĦĖĦĦąĦĦĵsr !-·Õ !,vĴĶ!Ķ!Ķ!ĶĶĶQ¦ÕÉĦĖĦĦąĦĦåså !-·Õ !*UPÆ!Q!!3Ķĵ!!ĘĥÆĦ2R!ĶöBćÕÖr !.·Õ !*tĖ Ķ&Q3Ķĵ×!ĖĶ!Ķ!2B!åħ¶Rµ !/·Õ !0ħcĥ×µ !,ķ1 !1·Õ !0C¶!µ !>·Õ !P·Õ !0Q !A·Õ !P·Õ !P·Õ !P·Õ !PæÕ !P·Õ !P·Õ !P×µ !P×µ !@Q !1×µ !-ÙĤĶĦĦ!cå !=×µ !+ÙÖÅĖ!ĶĶĄ!Çµ !<×µ !*ÙQõĆĶ!!ĶĶ!ĶR¶µ !:×µ !)ÙĆ@ĖĶĶ!!Ķc¦!rB¶µ !9×µ !(ÙQõĖ!ĶĶ!sĥ!!!U!ē !*·Õ !0×µ !'fÅõĶĦ!ĶĶ!!ĥ !/·¦!P !/×µ !'ęä!ĦĶ!ĶĶ!sBB!CR!õ!Ħ!ĦĶ!!2SĵdP !.×µ !'èĕĶĶĶ!ĶĶ!ĶĶĶRcå!!ÙĦĦĖĶĶĶąĶĦĕėĤ !-×µ !&¹rõĶĶĶ!ĶĶ!ĶĶĶĦR¶Õ!ÙĦĦĖĶĶĶąĶĦąsµ !-Ćµ !&fÅõĶĶĶ!ĶĶ!ĶĶĶĦb3ĥ!ÙĦĦĖĶĶĶąĶĦĶĵå !-×µ !&èą2ĶĶĶ!ĶĶ!ĶĶĶĦb3ħńÙĦĦĖĶĶĶąĶĦĶĕćń !,×µ!!!¨bĕ!ĶĶĶ!ĶĶ!ĶĶĶĦb3¶µÙĦĦĖĶĶĶąĶĦĶõ¶µ !,×µ!!!èĵĦ!ĶĶĶ!ĶĶ!ĶĶĶĦb3¶µ!¹ĦĖĶĶĶąĶĦĶätå !,×µ!!·#AĦ!ĶĶĆĦ!t222BR3RR!¥ĦĦĖ@!öAėĦåcå !-×µ!!¸ĵRĦ!ĶĶæ1 !,ĹæĦĦĖ´Ė!Ö÷Å¶µ !.×µ!!¸ĵRĦ!ĶĶæ1 !,ĹæĦĦĖ´µ!ķR¶µ !/×µ!!#csĦ!ĶĶĶö¶å !(ĘS¶BĦĦĖõ!P×!µ !0×µ!!ķAÇĦ!ĶĶĶ!ĶæR¶BB!CR!B·ĦĦĖ¶bP !3×µ!!×Öĵ¦!ĶĶĶ!ĶĶ!cĶĶRcå!!ÙĦĦĖ¶@r !3×µ!!!×¥A¦ĶĶĶ!ĶĶ!ĶĶĶĦR¶Õ!ÙĦĦĖ¶@r !3×µ !&×öĕtĶĶ!ĶĶ!ĶĶĶĦb3ĥ!ÙĦĦcĤ¦P !3×µ !'×¥AdĶ!ĶĶ!ĶĶĶĦb3ħńÙĦBbą·ń !3×µ !(×ÖĵS!ĶĶ!ĶĶĶĦb3¶µĉö¤åÕ !5Ćµ !)ĘrB!ĶĶ!ĶĶĶĦb3¶µĉ1åÕ !6×µ !*ĘåÆ!t222BR3RR!åąµ !7×µ !P×µ !1fÖĕ2Ç£ĆĖÖr !7×µ !1ØõĆ!ĶRĥ!Cħń!!÷§ćĥÕ !/×µ !1×ÆĶ!ĶĶ¥ą!dą!÷eõĶAr !/×µ !1×ÆĶ!ĶĶcĥ!÷tń×§õĶA·Ĥ !.×µ !0UĴĶĶ!ĶĶcĥ!É0µdøõĶĶÄ !/×µ !0UĴĶĶ!ĶĶcĥ!É0µdøõĶĶĕõ !.×µ !/vĆÖĶĶ!ĶĶcĥ!ÉĖasö3ĶĶõĕ !.×µ !/×Ö!ĶĵU£µCĥ!ÉĖĦĖĶõĶÕĥ !/×µ !/2ħRĶĶŅ×µCĥ!ÉĖĦĖĶõĶŅµ !/×µ !/Cĵ3ĶĶŅ!×¥æÁ½ĖĦĖĶõõõ !0×µ !/Cĵ3ĶĶŅ!×¥æÁ½ĖĦĖĶõõõ !0Ćµ !023ĶĶ÷q!C!ĥÉĖĦĖĶÄBµ !0×µ !0C!ĶÇ´!!×Ö!sĨĦĖĶÄcr !0×µ !/dö2Öµ !'·ĖĦ!!ĦBħń !0×µ !/·Ėsµ !?×µ !@Q !1×µ !1ØRa !-·Ķå !0×µ !0ę£ĦD!!!£öCRÕ!·!Ņöą !0×µ !.éĖĴö!ĶĶĶRÆµéĆĶĆĶĦąÕ¥µ !/×µ !.é!ÄĶ!ĶĶĦbSąéĆĶĆĶĦąĦ1×Ĥ!!!$õtń !'÷r !/2BB!ĶĶĶQ3ĥéĆĶĆĶĦąĦąsµ!!×ös!µ !'÷r !/Cĵ#!ĶĶĶQ3ĥéĆĶĆĶĦąĦĕĶą×!÷BQµ !(÷r !/×sR!ĶĶĶQ!ĈP¨ĶĆĶĦąĦĕc!!ėĦBä !)÷r !0×#!ç!!!å!!!ąÈĶĦ´ėĤ!×ėĦ!Bä !)÷r !1ØRa !'ĘÅĦĨĶĦô!µ!×ėĦ!!Ą !)Ħr !/¹ĆĤ!cĨ£!×µ!!ĈĆĶĦô!×ĤddĆ!!#RÓ !'÷r !.é!ÄĶ!ĶĶĦbSąéĆĶĆĶĦąĦĥ2×ńÈĆ!Ĕħ1 !'÷r !.éĔöĶ!ĶĶĶQ3ĥéĆĶĆĶĦąĦĦ!ĶĶ!!!ą·Ô !'÷r !/ħQ#!ĶĶĶQ3ĥéĆĶĆĶĦąĦĦ!ĶĶ!!ĥĥ !)÷r !/Cĵ#!ĶĶĶQ3ĥéĆĶĆĶĦą÷ĶĶĶ!Ķĕ×£ !)÷r !0CĶD¤!!Ņ!!dÇaĖĖøąĦĶĶĶ!Ķç? !*÷r !1Øçē !+·¶ÖĖ!2BB!Ĉó !*÷r !1Uē !-÷æ!2!2!Bµ !+÷r !P÷r !0Q!U¤ąÇ!ÅĶĦR¥CP!ĘąBr !/÷r !1U¤µ!Ķ2Ņ!éĦĖĦĖĦąĶŅBr !.÷r !1t2æ!ĶĶ¥ąéĦĖĦĖĦąĶA!r !.÷r !1×æĖ!ĶĶcĥéĦĖĦĖĦąĶŅBr !.÷r !0ĘåæĶ!ĶĶcħćĆĖĦĖĦąĶA!r !.Ħr !0·ĖĖĶ!ĶĶc¶èsĖĦĖĦąĶŅBr !.÷r !/ĘąÖĶĶ!Ņ!!!$!ĖĥĦ§õĶĶQr !.÷r !/×ĆĖĶĶ!è¢÷ĦĖĶĦĶĵ3ÇĶĦbr !.÷r !/×ÅħBĶ!¥Ęē !'·åØĶĦÖ!ń !-÷r !0CĖ!2!RĨĳ !(#çćĦöĦń !-÷r !12!ķ!!ća !(ttĶĶæĦń !-÷r !12#Ķ!÷q !(×!3ĶŅ!·ń !-÷r !1CĶĶDģ !)SB22cr !/÷r !1ķ¶Rµ !*×!·ń !1÷r !0Q !A÷r !*Ø2BSc!ĖôĦ !'B!tBĦ!Ė!Ė£ĘP !.÷r !)Øĕ!Ķ!ĶĶ!!ĶĶĶ!1ćQ!éĦĖĦĖĶõĶŅµ !.÷r !)#¥!Ķ!ĶĶ!!ĶĶĶ!ĶĦÖåéĦĖĦĖĶõĶĶsP !-÷r !(×¶¥!Ķ!ĶĶ!!ĶĶĶ!ĶĶQĶéĦĖĦĖĶõĶĶĕõ !-Ħr !(#cB!ĶĶ!Ķ!Ķ!ĶĶ!ĶĶQĈėĦĖĦĖĶõĶ2ąå !-÷r !'#cRĶ!ĶĶ!Ķ!Ķ!ĶĶ!ĶĶQSą!vĦĖĶõĶĕå !.ĘP !&tą¦!ĶĦĕ!!ėB!B2B2ÖĶBsĖĦĦBBĦçąå !/ĘP !&2SR!Ķ!ĸó !)döĶ¶cdP!!!×ĦBµ !/ĘP !'C!sĶ!øĳ !&×!öĆĶc¥dRń !&ĆĦ×ń !.ĘP !(CsĦĖuÓ!!×!öĖĶ!c¶r!DĦĖ!ĥĦ!31r !.ĘP !(tBöÇ£!!!CRĖĶĶ!Ķ2Ņ!éĦĖĦĖĶõĶc!P !-ĘP !'ķtB3Ó !&ķA3ĶĶ!ĶĶcĥéĦĖĦĖĶõĶ2¥ń !-ĘP !0×¥RĶĶ!ĶĶcħćĆĖĦĖĶõĶĶĕõ !-ĘP !0QC!ĶĶ!ĶĶc¶µÉĖĦĖĶõĶ2ąå !-ĘP !1×¥BĘs¤!ç!ē!×ĦöĖ÷Ķĕå !.ĘP !2ķÆÕ !-×ĦÕ !/ĘP !PĘP !2U£!!ĆĶĆĦ B&2B!µ !0#P !2Øąc!dąöĦRcdP!ĘąBr !/ĘP !1UńĖ!Ķ2Ņ!!ÉĦĖĖĦąĶŅBr !.ĘP !1tĆĶ!ĶĶ!A!ÉĦĖĖĦąĶ´×µ !.ĘP !0×!ÆĶ!ĶĶQĶ!ÉĦĖĖĦąĶŅĆõ !.ĘP !0×æĦĶ!ĶĶQĸńÉĦĖĖĦąćA¶ĥ !.ĘP !0¦ĆĶĶ!ĶĶQÇµÉĦĖĖĦąĶŅÖĥ !.ĘP !/tĖ!ĶĶ!Ņ !'U!£§õĶĦAµ !.ĘP !/dĦ!ĶĶ!Ņ×!ÖĵERPÅ3ÇĶĖrr !.ĘP !/ķR!ĶĶ!ĶĶsĕ!¹ôĥ!2ØĶĖæ!ń !-ĘP !/×b3ĶĶ!ĶĶBŅ!C÷P!#çĶĦöĦń !-ĘP !0×¥BĶ!ĶĶQĶ¦·P!!ttĶĦöĦń !-ĘP !1×Åķ!ĶĶQÇdP!!×!3ĶŅĆ÷ń !-ĘP !2×Åħ!Ķ¶ÇP!!!SBĖ!Rõ !/ĘP !P#P !3UöĶĕĦĶ!Ķą!2B2RdP !/$ń !3UĔ!Ķ2Ņ!éĦĖĶĆĦąõėĤ !.$ń !2UPæ!ĶĶcĥéĦĖĶĆĦąĦ1×Ĥ !-$ń !2¦ĦĆ!ĶĶcĥéĦĖĶĆĦąĦ1dP !-$ń !0×µCĶĶ!ĶĶcĥéĦĖĶĆĦėĦsąµ !-$ń !0#ŅCĶĶ!ĶĶQdõÉĖĶĆĦąĦÆÕµ !-$ń !0ħÖöĶÆ!dsöĥÖĶĖR2BçÆærÕ !-$ń !02CĶĶD¤Ņµ !'×ÖħæĦÄ¦å !-$ń !0Cĵ3ĶĶT£µDĦõĦBCSĦąĦæQõ !-$ń !*Ø2BSc!ĆÅ3ĶĶ!Ķ2ö!ĸĦĖĦĖĦąĦÆbą !-$ń !)Cc!ĶĶ!Ķ!Ķ!ĶĶ!ĶĶcĥéĦĖĶĆĦąĶÕĥ !.$ń !)#¥!Ķ!ĶĶ!!ĶĶĶ!ĶĶcĥéĦĖĶĆĦąĶąõ !.$ń !(×sÆ!Ķ!ĶĶ!!ĶĶĶ!ĶĶ21éĦĖĦĖĦąĶõ¶r !-$ń !(2CR!Ķ!ĶĶ!!ĶĶĶ!ĶĶQĈėĦĖĦĖĦąĶĥ!Õ !-Sń !'tą¦Ķ!ĶĶ!Ķ!Ķ!ĶĶ!ĶĶQ3ĥÉĖĦĖĦąĶĥ!Õ !-$ń !&tą¦!Ķå2!!ėB!B2B2!ĶĦĶĦĶĦbÇuąĶąBÕ !-$ń !&CĵdBĶ!ĸó !1t¥TąĶĕsr !-$ń !'C!sĶ!øĳ !1¦èĦąąĆĥ !.$ń !(CsĦĖuÓ !0÷t#Ôscå !/$ń !(tBöÇ£ !1÷ĦĖĶ2å !0$ń !'ķtB3Ó !F$ń !P$ń !'ØB!!2tBĦĶ´B !'BCP!!!$!õ!tń !/$ń !&CĆ¥!!!B2cCSBĤ !)$ń!·cC!ĥtń !.$ń !&ķ¶!!!ĶĶ!Ķ!Ķ!ĶĶĶ!Rĥ!!¨µP·d!Ķ1Ħ·ń !-$ń !&2t!!!ĶĶ!Ķ!Ķ!ĶĶĶ!A3ĥ!¨µP·d!ĶĶĥÕ !.$ń !&¦Ćc!Ķ!Ķ!Ķ!Ķ!ĶĶĶ!A3ĥ!¨Ķó÷ĆdĶĶĦĵå !-$ń !'23cĶ!Ķ!Ķ!Ķ!ĶĶĶ!Aħ1!¨ĶÅ!åB3ĶĦĵsr !,Sń !'¦õt!ĶĶ!Ķ!Ķ!ĶĶĶ!A!ĈP¨Ķa·ĖĥĆCĦ!ĵsr !+$ń !(¦ö!Ņ!!ėBB!B2BĶĦĶ222R!µ!Ę!ĥ!!!r !,$ń !P$ń !P$ń !@Q !1$ń !P$ń !P$ń !P$ń !P$ń!tcdP !+Q !A$ń!×dsĤ !K$ń!Ęs!Ĥ !K$ń !P$ń !P",
);
// }
// End Screen BJ {
rawImages.push(
  "!{| !¬| !¬| !¬| !¬| !¬| !¬| !¬| !¬| !¬| !¬| !¬| !¬| !¬| !¬| !¬| !¬| !¤Ĝ !)Q !kT !'ľĜ !9Q !a<Ĭ !IQ !P<Ĭ !UD!!ĤQDĤ!D!!Ĥ !9<Ĭ !SD!!!Ĥ!$ńDös !'Ĥ !'Q !0<Ĭ !QTĶ!!!Ĥ!$Bö!!!s !'Ĥ !5<Q !PT!!Ķ!Ĥ!$!Ėå¦P!D !)Ĥ !3<Ĭ !1Q !@TĶ!!!ĤDĦBr¦PD!!Ĥ !:<Ĭ !AQ !/T!ĶĦBĤ!Dösr÷ĦB!!Ħ !&B!!Ĥ !2<Ĭ !LTĔT!!tĦB!ĤDösÕ!·!Ħ!!!B !'Ĥ !2<Ĭ !JT!Ĕ!T!!Ė!BĤD!öÕsCR!!!B!t !(Ĥ !1<Ĭ !IT!!ĔT!!ĶĦ!B!Ĥ!¦s!!!Cs !,Ĥ !*Q !(<Ĭ !HT!!ĔT!!Ķ!Ħ!BĤDb!2B·B !.Ĥ !1<Ĭ !)Q !?T!!!ĔT!!ĶĤ$!!!õö!!2ctB !+ĦBĤ !1<Ĭ !9Q !.T!!!Ĕ!T!Ķ!ĤDĦ!¤!s!!CR!!!B !)ĦBĤ !1<Ĭ !ET!!!¦ĔT!Ķ!ĦBĤDĦ¤st !*B!!ĦB!!ĦBĤ !1<Ĭ !ET!!!Ĕ!T!Ķ!Ħ!!ń¦s!!C!S !'B!!ös!Ħ!B!Ĥ !0<Ĭ !DT !&Ĕ!TĶ!Ħ!!!¤s!·!!Ħ !)ĖRĖsös!!ĤQ !0<Ĭ !DT !&Ĕ!D!Ħ!!B<!!Ċ!!D!!Ħ!ĖR!!ĖądsÕrD!Ĥ !1<Q !DT !&Ĕ!D!Ħ!]!!Ė!2B!Ċ!D!ĦĖRBöĥĦ!dĥ·Ħń !2,ļ !1Q !3T !(Ĕ!D<Ħ!!B!ĖĶ!cĖĺ!!Dös!öĥĦĖs!tń !3,ļ !AQ!T !)Ĕ_ĦĖ!!!BRĖĶBBĖRĊ!Ę!!!ąĖ!stń !4,ļ !BT !)ĠĖ!!BBĖ=!B!!ĶcĖR!Ċ×Ė·ą!Ėsr !6,ļ !BTĶ !'İĖ !'cĖĥĶCRĶ!cĖR!xĖRĖ!Ćµ !7,ļ !<D !.Ā!!õ!t!!BĶåt!!!B2!RG!!RdP !1Q !(,ļ !0÷!· !/ö!!s!!Ĥ!!Ģ!RRĵ÷!!!RAÖCRĖB!2RĊ !=,ļ !)Q !'÷t!õt !/Õ!·!!ń$ĖR!]ĆQ÷õt!RA¥RC!B!2RĊ !<DĞ( !.Ęąµ!×d !'# !)Õ!·!!P$Õ!dPłQ¥æ÷!¥ĵ!ÖC!B!BBĊ !;DĦľ( !/¦ç!ÕĶ2!2!2 !*æ!¥!!r÷öÖRµłQsö¥t¥ræ¥RCB!BĪ !;DĦĖJ( !0¦RĖ!2 !(B !&Ć!!c!!µ!!M!÷FÑĶö¥t¥ræ¥RCBMBĪ!DĤ !7DĦĖ!J( !<·!Ķ!Ķ!!B !'LÖ¥»Ģõ÷!!ĆÕæ!Æ2d2ĺ÷!CsĤ !+Q !+DĦĖ!!J( !BTæ !(ď!!Í!Ā!!!õæ!¥Rdûö!R!dP !4DĤDĦ!!ľQ !AT !+Ķ!!ĀÅĖ!¥æ!!¥Rļö!!!R!d!P !3DĤD!Ħľ( !1Q !1T !+ĶĦB[Ė !(¥RüĖB!!!RBCsĤ !3DĤD!Ğ( !3.ĖB2ądĦ6 !(¦ !+Ė !'ďĆæ!ÆSěÖ!!s!Ė!RBCsĤ !3DĤĘJ( !($,!2 !)Ė!Ķ!ĵC!RĪ !&T !&Ķ!!2!!Ė !'S!B!!Ĥ¦Ħ!!B!!!R!BCsĤ !1DĤDÕl( !'đ!!3!!B2!2 !&ĶĖ !&BB !)( !&2!Ė !*B!Ĥ¦Ħ!!!BRĖ!RĦtĖP !0DĤDöĥl( !&łÉ!!o!3!B!!Ħ!ĵĶĶS!ĕ!!!S!!!BB!!!(!!!2!Ė !+BĤ¦Ħ !&BR!Ės!tń !.Q!!D!ÕĦlH !&ÅĖ!Ro!!3BĦĥĦ2S!28Ġą!ĶBB !'Sc!!Ĭ!ĦB2Ė !+BĤ¦ĶĶ !&RBBĦB!tń !'DĤ !)$ĖĥĦlH!!!ĘÃ!!ÄR!o3BĦĥĖĖ!s½Ħµ]ĖĶc!B!Ć!BB3c!(!Ħ!RĖ !+BĤ÷æĶ !&B2BdąB!tń !&DĤ !(D!öĥĦlH!!!Ģ¹!!!R!o3BĦ!ĥĖĖ2ý!ÚHðĖ¥B!!Ħ!ĦBB3c(Ħ!!BĦ !+B!Ĥ·ĦĶ !&RBBCĥ!tBĤ!!!D!Ĥ !'DĦĖĥĦlH!!!ÅĖ !&2BoS!Ħ!ĕ2ĖR¬ĤĢåĖ¥BC!ĶĥĦĶBB3cĬ!S!Ķ !'2!!!B!Ĥ·!Ė !&B2Bd!!!Rń!!!DĤDĤ !&D!öĥĦlH!!!ÅĖ !'RNd2Ħ!ĵĦ2ö·iĐõ!2S2!û^ĕĦ!BBS(!ĖRĖ!!!22!2B!Ĥ!!÷æĦĶ2Ķ!!RBBCsĦĖsĤ!!!DĤ !'DĦĖĥĦlH!!!ÅĖ !'2BNd2Ħ!ĕ2¶Ö¬Đõ!dBĦ!û4JĆ2ĶBt(!ĖRĖĵ!Ķ23B!RĤD!!Ĥ÷æĶ!2Ķ!2c!ds!ösĤQ!DĤDĤ !'DöĥĦlH!!!ÅĖ !'2B!Nt!ĦõRÖ×HĠąĦĆ¶S!ÛT[õBĦBt(Ėĥtą!Ķ23!B!0DĦ!Ė!ĥĦĆĶ2!Ķ2c!!dsĦĖsĤ !+D!!Õ!KQ!!!ÅĖ !'2B !&_ĆcRæÇąĆ!ĦĦsdËelÕsĦ!t(ĖĥtąĶ23ĵS!ĶcĦ!ÕdRń×ĖĦ!2Ķ!2c!!dP$BĤ !,D!öĥKH!!!ÅĖ !'2¡23B-ĥĆcR¥×ąæ!!2R¦»ulµ¶ĦBdļĖĥCĥĦ2!t!ĕd!Õ!!µ$!µBĖĦ2!Ķ222BĦBµ !'DĤ !&DĤD!ÕKH!!!ÅĖ !'2¡C22ĦĥĆcÖs·µĖĖÕçs!ì§-µ¥ĦBt(õĦdą!ĦRtĕĶCą!öć!ń$õöRĖĦ2!!!BBĖRdP !'DĤ !&D!!ÕKH!!!ÅĖ !'2¡S!2ĦĥĦB¶Ö¬ÏæĶÖĦĶ!üuJÖcĶBt(õĦdąĦ!ÇĕĖĦC!µć!!ńDÕÖBĶĶ2!!!BBĆcd!P !&$BĤ !&DöĥKH!!!ÅĖ !'2odĶBĦ!ĥ!ö·iï¶ĖÆcĦ!ĬnĥöBBBS(õĆBĦ!sSå!Bd!Ħå×ńD!öĥÖ!!!2Æ!BĦĶsdsĤ !&$!BĤ!!D!öĥKH!!!ÅĖ !'2!oSB!!ĦąĖýĤāÆĖccc!Ğö{Ħ22BS(õĆBĦ!s!öcd!!RĦ!ńĘ!!!µ!2Ķ2!B!ĖRBdRBĤ !&$!tĤ!DĦĖ!*H!!!Ģ¹ !'2!B!NS!!ądiÚĻÖĖcs!!2ĮľĖsB3cĬµBĦ!!B!!¦!ĕ!b÷t!!!B!ÕÖ!2Ķ2Ķ!RB!BCRBĤ!!!$ĖRńDĦĖ!!*H!!!ĘÃ!!Ä!!2!B !'ĒĝĦbLĖĖcsRĦĦ!ĖsB3B(ĖåBĦĶ2BĦc2Ķ!r$Ė!ĥtB!ĤĘąö2Ķ!2c!!ĦBdRBĤ !&ĘRB!ĦĖ!RĞH !&r !'2!B !'Nd8ßæĿdRB!!!c2SB!!(ÕĖRĦĶ2BĖR!ĦBdĥĦös×!!ĤDµö!B!!2!!!cCRB!Ĥ!!!$ĖR!Ė!!sþH !&µĦ !&2!Ãĕö!!æ!2sĖå!dRB!!cBC22!HÕĦ!ĆĖ!2 !&B!dąösd!RĖ!PDA!!B!!2!!BdR!!ń!!!$ĖR!Ė!RBþH !&ĘãĦ!!!2B¢!ĕÖĆcsĖ!!Ė!BR¦ !&B!!HÕĦĖRĦĶ!2!!!BB2!3!ą!·SĶ!RrĖ!!2!!!B!BdR!!ń!!!$Ė !&sö*H !'ĘóĖ!2²32 !)õ!Ć¶dĺ !&$Ėĥ!!!öRBĆĶ!2!!BRS !&RĤ!!ĸ!RrĖRĦĶ!!2B!!×#R!ń!!!$!Ė!!!sö*H !3ĢąöĆÖĶRh !($Ėą!ĖRRĖĦĶ!2B!· !&ĶRĤ!D!ÕĦ¦r!!2!BĦ!B!!BBt!ń!!!$!ĖĥCRĖĥKQ !ADĦĖ!ĥ2ĆĶĶ!!RĦB!·!!!Ķ0DĦĖ!ą!¦rBĦ!222B!ĦB!BtBĤ!!!$!ĖĥCsöĥKH !1Q !2ĘĥĦ! Ķ&!2!2!B!dRBĤDĖ!Ħ!ą!¦rBĦ!!B2!!B!!!·!ń!!!$!õC!sÕ!KH !AQ$õĦ! Ķ&2!!!2!B·BĤDöĥ!ĦBĦ!¦rB·µ!!B!!R!!!Btń!!!$ĖĥCRĖĥĦlH !BDöą!ĶĦĶ!!!B!!!BSń$ĖąĖR!Ħ!Bdµ2c!ö2Ķ!2BB!!Btń!!!Ęĥ!CsÕ!Ħl{Ĕ !BĘą!ĶĦĶ!Ķ2B!cC!P×dĥö!RĦĶ!RBÖ!22Ö2Ħ!BB!!!Btń!!!ĘąBCsÕĦ!l{Ĕ !B$Õ!ĶĦĶ!!Ķ2!BcCąĦ!cö!RĖĦB!R!ö!22RĦB!ĦB!!Btń!!!×ĆB·öĥĆ!¯{Ĕ !BDµ!ĶĦĶ!!Ķ!!2¥CąĦ!cö!RĖĦ!B!RĖĦ !'2B!c!CP!!!ĘåBdsÕö!!¿{Ĕ !(Q !<÷Ħ!ĦĶĶ!Ķ!!BRĖ2!!cæ2!Ħ !&B!!Ħ !&2Bc!Ħ·ń!!!×Ės·öąĆ!Ķß{Ĕ !8Q !,$Õ!ĦĶĶ!Ķ!!s!ĖĶ2!Rö22Ħ !)BĦ!2!cBĦ!dP!!!ĘÕ2¦sÕö!Ħ!ß{Ĕ !CT!¤ĶĶÖĶ!Ķ!¶öĶĶ22Rö!BĦ !+2!cBĦĖR·ń!!!×ö¶·Ħµ!!ĖĶï{Ĕ !E÷ĦĦĶĶ!!Ķ¶æ!Ķ!B!Ħ!!!¶ !)2!BB!!!dRń!!×öRB·Õ!!ĖĦĶï{Ĕ !EDµ Ķ&!!cĖĶĶ!!BĦ !,2!B!!ĶR!dQ!!×ĖĶc·Ė!!!åĦĶß{Ĕ !FĘąĶĶĦ!!cĖĶĶ!!!BĦ !)2 !'c!!d!P!×Ė!!çń!!!ĘąĖĶÏ¦Ĕ !GĘĥĖĦĶ!cĦĦ!Ķ !,2!!Ķ!2!c!dP!D!µ!!·ń !'ĘąĦ¯{Ĕ !0Q !9÷ĦĶĦĶcĦĶĶĶ !+2Ķ!!!22R!dPD!!!Õtń !*Ę!*{Ĕ !@Q !)ĘĥĦ!ĖĶcĦĶ!Ķ !,BBĖ2BdP !5Ġ{Ĕ !IĘĥĦ!ĶĦĶĆĶ!Ķ!Ķ !&BRCąĦ¦P!!T!!!Ĕ !1Ġ{Ĕ !JĘĥĦ!Ķ !+RC!!ĥ!tńQ !8Ġ{Ĕ !K$Ė!ĥ !&Ė!!t!RBĤ !7Q !(Ġ{Ĕ !NĘ!R !(B!Ĥ !?Ġ{Ĕ !(Q !JD !(Ĥ !@Ġ{Ĕ !8Q !aĠ{Ĕ !HQ !PĠsĶ !:Ķ !/Ķ !-Ħ!!!+ !As !j| !¬",
);
rawImages.push(
  "!{| !¬| !¬| !¬| !¬| !¬| !¬| !¬| !¬| !¬| !¬| !¬| !¬| !¬| !¬| !¬| !¬| !¤Ĝ !)Q !kT !'ľĜ !9Q !a<Ĭ !IQ !,D!Ĥ!DĤ!D!!Ĥ !;<Ĭ !SD!!Ĥ$ń#!s !'Ĥ !8<Ĭ !RD!Ĥ$Bö!!RB !(Ĥ !(Q !0<Ĭ !PTĶ!Ĥ!$Ėå¦P!D !*Ĥ !5<Q !OT!!ĶĤD!r¦PD !'Ĥ !:<Ĭ !1Q !?TĶ!!ĤD!r÷ĦBĦ !)B!!Ĥ !4<Ĭ !AQ !/TĶĦBĤD!Õ!!C!!R!!B !'Ĥ !4<Ĭ !KT!!ĔTĶSB!!öÕs!!CR!B !*Ĥ !3<Ĭ !IT !&ĔTĖ!BĤ!¦s!C!RB !'t !&Ĥ !3<Ĭ !HT!ĔT!!ĔDĦ!BĤ×!B!CR!B !,Ĥ !,Q !(<Ĭ !GT!ĔT!!!ĔDĦ!BµĖ!2B·BĦ!B !)ĦBĤ !3<Ĭ !)Q !>T!!ĔT!!!Ĕ!$!!µĶ!!2cCR!!B !(ĦBĤ !3<Ĭ !9Q !-T!!!ĔT!Ķ!!ĤDĦõö2c!!C!!R!!B!ĦB!!ĦBĤ !3<Ĭ !DT!!!Ĕ¦Ķ!!Ħ!BĤDrĶst !+B!ös!Ħ!BĤ !2<Ĭ !ET!!ĔT!Ķ!!Ħ!!!¤2c!!C!S !(Ė!sös!Ĥ !3<Ĭ !DT!!!Ĕ!T!Ķ!Ħ!!!¤s!·!!Ħ !)Ė!sÕrDĤ!!Q !0<Ĭ !CT !&Ĕ!D!Ħ!!B<!!Ċ!!D!!Ħ!ĖRB!öĥĦdĥ·Ĥ !4<Q !CT !&Ĕ!D!Ħ!]!!Ė!2B!Ċ!D!ĦĖRB!öĥĦB!tń !4,ļ !1Q !2T !(Ĕ!D<Ħ!!B!ĖĶ!cĖĺ!!Dös!ö!ÕRBtń !5,ļ !AQT !)Ĕ_ĦĖ!!!BRĖĶBBĖRĊ!×d!!ąĖRµ !7,ļ !AT !)ĠĖ!!BBĖ!=B!!ĶcĖR!Ċ×Ė·ąĖ!sr !7,ļ !ATĶ !'İĖ !'cĖĥĶCRĶ!cĖR!xĖ·ÕRdQ !8,ļ !;D !.Ā!!õ!t!!BĶåt!!!B2!RGsr !5Q !(,ļ !/÷!· !/ö!!s!!Ĥ!!Ģ!RRĵ÷!!!RAÖCRĖB!2RĊ !>,ļ !)Q !&÷t!õt !/Õ!·!!ń$ĖR!]ĆQ÷õt!RA¥RC!B!2RĊ !=DĞ( !-Ęąµ!×d !(# !(Õ!·!!P$Õ!dPłQ¥æ÷!¥ĵ!ÖC!B!BBĊ !<DĦľ( !.¦ç!ÕĶ2!2!2 !*æ!¥!!r÷ö!ĆµłQsö¥t¥ræ¥RCB!BĪ !<DĦĖJ( !/¦RĖ!2 !(B !&Ć!!c!!µ!!M!÷FÑĶö¥t¥ræ¥RCB!nĪ!DĤ !7DĦ!Ė!J( !;·!Ķ!Ķ!!B !'LÖ¥»Ģõ÷!!ĆÕæ!Æ2d2ĺ÷!Cs!Ĥ !+Q !)DĦ!!Ė!!J( !?T!!æ !(ď!!Í!Ā!!!õæ!¥RdûĆ!B!d!P !4DĤDĦ!!ľQ !?T !,Ķ!!ĀÅĖ!¥æ!!¥RļĆĶ!2B!!dsĤ !3DĤD!Ħľ( !1Q !/T !,Ķ!![Ė !(¥RüĖB!!2B!BCsĤ !3DĤD!Ğ( !1.ĖB2ądĦ6 !'T!!¦ !'Ķ!!Ħ !'ďĆæ!ÆSěÖ!!R!ĶRĦBBCsĤ !3DĤĘJ( !'$,2 !)Ė!Ķ!ĵC!RĪ!!!T !&Ķ!!2Ķ!Ħ !&Ė!!!#RB!ÕöĦ!!!B!!2B!dsĤ !2DĤDÕl( !&đ!!3!B2!2 !&ĶĖ !&BB !)( !&Ħ !&Ėĵ!!!3!RB!ÕöĦ!!!BRĖ2BĦtBĤ !0D!ĦĖĥl(!!!łÉ!!!o!3!B!!Ħ!!ĥ!C!ĥĶ2C!!!BB!!(!!!Ħ!!!ĖĵĶ!!2!3R!BĤ¦Ħ!!!22Rdåc!tń !.QD!ĦĖĥĦlH!!!ÅĖ!RĖRo!!3BĦĥĦ2S28Ġą!!BC!!!22c!ĬĦBĦ!!ĖĵĶ !&23R!BĤ¦ĶĶ!!!2BBdĥ!CRń !'DĤ !&DĤ$Ėĥ!ĦlH!!ĘÃ!!!Ä!R!o3BĶĕĖĶR½ĦÕ]ĖĦcC!ĵĶ2C!R(Ħ!BĦĖ!ĵĶĦ!B!23R!BĤ÷æĶ2Ķ!222¦!ĥ!CsĤ !&DĤ !'D!öĥĦ!lH!!Ģ¹ !'R!o3B!ĦĥĆ!í!ÚXĐĦRS!ĵĶ!!2CXĦ!BĦĖĵĶĦĦ!BB23R!B!Ĥ·Ė!2Ķ!2BBd!ĥCRń !&D!Ĥ !'DĦĖą!lH!!ÅĖ !(2BoS!!ĦĕĦR¬ĤĲõĦcC2Ķ!ĥĶ!BS(!BĦ#ĥ!ĦĦ!BBCR!!B!Ĥ·Ė!2Ķ!222¦ !&sĤ!!!DĤDĤ !&D!öĥĦlH!!ÅĖ !)RNd2!ĦĵĶĆ¦iĠå!RC!ě^Ħĕ!!t(!BĦĖĥĦĦ!!BdB2ń !&÷ÆĶ!2Ķ!2BcCRĖRBĤ !&DĤ !'D!ĦõĦlH!!ÅĖ !)2BNd2!Ħĥ!æčĠå!dBĦ!ċ±ÕRĦt(!BĦĖĥĦĦ!BR3B0!÷!tÕµ·Ė!2Ķ!2!cd!RBĦBĤQ!DĤDĤ !'DĦĖąlH!!ÅĖ !)2B!Nt!!!ą2YİąĶĦRS!û4ĮtĕSHĖR!ĖąĦ!BBC!Bą!Æ!ėµ¦ĥÖ!2Ķ!!2cBCRBĦBĤ !,D!!öĥKQ!!ÅĖ !)2B !&_!æRÇąĦĦĦ2¦!ëDĮ¦ąSHĖR!ĖąĦ!s3ĥ!tÕæcĖćÕdPtĶ!2Ķ!2!cBCRńDĤ !-D!ĦõKH!!ÅĖ !)2¡23M!ą!æĶ×!å!Ćc¦!ëDĞ·ĥS(ĖR!ąĖĦ!RĶ!!·µĖ!R×õCRµĖ!2Ķ!222cĦ·ń !.DĤDĦõKH!!ÅĖ !)2¡C22!ą!æÇRĖõĆĆ¶¦!ÛTð¦ĕB)!R!ąĖĦ!!Ķ!!ç¤2Ķ!stĖRõöĦ!2Ķ2!BB!dRń !.D!ĦõKH!!ÅĖ !)2¡S!2!ą!æ¥¬ßÖ!Æ3!!ûÁÅcĦB)!RÅRĦĦĶ !&Öç¤!sCsĦBÕÖ2Ķ2Ķ222BĆÇR!ń!D!ĦBĤ !(DöĥKH!!ÅĖ !)2odĶB!Ħĥ!CiĐrs2R3û~Ķą!2B)ĥCõRĆ!Ķ !'çõC!RńD!öÕĦ!!2Bæ!ĦĶsdsĤ !&$B!!Ĥ!!DĦĖĥKH!!ÅĖ !)2!oSB !&HĤĢ¤2cBBĞö®Ħ!R3ļĥCõ2ĦĶ !'RdRÕ!·ńĘ!!ÕĦ2Ķ !'RBdRBĤ!!!DĦ!BtĤ!$!Ė!*H!!Ģ¹ !)2!B!Nt!!ĦiÚ'Æ2Bc!!Į*!2SBû!Cõ2ĖĶ!!22!BdRĖ!!P$!Bµö!2Ķ!!!RB!BCRBĤ!!!DĦ!BĤDĦĖ!!*H!!ĘÃ!!!Ä!!!2!B !&łíĦr<Ė2B¥!Ć!2B2S(ÕĦcö2ĶĶ!!!BB!·ÕBÖBå$B!öµ!2Ķ!2c!!ĦBdRBĤ !&$ĖRB!ĦĖ!RĞH!!>U !)2!B !(ÉßæĿ¦R!!!cBC22(µ!BĖ2Ħ!Ķ2!B!Ķç¤ĦB¥!bD!Ĥd!22!!2!!!cCRB!Ĥ!!!$Ė!R!Ė!!sþH!!!µĦ !'2!Ãĕö!!æ!2sĖå!dBRcBC!22HÕöRĖ2ÆĶ!!2!!2!!çÕæ!¥µ$Ė!µ!!22!!2!!BdR!!ń!!!$!ĖR!Ė!RBþH!!!ĘãĦ!!2B¢!ĕÖĆcsĖ!!Ė!BR¦ !&B!!HÕöRĆ2Ķ!Ķ!!2!!2R!RbĘ!!RQĸ!rRĖ2 !&B!BdR!!ń!!!DĦõCRĖ!RĖ*H !&ĘóĖRo32 !)õ!Ć¶dĺ!!DĦĖ!ĥ!ĦĦBBæ2Ķ!Ķ!!22!RBd!0 !'ĸ!r !&2!!B!B·ĖS!ń!!!DĦõCRĖ!RĖ*H !1ĢąöĆÖĶRh !&DĦĖ!ĥ!Ħ!Ć2!ĶĶ!!!222B!BCBR!ĤD!ÕĦö!2Ķ!!!2BB!!Bt!ń!!!DĦõ!tĖ!!ĥKQ !?DĦĖĥ!2æ!!ĶĶ!!!B2!ĶRB·ĖRĖ2Ė!ą!öBĦ2!22B !&BtBĤ!!!DĦÕBtĖ!!ĥKH !1Q !0$ĖĥĦĦĶ!Ķ!Ķ!!!22!!s·!öĥ!C!!ą!öBĦ2!22!!B!!Bt!ń!!!DĦÕBtĖĥ!!KH !@DSõĦĦĶ!Ķ!Ķ!!2!!!÷!!ĖąĦcĦB!Ħ!öBĦ!2!2!2B!!B!tń!!!$ĖąBtĖĥ!ĦlH !ADöąĦĶ!Ķ!Ķ!!B!!RdĆdĥĆĶR!Ħ!!Bö2cö!2!22B!!B!tń!!!$ĖąBtĖĥ!Ħl{Ĕ !@Döą Ķ&!!Ķ!RcC!ąĦ!cö!RĦ!!!Bö!22Ħ¶22R!!!B!tń!!!$Õ!BtĖĥĦ!l{Ĕ !A$õĖĶĶĶ!!Ķ!2BcĦĦ!!cö!RĖ !'Ħ!22Ħ!BR!!!B!tń!!DöÕĆBtĖĥĆ!¯{Ĕ !ADöą Ķ&!Ķ!!BRĦ!!!BĖ!RĖĶ!!2Rö!!B!!!R!!B!CP!!!$ÕösdRõö!!¿{Ĕ !(Q !;$õĦ!ĦĶĶ!ĶBRĦĶ2!!BĆ2!ĶĶ!!!B!Ħ!!2!2ĶBBB!tń!!DĦÕö¶!CąĆ!Ķß{Ĕ !8Q !+Döą!ĦĶĶ!ĶsĦĶ !&2Ħ!!Ķ !(BĦ!!2!cBĦBCP!!!$ÕĦĖsB!öĶĶ!ß{Ĕ !CĘĥĦĶĶÖĶ!cĖ!!!Ķ!22Ė22Ħ !+2!cBĦBCRń!!DrĖRB!ĦĖ!!Ķï{Ĕ !CDĦõĦĦĶĶ!cĆ !&Ķ!BĦ!!!¶ !)2!BB!BCR!ń!Dµö2c!!Ħ Ķ&ï{Ĕ !DTæą Ķ&cĖĶĶ !22!B!!Bd!RQ!!×Ė!!çĖ!ąĦ!ĦĶß{Ĕ !E$õĦĶĶĦ22ĶĶĶ !.2!!2!!!RBCs!ĤDöą!!·ń!!Ę!ąĖĶÏ¦Ĕ !ETæĥ!ĆĶĶcĦĦ!Ķ !+2!!Ķ!!B!Rd!sĤ!D!ĦĖRń !)Ę!*{Ĕ !0Q !7TæĥĖĶĦcĦĶĶĶ !(2!!Ķ!!!22R!dRBĤD!!Ĥ !/Ġ{Ĕ !@Q !(TæĥĖĦĶcĦĶ!Ķ !,BBĦBd!P !6Ġ{Ĕ !HTæĥĆĶ!Ķcö!Ķ!!Ķ!!!BRCąĦ¦P!!!T!!!Ĕ !1Ġ{Ĕ !ITæĥĦ!Ķ !*RC!!ĥ!tń!Q !8Ġ{Ĕ !KDĦĖĥ !)C!RBĤ !7Q !(Ġ{Ĕ !MD!öR !(B!Ĥ !?Ġ{Ĕ !(Q !JD !(Ĥ !@Ġ{Ĕ !8Q !aĠ{Ĕ !HQ !PĠsĶ !:Ķ !/Ķ !-Ħ!!!+ !As !j| !¬",
);
// }
// Win BJ {
rawImages.push(
  "#{ Qs ¦)| !s Ĕ)Ķ !Ņ !l D' !m D'!!DD !'D !: T) !( T)!! T3 !+T!!!ĤĤDD!!ĖĆĆĖ!!D$D !6T Ķ'!!T !&T Ķ'!!TT Ķ' !.TT !(T!!!ĤD$öĦ!ĦĶ!22!!Ħ!Ħ !4L$ĖĦĦĦ!!Ķ!!T$$$ĖĦĦĦ!!Ķ!!!ĦĦĦ!!Ė !/TT_DDDĶĖööĘĦ!RBĦĦ!22!!ĦĶĖ!$ !2TĜJJńčJ*!!Ė!!2! J'*!!Ė!!2!J*!!Ė !.ĠðæĀĠŀ!BssR!!BĦĶ!22!BĦĖĦB!B !2ľ!!å!ÖĞĞ!!Ķ!!B! Ğ(!!Ķ!!B!ĞĞ!!Ė Ķ-ĠĖ!!!ĦĆĀĠĤ !&Ħ!!22!!ĦĖBB2!!D !1ĜL*¯|ğR!!Ħ Ķ& R(!!Ħ Ķ&RR!!!ĥ! Ĥ*!!Ė!!õõ !&ĢĠB !&2 !&ĶB2RBB!!D !0L!ľĖğ!îJ*ĦĶ!!!Ė ľ'J*ĦĶ!!!ĖľJ*ĖĦ!!ďĦĦĦõďL**qqH÷æ!!!Ħ !*2ĖĖ!22B!ĦĦ !2LĜöĶJ!îHĶĶZ !&J Ķ)Z !&JĶĶĶkĦ !*Ĺ%Ĺ%ĹMħ$dõ!!!ĦİĖ!!!ĖĖĥR!Ė!ĦĦ!!Ħ!!D !.ö!ÅĆ!!å!ĆĆĆ! Ķ& Ć*! Ķ& Ć&ĶĦ !2èdtdt3~^ĖĖĥĥC!!!Ė!B !4H|ÇsĞ!ÿĦ((ľ !&Ć ()ľ !&Ć(((½ĶĖ !*ĖĦöĆöĆöĆö !(Ħ~nÂCR!ĖąĥĖ!!!B !2íĵ!JÝľmmĸ!!ĶĶĶs m(ĸ!!ĶĶĶsmB·!!ĥ!YBBBtYĩ%%qqŅEôäBĆöĆöĆö !&n=M~ĦĦĥöBB!!!Ĥ !/ĠYååYåĶĶ !( Ķ) !(ĶĶ<!!ĦĦ ×,¶!õ!t!PôqôŅ¤cĆöĆö!2ĶĶĂĦĦąöö !539!9ĆĆ!!ĵĶĶĶ Ć)!!ĵĶĶĶĆĆĆ!!! Ħ-ļ¶·łĥ¦÷Ý3÷¥»gÊ¥!@Ĥö!2ĶòâĦąĥö!Ĥ !0HĠ(!Ħ!(ľ!!ĶĶĶĴ ((ľ!!ĶĶĶĮ((½!Ħ¥ B-!¬HHdąĥ!ÜÜÜC·sīúeĨ@Ĥö!2ĶĂĖĦPĤ !2HB ĸ&!!ĥCĶBBBe ĸ&!!ĥCĶB½··ĦĦÆ B.dR!!H½zĦR!!cs·!×īGeĨ@Ĥö2ĶĂ×D!D !3P!!ĵĵĥtRRń!!Ĥs!!ĵĵĥtRsńÇÇÇçç C.tsĶ!!!2 !'ĶĦĶ!!!BīheĨÄö!!-ĤDĤD!D !)D !)PPbbrńńń !&ĤPPbbrńńĤ! P0¥¥¥R !)2!R!Ė!!Ķ !'ī¥ÈÄĆ2Ķ?ĤDĤDĤD!D !&Ĥ !PĶ !(2!2!R!!Ķ !)ī¥ÈÄö!!O!DĤ!Ĥ!ĤD!D !NT!!Ķ !*22BBc!22Ķ !(ī¥ÈÄĆ2ĶŁĤD!D!DĤDĤD !OĦĶĶ!!!Ķ!Ķ !'2BĶ!2 !)ī¥ÈÄö!!OĤDĤDĤDĤ!Ĥ !NĶ!Ķ!Ķ!Ķ2Ķ2Ķ!Ķ !&BĶ !+ī¥ÈÄĦ!Ķ`ĤD!DĤD!D !LT !&ĆĶĖĦĶ2Ķ2Ķ2Ķ !&2 !,ī¥È£Ħ!ĶD!!!DĤDĤ !MĶ!!!cĖĦ!ĦĶ!Ķ2Ķ2Ķ !1ī@È£!Ķ=!!!ĤDĤ !OĶ!!ĶRĥĦ!Ħ!!Ķ2Ķ2 !2e!!Ħ!Ķ!!ĤDĤD !Q2!!tĵ!!Ħ!!Ķ2Ķ !2ī@È£!Ķ=!D!D!!D !JT!Ķ!ĶĶ2!!ĶĦ2 !&Ķ2Ķ !24B!Ħ!Ķ !&ĤDĤ !:ÑnÑnÑñ !.B22!Ķ2!CĥĶ !'Ķ2 !2RńÈ£!Ķ!!!ĤDĤD !1ĲÅÅÅĲĲĲ..÷ķ!BĦ!ĲĲ !)$ĖĖĖŀ2ĦĦĶĦĵ !)2 !3ī!B!!!=!ĤD!DĤ !0ÅÉĶĶ!ÕÕÕrA1AöĖĦĆÅÅ~~~ÁāāđĠĠ!!Ĭ<!ĥĦĶĶĦĦ!Ħ!!!Ķ !5Ħ!Ħ!Ķ!D!!Ĥ !0ÅĶ!!2_!ööĖöiöæææĆ22BBĶöĆ23!!Ġ!!ČcCĶ!!!ĵ !'2!!!Ķ!Ķ!Ķ!Ķ !*4Bè£!Ķ!!!ĤD !0ĖĶ!2³öråååĽĖĬĵĥĥĆöæÖÖĖĆÖöĵĕĥĕĠ!Ė!!ĵĵ!!!ĦĦĦ!2!!!Ķ2Ķ2Ķ2Ķ2 !*BńĦ!Ķ!=!Ĥ!Ĥ !02Ķ!³ĕæCCC!Rh» !(2ąõĥąĆS2ĶĖåĖ!öBĶ!Ħ!!ĵ!!!Ķ!ĶĶ2Ķ!ĖĶĶ2 !+2!B!!2!ĤD!D !0Ķ2!ĕd!!Bĕ3+}Ö !'2B!!ĶĶĶ!!Ė!Ķĥĥ!!ĦĶ!!Ħ !'Ķ!!ĶĶĶB22 !,ī!Ħ!!Ķ!DĤDĤD !0Ķ!2 !'ĕĖĘÁ!!!B!ĆĜĦ !'Ķ!!ĆĦĦ!ĖĶ!!Ķ !&Ħ!!!ĦĦĶ2 !1B!!2!ĤD!DĤ !/Ķ!!!ąc!B!SĥĿT3C·sĆĶĦ!S !&Ėö¶ĆĦĦ!ĥĶĦĶ!!Ħ!Ħ!ĦĦĆĦ!2!!2 !)Ķ!Ķ!!!Ħ!!Ķ!D!!ĤD !/2!!ê!RB!!BtĖÞB2Õc!!ĦĦB !'BBB !&Ķ!!ĶĶ!ĵĵĦĦĕą!!2!2 !(ĶĶ!Ķ2!!!B!!2!!!ĤD !0Ķ!!oúc !&åĦöµµæ!Rĵ!!ĦĶtRĦ!ĦÅąĶĶ!Ħ!ĶĶ!ĶĶĦĦĕĵĖR!B!2 !(Ķ!!!2Ķ!!!Ħ!!Ķ!!ĤD !3Ķ!³CB!!R¦B¶¥RB!õĦ!ĖĶĦõĖĵ!!!Ć !&ĶĶ!Ķ! Ķ&ĖR3R!2Ķ !&ĶĶ !&Ķ2!!!B!!2!!D!!Ĥ !2Ķ2cc!d!ąRkĆ!¦ĦĦĦ!R!!ĖĦĶ!!cBĶĶĥĶ!Ķ!!Ķ!ĶĶĦ!!R2!Ķ2!!!Ķ!!Ķ!!!2 !&Ħ!!Ķ !&ĤD !0ĶĶ!ĕĖ2cR!3)Ĕc!år¦Rc!ĕĦ!!!ĦR¦B!!!ĶĶ!!!ĶĶĶĦBR3!Ķ!2Ķ!!Ķ!ĶĶ!!!2 !'B!!2!!!ĦD !1ĶĶêĊĕ!¶öÕRRĻ!Ħ!ĶĦtLRĖĖ!!ĖĖ¤Ħ¦ĶĶ!Ķ!ĶĶĶ!ĶĦ2 !(Ķ2 Ķ&!!2 !*Ħ!!Ķ !&Ħ!Ć !/2ĶĦĆÊĚÚĥĖìêÖ!ĖĦ!!Ħö!!sBR!¤Ħ¤Å!ĶĦĶ!!Ķ!!ĶB2B!!ĖĖĶ!Ķ!Ķ!Ķ !&2 !(B!!2!!!B!Ħ !/2!ĶĶĶR±nĖöĦā< !'ĕĕĖ!BBcæ!Ķ¥Ç !'ĶĶ!ĶĶ2B!!ĵĵsB2ĴĶĶĶ!!2!2 !)Ħ!!Ķ !5R22BcłtĖ!sďRŁĦRB!BdSc!!31¤ç!!8ĶR !'ĶĶB!!ĶĶĶ¦ĦĦµDĶ!Ħ22 !*Ķ!B!!2 !&B !0ÇRB!os¶ćÇÇ÷K!¦¥cÇĖĕåĆ!Ħõ!!åç½Ħ2R !-ĶĶ!ĶĶ¦!ĦĦB!!!2 !'ĶMĨĦB2Ķī !5ÇÂ¡ÚĊcçħħ#ÈSÆĦd¶3D ¼(IÍXĦBB!Ħ !'2B2!!!¦öåå2ö!B22!2 !&ĶĶ!ĄBäÈ!2 !7Wª÷Çh666ĺÔåĆ¦ąö66 !(r¥ĶRB2ĦĦĶ!!Ķ!!ĶĶĶ!!!ąRR!!B22!2 !&Ķ !&Ħ!222 !@XGûĻXë !+r¥22ĦĦĦĶĶĶ2!!ĶĶĦĖĆ¤·ææĖs2 !)Ķ !'B!2Ķī !PtĶĖĖĦ!!Ķ!!!ĶĶĦĦĦĶ2ąć×BĦB !(Ķ !&-ĨÄè2B!ĶĶ !NB!!!ĶĶĶ2 !& Ķ&2!Ķ!åąĖ!2 !&Ķ!!2!ĦĤB!!!īĶ !PĤ!!2 !*Ķ!!22B!!¦dR!!!2 !&2!!MĨÄè2īĶĦĆ !PB2 !(ĶĶĶ2!222!!!ąąĖ !)2!!ĦĤB!!2ĦĆĦB !Pc !)Ķ !'22!!!··PĤ !&Ķ2!!ĶMĨÄè2ûĦ!R22!!!Ė !KC !'ĶĶ2!2!22 !&åöĖĸ$!!!Ķ2!!ĶĦĆäè!ċĦ!B!2 !PPB !)2!2!2!Ķ !,2!!ĶĦı!È!2ą!B22 !&Ħ !MB22 !(2!2Ķ !'B!2!!2 !'M!äB2ÊCB22 !Sd2 !&2!!!2!!ĶĶ!ĦĶąĦ!!Ķ !&ĶMĆäè!2CB22!22!!!Ė !MR!22!!!2!22ĦĦ!ĶĦ!Ħ!ĥĖ !(Mæäè!ûěP0ńĴĴĤĤ!!!RR !Lńc2!!!2!!ĶĖ!!Ħ!!Ħ!Ħ!ĥĖ!ĦĦĦ=æäè!ĻPĴ !)ĤĤ!Bń !M B'222!2!!!ĦĶc!!Ħ !&ĠMæäè!ĩÿđđđ !*ĤĤ !TĶĶĦĦ22!!ĦĆBB !&M¦ö@è!ÚđĆĦ!!áđł !U·B!B2!!!2!!B22!ĖĆĦB!~MĶĤ!s!ÚĦcBBĖö!Ėĕł !TĤdc!!!22!ĶĶĦBB2BĖĆĦÂĶõąĘ´Ĩ2ĦĖ!ĶĖĦ!ĦRĖåł !TPd!!Ķ!!2BĦĶĦ!B2R¥â@ą¦¦!!ĶĶ !&Ħ!!RöĦ!B> !TPsR!Ķ!!2B Ħ&!!²Ħ×2Ħ!!!22!!ąæ!!RĖ!BRÅõ !UrRB2ĶĶĦ!BĶĦ!ĦĶĦĕ23Ħ£!!ĶĶ!!!Õ!!Ė!!RöĦ!> !'T !Ors¥B22ĶĦ!ĶĦĶĂR2SBäÆ!!22 !*Rö!!t !Wr!!22BB2!ĶĶĖ´!ĖĖ !&ĶĶÒR½!ÖÖ!RĖ!!R¤Ħ !Wrs!2!2BB!ĶB!ĥBB !&Ħ22!B!ą!!Ė!!RĖB2 !Xrss!!2BR2Ħ!!ĦĦ !&ĶĶĶ!!½!ąÖ!!RĖ!R2 !Yr!¥2Ķ!2RB!!BB!!!è£Ķ2ÒRBÝ!ąÖÖĖ!RdĪ !Zrrs2ĦĦ!Ħ!!ĦĦ!!P!!ĦĶ!âR2č!ąąæ!èĺ !^rsB2ĶB!!BB!!DPè£Ė!ĶÒBB**ZīĈ !aråõBRuæÔĦu$£D!è£P!!Ò²±ÁnOĉù !cÕ2RÈĖôB!È£s!è!PĶ!!ĦĖĦB !fùRRÈĖÔĖ!§Ħ2!èèĦĖĖ!RB !hùRRÈĖÄq´qäôôĤ¥¥¥R!!! p&!p!p !`ùĩ¥øØøØø§Øè¸!Ķ!Ķ!Ķ!Ķ!Ķ!`ùpù !bùĩs!R2R!ĶĶĦĶĦĶĦĶĦĶĦ!Ķ!`!p !dùĩ ę1 ĉ&ùù!ľ <E ĠU!",
);
// }
var bjHudOffset = rawImages.length;
// HUD BJ {
rawImages.push(
  "!BĚ. !8Ħ !)ĺ. !-t!!S!õ !/ĺ.!!!t!!S !&ĎdcĆĖÆíĖĥ !,Ě.!tİÙ!!³!!B!R!rs¥¶!!z!!S!!Ė!ĥ!!ĺ.tÃĶ!!2ł!!Ė!Ć!!Ŀ!·ÕĶ!!t¶2!!!R!!İOóĶ!!2_ðÖõtõĝÀåĆBRtĖĵĶ!t¶s3!!ĥ!ĚOÃ222³Å¤Ćtĥ:ÕÖğæ!BcĦ2!!įt¶sĦ2ĶĖLOÓĶBÃĕsåĦcĆ¾êĆ©¯RB !(c·ćąĶĖ!LOÃ22od1ğĦRæ#ëļĚ¶s!BB·ÅĖĦBÇķąĆæsĚOÃ!B¡S1ąĆ!öėĻCïæB¦ĥĶć¥ĥ¯sÇķõĖÖĖĐO³2B¡ĶÖÅĆ!Ė¥iU½ğ·cÆĕ×µBæBÇķÅÖõ!ıOÃ!B!oĆ]Å!!B÷ĦÅ2Ķħcĕ·µ¦åR·ėÅĖĆ!ĚO³2BoúosõĖ!B÷ÖÅĶ2SÆõtµ·ÿÇsÇåö¤cġO³22¡C!rĖąĖRç!µÿ!3QĦ·b×åR·æöö¤!=O³22odRàæĶ2ĖGUz!¦ÖQĦ÷rcĆ!ÇöĆöåĦĚO³!2¡2SÕĶĆ!ĦĻCïĆ!cĶ!ć¥ĥßBÇöæ!ĖåġO³Ķ22R_Ć¥!ĥçí©©ßB!!c·ÅĖösÇÆæÕtBÀO³!Ķ!2!ÄBnĖIĻsĚ¶RB !(c·sŅ2ĖcĚ.äĶĦ!2cn!ĖözĖõĀ¶RBcĶ!!!įSÖö¤!c!ġ.ĔĖĦ2RłæÅ!RæYÀåßBRtĖĵĖB23õ!ç¤cç].CóĖĶÂ!ðĖĆ!!õt!ą!·æĵĶĶ!Ħ!!!c¦c!Ě.!CĿĖúR_S!!BR!rA¦æ!!zB!tö!!ĥ!!!ĺ.!!!C!!!R!!!Ď3¶]ą×íĖĥ !,Ī> !(Ħ !&t !&õ !/",
);
rawImages.push(
  "!BĚ. !8Ħ !)ĺ. !,t!!!Sõ !0ĺ.!!!t!!S!!!|öcĆĖ¥čĖĥ !-Ě.!tİÙ!!³!!B!Rrs¥¶!!!z!!S!!Ė!ĥ!!ĺ.tÃĶ!!2ł!!Ė!Ć!!Ŀ!·Õ3!ss!2!!!R!!İOóĶ!!2_ðöÕtÌðĖåĆBRtĖĵĶt¶!s3!!ĥ!ĚOÃ222³Å¤dą*ÿ^æwö!BR2!Ķ!]Æ!!B2ĶĖLOÓĶBÃĕsåSĥkÿ-öw¯RB !'2·¶sĶĶĖ!LOÃ22od1ğBĦĭ~ªÆĿ¶s!B2Ė!!!c·ćąĆæsĚOÃ!B¡S1ąĶĖĝÑċsÿöB¦ĥCsÕĆßBÇķõĖÖĖĐO³2B¡ĶÖÅĆ!Ė)Ñj½ğ·cÆĕė¥ĥÆsÇķÅÖõ!ıOÃ!B!oĆ]Å!!B÷ĦÅ2Ķħcĕ×µBæBÇķÅĖĆ!ĚO³2BoúosõĖ!B÷ÖÅĶ2SÆå¦µ¦ÿR·ėÅö¤cġO³22¡C!rĖąĖRç!µÿ!3QĶ¦bçÕÇsÇåö¤!=O³22odRàæĶ2Ėj3z!¦ÖQĦ÷b·åR·æööåĦĚO³!2¡2SÕĶĆ!Ħ9gwĖ!c!Ķć1cÿ!Çöæ!ĖåġO³Ķ22R_Ć¥!ĥĽtĺĚßB!BdÖ¥ĥöBÇÖÖÕtBÀO³!Ķ!2!ÄBnĖkącĿ¶RB!BBĶĖösÇÆŅ2ĖcĚ.äĶĦ!2cn!ĖöÞÕæÿÆRB !'ÿc·BQ!BBġ.ĔĖĦ2RłæÅ!Ræz}åßBRtĖĵĦ!2S¥ĦĖÕRÇ°.CóĖĶÂ!ðĖĆ!!õt!ą!·æĵ!!Ķ2ĦĦ!cdRRĚ.!CĿĖúR_S!!BR!rbĶķ!!zB!tö!!ĥ!!!ĺ.!!!C!!!R!!!Kö¥]ĖsĝĖĥ !,Ī> !(Ħ !&t !&õ !/",
);
rawImages.push(
  "!BĚ. !8Ħ !)ĺ. !-t!!S!õ !/ĺ.!!!t!!S !&KĖcĖĖ¶¶9!!ĥ !*Ě.!tİÙ!!³!!B!R!rs¥¶ !'S!!Ė!ĥ!!ĺ.tÃĶ!!2ł!!Ė!Ć!!Ŀ!·ĆĕĶ!!t¶sĆ!R!!İOóĶ!!2_ðÖõtõĽ}åĆBRtĖĵĆ!2·¶¦!!ĥ!ĚOÃ222³Å¤Ćtĥ:Õöÿæ!BcĦĦ!!ÿc·ćõ2ĶĖLOÓĶBÃĕsåĦcĆ¾Õ¥ğ¯RBBĦ!RĖĦBÇķąĶĖ!LOÃ22od1ğĦRæz·g©¶s!!¦Ö¥ĥÆsÇķąĆæsĚOÃ!B¡S1ąĆ!öCčĚĚæB¦ĥĶ×¤BßBÇķõĖÖĖĐO³2B¡ĶÖÅĆ!Ė÷93½ğ·cÆĕ×r¦åR·ėÅÖõ!ıOÃ!B!oĆ]Å!!B÷ĦÅ2Ķħ¥ĕtµ·ÕÇsÇåĖĆĦĚO³2Boúosõ!Ėc×ÖÅĶ2S¶õ¦b×ÿR·æöö¤cġO³22¡C!rĖĕĦ·c!µÿ!3QĦ×rcĆ!ÇöĆöÅĦ=O³22odRàæĶ29ß¾z!¦ÖQĦķ¥ĥöBÇöĆöĆĕĚO³!2¡2SÕĶĆĽĠĜbÿĆ!cĶSsÕĆ¯sÇÆĖĦĶĆĀO³Ķ22R_Ć¥!IĠÛ¶įßB!!RĖ!!!c·sæÕ2¦ÀO³!Ķ!2!ÄBnkďÌīÚ¶RB!!B!!2SÖö¤2ĖcĚ.äĶĦ!2cnCÅzÐÑ2ĺ¶RBRĶ!ĶBĿ3ĕtĕĆc!ġ.ĔĖĦ2RłæÅ¦µ9|!ĦßBRSĶĥĶ2ĶĦ!!ÇĖĵç].CóĖĶÂ!ðĖĆ!!õt!ą!·æĵĶĶ!Ħ!!!c¦c!Ě.!CĿĖúR_S!!BRÅÖ¤·Ö!!zB!tö!!ĥ!!!ĺ.!!!C!!!R!!ÏQdR,!ĦjĖĥ !,Ī> !(Ħ !&t !&õ !/",
);
rawImages.push(
  "!BĚ. !8Ħ !)ĺ. !-t!!S!õ !/ĺ.!!!t!!S !&ĎdcĆĖÆíĖĥ !,Ě.!tİÙ!!³!!B!R!rs¥¶!!z!!S!!Ė!ĥ!!ĺ.tÃĶ!!2ł!!Ė!Ć!!Ŀ!·ÕĶ!!t¶2!!!R!!İOóĶ!!2_ðÖõtõĽ}åĆBRtĖĵĶ!t¶s3!!ĥ!ĚOÃ222³Å¤Ćtĥ:ÕÖğæ!BcĶ!!!įt¶sĦ2ĶĖLOÓĶBÃĕsåĦcĆ¾êĆ©¯RB !(c·ćąĶĖ!LOÃ22od1ğĦRæ#ëļĚ¶s!BdsÅĖĦBÇķąĆæsĚOÃ!B¡S1ąĆ!öėĻ3ÿæB¦ĥĶć¥ĥ¯sÇķõĖÖĖĐO³2B¡ĶÖÅĆ!Ė¥iU½ğ·cÆĕ×µBæBÇķÅÖõ!ıOÃ!B!oĆ]Å!!B÷ĦÅ2Ķħcĕ·µ¦åR·ėÅĖĆ!ĚO³2BoúosõĖ!B÷ÖÅĶ2SÆõtµ·ÿÇsÇåö¤cġO³22¡C!rĖąĖRç!µÿ!3QĦ·b×åR·æöö¤!=O³22odRàæĶ2ĖGUz!¦ÖQĦďrJĆ!ÇöĆöåĦĚO³!2¡2SÕĶĆ!ĦĻ3ÿĆ!cĶ!ć¥ĥßBÇöæ!ĖåġO³Ķ22R_Ć¥!ĥçí©©ßB!!¦sÅĖösÇÆæÕtBÀO³!Ķ!2!ÄBnĖIĻsĚ¶RB !(c·sŅ2ĖcĚ.äĶĦ!2cn!ĖözĖõĀ¶RBcĶ!!!įSÖö¤!c!ġ.ĔĖĦ2RłæÅ!RæYÀåßBRtĖĵĖB23õ!ç¤cç].CóĖĶÂ!ðĖĆ!!õt!ą!·æĵĶĶ!Ħ!!!c¦c!Ě.!CĿĖúR_S!!BR!rA¦æ!!zB!tö!!ĥ!!!ĺ.!!!C!!!R!!!Ď3¶]ą×íĖĥ !,Ī> !(Ħ !&t !&õ !/",
);
rawImages.push(
  "!BĚ. !8Ħ !)ĺ. !,t!!!Sõ !0ĺ.!!!t!!S!!!|öcĆĖ¥čĖĥ !-Ě.!tİÙ!!³!!B!Rrs¥¶!!!z!!S!!Ė!ĥ!!ĺ.tÃĶ!!2ł!!Ė!Ć!!Ŀ!·Õ3!ss!2!!!R!!İOóĶ!!2_ðöÕtìÐĖåĆBRtĖĵĶt¶!s3!!ĥ!ĚOÃ222³Å¤dą*ÿ^æwö!BR2!Ķ!]Æ!!B2ĶĖLOÓĶBÃĕsåSĥkÿ-öw¯RB !'2·¶sĶĶĖ!LOÃ22od1ğBĦĭ~ªÆĿ¶s!B22Ć!!c·ćąĆæsĚOÃ!B¡S1ąĶĖĝÑċsÿöB¦ĥCsÕĆßBÇķõĖÖĖĐO³2B¡ĶÖÅĆ!Ė)Ñj½ğ·cÆĕė¥ĥÆsÇķÅÖõ!ıOÃ!B!oĆ]Å!!B÷ĦÅ2Ķħcĕ×µBæBÇķÅĖĆ!ĚO³2BoúosõĖ!B÷ÖÅĶ2SÆå¦µ¦ÿR·ėÅö¤cġO³22¡C!rĖąĖRç!µÿ!3QĶ¦bçÕÇsÇåö¤!=O³22odRàæĶ2Ėj3z!¦ÖQĦ÷b·åR·æööåĦĚO³!2¡2SÕĶĆ!Ħ9gwĖ!c!ĶïAkÿ!Çöæ!ĖåġO³Ķ22R_Ć¥!ĥĽ·ĚĚßB!BdÖ¥ĥöBÇÖÖÕtBÀO³!Ķ!2!ÄBnĖ¾ÕcĿ¶RB!BBĶĖösÇÆŅ2ĖcĚ.äĶĦ!2cn!ĖöÞÕæÿÆRB !'ÿc·BQ!BBġ.ĔĖĦ2RłæÅ!Ræz}åßBRtĖĵĦ!2S¥ĦĖÕRÇ°.CóĖĶÂ!ðĖĆ!!õt!ą!·æĵ!!Ķ2ĦĦ!cdRRĚ.!CĿĖúR_S!!BR!rbĶķ!!zB!tö!!ĥ!!!ĺ.!!!C!!!R!!!Kö¥]ĖsĝĖĥ !,Ī> !(Ħ !&t !&õ !/",
);
rawImages.push(
  "!BĚ. !8Ħ !)ĺ. !-t!!S!õ !/ĺ.!!!t!!S !&KĖcĖĖ¶¶9!!ĥ !*Ě.!tİÙ!!³!!B!R!rs¥¶ !'S!!Ė!ĥ!!ĺ.tÃĶ!!2ł!!Ė!Ć!!Ŀ!·ĆĕĶ!!t¶sĆ!R!!İOóĶ!!2_ðÖõtõĝÀåĆBRtĖĵĦĦ2·¶¦!!ĥ!ĚOÃ222³Å¤Ćtĥ:Õöÿæ!BcĦĦ!!ÿc·ćõ2ĶĖLOÓĶBÃĕsåĦcĆką¥ğ¯RBBĦ!RĖĦBÇķąĶĖ!LOÃ22od1ğĦRæz·g©¶s!!¦Ö¥ĥÆsÇķąĆæsĚOÃ!B¡S1ąĆ!öCčĚĚæB¦ĥĶ×¤BßBÇķõĖÖĖĐO³2B¡ĶÖÅĆ!Ė÷93½ğ·cÆĕ×r¦åR·ėÅÖõ!ıOÃ!B!oĆ]Å!!B÷ĦÅ2Ķħ¥ĕtµ·ÕÇsÇåĖĆĦĚO³2Boúosõ!Ėc×ÖÅĶ2S¶õ¦b×ÿR·æöö¤cġO³22¡C!rĖĕĦ·c!µÿ!3QĦÿbJĆ!ÇöĆöÅĦ=O³22odRàæĶ29ß¾z!¦ÖQĦķ¥ĥöBÇöĆöĆĕĚO³!2¡2SÕĶĆĽĠĜbÿĆ!cĶSsÕĆ¯sÇÆĖĦĶĆĀO³Ķ22R_Ć¥!IĠÛ¶įßB!!RĖ!!!c·sæÕ2¦ÀO³!Ķ!2!ÄBnkďÌīÚ¶RB!!!B!2SÖö¤2ĖcĚ.äĶĦ!2cnCÅî[Ñ2ĺ¶RBRĶ!!2Ŀ3ĕtĕĆc!ġ.ĔĖĦ2RłæÅ¦µ9|!ĦßBRSĶĥĶ2ĶĦ!!ÇĖĵç].CóĖĶÂ!ðĖĆ!!õt!ą!·æĵĶĶ!Ħ!!!c¦c!Ě.!CĿĖúR_S!!BRÅÖ¤·Ö!!zB!tö!!ĥ!!!ĺ.!!!C!!!R!!ÏQdR,!ĦjĖĥ !,Ī> !(Ħ !&t !&õ !/",
);
rawImages.push(
  "!BĚ. !8Ħ !)ĺ. !-t!!S!õ !/ĺ.!!!t!!S !&ĎdcĆĖÆíĖĥ !,Ě.!tİÙ!!³!!B!R!rs¥¶!!z!!S!!Ė!ĥ!!ĺ.tÃĶ!!2ł!!Ė!Ć!!Ŀ!·ÕĶ!!t¶2!!!R!!İOóĶ!!2_ðÖõtõĝÀåĆBRtĖĵĶ!t¶s3!!ĥ!ĚOÃ222³Å¤Ćtĥ:ÕÖğæ!BcĶ!!!įt¶sĦ2ĶĖLOÓĶBÃĕsåĦcĆ¾êĆ©¯RB !(c·ćąĶĖ!LOÃ22od1ğĦRæ#ëļĚ¶s!BdsÅĖĦBÇķąĆæsĚOÃ!B¡S1ąĆ!öėĻ3ÿæB¦ĥĶć¥ĥ¯sÇķõĖÖĖĐO³2B¡ĶÖÅĆ!Ė¥iU½ğ·cÆĕ×µBæBÇķÅÖõ!ıOÃ!B!oĆ]Å!!B÷ĦÅ2Ķħcĕ·µ¦åR·ėÅĖĆ!ĚO³2BoúosõĖ!B÷ÖÅĶ2SÆõtµ·ÿÇsÇåö¤cġO³22¡C!rĖąĖRç!µÿ!3kåßz¿åR·æöö¤!=O³22odRàæĶ2Ėj3z!¦ÖQĦďrJĆ!ÇöĆöåĦĚO³!2¡2SÕĶĆ!Ħ9s{Ć!cĶ!ćjľßBÇöæ!ĖåġO³Ķ22R_Ć¥!ĥĽ·g©ßB!!¦sÅĖösÇÆæÕtBÀO³!Ķ!2!ÄBnĖkĚsĚ¶RB !(c·sŅ2ĖcĚ.äĶĦ!2cn!ĖöÞÕõĀ¶RBcĶ!!!įSÖö¤!c!ġ.ĔĖĦ2RłæÅ!Ræz}åßBRtĖĵĖB23õ!ç¤cç].CóĖĶÂ!ðĖĆ!!õt!ą!·æĵĶĶ!Ħ!!!c¦c!Ě.!CĿĖúR_S!!BR!rA¦æ!!zB!tö!!ĥ!!!ĺ.!!!C!!!R!!!Ď3¶]ą×íĖĥ !,Ī> !(Ħ !&t !&õ !/",
);
rawImages.push(
  "!BĚ. !8Ħ !)ĺ. !,t!!!Sõ !0ĺ.!!!t!!S!!!|öcĆĖ¥čĖĥ !-Ě.!tİÙ!!³!!B!Rrs¥¶!!!z!!S!!Ė!ĥ!!ĺ.tÃĶ!!2ł!!Ė!Ć!!Ŀ!·Õ3!ss!2!!!R!!İOóĶ!!2_ðöÕtìÐĖåĆBRtĖĵĶt¶!s3!!ĥ!ĚOÃ222³Å¤dą*ÿ^æwö!BR2!Ķ!]Æ!!B2ĶĖLOÓĶBÃĕsåSĥkÿ-öw¯RB !'2·¶sĶĶĖ!LOÃ22od1ğBĦĭ~ªÆĿ¶s!B22ĶĖ!c·ćąĆæsĚOÃ!B¡S1ąĶĖĝÑċsÿöB¦ĥCsÕĆßBÇķõĖÖĖĐO³2B¡ĶÖÅĆ!Ė)Ñj½ğ·cÆĕė¥ĥÆsÇķÅÖõ!ıOÃ!B!oĆ]Å!!B÷ĦÅ2Ķħcĕ×µBæBÇķÅĖĆ!ĚO³2BoúosõĖ!B÷ÖÅĶ2SÆå¦µ¦ÿR·ėÅö¤cġO³22¡C!rĖąĖRç!µÿ!3kåßbçÕÇsÇåö¤!=O³22odRàæĶ2Ėj3z!¦ÖQĎďIÏåR·æööåĦĚO³!2¡2SÕĶĆ!Ħ9gwĖ!c!ĶïAkÿ!Çöæ!ĖåġO³Ķ22R_Ć¥!ĥĽ·ĚĚßB!BdÖY*öBÇÖÖÕtBÀO³!Ķ!2!ÄBnĖkącĿ¶RB!!cĶĖösÇÆŅ2ĖcĚ.äĶĦ!2cn!ĖöÞÕæÿÆRBRĖ!!!ÿc·BQ!BBġ.ĔĖĦ2RłæÅ!Ræz}åßBRtĖĵĦ!2S¥ĦĖÕRÇ°.CóĖĶÂ!ðĖĆ!!õt!ą!·æĵ!!Ķ2ĦĦ!cdRRĚ.!CĿĖúR_S!!BR!rbĶķ!!zB!tö!!ĥ!!!ĺ.!!!C!!!R!!!Kö¥]ĖsĝĖĥ !,Ī> !(Ħ !&t !&õ !/",
);
rawImages.push(
  "!BĚ. !8Ħ !)ĺ. !-t!!S!õ !/ĺ.!!!t!!S !&KĖcĖĖ¶¶9!!ĥ !*Ě.!tİÙ!!³!!B!R!rs¥¶ !'S!!Ė!ĥ!!ĺ.tÃĶ!!2ł!!Ė!Ć!!Ŀ!·ĆĕĶ!!t¶sĆ!R!!İOóĶ!!2_ðÖõtõĽ}åĆBRtĖĵĆ!2·¶¦!!ĥ!ĚOÃ222³Å¤Ćtĥ:Õöÿæ!BcĦ!BĆÿc·ćõ2ĶĖLOÓĶBÃĕsåĦcĆką¥ğ¯RBBĦ!RĖĦBÇķąĶĖ!LOÃ22od1ğĦRæz·g©¶s!!¦Ö¥ĥÆsÇķąĆæsĚOÃ!B¡S1ąĆ!öCčĚĚæB¦ĥĶ×¤BßBÇķõĖÖĖĐO³2B¡ĶÖÅĆ!Ė÷93½ğ·cÆĕ×r¦åR·ėÅÖõ!ıOÃ!B!oĆ]Å!!B÷ĦÅ2Ķħ¥ĕtµ·ÕÇsÇåĖĆĦĚO³2Boúosõ!Ėc×ÖÅĶ2S¶½ßz¿ÿR·æöö¤cġO³22¡C!rĖĕĦ·c!µÿ!3kåħbJĆ!ÇöĆöÅĦ=O³22odRàæĶ29ß¾z!¦ÖQĦķ{ĭöBÇöĆöĆĕĚO³!2¡2SÕĶĆĽĠĜĖJĆ!cĶSsÕĆ¯sÇÆĖĦĶĆĀO³Ķ22R_Ć¥!IĠÛķ®ßB!!R!!Ė!c·sæÕ2¦ÀO³!Ķ!2!ÄBnkďÌīÚ¶RB !'RSÖö¤2ĖcĚ.äĶĦ!2cnCÅzÐÑ2ĺ¶RBRĶ!ĶBĿ3ĕtĕĆc!ġ.ĔĖĦ2RłæÅ¦µ9|!ĦßBRSĶĥĶ2ĶĦ!!ÇĖĵç].CóĖĶÂ!ðĖĆ!!õt!ą!·æĵĶĶ!Ħ!!!c¦c!Ě.!CĿĖúR_S!!BRÅÖ¤·Ö!!zB!tö!!ĥ!!!ĺ.!!!C!!!R!!ÏQdR,!ĦjĖĥ !,Ī> !(Ħ !&t !&õ !/",
);
rawImages.push(
  "!BĚ. !8Ħ !)ĺ. !-t!!S!õ !/ĺ.!!!t!!S !&ĎdcĆĖÆíĖĥ !,Ě.!tİÙ!!³!!B!R!rs¥¶!!z!!S!!Ė!ĥ!!ĺ.tÃĶ!!2ł!!Ė!Ć!!Ŀ!·ÕĶ!!t¶2!!!R!!İOóĶ!!2_ðÖõtõĝÀåĆBRtĖĵĶ!t¶s3!!ĥ!ĚOÃ222³Å¤Ćtĥ:ÕÖğæ!BcĦ!Ħ!ď·¶sĦ2ĶĖLOÓĶBÃĕsåĦcĆ¾êĆ©¯RBB!ĦcĆ!c·ćąĶĖ!LOÃ22od1ğĦRæ#ëļĚ¶s!BdsÅĖĦBÇķąĆæsĚOÃ!B¡S1ąĆ!öėĻ3ÿæB¦ĥĶć¥ĥ¯sÇķõĖÖĖĐO³2B¡ĶÖÅĆ!Ė¥iU½ğ·cÆĕ×µBæBÇķÅÖõ!ıOÃ!B!oĆ]Å!!B÷ĦÅ2Ķħkč·µ¦åR·ėÅĖĆ!ĚO³2BoúosõĖ!B÷ÖÅĶ2SÆõt¬¿ÿÇsÇåö¤cġO³22¡C!rĖąĖRç!µÿ!3kåėrlåR·æöö¤!=O³22odRàæĶ2Ėj3z!¦ÖQĦďrJĆ!ÇöĆöåĦĚO³!2¡2SÕĶĆ!Ħ9s{æBB2!ćjCç:Çöæ!ĖåġO³Ķ22R_Ć¥!ĥĽ·gw¿B22¦sj*ösÇÆæÕtBÀO³!Ķ!2!ÄBnĖkĚsÚö!BRBĦcĆ!c·sŅ2ĖcĚ.äĶĦ!2cn!Ėö½ö3:ö!BBsĆ!!įSÖö¤!c!ġ.ĔĖĦ2RłæÅ!RæYÀ¤¯22sB!ĖB23õ!ç¤cç].CóĖĶÂ!ðĖĆ!!õt!r!cR!ĶĶ!Ħ!!!c¦c!Ě.!CĿĖúR_S!!BR!rA¦BĶc!sdtö!!ĥ!!!ĺ.!!!C!!!R!!!Ď3¶]ą×íĖĥ !,Ī> !(Ħ !&t !&õ !/",
);
rawImages.push(
  "!BĚ. !8Ħ !)ĺ. !,t!!!Sõ !0ĺ.!!!t!!S!!!|öcĆĖ¥čĖĥ !-Ě.!tİÙ!!³!!B!Rrs¥¶!!!z!!S!!Ė!ĥ!!ĺ.tÃĶ!!2ł!!Ė!Ć!!Ŀ!·Õ3!ss!2!!!R!!İOóĶ!!2_ðöÕtÌðĖåĆBRtĖĵĶt¶!s3!!ĥ!ĚOÃ222³Å¤dąĭĠ^æwö!BR2!Ķ!]Æ!!B2ĶĖLOÓĶBÃĕsåSĥkÿ-öw¯RBB!Ħ!!2·¶sĶĶĖ!LOÃ22od1ğBĦĭ~ªÆĿ¶s!B22ĶĖ!c·ćąĆæsĚOÃ!B¡S1ąĶĖĝÑċsÿöB¦ĥCsÕĆßBÇķõĖÖĖĐO³2B¡ĶÖÅĆ!Ė)Ñj½ğ·cÆĕė¥ĥÆsÇķÅÖõ!ıOÃ!B!oĆ]Å!!B÷ĦÅ2Ķħkč×µBæBÇķÅĖĆ!ĚO³2BoúosõĖ!B÷ÖÅĶ2SÆå¦µ¦ÿR·ėÅö¤cġO³22¡C!rĖąĖRç!µÿ!3kåçrÏÕÇsÇåö¤!=O³22odRàæĶ2Ėj3z!¦ÖQĎħQ¯åR·æööåĦĚO³!2¡2SÕĶĆ!Ħ9gwĖ!BBĶïAkÿ!Çöæ!ĖåġO³Ķ22R_Ć¥!ĥĽ·ĚĊßĶRBdÖYdÅ:ÇÖÖÕtBÀO³!Ķ!2!ÄBnĖkąėkÖ!BRBBî:ösÇÆŅ2ĖcĚ.äĶĦ!2cn!ĖöÞÕdĮö!BcĶ!!!ÿc·BQ!BBġ.ĔĖĦ2RłæÅ!RæYKĆ¿!2cB2Ħ!2S¥ĦĖÕRÇ°.CóĖĶÂ!ðĖĆ!!õtõö!!RR!!Ķ2ĦĦ!cdRRĚ.!CĿĖúR_S!!BR!rbĶÇB2BcStö!!ĥ!!!ĺ.!!!C!!!R!!!Kö¥]ĖsĝĖĥ !,Ī> !(Ħ !&t !&õ !/",
);
rawImages.push(
  "!BĚ. !8Ħ !)ĺ. !-t!!S!õ !/ĺ.!!!t!!S !&KĖcĖĖ¶¶9!!ĥ !*Ě.!tİÙ!!³!!B!R!rs¥¶ !'S!!Ė!ĥ!!ĺ.tÃĶ!!2ł!!Ė!Ć!!Ŀ!·ĆĕĶ!!t¶sĆ!R!!İOóĶ!!2_ðÖõtõĽ}åĆBRtĖĵĆ!2·¶¦!!ĥ!ĚOÃ222³Å¤Ćtĥ:Õöÿæ!BcĦ!BĆÿc·ćõ2ĶĖLOÓĶBÃĕsåĦcĆką¥ğ¯RBBĦ!RĖĦBÇķąĶĖ!LOÃ22od1ğĦRæz·g©¶s!!¦Ö¥ĥÆsÇķąĆæsĚOÃ!B¡S1ąĆ!öCčĚĚæB¦ĥĶ×¤BßBÇķõĖÖĖĐO³2B¡ĶÖÅĆ!Ė÷93½ğ·cÆĕ×r¦åR·ėÅÖõ!ıOÃ!B!oĆ]Å!!B÷ĦÅ2ĶħkĭtjßÕÇsÇåĖĆĦĚO³2Boúosõ!Ėc×ÖÅĶ2S¶½ħ1¿ÿR·æöö¤cġO³22¡C!rĖĕĦ·c!µÿ!3kåħbJĆ!ÇöĆöÅĦ=O³22odRàæĶ29ß¾z!¦ÖQĦķ{sr:ÇöĆöĆĕĚO³!2¡2SÕĶĆĽĠĜĖJĆ!B2SsY:¯sÇÆĖĦĶĆĀO³Ķ22R_Ć¥!IĠÛķkÏ!B2R!!Ė!c·sæÕ2¦ÀO³!Ķ!2!ÄBnkďÌīºÖ!BR !&RSÖö¤2ĖcĚ.äĶĦ!2cnCÅzÐÑ2úö!BRB!ĶBĿ3ĕtĕĆc!ġ.ĔĖĦ2RłæÅ¦µ9|!ö¯!BRR2Ħ2ĶĦ!!ÇĖĵç].CóĖĶÂ!ðĖĆ!!õtõæ!BcSĕĶ!Ħ!!!c¦c!Ě.!CĿĖúR_S!!BRÅÖµScBRBRztö!!ĥ!!!ĺ.!!!C!!!R!!ÏQdR,!ĦjĖĥ !,Ī> !(Ħ !&t !&õ !/",
);
rawImages.push(
  "!BĚ. !8Ħ !)ĺ. !-t!!S!õ !/ĺ.!!!t!!S !&ĎdcĆĖÆíĖĥ !,Ě.!tİÙ!!³!!B!R!rs¥¶!!z!!S!!Ė!ĥ!!ĺ.tÃĶ!!2ł!!Ė!Ć!ąď!·ąĶ!!t¶2!!!R!!İOóĶ!!2_ðÖõtõĝÀåĆ2cSĶĵĶ!t¶s3!!ĥ!ĚOÃ222³Å¤Ćtĥ:ÕÖğÆBBRĶ!Ħ!ď·¶sĦ2ĶĖLOÓĶBÃĕsåĦcĆ¾êĆg¯RBB!ĦcĆ!c·ćąĶĖ!LOÃ22od1ğĦRæ#ëļúÖBRBdsÅĖĦBÇķąĆæsĚOÃ!B¡S1ąĆ!öėĻ3ÿæB¦ĥĶć{¶¯sÇķõĖÖĖĐO³2B¡ĶÖÅĆ!Ė¥iU½ğ·cÆĕ|íBæBÇķÅÖõ!ıOÃ!B!oĆ]Å!!B÷ĦÅ2ĶħkåėY¦åR·ėÅĖĆ!ĚO³2BoúosõĖ!B÷ÖÅĶ2SÆõt¬¿ÿÇsÇåö¤cġO³22¡C!rĖąĖRç!µÿ!3kåėrlåR·æöö¤!=O³22odRàæĶ2Ėj3zĦÇÖQĦďrJĆ!ÇöĆöåĦĚO³!2¡2SÕĶĆ!Ħ9sZö!RR!ćjCçR¯öæ!ĖåġO³Ķ22R_Ć¥!ĥĽ·g6¯!RB¦sj*ösÇÆæÕtBÀO³!Ķ!2!ÄBnĖk·QĞČLBB2!cĆ!c·sŅ2ĖcĚ.äĶĦ!2cn!Ėö½+ĮîČLBB2!!!įSÖö¤!c!ġ.ĔĖĦ2RłæÅ!RæYKöbLBBc2ĖB23õ!ç¤cç].CóĖĶÂ!ðĖĆ!!õSĕæ!B2cĶĶ!Ħ!!!c¦c!Ě.!CĿĖúR_S!!BR!rA2CR2c×Xtö!!ĥ!!!ĺ.!!!C!!!R!!!Ď3¶]ą×íĖĥ !,Ī> !(Ħ !&t !&õ !/",
);
rawImages.push(
  "!BĚ. !8Ħ !)ĺ. !,t!!!Sõ !0ĺ.!!!t!!S!!!|öcĆĖ¥čĖĥ !-Ě.!tİÙ!!³!!B!Rrs¥¶!!!z!!S!!Ė!ĥ!!ĺ.tÃĶ!!2ł!!Ė!Ć!ąď!·ą3!ss!2!!!R!!İOóĶ!!2_ðöÕtÌðĖåĆ2ctĖĵĶt¶!s3!!ĥ!ĚOÃ222³Å¤dą*ÿ^æ©ÆBBR2!Ķ!]Æ!!B2ĶĖLOÓĶBÃĕsåSĥkÿ-öV¯RBB!Ħ!!2·¶sĶĶĖ!LOÃ22od1ğBĦĭ~ªÆğÖBRB22ĶĖ!c·ćąĆæsĚOÃ!B¡S1ąĶĖĝÑċsďæB¦ĥCsÕĆßBÇķõĖÖĖĐO³2B¡ĶÖÅĆ!Ė)Ñj½ğ·cÆĕįc¶ĽsÇķÅÖõ!ıOÃ!B!oĆ]Å!!B÷ĦÅ2ĶħkåėzBæBÇķÅĖĆ!ĚO³2BoúosõĖ!B÷ÖÅĶ2SÆå¦µ¦ÿR·ėÅö¤cġO³22¡C!rĖąĖRç!µÿ!3kåçrÏÕÇsÇåö¤!=O³22odRàæĶ2Ėj3z!¦ÖQĎħQ¯åR·æööåĦĚO³!2¡2SÕĶĆ!Ħ9ggö!RcĶïAkÿ!Çöæ!ĖåġO³Ķ22R_Ć¥!ĥĽ·ĚÊ¯!RcdÖYdÅR¯ÖÖÕtBÀO³!Ķ!2!ÄBnĖk·QĞČLBRBBî:ösÇÆŅ2ĖcĚ.äĶĦ!2cn!Ėö½+ľÞČLBB2!!!ÿc·BQ!BBġ.ĔĖĦ2RłæÅ!RæYÀ¤bL B&ĦB!S¥ĦĖÕRÇ°.CóĖĶÂ!ðĖĆ!!õCĕö!B2cĶĶ!BĦĦ!cdRRĚ.!CĿĖúR_S!!BR!rA!Btccditö!!ĥ!!!ĺ.!!!C!!!R!!!Kö¥]ĖsĝĖĥ !,Ī> !(Ħ !&t !&õ !/",
);
rawImages.push(
  "!BĚ. !8Ħ !)ĺ. !-t!!S!õ !/ĺ.!!!t!!S !&KĖcĖĖ¶¶9!!ĥ !*Ě.!tİÙ!!³!!B!R!rs¥¶ !'S!!Ė!ĥ!!ĺ.tÃĶ!!2ł!!Ė!Ć!ąď!·ĶĕĶ!!t¶sĆ!R!!İOóĶ!!2_ðÖõtõĝÀåĆ2ctĖĵĆ!2·¶¦!!ĥ!ĚOÃ222³Å¤ĆtĥĽööÿÆBBcĦ!BĆÿc·ćõ2ĶĖLOÓĶBÃĕsåĦcĆką¥ÿ¯RBBĦ!RĖĦBÇķąĶĖ!LOÃ22od1ğĦRæz·ggÖBR!¦Ö¾2YsÇķąĆæsĚOÃ!B¡S1ąĆ!öCčĚĚæB¦ĥĶïAÏßBÇķõĖÖĖĐO³2B¡ĶÖÅĆ!Ė÷93½ğ·cÆíħI¦åR·ėÅÖõ!ıOÃ!B!oĆ]Å!!B÷ĦÅ2ĶħkĭtjßÕÇsÇåĖĆĦĚO³2Boúosõ!Ėc×ÖÅĶ2S¶½ħ1¿ÿR·æöö¤cġO³22¡C!rĖĕĦ·c!µÿ!3kåħbJĆ!ÇöĆöÅĦ=O³22odRàæĶ29ß¾z!¦ÖQĦķ{srR¯öĆöĆĕĚO³!2¡2SÕĶĆĽĠĜĶĮö!RcCsY:¯sÇÆĖĦĶĆĀO³Ķ22R_Ć¥!IdP#*¯!Rc2!!Ė!c·sæÕ2¦ÀO³!Ķ!2!ÄBn:#Äī6ČLBR !&RSÖö¤2ĖcĚ.äĶĦ!2cnCÅzįN2ºČLBB2!!!Ŀ3ĕtĕĆc!ġ.ĔĖĦ2RłæÅ¦µ9|!æbL B&ĦBĶĦ!!ÇĖĵç].CóĖĶÂ!ðĖĆ!!õtÅĖ!B2cĶĶ!Ħ!!!c¦c!Ě.!CĿĖúR_S!!BRÅÖ¤2CcscSitö!!ĥ!!!ĺ.!!!C!!!R!!ÏQdR,!ĦjĖĥ !,Ī> !(Ħ !&t !&õ !/",
);
rawImages.push(
  "!BĚ. !8Ħ !)ĺ. !-t!!S!õ !/ĺ.!!!t!!S !&;ĆöÖĦĝ!!ĥ !,Ě.!t¢22N!B!C!!Ķ!Q!!2R¥!½tĦ!Ė!ĥ!!ĺ.tp!2!2!!³!!µ!ĖįĶ!B!¦!Bs!!!ĶR!!İOÃ!!!2!ĠS!µĖĖČ+Ė!!R2C!cB÷!!Ħ!ĥ!ĚO³!!22oS!µĆĦĭlČïĖ2R22SĥLs÷å22ĶĖLO³!!22oSµĆõĶJĺæįæ!R2B2tÕBÇ÷ąĶĖ!LO³!!!2¡-µÖõB)·Õ+æ2BBBt:ĖÍçėąĆæsĚO³!Ķ222oĖÆąĖ×)¶ZĆ!2B2eÌ§¤|3õĖÖĖĐO³!Ķ222!łBæ¤R¾3ĿĆçĖąSĖŅSå¦3ÅÖõ!ıO³Ķ!!ĶBÔ!2nĖĶ×¶ÆĕĶ¦{A#)·åd3ÅĖĆĦĚO³Ķ!22¡S!rĦõĖ¦¶µĆĦ·æö®Ņ}å¦÷åö¤cġO³Ķ!22¡S!åöĦõtRĿĆĖ¶ïA#æĞådĖĆöÅĦ=O³Ķ!22_ĠS!µĖĖY3ÍĖ¦ĥĶ!#¾þåïÎĆöĆĕĚO³Ħ22ĶRNtÅ!æºùėúę!R!2uĽķĖ|ĖæĦĶĆĀO³Ħ!2!BĦR!2!e·æ)È22R2SíZĆ¦Ė¶Õ2¦ÀO³Ħ!!!2Ä!!!òĝs¶Ļę22!R2Så!¦æŅ2ĖcĚ.ÔĶĶĶ!222!B~:ĥÈVę22BR!!ÿtöÖõĆc!ġ.ĄĖĶ!!!RÃŅĥĖĖzħÿö22BR!!2CĥĖÇĖĵç].CãĆ!!Bô¢!röĥæcĆ!ĦBRB!2tõĖ!c¦c!Ě.!CãĦ!¡!B!C!!Ķ!ĤĆ!!c¦RcİtČ!ĥ!!!ĺ.!!!C !)låėmĦ#Ħĥļ !,Ī> !(Ħ !&C !&ĥ !/",
);
rawImages.push(
  "!BĚ. !8Ħ !)ĺ. !-t!!S!õ !/ĺ.!!!t!!S!!!ÿccRÆsÝ!!ĥ !,Ě.!t¢22N!B!C!!Ķ!Q!!2R¥!½tĦ!Ė!ĥ!!ĺ.tp!2!2!!³!!µ!ĖįĶ!BSR!¶!!!2!2!!İOÃ!!!2oŀ!ĆĆĖ¼ðÅĖ!!R2CRR¶!!C!!ĥ!ĚO³!!2_R2ĆÖĶčďMæwæ2R22ScÀ÷!ĕĦ2ĶĖLO³!!2_R2ĆÆõ:į>Ġįæ!R2B2C2s÷åBĶĖ!LO³!!!2²ŀö¥õI,{ÅJæ2BBBSBÕBÇ÷ąĆæsĚO³!Ķ22RNĖÆąĽ,ĜeĽĆ!2B2ÇĮTÍçėõĖÖĖĐO³Ķ!!B2BĢĶöÅYİÞĿĆçĖąSĖĝç¤|3ÅÖõ!ıO³Ķ!Ķ22Ô!ĲµĖĶ×¶ÆĕĶ¦{A#ISå¦3ÅĖĆĦĚO³Ķ!!B¡S!ÅöõĖ¦¶µĆĦ·æö®)]åd3Åö¤cġO³Ķ!22¡S!ĕÖĖõÇ!ĿĆĖ¶ïA#Ņßå¦÷åöÅĦ=O³Ķ!22_ĠS!õöĶěv¬Ė¦ĥĶCĦ¾ĞådĖĆöĆĕĚO³Ħ22ĶRNtõĖæº×Ĉīę!R2d3I<åïÎæĦĶĆĀO³Ħ!2!BĦR!2!e·¶)È22R2×þąĖ|ÖöÕ2¦ÀO³Ħ!!!2Ä!!!òĝRĆċę22!RBĎZĆ¦¶Q2ĖcĚ.ÔĶĶĶ! 2'~Ý¥ÈVę22BR!dÿ!¦c¤!c!ġ.ĄĖĶ!!!RÃŅĥĖĖzħÿö22BR2!Ėt¥öĶĥ2ç].CãĆ!!Bô¢!röĥæcĆĶĶ2cB2CRõĖR2¦c!Ě.!CãĦ!¡!B!C!!Ķ!ĤĆ!!cdBRİtČ!ĥ!!!ĺ.!!!C !)|å×mĆÆÇĥļ !,Ī> !(Ħ !&C !&ĥ !/",
);
rawImages.push(
  "!BĚ. !8Ħ !)ĺ. !-t!!S!õ !/ĺ.!!!t!!S !&lĆs!ÖĆI!ĥ !,Ě.!t¢22N!B!C!!Ķ!Q!!2RB!ýtĦ!Ė!ĥ!!ĺ.tp!2!2!!³!!µ!ĖįĶ!BCB!cBR!!ĶR!!İOÃ!!!2!ĠS!µĖĖČ+Ė!!R2C!ĥSs÷ĶĶ!ĥ!ĚO³!!22oS!ÕæĦĭlĬÏĖ2c2!SRğBÇ÷õ2ĶĖLO³!!22oSõæåĦ{µ¶įæ!RR!SkĖÍçėąĶĖ!LO³!!!2¡-ÕÖÕB)·gwæ2BBBçIç¤|3ąĆæsĚO³!Ķ222oĖÆąĖ×)Õ;Ć!2Bt#ô<å¦3õĖÖĖĐO³!Ķ222!łBæ¤R¾3ĿĆçĖĦ2Ėĥ·åd3ÅöÕ!ıO³Ķ!!ĶBÔ!2nĖĶ×¶ÆĕĶ¦{A#Ņßå¦÷åĖĆĦĚO³Ķ!22¡SĕÆĆĕĖ¦¶µĆĦ·æö®æ]ådĖĆö¤cġO³Ķ!22¡SĕĖÖĖĥtRĿĆĖ¶ïA#æþåïÎĆöÅĦ=O³Ķ!22_ĠSĕæĆĽÏîÍĖ¦ĥĶ!T9ąĖ|ĖĆöĆĕĚO³Ħ22ĶRNtÅ!íÃ6¥úę!R!2ÇzĿĆ¦ĖæĦĶĆĀO³Ħ!2!B2!!2Ėãý1)È22R22!Ć!¦ææÕ2¦ÀO³Ħ!!!2´2Ķ!¸ðZĥ7ę2ĶBBBĶĦts2r2ĖcĚ.ÔĶĦ!2!22!âĜÀÌeºę22!c!ĶįCĥ!Çrc!ġ.ĄĖĶĶ!22N¶ĥĖ)°Ýÿö22!B2R2ĶĖ!c·Õç].CãĆ!!2ô¢ÕĆöĥæcĆĶĶBB!B !'RCÆ!Ě.!CãĦ!¡!B!C!!ąĦQĶ22SBRcİtČ!ĥ!!!ĺ.!!!C !);Bs,cħĦĥļ !,Ī> !(Ħ !&C !&ĥ !/",
);
rawImages.push(
  "!BĚ. !8Ħ !)ĺ. !-t!!S!õ !/ĺ.!!!t!!S !&į¥B¥ÆÍ!ĥ !-Ě.!t³>BB!3 !(bĦ!BRsÍ!S!Ė!!ĥ!!ĺ.tp!2!B!!!¢!õĆöįĖĶR2¦RRc !)İOÃ!!!22ô_C!õÆąĭLõĶ!R2¦RR¦R!Ė!ĥ!ĚO³!!!2BodĦõÆąĭàIZö!RRS¥ÀR¦Rå2ĶĖLO³Ķ!!2BÃBÕĆVòíçÛ35ĖRRS¥ĆĦætRåĖ!LO³Ķ!!22ôÃąĊòöĜ·gdĩĖRRS¥ĮsĎcÇµæsĚO³Ķ!!22R!!!òÅçĝs'5ĖR¦!3ķ×bĿÇµÖĖĐO³Ķ!!22R!¢õöµ2®§þądRĖ!Ær×µėÇAÕ!ıO³Ķ!!22ô!!ĶĂåĶtÖÖåĶ!ÇÍ·¬÷µė¦¤ĆĦĚO³Ķ!!22²d!ÕæåĶS¶2bö¥ÇRsćĿÖķµö¤cġO³Ķ!!22oBdÕĆĖ!¥ĐöbĖ¥ÇÍ·sĎµ#SbQR=O³Ķ!!22ÔB!¢å!!ítVĩctõ3ÖzÏµħ·AĆĕĚO³Ķ!!222BÃĦ!!ééėĚĉĶBRC3ķç¤ğd¤ĶĆĀO³Ħ!!B!BB !&¢iėi[[BBt!í|BæSĤ2¦ÀO³Ħ!!22ÄB!!2ĖùB¥h}K!Rc¦Ć!¶cbĖĖķĚ.ÔĶĶ!!!B!2!!M{ĥeåĎĦ2R2cįt¶ĖĶrc!ġ.Ô2Ė!!B2!RâåĶĖYstĮĦ2R2R!¦µBB·Õ·°.CÃĦ!!2ÄR!¢bå!!æ!Ħ2R2B2ĶĦĖ!¶CsRĚ.!CãĦ!R!¢ !'µ¤ĶĞsl!RsĀ!j!ĥ!!!ĺ.!!!C !);¥BŀÆÍ!ĥ !-Ī> !(Ħ !&C !&ĥ !/",
);
rawImages.push(
  "!BĚ. !8Ħ !)ĺ. !-t!!S!õ !/ĺ.!!!t!!S!!!ßQçcÖcz!ĥ !-Ě.!t³>BB!3 !(bĦBRRR½!S!Ė!!ĥ!!ĺ.tp!2!B!!_C!õĆöįĖR!C¶cR !*İOÃ!!!2BİC!ĕÆĦìĀ¶õĶ2RCcscS!!BĦĥ!ĚO³!!!2R¢BõÆĦìĀ®Ùgö!RRS¥ðB·!ĖĥĶĖLO³Ķ!!2BÃBÕĆĶĶítÛ35ĖRRSRĶ¶2Çå!Ė!LO³Ķ!!22ôÃąĊòöĽçŅWĩĖRRSRBöæ!ÇµæsĚO³Ķ!!22R!!ĖòõçĝÖċ5ĖR¦!¶§sĎcÇµÖĖĐO³Ķ!!22R_CõÆå2®§þą!·Ė!Ć9×bĿÇAÕ!ıO³Ķ!!22ô!!ĶĂåĶtÖÖåĶ!ÇÍ·Í×µėÇbĆĦĚO³Ķ!!22²d!ÕæåĶS¶2bö¥ÇRsď÷ææ¦b¤cġO³Ķ!!22oBdõĆö!¥ĐöbĖ¥ÇÍ·¤ĿÖķµöQR=O³Ķ!!22ÔB!¢ĕĖ!ítVĩ¦RĖRs:Ďµ#SbĆĕĚO³Ķ!!222B!¢!!ééÆGĉĶBRdöķ|ĖöBÆĶĆĀO³Ħ!!B!BB !&¢i÷«[[cB¦æ)ç¤ğ!A2¦ÀO³Ħ!!22ÄB!!2ĖùĖĶ'}K2cB¦½|BėrµĖķĚ.ÔĶĶ!!!B!2!Ē¤ĽceÅĮĦBRR2,¶!cbĆc!ġ.Ô2Ė!!B2!RĂöąĖĽçĦ*ĦBRB2t!¶¶RBÕ·°.CÃĦ!!2ÄR!¢bå!!æĦ!2R2BtąĖĖ!¶CsRĚ.!CãĦ!R!¢ !'µbĮsľ!SssĀ!j!ĥ!!!ĺ.!!!C !)[BcŀÆÍ!ĥ !-Ī> !(Ħ !&C !&ĥ !/",
);
rawImages.push(
  "!BĚ. !8Ħ !)ĺ. !-t!!S!õ !/ĺ.!!!t!!S !&lĆ¥¥sÖIĥ !-Ě.!t³>BB!3 !(bõ!tÆ!Í!S!Ė!!ĥ!!ĺ.tp!2!B!!!¢!õĆö<åĶRScR×!RĖ!ĥ!!!İOÃ!!!22ô_C!ĕ¥ąĭ+ĖĶ!RScsBtRåS!ĥ!ĚO³!!!2B2ÃĦĕ¥ąĭàz*ö!R¦!Æ]Ħæ¦ĕ!ĶĖLO³Ķ!!2BBÃĕĆĺòíçç'5ĖRcCksĎ!×ĕ!Ė!LO³Ķ!!22ôÃĕúòöĜ·gdĩĖRctöĽ×bĿÇµæsĚO³Ķ!!22R!!!òÅçĝg3UĦ!¦ÖÇLą!ėÇµÖĖĐO³Ķ!!22R!¢õöµ2®§þĥtRæ¥B¤Çææ¦bÕ!ıO³Ķ!!22ô!!ĶĂĖątÖÖĖą!ÇÍ·¤ĿÖķµĖĆĦĚO³Ķ!!22²d!ąÆĆąS¶2bö¥ÇRsøĎµ#Sb¤cġO³Ķ!!22oBdąĆöĶ¥ĐöbĖ¥ÇÍ·ÕÏæö·AQR=O³Ķ!!22ÔB!¢åĖĦĽtVĩBtĕ3Özç¤ğdrĆĕĚO³Ķ!!222ã!Ħ!õĺ_ZĚ]¿BBSRć|BæS1cĆĀO³Ħ!!B!BB !&¢½ėi[[B2!c3!s¥Æõ2¦ÀO³Ħ!!B2ä!!!Ħ!o®µx]l!RBĶRC¶!ÖąĖķĚ.ÔĦ!!!B!2!!òĝďözĶĎĦ22BBįCRåtÕc!ġ.ÔĶĶ!B2!R!¡ĥĶčÀďĞĦĮ2!RcĶ¦åĖR¦ą·°.CÃĦ!!2ÄR!ĢÆĥ!!æ!Ħ2!cBĖ !'R×RĚ.!CãĦ!R!¢!!!õ!Ć¤Ķ!Ğsl!R°sj!ĥ!!!ĺ.!!!C !(ÿÆÆB}¥j!ĥ !-Ī> !(Ħ !&C !&ĥ !/",
);
rawImages.push(
  "!BĚ. !8Ħ !)ĺ. !-t!!S!õ !/ĺ.!!!t!!Q!$!![ĖcĆÆcYĖĥ !,Ě.!tİÙ!!_úoúoúo!Ė !&»!!Q!!Ę!ĥ!!ĺ.tÃĶ!!2Ķo!ĆĦĦ!!°!Ė!!!RRs!!Ė!R!!İOóĶ!!2_İĆĦĦ!¼Ðæ!ÖöĆ!¥!!R×!Ħ!!ĥ!ĚOÃ222³õĦĆ!!¼ÐČÿ!¦Ćą!B!!L¶×ĕĦ2ĶĖLOÓĶBo!C¤ösÕĭr«&ÿt!ĦÆ!æ!ą¦¶×ąĶĖ!LOÃ2!¡dĦ°¤dą¦'igĦ·!¥ü!mæąĶ÷ćąĆæsĚOÃ!2²ĶdbÅĦtõ9!+ĖtB!cü!<ĿĆ·#õĖÖĖĐO³2!Bod¹ÂÅ·ÕjØÞ,¥!ĆcüĶğdąd#ÅÖõ!ıOÃ!!22!İ¥r·Õė¼Ðæ!¥ĆcÜ!į·ÕÇćÅĖĆ!ĚO³2!22o!ÆÅCąç!r!!÷ĆcÜ!į}ĆĖCåö¤cġO³2!N¦!ĥÆæRĖ¥¼]ß!ėĆcÜ!į·ÕÇÖöö¤!=O³2!BÃRİĖö!!ċf½Ć·sĆcÜ!ïÇądĆĆöåĦĚO³!2!BÃĕ!ĖĦĖċ÷+ĖtB!cě!ðĿĆ·Ćæ!ĖåġO³Ķ22!!BoÆ!¤««wÿRC¥ě!MÅĖ!÷sæÕtBÀO³!Ķ!2!ä!!!eĆËºBRCĦÆ!ÅĦĶ!ħBŅ2ĖcĚ.äĶĦ!2c!oÆ¤ĝĐČ¯B×å!!!ĦĶįÇÖ¥¤!c!ġ.ĔĖĦ2RłsÆ¤!!ĝlößħĖĆąĶ!¦s!¤Ķç¤cç].CóĖĶÂ!İÆ!öĥ!!Ķ!SĶąĶR!!!2!!!¦c!Ě.!CĿĖúR_úoúoúo!Æ!!!s»!!Q!!Ęĥ!!!ĺ.!!!C!!P!!!$Ď3¶]R¥¬Ė!ĥ !+Ī> !(Ħ !&r !&÷ !/",
);
rawImages.push(
  "!BĚ. !8Ħ !)ĺ. !/tS!!!õ !-ĺ. !(S !'ď¥Õ·ħQčĖĥ !+Ě. !&Cã!!_!!!2!!C!!Q!s!t!!Ħ!Ėĥ!ĺ.!!!CÃ!!!B !'äãr!ÆĵĶCcÖS !'ď.!!C¢2!´!2!B!oCRrĖR½+íZ!¦Ö·!ĶĶĦĚ.!!C¢2 !&2!B³RÕĆĖíÏÎľąįCö¦RĶĖą,.!!C¢2 !'2!¡SÐ6âĽSöĚĩBC¶sRtĖµm.!!C¢!2´ !&2B!!âĦČ·SÛĘ!çĞcĮ¥tåĚ.!!Cp22 !'2BãĖÅöą{dûè,CĭsckSąŀ.!!Cp22 !'2B2^r!ÖY×JccĖÆö:kSµm.!!Cp22´ !&2B!!2!²æR¶ĖB:ÞR¥¥SbĚ.!!Cp22 !'2BãåĶæö¶¥sĖ,ÆkRĮCÅĖÀ.!!Cp22 !'2B³-ąĦĦ×ĕsĖĥ¿¶s®¥SŅĀ.!!Cp22´ !&2B2ÓĦÙ³ÙéļèĞß¾öBkSĔĚ.!!Cp22 !'2!R!!³Ùédwê<3ĭsckSbÀ.!!Cp2!2 !(ĶÄR!!éķěĘ!çÎ!¥¾Cĥİ.!!Cp2!£2!!!2B!!!.zs÷7øB2dRBÇÅÇĚ.!!!´!2 !&ĶB!!2ĶR!eÈÅĮį2d¶¦r!Rm.!!!ÄĶ !(2Ķ2´>öõ:Ïzö{2dsb!¦¥m.!!!Cp!q!!!BRoCÅĆåĆRĮĖRJ*ľĖĶ!ħsĚ. !&Cp!!B¡ !&B!S!ĔĎR·t!!Ħ!Ėĥ!ĺ. !(C !'ÿæį·ÖÆÝ!!ĥ !*Ī> !(Ħ !(C !&ĥ !-",
);
rawImages.push(
  "!BĚ. !8Ħ !)ĺ. !-t!!S!õ !/ĺ.!!!t!!S !&QĖsĖĦs÷Ėĥ !,Ě.!tİÙ!!³!!B!R!WÖsBcCR!!S!!Ė!ĥ!!ĺ.tÃĶ!!2ĸĦ2ĶöR!!s!BĖĶ!ĦBc!!222BBĺOóĶ!!2_ÖÆcBĆÖæĖĦ2¶ĶĦĶĖĶBsBBB!Ħ!ĚOÃ222³»ĆĦĦ!ķÕÖRĆ!c!ĶĶĶ!2¥BsĦĦ!B6OÓĶBÃĕ¼ĦĶBĦ#·ÖP!22 !&Ķ!Bc×ĥĦ!!6OÃ22odGcĶ2Ħcĕ!SæB!22RĆĶĶ2s×ĥĦĖRĚOÃ!B¡SWĶĦ!ĦcsÕ3Ė2RĶĶö¶Ħ!Bs×ąĦĶ!gO³2B¡ĶÌĶ!ĖĶB¥Õħ2cBĦĖÆÖ2Ė2s×åĶĶ!wOÃ!B!oÌs2ĖB2¥Ėæ!ĶÆöĖ¶ÆcĦ2BçåĦĦĶĚO³2Boú$Ć2ĆBĶcĦö!!ÖĖĦcÖcRRRçµĆĦ!ÚO³22¡Cûö!ĖB!¥ĖöB!ÆöĦ¥ÖRĦ2BçåĆĖ!êO³22odRÖĶĦ2ĦsÕ#!BRöĶÆÖ2Ħ!s×åĖ!!ĚO³!2¡2ĜĖ2Ė2ĖsÕCĖ!RĦ!ö¶Ħ!Bs×å!ĦĶ©O³Ķ22RĨ!ĶĖĦRėńS22!!BRĆĶĶ2s¶æ!ĶBgO³!Ķ!2!ÄBèĦĆĈbÅæ22!!!Ķ!2Bcc¶BĦBĚ.äĶĦ!2cèĶĦ!öĖõ3ö2c!!Ķ!ĖcRsöĖĶ!Rº.ĔĖĦ2RĸĆĆ22ĦöæĆ22¶ĶĶĶĆ!RBĆ2RĖBcV.CóĖĶÂ!Ö!Ħ!æs!!Ķ!RĦĶĶ!!Ķ!!!2RR!Ě.!CĿĖúR_S!!BR!GÖRscCRB!tö!!ĥ!!!ĺ.!!!C!!!R!!!bĖs¶ĖsçĖĥ !,Ī> !(Ħ !&t !&õ !/",
);
// }
var deathCamOffset = rawImages.length;
// Death Cam Label {
rawImages.push(
  "#c Ņc!R !0R !QRâ R0âR !R â0 !T ©0 !T?! Ė,!? !TÅ/RR !)R?Åt !QĖ©!Õâ?³ R&³pâÅ!5Ė !QĖ©!!Å¤ â&¤Å!!©Ė !SĖ©Ç !*Ç©Ė !UĖĩ ©*ĩ!R !VĖ!Ń â*/R !URâå·©©!!©©×ÕâR !WĹĖ !'ęR !Y/R !'/ĖÇ !UĖ©¦Õââ!!!âÕÇĩĖ !UĖ% ©'!©©ĩĖ !VR/ââ!!/ â&R !URâÕ·©!/Õ!©×!âR !WĹĖ!Õ!©ĖęR !Y/R!!!/R/ĖÇ !UĖ©·Õââ!!ÕâÕ!ĩĖ !VĹ ©+âR !SRRââ !+©Ė !RRââ!! â+/R !RĖ©©!! ©*·Õ !TĖ !& Ė)Ĺ !SR !&× !*Ė©Ė !PRâRR!×ę! R*âR !Râââµ â, !RĖ ©&·!¦ç ©) !SĖĖĖ!Õ¦cĉ Ė)©Ė !VåĆ` R) !VĖ©!å¤ â*R !UĖ ©, !URRR !+Ė©Ė !RR/ģ â*ģ?RĖ !RRâÕą !*ąÅâR !QRâ!!Ç ©+!!âR !S©ù Ė+© !·Ė©!âpR !)Râ!©Ė !PRâ!!ÅâR !(âÇ©Ė !QĖ ©'!RR!!RR©ĩ !T Ė&!/ââRR/ â&R !URâÕ·©!/Õ!©×!âR !WĹĖ!Õ!©ĖęR !Y/R!!!/R/ĖÇ !UĖ©·Õââ!!ÕâÕ!ĩĖ !UĖĹ ©+âR !UR Ė,©Ė !QR!!Râ R,âR !PRâRR!! â, !Tââ!©!¦ç ©) !T©©!â¦cĉ Ė)©Ė !PĖ© !&åĆ` R) !RRâââ!©!å¤ â*R !PĖ©!©!/!¦ç ©) !SĖ©â!Õ¦cĉ Ė)©Ė !QRâ©!!åĆ` R) !RRâ!â!©!å¤ â*R !PĖ©©©ĖĖ ©, !SĖĖĖ!! Ė,©Ė !aĖ !Q",
);
// }
// }
var titleScreenIndex = rawImages.length;
// Title Screen {
rawImages.push(
  "!Ď# !FBRċ!B!!M !-ě!M!!ĔT !'Ĕ!ĭ!ĥ!S !'^ !(ċ!^!!!Ĕ!!!ĝ!2!2 !&Ħ!~!û!n!ë!K !;ĭ!!^!û!!B!!!+ !/Ľ !5+ !-Ę !FB2ī!ně!M!!!ĔT!Ĕ!T !,ĔT!!Ĕ!Ľ!^!!ě !&MěĿ!Tě!M !'Ĕ!!!ĭ!2 !&^!ċ!2!!Mċ!+ !'Q !8D!ċ!;!!Ľ!!!+ !/Ľ !3+ !/Ę !FB2ī!n !*Ĕ!!T!Ĕ!T!!ĔT !'Ĕ!!Ľ!^!ě !)Ŀ!Tě!MĔ!!TĔ !&ĭ!2!!!2MěĶ!2!!Mċ+ !Aĭ!;!!Ľ!!!+ !/Ľ !1+ !1Ę !F2BńQ !?Ľ!ĕ!d!M!ě!!M !(Ĕ!!T!Ĕ!!!ĭ!2!!!2 !'Ŀ!TĔ !YĽ !0+ !2Ę !F2Bń !@Ľ!ĕ!²!!!ě!M !&Ĕ!T!Ĕ!TĔ !&ĭ!2 !&^!!ě!MĔ !SQ !)Ľ !/+ !3Ę !F2Bń !ÑĽ!!+ !3Ę !F2Bń !JQ !½Ę !FB2' !'Ŀ!) !BĿ !MDĤ !m# !FB2' !'Ŀ!)Ħ !@2+ !GD!!Ĥ!DĤ!!!DĤ !iĘ !FB2'!Ħ!B!Ŀ!)Ħĥ!3 !'ĵ !&3!!!ĵ!3ĵ3!2!Ķ!!!22+!!!) !:Ŀ !(DĦB!Q!$ń!!DĤ !4Ľ !22 !+Ŀ !<Ę !FB2'!Ħ!B!Ŀ!)Ħĥ!3 !'ĵ !&3ĵ !&3!!ĵC!Ķ!!!22+!!!)Ķ!Ķ!!2 !4+ !'DĦ!BĤ!$BĤD!!Ĥ !4Ľ!!!+Ľ !&+ !') !*Ŀ !>Ę !FB2'X!!Ħ!;!)Ħĥ!!!Ķ!C !&2!!ĥ !'3B!!Ķ2!Ķ!!2+!!!)Ė2!!ĥ!3!ĵ!3!2!Ķ!!ĵ!!32BĿ !($!BĤ!$!ń$BĤ!D!!Ĥ !1Ľ+Ľ+!!Ľ!+ !+) !&Ŀ !@Ę !FBRī!!!Ħ!;!)Ħĥ!!!Ķ!C!ĵ!32!!ĥ !'3B !'Ķ!!2+!!!)Ħ!!ĥ!!3!ĵ!C!!Ķ!!ĵ!!3!2;!!!D!ĤDĦ!BĤDĦBösĤD!!Ĥ !3Ľ+ !.Q !&)!Ŀ !BĘ !E22Rī!Ė!B!+!)Ħĥ!Ė!R!3!ĵĶ!!S!!ĥ !'3B!!!Ķ!!2!+!!!)Ė!!!2!!ĕ!!S!Ķ!!!ĵ!32!BĿ!!D!ĤDĦ!!ń!DösösĦB!Ĥ !kĘ !E22Rī!Ė!B!+!)Ħĥ!Ė!R!3!ĥ !&S!Ķ!ĵ !&3B!!Ķ!!2!Q!!!)Ė!B!Ķ2!ą!!!SĶ!!!ĵ3ĵ32BĿ!!DĤ!DĦ!B!ĤDös!ĦB!Ĥ !lĘ !E22Rī!M!ċ!+!)ĦĶ!ĥ !+CB!!Ħ!ĵ!!3!!B!Ħ2!2!+!!!)Ė!B !&Ķĕ!!!Cĵ!!C!!n!Ĕ!!DĤ!!DĦ!BĤD!ösöRń !n# !E22Rī!M!ċ!+!)ĦĶ!ĥ !+CB!!Ħ!!ĵ!!!3!!!2!2!+!!!)Ė2 !)ĕ!!2!!!C!!něĿ!!!DĤ!DĦ!B!Ĥ!DöRń !oĘ !E2BBī!Ħ!2!+!)Ħ!!Ķĥ!!C !&ĥ!2!S!Ħ!!!ĵ!3!!22!!!+!!!)Ħ !(ĥ!!3 !*RĿ!!!DĤ!!DĦ!BĤDĤQ !rĘ !E2BBī!Ħ!2!+!)Ħ!!Ķĥ!!C !'ĥ2!S!2Ė !(2!2!!!+!!!)Ħ !'ĥ!!!3!!!B!!ĦRĿ!!!DĤDĤ!!DĦB!Ĥ$!BĤ !pĘ !EB2'!X!M!Ĕ!Tû2!Ķ!ĕ!C!!!2!!2 !&2!!Ė !&B!Ķ!2!+!!!)Ė !'2!ĥ!3!B !&ĦRĿ !&DĤ !&DĦń$!!ń !qĘ !EB2'!!!M!Ĕ!Tû2!Ķ!!ĶĥC!!2!!!2!!!2 !&Ħ2!!!Ķ!2!+!!!)Ėĥ!C2!B!!!Ė!B2!Ķ!ĦK!!!÷CP !)$!B!!Ĥ !GQ !IĘ !EB2'!Ķ!!!+!Tû2!ĕ!!CĕC!!!2!!!2!Ķ!B!!Ħ!!!n!ě!M!Ĕ!!!)Ėĥ!!C2B !&Ķ!2!ĶĦ!K!!÷·!Ħ!!B!Ĥ!!$!BĤ !-D!Ĥ!D!Ĥ !`Ę !EB2'!Ķ!!!+!Tû2!ĕ!!d!Ė!!!2!!!BĶĶ !*n!ě!M!Q!!!)Ħĕ!!C!ĵd!!!Ķ !&Ħ!K!÷r !)DĤ!$BĤ !.D !&Ĥ !aĘ !EB2'!M!!!Ĕ!Tûĥ!C!B!!!Ė !&2!B!Ħ !'B!Ħ22!M!Ĕ !&)Ħĕ!!!Cĵd !&Ķ!Ķ!2!+!$!!!ń !'DĤ !1D!ĤD!Ĥ !SD!!Ĥ !+# !EB2'!M!!!Ĕ!Tûĥ!C!B !&Ė!!!2B!!Ħ !&B!!!Ķ2!!MĔ !&)Ħ!ĕ!!C!ĵd!!!Ħ!!!22Ŀ$ĖRĖP!$!ń !4D!ĤDĦń !CD!Ĥ !/D !(Ĥ !(Ę !EB2'!M!!!Ĕ!Tûĥ!C!!B !&Ė!ĵC!2!Ķ !&B!!!Ķ2!!M!Ĕ!!!)Ħ!Ķ !&ĵCB!!Ħ!!!BĿ$ĖRĖPĘR!ń!!!_!!Ċ!Q !+D!!Ħ!ń !BD!!!Ĥ !&D!!!Ĥ!!DĦ !(B!!Ĥ !&Ę !EB2'!M!!!Ĕ!Tû2 !&2 !(ĦĶ!R!!!Ħ!!B!!!Ķ2M!!Ĕ !&)Ħ!ĥ!3ĵ!32B!Ħĥ!CBĿĘ!!!PĘR!ń!!_!!Ė!2B!Ċ !&DĤD!!Ħ!!ń !BD!ĦB!Ĥ!!D!Ħ!!ń!D!ĦĶ!!!2 !&BĤ !&Ę !EB2'!¦!!!Ĕ!Tû2 !&ĶB !'ĦĶ~!!ě!!Ħ!!B!Ħ2!^!!Ĕ !&)Ė!ĵ!3ĵ!322Ķĥ!!dĿĘ!!s!ĦĖRń!_Ħ!!B!ĖĶ!cĖĺ!!DĤD!Ħ!!ń !CD!Ħ!BĤ!D!Ħ!Ħ!@!DĦ!Ķ !)2!B!Ĥ!!!Ę !EB2'!!Ķ^!Ĕ!Tû2 !'2 !'Ė!~!!!ě !(Ķ^ !'Ĕ!!!)!!!Ħ2Ħ!!!Bĕ!3!K$ń!!Ę!!Rń!_ĦĖ!!!BRĖĶBBĖRĊ !EQ !'DĦĖRń!DĦ!!Ė!2@!$Ħ!Ķ !'22!2!B!Ĥ!!Ę !EB2' !&MĔ!TûĶ!B !&2 !&Ħ!!B!!!Ķ2!Mě!ĿT!Ĕ !-)!!Ķ!!!Ķ!^Ĥ$Ė !'ĥr.Ė!!BBĖ!!B!!ĶcĖR!Ċ!$!!ń !DD!ĦĖRńDĦ!Ė!ĵĶCsĦĦĶĵ !(3!!B2!BĤ!!Ę !EB2' !'Ŀ!TûĶ!B !&Ķ!B!Ħ!!!B!!Ķ!2!!!Ŀ!T!Ĕ!!!Q !,)!!ĶĶ!;$Ė !&ĥ!r.Ė !'cĖĥĶCRĶ!cĖR!Ċ$ń !:DĤ!!DĤ !(DĦĖ!RB!ĦĖĵĶ!!CsĦĖĥ !(2!3!!B2BĤ!!Ę !EB2'!Ķ2!!Ŀ!TûĶ!B !&Ķn!!û!!!B!M!!ě!!!Ŀ!T!!Ĕ !0) !&Ŀ!Ę!!!å×ń!Ģ!!õ!t!!BĶåt!!!B2!RĊ !;D!Ĥ!!D!Ĥ !'$!ĖĥCsĦ!ąĶĶĶBCRĖĥ!Ķ !&2!!23!!B2B!Ĥ# !EB2'!ĦB!!Ŀ!Tû2!Ħ!!2!2^ !&ċ!!2M!!!ě!!!M!Ĕ !5)Ŀ$ĖR¤söå!!!Ģ!RRĵ÷!!!RAÖCRĖB!2RĊ !:D!Ĥ!!DĦBĤ!DĤ!!$Ė!ĥCRĖĵĶĶĶ22C!ĵĶĦ !)B!2!3!R!BĤĘ !EB2'!Ħ!B!Ŀ!Tû2!Ħ!R!!!M !&ċ!!2M !&ě!MĔ)!Ŀ !5$õĦ!·bąĘ!P!$!]ĊM÷õt!RA¥R-!B!2RĊ !9D!!Ĥ!!DĦBĤ!$BĤ!$Ė!ĥ23!ĵĶĦ2ĶB2Ķ!ĦĶ !(2!B!2!3!BR!ö !EB2'!Ħ!!!;!Tû2!Ħ!RM!ě!M!!!ě!Ķ!2M !(Ĕ)!Ŀ !4$õĦĖĦćbąĘÕ·!å¦P!M¥æ÷!¥ĵ!ÖC!B!BBĊ !8D!!Ĥ!!DĦ!BĤ!$BĤ!$ĖĥĶB3ĵĶ!ĶĶ2ĶB!ĦĶĶ2Ķ2Ķ2!!2!B!23!B2Bö !EB2'!8!!!;!Tû2!Ħ~ !&ěM!!!ě !&M !)Ĕ !4Döą!ö!ą !'tĶ¶r!Ģrsö¥t¥ræ¥RCB!BĪ !8D!!!Ĥ!D!ĆBBĤ!$!BĤ$ĖĥĶB!!ĶĶĶ2Ķ!Ķ!!Ķ2Ķ !&2!! 2&!3B2Bö !EBRī!Ķ!Ķ!;!TûB!!M !'ě!M!!!ě!!!M!!!ě!MĔ !3DöąĖĦRÕ!!!D!Ĥ !&ĢFÑĶö¥t¥ræ¥RCB!BĪ!ĘP !4DĤD!Ĥ!!DĦĦBBĤtĦ!BĤ$õ!Ķ22ĶĶĶ2ĶĶ!!Ķ !+2! 2&!3B2Bö !EBRī!Ķ!Ķ!;!TûB !&M !&ěM!!!ě!Mě!!!Mě!Ŀ !)_!Ċ !)DöĥĆĖRÕ!DĤ!D !&¿Ö¥»Ģõ÷!!ĆÕæ!Æ2d2ĺ÷!!C!P !3DĤ!!!DĦĖ2BBĤDöR!ńDöĥĦB!ĶĶ!!2!!!ĶĦ !*2! 2&!3B2Bö !EBRī!M!!!Ĕ!Tûĥd!!!M !'ě!Ŀ!T!ě !&M!!Ĕ!!!_!!±!!!Ċ!!!DĤDöĥæ22Õ!DĤ!D!ĦB!!!¿!!ª!Ģ!!!õæ!¥Rdûö!R!BCsĤ !3DĤ!D!ĆĶ2BBĤ$Ė!RBĤĘĥĦ2!Ķ!2!22!Ķ!ĦĦ2Ķ !'2! 2&!C22Bö !*ÇÖÕĶą!!Rcd !3BRī!M!!!Ĕ!Tûĥ!d!!M !'ě!Ŀ!T!Ĕ!!)ĿT!Ĕ!!!>!!B !(Ċ!!$rc!Ėå!!!DĤ!DĦ!!B !'ĤĢÅĖ!¥æ!!¥Rļö!!!R!BCsĤ !3DĤDĦĖĵCBBĤ$ĖĥtBĤĘĥĦ!!!Ķ2!22!2Ķ!ĦĦ2Ķ !&2! 2&!C22B# !)ĖĖĦĶĔ !&ķcsd !1BRī!Ķ!^!Ĕ!Tûĥ!C!B!!M!ě!M!!ě!Ŀ !'T!Ĕ!!> !'B !)ČńSRå !'_!ĬĦ!ĶR !([Ė !(¥RüĖ!B!!R!BCsĤ !1DĤDĖĦ!!2BBĤĘĥ!tBĤ$õĦ!!Ķ2!BĦ222!!Ė!Ħ2Ķ!!!2! 2&!C22Bö !(Ķæ!ŅĶĶ!ĖĦĶQ!ķsÇ !0BRī!Ķ!^!Ĕ!Tûĥ!C!B !(M!!ě!Ŀ !'TĔ!!>Ķ !&2!!B !(ÜąÑ!Ī_Ċ!_!!ĦĬĶĦ!s !*ïĆæ!Æ-ěÖ!!s!Ė!RBrĘP !0DĤDĦĦĶĵ3B2B!öĥ!tBĤ$ĖĕĶ!!!dĕ!Ķ22C!ĥĦ!Ħ2Ķ!2!! 2&!C22Bö !'3åĥ!Ķ!!Ķ!Ķ!ĦĦAħs× !/BRī!Ħ!n!Ĕ!Tû!!2!!2 !&M !(Ĕ !)>Ħ!!2!!!2!BĖĶĦ!¥!Ċ!!_!!Ċ_!!Ħ!ĬĖ!!s !.Ĥ!·Ė!s !&Ės!r !2D!ĦĖĵ!3B2B!öĥ!CsĤDöĥĶ!!!SĕĶ2Ķ22CĵĶĦ!Ķ !&2!B!232B!Bö !&dÄĦĶ!!ĶĶ!!Ķ!!Ķ!ĶĶsÇ !.BRī!8!n!Ĕ!Tû!B!Ķ!2!M!!Ĕ!T !'Ĕ !'>Ħ !&2!!2!ĦĦ !&cĪ_!!!Ċ_!!Ħ!!!ĬĖĵ¦ !.Ĥ÷Ö!!RĶ!2B!!B!tń !0$!ĦĶĥ23R!BĦõĦBCsĤDĦĖ!ĥ!t!õĦ!2ĶBC!ĵĶĦ!Ķ!!2!B!2!32B!Bö!!sķÄĦĶ!!Ķ!!Ķ!ĶR!R!!Ö!¶d !-BRī!!!M!Ĕ!Tû!B!!!M !&Ĕ!TĔ!!T!!Ĕ !&ł !'2!!2!ĆBc!ĖĖĥC¥!!Ċ_!!ĦB!Ħ!Ĭą!Ķ·!!ĦBĦBĦBĦB!Ĥ¦Ħ!RĦ!!22B!!B!tń !.D!ĖĦĵĶC2BB!ĦĦĦBCsĤ!DĦĖ!!RBöĥĦ!22CRĖĵĶĦ!!!B!!2!3222!Bö!RtaĦ!!Ķ!!ĶĶ!!BDö!ĆąĥĆĖ÷ !-BRī!!!M!Ĕ!Tû!!B!!M !)Ĕ!!!T!Ĕ!!!>ĦĶ!2!!2!!2!ĆBB!Ī!āĶx_Ċ_!!ĦB!!!Ħ!Ĭõ!·Ħ!BĦBĦBĦBĦB!Ĥd !&222B!!B!tBĤ !-DĦĶĕ!ĶCB2BĦĖĥĦBCsĤ!D!ĦĖ!!RBöĥĶ!2CR!ĖĥĦ!BC!ĵ!!!3B2!B!ö!×P!!ĦĶ!!Ķ!!ĶćÇ!r!!!æÅ¶· !-BRī!Ħ!n!Ĕ !<łĶ!!!2!2!^2!ĦĦ!RĖ!cÅçĦ!!!B !&ĦB!Čå!¦Ķ !'2BĦB!!ĤtBĖ!!!222B!BC!Rń !-D!öĵĶ2CBB!ĦõĦĶ2dsĤ!!D!ĦĖ!RB!ĦĖĥC!!RĖĵĖB23R!ą3!B2!B!Ĥ÷ĸĴ!!Ħ!!Ķ!!ĶĶćÇr !6BRī!Ħ!n!Ĕ !<Ĳ !&2!2!!2!!!Bæ!!!¥Ć!!!B!B !(ČÕ!·Ė!!!22!2B!Ĥ!!·!Ė!!!222B!dP$ĖsĤ !,DĦĖĥ!CB2BĦĖĥĦĶ2dsĤ !&DĦ!ĖR!B!ĦĖ!!R!Ėĵ!3R!!ĖRB !&Ĥ!æB !&ĦĶ!!Ķ!÷Ė !8BRī!Ķ!-0S×P !9>Ė !&2!2!!2 !&Ė!!Ķ !&ĵ!3Bc !'Čµ!×Ėĵ!Ķ23B!RĤD!!Ĥ÷Ö!!!22R!!dP$ĖsĤ !-Döĥ!CRB!ĦĖĥĖĶBdsĤ!D!Ĥ!D!Ħ!Ė!RB!!!Ħ !,B!Ĥ !&CcR!!Ħ!!Ķ!!sC !9BRī!Ķ-bĦ!cå !9łĶ !&2!!2!Ħ !&ĥ3!2Ķĵ!Ħ!!!ScB !&Čµ!×ą!Ķ23!B!0DĦ!#!ĥÖ!!!2c !&dP$ĖsĤ !+D!ĦąĶCRBĦ!õĦĶĶBdsĤDĦ!B!ĤD !2Ħ!!BĤ !(ħRsR!!ĦĶ!!RµĘ !9BRī!ŁÕÖtAÖĥ!) !6ĿłĶ !'2BĶĦ !'ĥ!3!2ĥ!ĦĶĖ!Bt¥!Ċ!_Čµ!×ąĶ23ĵS!ĶcĦ!ÕdRń×ö!!2cĦ!B!!dP$BĤ !,D!öĥSBBĦ!õĦĶĶBdsĤDö!R!BĤ !1D!!Ĥ !*tą#sRĦ!!Ķ!s¶ĵ!!ė!!2!22!!2!2!!2!22!2!B!!!Ć!!ħAÖĥ!ĭ !6;Ĳ !(2!2Ħ2 !&ĕ!Ķ!C!ĵĖĖ!!!c×Ċ_!Ċ$¤!·ĥĦ2!t!ĕd!Õ!!µ$!õÖ!!sĦĦ!B!B!dP !'DĤ !&DĤDĦõSBBĦĖĥĦĶĶBds!ö!!!R!BĤ !<ĘÅą#sRĦĶ!2öĆcB222c!CRBĤ !($ĖĥĦ !+ķĶb¶ĥ!ĭ!2 !&Ķ!!!n!ěĶĶ!n!ěĦ;Ĳ !(2BĆ!ĵSB!Ć!ĕ!!2C!ĕ!ĶĖĖR·¥!!!Č¤!·ą!ĦRtĕĶCą!öć!ń$!b!!sĆ!!!B!B!dP !'DĤ !&D!ĦõCR!!ĖĥĦöĶB·B!öĥC!R!BĤ !<Ę!Åą#s2!Ķ!!ĶĶ!!Ķ!!!Ķ!Ķ!Ķ!Ķ2Bcå!DÇĦĦĶĶĖĶĦĕĶĦĶbÖą!ĭ!2 !&Ķ!!!n!ěĶĶ!n!ěĦ;Ĳ !(RBæ!!ĵ3!!ĵĖ!!BC!!ĵĦöĦBÇF_!!Č¤Ħ×ąĦ!ÇĕĖBC!µć!!ńD!A !)2B!B!dP !&D!Ĥ !&Döĥ!t!!õ!ĦĦ22·Böĥ!C!R!!BĤ !;Ę!!åå#s!!!Ķ!!Ķ!Ķ!!Ķ!!Ķ!Ķ!ĶĦ!2¶õ!éĦĦĶĶĖĶĦĕĶĦĶ¥µą!ĭ!2 !&Ķ!!!ně!ĶĶ!B!!Ħ;Ĳ !'RĪ.Ė-!!ĵ3ĕĦĖBBBC!!ĵĦöĶĶ¶tc!!ČµĖsĦ!sSå!Bd!Ħå×ńD!Ĥ×ö!sö !&2BBĦBµ !&DĦBĤ!!DĦĖĥĦBtõĦBĦĦ22·Böĥ!!C!R!BĤ !;Ę!!!rĵ3sĶ!!ĶĶ!!Ķ!!!Ķ!Ķ!Ķ!Ķ!Ħb3ĥ!éĦĦĶĶĖĶĦĕĶĦĶ¥Åõĭ!!2 !2Ķ!;Ĳ!!!Ķ26_ĖĖ!!ĵ!YďĦæ2BBR3!ąĦĦĶĦ¥·&_!ČµB!Ħ!s!öcd!!RĦ!ńĘ!R!¤Ħ !(2BBĖRµ !'DĦBĤ!$!Ė!ą!BĦ!!Ħ!2RtBÕĦ!BC!R!B!ĤDĤ !8#!!!åå!t!!Ķ!!Ķ!Ķ!!Ķ!!Ķ!Ķ!Ķ!Ħb3ĥ!éĦĦĶĶĖĶĦĕĶĦĶÖ¤åĭ!!2 !2Ķ!;Ĳ!!Ķ!cĪ_Ćĕ3ĵĶ¬ŀ¬JĦĆBRRĦĶĖĦ!Ķ!BÇF!_ČÕ!Ħ!!B!!¦!ĕ!b÷t!!!B!bĦ !(2BBĆcdP !&DĦ!ńDĦĖ!!ąĦB!!Ħ!ĶBRtBÕĦ!BC!R!BĤDĤDĤ!!!DĤDĤDĤ !.Ę !&rĵ3c!!ĶĶ!!Ķ!!!Ķ!Ķ!Ķ!Ķ!Ħb3ĥ!éĦĦĶĶĖĶĦĕĶĦĶÖ¤åĭ!!2!!2!!M!ċ!2!!Ķ!Ķ!2!+Ĳ!!ĥd2Ī_Ćĕ3ĥĦª>Ûnĕ¥cBcĦĆĦĦ!!!Rs×!ČĖĥCåĶ2BĦc2Ķ!r$Ė!ĦtB!Ĥ×ĖĦ !'2BĦĶsdsĤ !&$!B!ĦĖ!R!ÕĦ !&ĶRBtBµ!!BC!R!B!!!ĤDĤ!DĤ$ńDĤDĤ !-Ę !&åå!SBĶ!!Ķ!Ķ!!Ķ!!Ķ!Ķ!Ķ!Ħb3ĥ!éĦĦĶĶĖĶĦĕĶĦĶörÕĭ!!2!2!!!M!ċ!2!!Ķ!Ķ!2!+Ĳ!!ądRĪ_ĖĦĶĕĦ»!·Ñĕ¥RR!!ĆĦ!B!Ħ2Rė!ČĖĥCåĶ2BĖR!ĦBdĥĦös×!!Ĥ×!ĖĦ2BĖ!R!ĖRBdRBĤ!!!DĦ!!Ė!!s!öÕĶB!Ķ2BdRBµ!!!BCR!B!Ħ!BĤ!!DĦBĦńDĤ !.Ę !'rĵ3c!ĶĶ!!Ķ!!!Ķ!Ķ!Ķ!Ķ!Ħbħ1!ĉĆĦĶĶĖĶĦħĶĦĶörÕĽ !&^ě!!Ħ!n !*û!;Ĳ!ĥĦScĪ_ĦĶĖąĦ·6ČXĕÆcĶ2ĖĶsBöĆ!!cėĬĦĖ!ąĖ!2 !&B!dąösd!Rń$ńDÕ!!æĶ2Ķ!RB!BCRBĤ!!DĦ!!Ė!RBöĥö!ĦB!2cCRBµ!!!BCR!B!Ħ!BĤ!DĖ!2BĦńDĤ !-Ę !'åå!tĶ!!Ķ!Ķ!!Ķ!!Ķ!Ķ!Ķ!Ħb!dõ!ĉæĶĶĖĶĦĕĶĦB¥Õçċ!2!Ķ^!!!û!B!!M!!ěM!û!;Ĳ!ĕĊNScB!ĦĦąĆĶÛ$ď!ĆB!2ĖR!ìĐ!!!cý!ĦĖ!åĶ!2!!!BB2!3!ą!·!ńDĤ!ĘąĖĶĶ!2c!!ĦBdRBĤ!!DĦĖ!!!söĥ!ĆĶĦB!ĆBCR!Õ!!!BCRB!ĦĦBBĤDĖĦ!B2B!Ĥ !.Ę !(rĵe22BĶR!SBR!!!RB22B` !(ùĆĖĖĶĦĕĶĦÆõtRċ2!!!M !'ě!!M!ě!!M!!ĔłĶąĚ!N!d6.Ė!åĖûù¯õĶ!Cĥ!Ć¦»ĠRĖ!cý!Ħ!õĆĶ!2!!BRS !&RĤ!!D!!ĤDµĦĖB!!2!!!cCRB!Ĥ!DĦĖ!!!söĥĦĦĶĦ2BBdĥt!Õ!!!BCRB!Ć!cĤDĖĦĵ3B2!ńDĤ !&DĤDĤ!!!Ę !(åöĵe22B Ķ&!22R2¦Bc2B0!CsÇĦĦĶĶĖĶĦĕĶ¥õtR!ċ2!!Mě!Ŀ!)!!M!!!ě!M!!!Ĕ.ĦÙ !&Ç_Ħ^Ėõæć6.ĖĕĦt!ĥö·ËðsĖ!cý!Ħ!ÕĦĶ!2B!·!!Ķ!!!0!D!!!Ĥ!!DÕÖ!B!!2ĦĶsdR!!ń!DĦĖĥCRĖĥ!ĦĦĦĶ2BBB!CRÕ!!!BCRBĦĦBB!ĦĖĵ!3B2B!Ĥ !&DĤD!!!Ĥ!Ę !;µsµ!!!éĦĦĶĶĖĶĦcĥĖRńT !(ě!Ŀ!)!M !)ĔT!Ĕ>ĖÙ!!!ÓR!!!ĆąÖc×Ćĕ!æ×!ĥö·ÛàsĶĦÖ¬!!åö!Ķ!RĦB!·!!!Ķ0 !(ĸ!R!öÕĦ2!!Ķ!2cdRõtń!DĦĖĥCsöĥĦ!ĖĶĶBRdĥĦdRÕĦBBC!s!ĆĶR!!ĶĦĵ!S2!BĤDĤ!!DĤD!Ħ!BĤ!# !;r¶ö×P!éĦĦĶĶĦcåõĦĦĦĶĦ3 !0Ĕ!T !(ĔłÉ!!!_tĺ!_ÅĖĦcdõ!ĖRd!!ądûà¶ĆcB¬!!åö!Ķ!!2!B!·!!Ķ0D!Ė!RĖ!!R!µĦĦĶ!!!2c!·Ėĥtń!DĦõC!sÕ!Ħ!ĖĦ!BR·õĦdRÕĦcC!RBĆĶ!R!!Ė!ĥCB2!B!ĤDĤDĤD!Ħ!!BĤ!Ę !,ĥĆĶĦĦ!!c· !(r¶Åtå!éĦĦĶRRp !(dą !:>ĖÙ_Ċ!!Nd6łĕĦBCåĖĶĦķĆĥ2tüďdõ!·&DĦąĆĶĶ!!!2!BdRń!DĖCĦ!!!ĥd!Rµö2!BĦ!BBBtõ!tń!$ĖĥCRĖĥĦ!ĦĶĦ2B¦!ĥĦdRÕĦBBC!RĖĥC2B!ĖĵĶCR!!!B !(Ć22BĤ!!Ę !*tÅĦĶ!Ķ!ĶĄ!3¶d !&µsÅSą!éĦĦĶĶĖĶĦĕĶĦĶÔtõ !;>ĖÙ_SB2Ī_ĦĦ2ĺ!ĢąĖĦė!Ħ!cČďWł!&!DĦąĆĶĦ!B!!!B·ń!Döĥ!ĦB!Ħ!¦!!ąÖ!222B!!·ĖĥtBĤ!Ęĥ!CsÕ!Ħ!ĖĶĶ2B×õ!ĦdRÕĖ2BBC!!ĥC2BĖ!ĥ!CR !)BĦĦ!BB!Ĥ!Dö !)SąĦõĶ!!Ķ!!Ķĵ3¶d!!!µsÅ3ĥ!éĦĦĶĶĖĶĦħĶĦĶöbå !<>Ė!ĕC2RĪ_!Ċ!ĽhĖąĦ·đ !'2!!!2=ĦąĆĶĖ2B!cC!Rń$ĖąĖR!Ħ!!BdB!Ħąö!B2!!cöRBtń!!ĘąBCsÕĦ!ĦĦĶ!2c·õĦĦ¦RÕĖ!2BBCĥĦBC!!ĥĦBCR!Ķ!!2!!!Ħ!BB!Ĥ!DĦĖ !(·æÔĦ!!Ķ!Ķ!!!ĶĖR¶d!!ÅcÅ3ĥ!éĦĦĶĶĖĶĦĕĶĦĶÖÕµ !=>!Ė!!B2Ī!ĝ2!2!hĦġĶ !*22=ĦĖõĶĦĶ2!BcCP×dĥö!RĦĶ!!RdBÅBdÅ!ĶB!!!R!·BĤ!!×!B·öĥĦĦĦ!Ķ2B¦!ĦĦĦ¦RÕĖĶ2R!BĦ!B!!!Ħ!BCRĖ !'2!Ķ2B!B!!Ħ!Ė !'Çö£!!ĶĶ!!ĶB2Ę!!ĔB¶d!ÅcÅ3ÖréĦĦĶĶĖĶĦĕĶĦĶ¥ĥH !)ĵ !'C!B!!Ŀ!!!ĭ !&;.!2!!!Īĝ!2 !(2!Ķ!2!Ķ!2!2=ĦĖąĦĶĦ!!2B¦ąĦ!cö!RĖĦ!B2BdÅ!c!Ć!Ķ!!BRdsĤ$ńĘåBdsÕĦĦĶĦ!!2B×õ!ĦĖ·RÕĦĦ!BB!!!ĦB !&R!3ĵ !'3!!!2B !'Ė !&ÇĆ£Ķ!Ķ!!Ķ!2cd!!¦!ē×d!ÕRÅ!dÇPĉæĶĶĖĶĦĕĶĦĶ¥ĥH !)ĵ !'C!B!!Ŀ!!!ĽĶ !&; !&Q!ĝ!2 !(2!Ķ!2!Ķ!2!2=ĦĖĥĖĦĦ!!2BBĦ!!cæ2!Ħ!!!BRBÖ!22!2Ħ!2Rdĥ!CRń×Ės·öą!ĦĖĶ!2Rctõ!ĦĖćöąĦĶĦBR!!!Ħ!!B!dĵ3!ĥ !)2!3!2!B!!Ė!!!çĖqĖ!!!ĶĶ!2cd !&¦!å!!ÕRµ !'ùĆĖĖĶĦĕĶĦĶbCĺS !&ĕ²!!ċ!Ķ!BM!ě!Ŀ!!!)ĦĶ!!!B!!^!Ĕ!ĝ!2!2 !&Ķ!2!^!û !&^ĦĖĥĖĦĦ!!2ÇąĆ2!Rö22Ħ!!!B!R!ö!22RĦB !&BCPĘÕ2¦sÕĦĦ!ĦĦ!BB¦!ĥ!Ć!÷µ!!ĦĖ2BB!!Ħ!Ķ2!Bdĥ!Ħ !)B!2!3!!2!#!!!Ç!aĦĶ!Ķ!!Ķsd !-ą!!ĦöĥÉĦĶĶĖĶĦĕĶĦĶbCĺS !&ĕ²!!!ċĶB=īM!!Ĕ!!!)ĦĶ!!!B!!^!Ĕ!ĝ!2!2 !&Ķ!2!^!û !&nĖĖĵĶĆĦĶ!RBĆĶ22Rö!BĦ !&B!RĖĦ !'B!!2¦P!÷ĦB·ĦĖąĦ!Ħ!!!¥tĖĥĦĖRdåB!ĦĦĶBR!!!Ħ!Ķ2!!BĦBĶ !&2!!!B!2!!3 !'Ķ¦qĶ!!!ĶĶĦĖA!ė!2!22!B!222ĦĦceĦĦĶĶĖĶĦĕĶĦQĦy!2 !&Ķ!BM!ċ^!ě!!MĔ !&)Ħ2!Ħ!~ !&Ĕ!ĝ!B!!!^ !/ě=ĦĖĥĖĖ!Ķ¶æ!Ķ!B!Ħ!¶ !1B!2Bµ!Ę!!!RĖ!ą!Ħ!!B!BtĖĥĦĖ·ĥĆB!ĦĶĦ2BB!BĦĦ!Ķ!!!2!!!2 !'2!!!B!2!3!!!ĶöŅ!Ķ!Ķ!!ÆRsBBB!!CR!ń !)éĦĦĶĶĖĶĦĕĶĵ!i2!2 !&Ķ!B!!Ħn!ě!!M!Ĕ!!!)Ħ2!Ħ!~ !&Ĕ!ĝ!B!!!^ !/ě=ĦĖ!ąĖĶ!cĖĶĶ!!BĦ !2B!R!µ!$!Ė!RB!ö!ĥĦ!!!B!tĖ!ÕR·ÕĦB!!ĖĦ!B2B!BĦĦ!ĶĶ!!2!2 !'2!!!2!!B23!!!å#Ħ1!!!ĶĶ!!Ķ!!Ķ!!Ķ!Ķ!Ķ!BR¶r!éĦĦĶĶĖĶĦħĥĆ»!3!2 !&2!!!Ķ!n !(Ĕ!!!IĆně!M!ě!M!Ĕ !9DĦĖĥĆ!ĶRĖĶĶ!!!BĦ !022RdP!$ !&ń!!!DĦĖĥ!!C !&ą×öå!!B!ĦĶĦ22R!dĥĦĦĶ!ĶĶ2!2!!2 !(22!!BC !&åÆ¦1!Ķ!!Ķ!Ķ!!!Ķ!Ķ!Ķ!Ķ!Ħ2cĥ!éĦĦĶĶĖĶĦôĆÜĥ!3!2 !&2!!!Ķ!n!!ě!M!Ĕ!!!IĆně!M!ě!M!Ĕ !:Dö!ąĦ!BĦĦ!Ķ !3BR!µ!D !'ĤĽ!Ķ!;DĦĖ !'s!tĦÕĦ!!!B!ĖĦ!22RBCĥĦ!Ė!ĶĶ!2!!2!!!2!!!2!2!d !'ååe1!ĶĶ!!Ķ!!Ķ!!Ķ!Ķ!Ķ!ĶQ3ĥ!éĦĦĶĶĖĶÔæü!ĥ!3RM!ě!!Ķ!!!Ķn!ě !&Ŀ !&)Ħn !*Ĕ !;$Ė!ĥ!ĦĦĶĶĶ !0222BdGM !'Ĥ!Ľ!!Ķ!nĔD!!Ħ!!!BĤ!Ęą!Ħ!!!BĦĶĶĶ22RBCĥ!ĦĦĶĶĶ!!2 !&2!!2!2!2d !(rĵ3R!!Ķ!Ķ!!!Ķ!Ķ!Ķ!Ķ!ĶQ3ĥ!éĦĦĶĶ0æBĜn!Ú!Cn!!!ě!Ħ!!!^2!!ě !&Ŀ !0Q !<$Ė!ĵ!ĖĦĶ!Ķ !,BBĖ2B!« !*Ķ!2!!Ķ!nċ!+ !*Ę!ĥ!Ħ!Ħ!!!ĶĶĶ2c!BC!ĥĦĦ!ĶĶĶ !'2!!22!22d !(ąÅė¶!Ķ!!Ķ!!Ķ!!Ķ!Ķ!Ķ!ĶQħ1!ĉĆĦĶńąSì!n!Ú!CBM!!!ěĦ!!!^2!!!ě!!!Ŀ!!!) !HŁĖ!!ĵĶĦĶ!Ķ!Ķ !&BRCąĦ¦P!!T!!!ċ!ĕS!Ķ!2!!Ķ!B!!M !&Ĕ!T!Ĕ$Ė!!ĥ!Ħ!Ħ!Ķ!Ħ2BcCRĖĥ!ĦĦĶĶ!Ķ!!!2!!22!Bd# !)µĕķs!Ķ!Ķ!!!Ķ!Ķ!Ķ!Ķ!ĶQ!Çµ!!tą!dÌ!!B!ĦR!!M !&û!!!2^ !'ě!Ŀ!!!)ą !GdŁ!Ė!!ĥ !*C!!ĥ!tńĽ !'^ċ!Ķ !)2^ě !'Ķ!+!T!!Ĕ!!$Ė!!ĥ!Ħ!!ĦĶ!2cCRĖ!ĥ!Ħ!!Ć!!!B!!!BB!C !*ą¥A#R!!Ķ!!Ķ!!Ķ!Ķ!Ķ!Ķ!QSą!ķAdci!!!B!ĦR!MěM!!!û!B!!M !&ī!į !&)ą !Hd=Ħ!Ė !(#!RBĤ!!!Ľ !)^ċĶ!!!BĦ!!!n!ûB !'Ķ+!Tċ!^ĔT!!!ĖĖ!!ĥ!Ħ!!!ĦcCRBĦ!Ė!ĥ !,CRĖ !*ÕÆQ#R!Ķ!!!Ķ!Ķ!Ķ!Ķ!Ķ!Ķ!sĖ¥c×!û!!!2!!BM!ě!M!!ċ!!2 !&Mī=Ĕ9į!!!)ą!!C!ĥ !(C!Ķ!ĵ!3!!ĵ!!!C!!!ĥ!S !&ĕ!C!BĿD!Ħ !(B!ĤĽ!!^ !'ě!!!Ħ!!!B!!M !&û!!B!!!Ķ+!Tċ !(2!!!ŁĖ!!!ĥ!Ħ!BCs!!!Ħ!Ė !'R!B!!!ö !+rĆQ#2d22!B2Ss!!2!ö!õSscµ!s!û!!(2!!B !&Ķ!!^ċ2 !'Mī=ī-Ļį!!)ą!!C!ĥ !(C!Ķ!ĵ!3!!ĵ!!!C!!!ĥ!S !&ĕ!C!!;!!!D !(ĤĽ!!!^!!!ěMě !&Ħ!!!B!!M!!!û!!!B!!!Ŀ!T!!ċ!!!2 !'Ķ2Ł!Ė!!!ĥ!·!Ĥ !1Ę !,ÅæAe2BcCc2s!r !-s!û!B!Ķ!n!!!ě!!!M!!ě !&M!!ī=Ĕ !&)ąC!Ķ!ĵ!!3!2!!!2!!!ĕ !(C!!!2 !(^!û!!;!ĭ2+ !)Ľ!^ !)ě !&Ħ !'B!M!!!û!!B!!!Ŀ!TH !&2 !+Ķ !'Ķ!!2!2 !&Ķ!^ !(æ !6¦ĖĦĶĥĶĦ!Ķ!Ķ!ą!! 2'Bd¥ !(ěM!!!ě!!Mī!=!ī=Ĕ!!!)ąC!Ķ!ĵ!!3!2!!!2!!!ĕ !(C!!!2 !(^!û!!;!ĭ2 !(+!Ľ!^ !*ě !&Ħ !&B!!M!!!ûně!Ķ!+!Tċ !'2 !)Ė!!!B!!Ķ !&B !'M !)æ !6¦£¶!Ķ!2Rĕ!!éĦĦĶĶĖĶĦĕĶõÇ¥ !/ī=!īįTĔ !&)ą3 !*8!2 !'Ķ !&Ķ!ĵ!3!B !&^!!!ċ!!+!ĭ2 !&Mě !*^ !&ċ!2!!!Ķ!2 !&M!!!ċ !'+!Tě!!Ķ !&2 !&Ė !&B!!Ķ !'B !)M !&æ !6¦0Ć!Ķ!Ħbtå!éĦĦĶĶĖĶĦĕĶĦ1d¥ !+ĔTĔTĔT!ī=Ĕ !&)ą3 !*2!2 !'Ķ !&Ķ!ĵ!3!B !&^!!!ċ!!+!ĭ2 !1^!!!ċ !/^!!ċ !'+!!)!!!Ķ!!!2 !'Ė !&B!!!Ķ!!!B !)M !&# !5¦PöĶ!Ķ!ĶQ3ĥ!éĦĦĶĶĖĶĦĕĶĦĕcç !1ī=!!Ĕ!!!)ą!!3 !(B !)Ķ !&Ķ !'n!ě!!^!!!ċ!!+!T !'ċ !G+!!Ľ2!Ķ !(2!!!Ķ!Ħ!!B !&Ķ !&2 !&^ !'æ !4Ç0ĦĖĶ!Ķ!ĶQ3ĥ!éĦĦĶĶĖĶĦĕĶĦĶAd¥ !4Ĕ!!!)ą!!3 !(ĵ !)C !&Ķ !'n!ê!!²!!!Ú!S+!T !'ċH !F+!) !:Ħ!!!B!= !&2Ķ2Ķ!ö !3÷rµĖ!Ķ!Ķ!ĶQ3ĥ!éĦĦĶĶĖĶĦĕĶĦĶ¥ąĻ!!!2!B!Ħ!B!Ħ!!Ķ!2!¦+!!ìĦ !;2!B!Ħ!B!Ħ!!Ķ!2!Ò!© !L·M!ÊĦ !Io !2ąµdĦĶ!Ķ!Ķ!ĶQ3ĥ!éĦĦĶĶĖĶĦħĶĦĶ¥ąĻ !32Ķ·M!ěõĦ !BR !(²!©!!!2!B!Ħ!B!Ħ!!Ķ!2!Ķ !(2!B!Ħ!B!Ħ!!Ķ!2!Ķ!·MěõĶ!!!Ħ !12!!!2!B!Ė !-o !2µąC!Ķ!Ķ!Ķ!ĶQħĆréĦĦĶĶĖĶĦĕĶĦĶÖÕĻ!!2!!Ħ2!!2!!Ħ!!!BĶ!·M!ěõĦ!!2!!Ħ!!!BĶ!!2!!Ħ!!!BĶ!!2!!Ħ!!!B22!Ė!R!²!Ú!!!Ė!!!B!!2 !&Ė!!!2!B!!!Ė!!!B!!2 !)CBMěõĦë!2!Ķ!2!!!B!Ė!!!R!Ė!BB!!Ė !(2!!Ħ!!!BĶo !2QŅC!Ķ!Ķ!Ķ!ĶQ!dÇPÉĦĶĶĖĶĦĕĶĦĶÖÕĻĶ!Ħ!!R!Ķ!Ħ!!R !&R!!dM!ěõĖ!Ħ!!R !'Ķ!Ħ!!R !'Ķ!Ħ!!R !&BĶ!B!Ė!â!©2!B!Ė!Ķ!2!B!2!ĖR!!!Ė!!2!B!Ė!Ķ!2!B!2!Ė!RC!BMěõĖ!2!!!2!2!!Ķ!Ħ!R!!!Ķ!Ķ !*Ķ!Ħ!!R !'o !21Öö!ĶD£!!d'MĖĥöĦĶĶĦR2!BstÆĶªà7!!Ķ!!!2!!Ķ!!!B!!!Ķ!RdM!ěõĦ!Ķ!!!B!ûĖ !&R !&2!Ķ!!BĖ!!B !(2!!2²!ºĶ!2!B!Ķ !)2Ė2!B!Ė2Ķ!2!B!Ķ !)2!C!BMěõĖ!!2!Ķ!2 !'B!Ķ!Ć!R!ĖR!2!!Ħ!!2!!Ķ!!!B!!!Ķo !21Öö!ĶD¤ç!!£ĦĦĦĖĶĶQ!!ė2RħæĦĶªàG!BĦĶ!2!B!Ķ !)2!Ė!·M!ěõĦ!Ķ!!2Ė !(B!!!B!ĶB!!!2 !&Ķ!Ķ!!2!!!Â!º!B !+Ķ!!!ĶĶ!2!BĦ!B !+Cĕ!S!!!BMěõĖB!Ħ!R!!!Ķ!!!B!Ė!2!2!ĶĦ!Ħ!!R !&R!Ķ !'2Ė# !2aCĶ!Ķ!D¤Ņ!µ !*×!ÖħöĶĦĶÔ¦G!2!!B !+Ķ !'2dM!ěõĦĶ !'Ħ !'R !&RĖB!Ħ2!B!Ħ!B!Ħ!!Ķ!2!Ò!©!2!B !'Ķ !'Ķ!B!!!Ė!2d !(ĕSĕ!S!!!BMěõĦ!!!2!!Ħ!!!BĶ2!!Ħ!!!B!Ķ!!Ķ!!!B!!!2 !*Ħo !2AĶc!Ķ!D¤!!!ç!ê!MĖąĖĶĦėħĕĶĦĶÔtW2!Ķ!2!B !'Ķ !(S!!BM!ěõĖ!!ĦR !&Ķ!!!B!!!Ķ !*B!!2!!!Ć!¦ĥ²!©2!B!!!ī!Ķ !(Ħ!tądĥC !3BMěõĦ!Ķ!Ħ!!R!!B!ĖĦ!!R !(B!Ħ!2!B!Ħ!B!Ħ!!Ķ!2!Ķo !2rĵ3!Ķ!ĶT!£µĝ!MĖĥĦ!BCR#ĦĕĶĦĶªÀhĶ!2!!Ķ!2!B!Ķ !)S!õ!·MěõĦ !)Ķ!2B!Ķ!!Ķ !&RĖ!!!Ķ2!BĶBĆ!!¦ĥ² !LěõĦ !&Ķ!!!B!2!!!Ė!!B!!!2!!!2!Ė!!!B!!2 !)Ėo !2ąÅħRĶ!Ķ!Ķ!2Rĕ!!éĦĦĶĦĦĶĦħĶĦĶÖbx!B!!Ħ!B !+Ķ!!!SĕSBM!ěõĦĖ !'B!!22!!!ĶB!Ħ!2Ķ!!!B!!Ķ!!Ħ!cC!n!© !GRdMěõĶ!!Ħ!!!B !&2 !.Ķ !&ĶĶ!2!B!2!Ė!R!Ėo !3AA3Ķ!Ķ!Ķ!Ħbtå!éĦĦĶĶĖĶĦĕĶĦĶ¥rª!2!BĖ!2!B !'Ķ!S !)BMěõö !(B!2!!2Ķ!!!BĶB!Ė!!R!!Ħ!!2!!!S!n!©R!Ħ!!!Ħ !1BĦ!2!!2!!Ħ!!!BBdMěõĦ !&û!!!2!!!2!!!2Ķ!!!Ħ!BĶ !&B!Ķ !)2!Ė!!o !3rĵ3Ķ!Ķ!Ķ!ĶQ3ĥ!éĦĦĶĶĖĶĦĕĶĶŅÖªâ !:ěM!ěõĦĖ!!BB!!!2Ħ !'B!Ķ!BĖR!!!Ħ!2!Ķd!!!n!w2!Ķ!2!Ķ!2!!!B!Ė!!!R!Ė!ĦR!!Ķ!Ħ!!R !&RdMěõĦ2!!Ħ!!!B2 !*ĶBĖ!!!R!!!Ė2!B!Ħ!B!Ħ!!Ķ!2!Ķo !3ÕõħB!Ķ!Ķ!ĶQ3ĥ!éĦĦĶĶĖĶĦĕĶĵÖª !7RĦ!!Ķ!·M!ÊĦ!!!û2!B!ĦĶ!!!R!Ķ!!Ħ2!B!Ħ!B!Ħd !'n!©ĶĖ!c!Ė !&s!ö !'s!Ķ!Ħ!BĶ!!Ķ!!!B!!!¦MěõĖ!Ħ!!R !&R !(ĦĶ!2B !)ĶĦ!!!B!!2 !)Ėo !3ą¥A#!Ķ!Ķ!ĶQ3ĥ!éĦĦĶĦĦĶĦĕĥÖª !&2!!Ħ!!!2!!2!!Ħ2 !,·Měõ2!!!Ė!!!B!!2!!!Ķ!2!Ė!!!B!S!!!ąBC!!n!©ĶĖRĖ2 !'R!Ė !(R!ĖR !&R!Ķ !'2dMěõĦ!Ķ!!!B!!!2!2!Ė!RĦ!B!Ė2!BĶ !&2Ė!Ķ!2!B!2!Ė!R!Ė# !4rĵ#!Ķ!Ķ!ĶQħĆréĦĦĶĦĦĶĦÔöª!!!Ķ!Ħ!!R!!!B!!Ħ !(2!!Ħ!!!B¦M!ÊĦ2!B!Ė!Ķ!2!R!!Ķ!Ķ!B!Ė!Ķ!¦!!ĕS!!!ĥCn!ºö!!!2 !&c!Ķ!!RĖ!2!2!ĶĦ!!!B!!Ķ!2!!2tMěõĶĶ!2!B!Ķ !)2!Ė!!2!!Ķ!2!!Ķ!2!B!Ķ !)2!Ė!!o !5ÆÅcĶ!Ķ!ĶQ!dÇPÉĦĶĦĦĶÔĆcĻ !,B !&Ķ!Ħ!2Ķ!Ħ!!R !'·MěõĦ!2!B!Ķ !)ĶĶtą!d !/n!ºö!!2!RûĶ!ĦR !&BĦĶ!Ħ!!R !&R !)dMěõĶ!B !+Ķ !'2Ė!!2!B!!Ħ!B !+Ķ !'2Ėo !6æąB¥tń$!Ė!ĥĦ!Ħ!ĶĶĶRBĻ !(2!!Ħ!R!!!ö!!R!!!Ė!!Ķ¶!!!Ħ!¦M!ÊĶB !*Cĕ!!S!ĥ!C !&ĥ!C!ĕS!!ĕSn!ºö!R!!!2!!Ķ!2!B!!!Ħ!Ķ!!!B!!!B!Ė!R!!dMěõĦ!!2!B !'Ķ !*Ħ !&2!BĖ!2!B !'Ķ !*öÂ !7Ć!ĶĶ!Ķ!ą!!ĦĶĶQ!ėc¶û !'Ķ!Ħ!!R!B!Ħ!Ķ!!!B!!!22 !)Ė·MěõĶ!B!!!C !;n!ºĶ !&Ė !&R!!B!!!Ķ!B!Ķ!!!2!Ķ!2!!!CBMěM !Qb· !(Ć!222SBB!ĦĶôĆB !*B!CRěK!!ĝMĖĥ!Ħdú!!!Ķ!!!B!!!ĶB!2!Ė!R!ĖB!2 !'Ė·M!ěM !CºĶ!2!!Ć !&cĦ!R!Ķ!B !+Ķ !&2dMěõĦ !*û !FĖ-!· !'ĆÕĆcB!222BBCR!ě!K !0ĝM!Ėĥ!Ć¦ú2Ķ!2!B!Ķ !)2!Ė!B !&2!Ė!!!·MěõĦ !@â!ºĦ!Ħ!!RĶ!Ħ!!R !'2B !)Ķ !&S!BMěõ2Ħ!!!Ħ !1B!!Ħ!2!!2!!Ħ!!!B!!!Ķ !&Ė-!!· !'rĖ¶!!ĶĶ!!Ķ!!Ķ!!Ķ!Ķ!Ķ!2Bĥ!!éĦĦĶĦĦĶĦĕĶĶŅĆW2!Ķ!!!2!B!Ħ!B!Ħ!B!Ė2!2!2!!Ķ2!!CBMěěĦ!2!!Ħ!!!BĶ!!2!!Ħ!!!B!B!Ħ!Ħ2!2Ò!ÊĦ!Ķ!!R!!Ė!!!B22!ĦĶ!Ķc!!Ķ2 !&Cĥ!dMěõĦ!Ķ!2!Ķ!2!!!B!Ė!!!R!Ė!Ħ!!R!!Ķ!Ħ!!R !'R!Ė!!!Ė-!!!· !'QcB!Ķ!!Ķ!Ķ!!!Ķ!Ķ!Ķ!Ķ!Ħbtå!éĦĦĶĦĦĶĦĕĶĶŅĆW!!R!!!Ė!!!B!!2 !'Ħ!B!!!Ķ!!Ħ!RdMěõĖ2 !)Ķ!!!Ħ!!R !&B!2Ć!!c!!²!ÊĦ2!2 !&2Ķ!!!2!!ĦB!Ķ !)S!!ĥCBMěõĖ!!2!!!2!2!!Ķ!Ħ!R!!!Ķ!Ħ!!!BĶ!!Ķ!!!B !&B!Ė!Ė!- !&# !&ą¶¶Ķ!!ĶĶ!!Ķ!!Ķ!!Ķ!Ķ!Ķ!ĶQ3ĥ!éĦĦĶĦĦĶĦĕĶĶĥĖćÊ!!2!B!Ė!Ķ!2!B2!!Ė2!!!BĦB!Ħ!!Ķt!BMěõĦ!!2!!Ħ !&2Ķ!!!B!!!Ķ!BĖ!!2!tn!ÊĦ!B!!!Ħ!!!R !&Ė2!B!Ħ!BC !'ĥCBMěõĦĶ!!2!Ķ!2 !'B!Ķ!Ć!R!ĖcĶ!2!B!Ķ !)SĥĖtõĖ- !(· !&ąsÆ!!Ķ!!Ķ!Ķ!!!Ķ!Ķ!Ķ!Ķ!ĶQ3ĥ!éĦĦĶĦĦĶĦĕĶĶąĶ¶ě!2Ķ!2!B!Ķ !&2!ĶĶ!!!ĶB!!2C !'BMěõĦĶ!Ħ!!B!2!!2B !&Ė !'B!!2!Ėâ!ÊĦ!2!!Ħë!!BB !,C!ĥC !(BMěõĦĶB!Ħ!R!!!Ķ!!!B!Ė!2!2!Ķ!!B !+ĶSĕ!S!!Å- !)· !&¤öÖĶ!!ĶĶ!!Ķ!!Ķ!!Ķ!Ķ!Ķ!ĶQ3÷PéĦĦĶĦĦĶĦĕĶĶąĶR7!2!B !+Ķ!!!Ķ!BĆ!2!B!SĥC!ĥCBMěõĦ!Ķ!!!B!!B !'Ė !&R!Ħd!ĕ!!Â!ÚĆ!Ħ!!R !&B!Ħ2!BCĥC!ĥ!C !)BMěõĦĶ!Ħ!!R !&B!2!Ė!!2!B!Ė!!!2!B !'Ķ!!S!!!ĕ!ā !*·!!!ąÅCR!!Ķ!!Ķ!Ķ!!!Ķ!Ķ!Ķ!Ķ!ĶQħæµ!ÉĦĶĦĦĶĦħĶĶĦŅ!¦ú!!2!B !'Ķ !+S !)ĥC!BM!ÊĶĶ!2!B!Ħ!B!!!Ķ!2!Ė!RĶ!Ķ!d!!!n!ÚĖ!Ķ!!!B!!!2!Ķd !2BMěõĦ!!Ķ!!!B!!!2!!!2!ĦĶ!2!B!Ķ !)2C !(õĖ- !+·!!!¤ĥ¦!Ķ!!ĶĶ!!Ķ!!Ķ!!Ķ!Ķ!Ķ!ĶQ!S×P!¨ĶĦĦĶĦĕĶĶĦŅ!¦!ú!!!Âõ!tÊ!!!2!B !&C!ĥC!ĕS!!!ĕS!BMěõĶB !+Ķ!SĕS!ĥCĥC!!ĕS!!n!ÚĦB !&C !*ĥ!!!C!ĥdąCB !&MěõĦ2!B !+ěSĕ!!Ķ!BCĥ!C!ĥC!ĥCĕS!ĕ!S!!!õĖ- !,·!!¤ĥCcĶ!å !&ĝ!MĖ!ĥ!Ħ !*ĦĶĶĶ!Ħ!¶¸ĦĕĶĶĦĥB×Ė!ú!ġöĖ!c¶Ļ !&2!d!!ĥC !.BMěĦ !<n !CěõĦ!!2!B !'Ķ !'S!õtąd !3Å- !-·!ÅąCc!!Ķå3Ņ!!!ė!B!B! 2' Ķ,b3¶uĕĶĶĦĥ!¥C!!ÅcöCQĆĖĥD !7těMěõæ!!2 !(R !)Ķ !&Ħ !)R!!Ė!!!R!Ć!2 !(Ķ!÷M !Oû!Ł!!Õ !-·!a!3s!Ķ!!eöÅ !8ÅĆŅ3ĈĕĶĶĦĶŅ2¦!ÕRė!BQĦ' !12 !'2!!!dMěõĖ2!!!2!B!Ħ!B!Ħ!!Ķ!2!B !.Ķ!Ķ!2!!!2 !*dMûąB!Ħ!!!Ħ !6B!!Ħ!!!2!!!2!!!2!ö!!- !.#!rĵ!dB!Ķ!ĸ!Å !9Åą3ĈĕĶĶĦĶQĦ¦ą!ėĦBQ!'!!B!Ħ!2!!!2 !1dMěąĦB!!!Ė!!!B!!2 !-Ħ!!!B !,Ķ!!!2 !'dM!ûąĶ!Ķ!2!Ķ!2!!!B!Ė!!!R!Ė !(2!Ķ!!!R !)2!Ö!!= !/·!!rĵ3sĶ!!ø!ą !:A¶ÈĕĶĶĦĶQĦB!ėĦ!BQĻ2!2 !'Ķ!Ķ!2!2!2!Ħ!B !)dMěõĦ2!B!Ė!Ķ!2!B!2!Ė!R!Ħ!B!Ħ !'B!!!ī !&Ķ!!!2 !'dMûąĦ!!!2!!!2!2!!Ķ!Ħ!R!!!Ķ!Ķ !)2!2!!!2 !'Ö!!= !0·!!ĥRcs!ĶĆĈÖ¤ !)r!BB!Rd !,rÖTĕĶĶĦĵĆ÷ąķĆ!!B÷¹!2!B!!!Ķ!Ķ!!!Ķ!2!2!2!Ħ!B !'d!ąĦĶ!2!B!Ķ !)2!Ė !'2!B !(Ķ!!!2 !-dMûąĦ!!!2!Ķ!2 !'B!Ķ!Ć!R!Ė!R!B!2!!!Ħ!B !)Ö!!= !1·!!!QBsĶĶĖç÷¤ !(ĆŅ!µ!!!×d !*ÕsuĦħĶą!Ć÷ąµ§Ħ!!B÷ąú!2!!!B !'Ħ!2!2 !+C!ĥdMěõĶB !+Ķ !'2 !1C !)ĥ!C!!BM!ºBĆ!B!Ħ!R!!!Ķ!!!B!Ė!2!2!Ķ!B !/C!ĥ!æ!- !2·!!!rRBĦĖÇė¤ !(ĆŅÖĶ!ĶŅ×d !*ĥĆ×#ĦĕĥĆĖ÷!ąµ§Ħ!!!ėą!ú!2B!Ħ!B!Ķ!Ķ!2!2!Ħ!!!d!ĥ !'d!ąĶĶ!B !'Ķ !-2!C !)ĥ!!C !)ĥ!!!dMÚĦĦ !'B!B!!!Ė!B!2!Ħ!!!ě!2!Ķ!Ķ!!!2!2!!!C!!!Å!- !3·!!åĦ!ĖtBħ¤ !(¦¤Õ!Ķ!Æ!d !+ĥtSĖÔĖĆc·!!ąµ§Ħ!!!cćÕ!!ú2!B!Ħ!B!Ķ!Ķ!!!2!S!ĥ !(CBMěąĦ!!B!!!C!ĥ !&C!ĥ !'C!ĥ!C!!!nû !/n!ºBĆB!!!Ħ!B!Ħ!c!Ħ!2!!!2!!Ķ!2 !0CÅ!- !5·!!AATBķB¤ !)ĆçĴ!Ķccd !,ĥĦĦĶĶĦR· !&ąķĆ!!!BħR¤!!ú2!B !0C!!(ĥ!!!CBM!Ú !,C !&ĥ!!!C !+nû!n!!!û !'ĥ!²ÚĦĦ !'2!R!Ħ !*2!!!2!!!Cĥ!!!C!ĥ!C!!!Å!- !6·!!!ÅĖĥU !+¤çĴ!ĶÆ !9Ö!ĥ§Ħ!!!c3!b!!ú2!B !,Ķ!!!2 !)dM !wû!M!õ!ö !7# !'r 2&!R!!è!!!Ĵ!ĶÆ!BCRń!ĝMõĦĖ Ķ&ĖAħc 2&B·ńÈĦĦ!!Ĕħ¥Ç!!!ú2!B !(C!ĥ !.CBM!©R!Ć!2!B!ĖR!2 !'Cn!!!©!!!2!!Ķ !'2!2Ħ !)2!!2!Â!!!w!RĶ!Ħ!2!!!2Ħ!2!2!Ħ!22!!!2!2!Ö!= !8· !'rc!!Ķ!!Ķ!Ķ!!Ķ!!Ķ2Ħ!Ķ!!są!ĝĒĦĦĶĦĦĶĦĕĶĶĦĶ!!ĶĶ !&Ĕķ·¥ !'ú2!B!!!C!!ĥ!C !(ĥ!!!Cn!!!º!Ħ!RĶ !'B !(C!n!!©!2!B!!û!R!Ħ!dõ!!!R !(C!!!n!!º!2!Ħ!2!!B!Ė!B!!2 !,C!µ!= !9· !&ąÖsĶ!!ĶĶ!!Ķ!!!Ķ!Ķ!Ķ!Ķ!Ħbtå!éĦĦĶĦĦĶĦĕĶĶĦ!ĶĶ!!Ķ!!Ĕ§!¥ !*'!n !:ÚĆ!c !(C!ĥ!Cĥ!!!²!!º!B !&C!ĥ!C!ĥ!!C!ĥ!C!!ĥ!!!Cn!!ěą !(Ħ!B !&Ķ!!2!C!!!ĥ !&æ!- !:· !&ÅĖc!!Ķ!!Ķ!Ķ!!Ķ!!Ķ!Ķ!Ķ!ĶQ3ĥ!éĦĦĶĦĦĶĦħĶĶĦĶ!!ĶĶ!!!ĥ¦s !+úĶ!B!Ħò!º!Ħ!2 !&Ķ!!2!!!Ķ!!2!2Ķ!!!2!¦M!ûõ !8·M!ěå!!Ķ !(2 !@Ć!- !;· !&rBRĶ!!ĶĶ!!Ķ!!!Ķ!Ķ!Ķ!Ķ!ĶQ3ĥ!éĦĦĶĦĦĶĦĕĶĶĦ!ĶĶ!!Ķ!ĕ×R !-ĺĆĶ!2R!²!ºĦ !&2!!!2!!Ħ!B !+BCn!ÚĖ!!2!!Ħ!!!BĶ!Ķ!B!!Ħ!!c!dM!ěåĦĦ!!!B !&2!!Ķ!B!!Ħ !(cĦ!ċ!!Ħ!2!R!!Ö!= !=·!!!ąÖR2!!Ķ!!Ķ!Ķ!!Ķ!!Ķ!Ķ!Ķ!ĶQ3ħńĉĆĦĶĦĦĶĦĕĶĶĦĶ!!ĶĶ!ĕcÇ !/ĺö!BB!²!º!!Ķ!R !&ĖĶ!c !(Ħ!!B!!CBMÚĖĶ!Ħ!!R !*2B!Ħ !&¦Měå!Ħ!!Ħ!B !&B!!Ķ!!2!!!2 !&ĖB!B!!Ć!B!B!!Ö!= !=·!!!ÅĶR!Ķ!!ĶĶ!!Ķ!!!Ķ!Ķ!Ķ!Ķ!ĶQķÖµ!ÉĦĶĦĦĶĦĕĶĶĦ!ĶĶ!!Ķ1Øĵ !1úĶ!cC!nº!Ħ!Bċ!!Ħ!!!BB!Ħ !'B !&CnÚĖ!!Ķ!!!B !'B!ĦB !&CněMěåĶ !)2!!Ķ!Ķ !&R2 !(Ħ!!B!C !'Å!- !?·!!ąÖRBĶ!!Ķ!!Ķ!Ķ!!Ķ!!Ķ!Ķ!Ķ!ĶQ!3Ör!¨ĶĦĦĶĦĕĶĶĦĶ!!ĶĶ!rèå !2úĶ!BB!²º!BĖ!2!B!!Ķ!!!2!Ė!!R!!C!!!n!ÚĖ2!Ħ2!2 !'B !*dM!ěå!!2!!2Ķ!!Ķ!B!ĶĶ !'2!2!!C!ĥC !&ĥC!Å!- !@#!ąÖBR!!ĶĆĵ3B2!BB!!Ö!Ķ¥B!BCRěK !&ĝMĖĥĦĦ Ķ& 2&B!èBÅ !3úĶ!cĦ!Òº!Ķ2!!B !)Ķ!!Ķ!!B!Cĥ!CnÚĖ!!2!!B!!!Ħ!!!B !(dM!ěå!!!BĖ!!R!Cĥ!C!ĥĶ!!2!C !'ĥ!!!C!ĥC!Å!- !A·!r!s!!Ķ!sÈģė 2&·ŅÖ!Ķæ¶ĵ !1ć!2!22!BBBsC !5úĶ!BB!²º!!B!ĦB !&Cĥ!C !,nÚĖ!ĶB!!B !)Cī!C!!!BMěå!BĶ !&Ħ!!R!!Cĥ!C!!ĥ!!Cĥ!C !*nV!- !B·!aħ¶2!!Ķ!èRå !&ĆŅÖ!Ķć !SúĶc!Cn!ûą !02!!!2!!²ě!ą!ĦB!C !'ĥ!!Cĥ!!!C!BMěå!!B !'Cĥ!C!!!ĥC!nû!!n!ûn!û!!nû!ĥæ!- !C·!rĵħÆ!Ķ!!tÇå !&ĆŅÖ!ĶķĖ !2# !BúĶ!!c²!ûą!2!!!2Ķ !&2Ħ!22C!!ĥ!dM !Yû!Mõ!ö !D·!!rĵCc!Ķ!Sħ¤ !&ĆąĖ!RÇ !UĊĦc!!²!!Ú!!!C!!!ĥ!!C!ĥ!C!ĥ!!!²© !&Ėc!!Ć!!!c!Ć!c !'Ķ2 !'B!!!²!ěÕ2!ĶĶ!!22!2Ė!22!!ĦBċĦĖ!= !E·!!!aħÆĶ!S!ħ¤!!!r¶Ö!RõU!£!ĖĶĶĦĦĦ!BB 2'B!!BC !@ú!Ķ!22Ħ!R2!Ćc!!Ćc!!²!!ºĶ!!RCĥ!Ė2!2!Ķ!2!Ķ !&22 !+C!!!ĥCĥ!²!ěÅ2 !&2 !&Ķ!!!B2!!!æ!- !F·!!!aħÆ!ĶSćÅ!!!a3¶!!µU¤!ącd!ąĆĶĦ!RcBCRń!Ę!ą!BC !Aú!!ċ!!BĶ!!2Ķ!SĥC!!n!ÚĆ!BĦ!!!B!ĶĶ2!Ķ!B!!ĦB!2Ė22!Ķ!Ķ!2âÚ!Ķ!2!!!²!wB!B!!!C!ĕ!!!2!!!Cĥæ!- !H·!!!a¦!Ķ32s !&rĵ!!Çè¤åĖ!Ķ!2Bĥ!!éĦĦĶĦĦĶĦĕĶĶAĦBC !Bs !4ÚĆ!2!!B!2!!!Ħ!Ķ!!!B2 !-² !>ö!Õ !I#!!r!s¸ĥöķµ !+¦¤åĖ!Ķ!Ħbdõ!éĦĦĶĦĦĶĦĕĶĶĦÖõC !Bú!!R!ĖRĦ!!BĶ!Ķ!!BĦÒ!©2!Ķ!ĶB2Ė!R2ĶĶ!B!ĦB!Ħ2!2!C!ĕ2!²!©Ė!!!RĖ!!!RĶ!2Ķ2Ė!R !'2Bæ!- !J·!!a!3C23µ !,Å2öĶ!Ķ!ĶQ3ĥ!éĦĦĶĦĦĶĦĕĶĶĦÔ×d !Cú!!2Ć!!R2!B!Ķ!2C!ĥ²ÚĶ2!Ħ22!!Ħ!BĦB!ĶĶ!B!!(ĥ!!!C!!nû!ÅB!B!!ĶBö!!!Ķ2s!2ĆcĖ!!2d!Å!- !K·!!Õõ!S× !-ą!æĦĶ!Ķ!ĶQ3ĥ!éĦĦĶĦĦĶĦĕĶĶĦÔtÇ !Dú!!!RĦ!!22!Ķ!2C!!n!Ú!ĦB !&C!ĥ!!C!!nû!nûnûnû!n!!ûÅ!RĖc2ö!RBĦ!RĦ!!B!C!!ĥC!!Ł!Õ !L· !4åĶö!Ķ!Ķ!ĶQ3ĥ!éĦĦĶĦĦĶĦħĶĶĦÖrÇ !Eú!R!ĦB !&CĥĶS!!2^!ûĥĦ!!ĶĶ2!B!!2!Ķ2C!n!û !)nw!2!BSĥĦBĦB!Cĥ!Cĥ !&C!Mõ!ö !M· !3ą!æĦ!Ķ!Ķ!ĶQ3ħńĉĆĦĶĦĦĶĦĕĶĶĦb¶÷ !Fú2B!Ķ!2C!ĥCĥ!Cnûn!ċ!ÕcC!ĥC!!!ĕĦ2Ķ2Ķ!tnûąBCąd!!nÚC !7Ł!Õ !&Ö !I· !3åĶĆĶ!Ķ!Ķ!ĶQ3¶µ!ÉĦĶĦĦĶĦĕĶĶĦAÖs¦ !Fú !+2!!!2!Â!ċĶnû !(ĥĶS!ĥC!!nû !(n!!ûåBĶt!!n!©B!!Ħ!2B!!!CÅ!- !O· !2åBæĶĶ!Ķ!Ķ!ĶQ!3¶µ!¨ĶĦĦĶĦĕĶĶĦĶQĆÇ !B# !&ú!B!ĶĶB!SĥCĥ!!CBM !*© !22!!!22²Ê!ĶĶ2Ò©!!22!SĥC!!Å!- !P· !2ÅcÖ!Ķ!Ķ!Ķ1 !*vĦ£!§ąĶĶĦ!AÖ÷ !IúBS !*nûB!M!ûĥC!!!nÊ2C !5nÊS!!nû!ĥ!C !'Mõö !R# !2µ2Ė!Ķ!Ķ!Ķ!1×Ö!ĵĶ!¨ĶaÅ!3×ĶĶĦĶræÇ !JúĶ2Ć2!RĶ!2Ķ2BöcĆcĆB2!B2Ħ!Ķ!B2ĦĶ2!Ćc!!BC!!n!V!!B!!22ĦB!Ħ22B!ĶSÅ- !S· !2QcĦ!Ķ!Ķ!Ķ!2Ņ×Öĥ!¹!ĴÆ¶ą!èĶĶĦ!¥Å÷Ė !Jê!2BĶ!!ÒºĶ2!22²ÊĦ!ĶĦB!2!!B !'( !'n !&VRĖRBSąĶBS!ĥCĥC!!ŁÕ !T· !2a!3!Ķ!Ķ!Ķ!Ķsĕ!!éĖôĵĈ!!a3ÇĶĦĶæÕ·Ė !Q*ĥ!ĶÇ !AĶ!Å!HĖR!=ýĖ ![· !3a!3Ķ!Ķ!Ķ!ĶBÖµ!!CĵĈ!!!QÆtĶĦ!Ô÷tĖ !QĽĖR!Ė!Ķ!!Ķ!!!ĦBĦ !'ÝÏ!½Ķ!!ĵ!!!Ķ !,CŀýĖ ![· !4a!3ĶĶ!Ķ!ĶQdõ!CĵĈ !&Å¥ķĶĦĶä÷tĖ !QĽ3!ĵĖĶ!Ķ!!!Ħ !)Ý!ÏRĖ¬ĵ!!!Ķ !-CïĶ¦ýĖ !3Ö !22!Ķ !6· !5a!#Ķ!Ķ!ĶQ3ĥ¦õĈ !'ÅõèĶĦ!AdRĖ !QĭIŀĕĖ!ĦBĦBĦ!!!Ý!!Ķ!!ĵĆtĵĶ°Ü !(2 !(3ą^ÅÇýĖ !C2!!!Ķ !5· !6a!ķ!Ķ!ĶQ!Çsķ !'ąµøĶĶŅ!ĆÇRĖ !A# !1ĭĦĦ!ĦBĦ !'Ý!!Ķ!ĵ !'Ķ!!!2 !(3 !+ŀýĖ !C2 !&Ķ !4· !7a!ķĶ!ĶQÇsķ !(Pĩĕĥ!Ö!¶·Ė !Rĭ!Ķ!!Ķ!!!Ķ !DRĞĖ !B2!2!Ķ!!Ķ !3# !6Ķ·Ĵĵħ!ĶöÖ÷ !(r2B!Ė!RÇ !Vú!!RĦBĶĶBĦ¦å!ĦBĦR!ĶBĦBĶ!S!ĥmÌĖ!RĖ!R!ĶĦR!!2Bæ- !C22!!Ķ!!Ķ !3· !5Ķ·£è!£!!Ö÷ !.ą!d !WúR!Ķ2!C!!B!å!Ħ!R2Ķ!2!m(ĥĦ2}¼R2C!ĥĦd!!ĥ!!oõö !C2!22!ĶĶ!Ķ !3· !4Ė×Ĥ!Æè!¤!!ÕĖA!ħRBB2B!!!µ!×d !Wú2!Ķ!B!2CB!ĦBĦ!!!ĥC!BĦ!!!BĦĥĶS!BÕBĖRS!!Å- !D222!!ĶĶ!!Ķ !2· !3ĆçĴĶ!ĶÖ!!!µ!Ę!!ĥĦĖĦĦBBĦrØ´÷C !XúĆc!!!B!!Ķ!22CĥĶ!SĥĦdĥC!!B¤RĖRĶR2!Ħ!dÅ- !D2!222!Ħ!Ķ!Ķ !2· !2Ć!Õ!Ķ!Ķ!Ķ!2cą!ĝĒĦĦĶĦĦĶĶąĶĶŅd !ZĊB!!!ĦB!dåB!Ķ!!2Cĥ!C!!BÅ!c!ĖR!Ħ!BC!Å- !8Ö !.222!2!ĶĶĶ!Ķ !2· !2r·Õ!Ķ!Ķ!Ķ!Ħbdõ!éĦĦĶĦĦĶĶąĶĶĦÔĘ !Zê¦ąBĦĶB2!!!SõĶĶBB!CBåĶ!2!Ħ!BB!Ħdĥæ- !F 2&!!ĶĶĶ!Ķ !2· !2µĕ3!Ķ!Ķ!Ķ!ĶQ3ĥ!éĦĦĶĦĦĶĶąĶĶĦÔ$Ė !C# !8ú!!!Ķ!!sĖ!¦å !&B !&C!ĵĆ!B2Ė2!Ć- !G2B!22 Ķ&!Ķ !2· !2ååħRĶ!Ķ!Ķ!ĶQ3ĥ!éĦĦĶĦĦĶĶąĶĶĦAd'Ł !Yú!!!Ķ!!Çå!RĖ !&B !&C!BÕ!B2Ė2!Ć- !G2B2!2 Ķ&!Ķ !2# !3a!3Ķ!Ķ!Ķ!ĶQ3ĥ!ĉĆĦĶĦĦĶĶąĶĶĦĶ¶ !]Ī!Ħ22!Cĥ!Ķ!!2C!!!ĥdÅcĆR2ĦBĶSĥæ- !G222B2Ķ!ĦĶĶ!Ķ !2· !3rĵ3Ķ!Ķ!Ķ!ĶQ3ħń!ÉĦĶĦĦĶĶąĶĶĦĶQÖ÷ ![G!Ħ22!Mě!Ķ!!2M!t!ě+üĻ!_Ċ!B3!!Ë !G222R!!ĶĦĶĶ!Ķ !2· !3ååħB!Ķ!Ķ!ĶQ3¶µ!!¨ĶĦĦĶĶąĶĶĦAÖ÷ !^'BĦ!2Ķ!B!+D !'ĤĽ'õ!BĦB3!ĵ!Ķ!!!SÕ!Ķļ !?222R3ĵĶĦĶĶ!Ķ !2· !4aħsRÕtæ!ĶQ!3¶µ!!÷öĦĦĆbØĶŅĖ· !`sċ^ěMĤČC^!ûĥ²!!ĠąC!ĵ!!3!!ĵĦ!!!dÕĦ!!2ļ !>2B2S!ĵĶĦĶĶ!Ķ !2· !4AAçĦĆöĶ!ĶBsc !*ÖĆćĵĖ· !díĦ!!!ÝĶĵ!Ă22!223ĵCĥ3!ĵ3å!RdÕĖ!!22ļ !2Ö !,222BC2ĥĦĶĶĶ!Ķ !2· !5ą!Ćö!Ķ!cBc!Btń !&$ÕÖ¶ĦB·Ė !jLå22!2!!SĕdąSĦĵ3ąBöÇb!!R2BĜ !=222RC2ĕĦĶĶĶ!Ķ !2· !2ĥæc×QĆĶ!Ķ¥c!!ĦĶĆĵ3BB!2B!!µ!×d !D# !@s!ċ^ÊyõĆs2!!3!BĦRĶBĦĦBĦĥ!Sb¥RöB2Č !,ŀ!!stª !-222dB!ĕĦĶĶĶ!Ķ !2· !2ÅÇsŅĶ!Ķ!ĶĆ!tń !.ØŅBC !dĪĦ2Ķ«ÕBB3ĥCB!!!2RĦ!ĶĶ2ĶĶ2&Mc!sĦBìÑ!!»!!m!S2bR!cÇĪ·Ķ !+222dB!ĕĦĶĦ!!Ķ !2# !2rRĖ!Ķ!Ķ!Ķ!2cą!!éĦĦĶĦĦĶĶąĶĶĕ· !eĊĦR!īBB!!3B!cĦĪ!_ĦĪ!_Ė!!ĺ!áÖc·ĥS!ąB!Cą!!æÆ¥!Bst!RĪ÷ĆĶ !)22BSB2ąĦĶĦ!Ķ !3· !2adĖ!Ķ!Ķ!Ķ!Ħbdõ!éĦĦĶĦĦĶĶąĶĶĦÔĘ !dĪ!ĖBīBB!!ŀ!3ĥt!!R!!!Ċ!_ !)æ!ĕĖ2c!ö!Ć¥ĶÖ!Rçĕ!CF!!÷ĆĶ !'2BdB!2õĶĶĦ!Ķ !3· !2AA3!Ķ!Ķ!Ķ!ĶQ3ĥ!éĦĦĶĦĦĶĶąĶĶĦA·Ė !cú!B¼!!ĖĶĵ!Ķ!Cĥ!S!B2B!Ċ!!>BĆĦĥĖ2¦¤!¶!öĖ!Ķcæ!Bc!BB2S&!!÷ĆĶ!Rµ !&ĸ!2õĶĶĦ!Ķ !3· !2rĵħRĶ!Ķ!Ķ!ĶQ3ĥ!éĦĦĶĦĦĶĶħĶĶĦĵ·sö !b'ĥĶ} !&>!ĆĥCĵĶ!S!2B!Ī!!>ĦĦĥĖ2ĆcĆĖæÖĶĶ!2!Ė!BcB!B23F !/ĸ2õĶĶĦ!Ķ !3· !2åÆ!RĶ!Ķ!Ķ!ĶQ3ħńĉĆĦĶĦĦĶĶąĶĶĦĶ¶ !dĪ2Ħ} !(>õö¦ĥĖ2tĶBBĪ!!>ĆĕöBĦcĖö2RĶĶ !&Ħ!BcB!B2-F !/ĸ2å!ĦĶ!Ķ !3· !3rĵ3Ķ!Ķ!Ķ!ĶQ3¶µ!ÉĦĶĦĦĶĶąĶĶĦĶQÖ÷ ![ĥ!C!!!Ī!m !+DĀĵĆĶBtĥ3cĪ!!ĢõöBĶsĖö2RĖ !)2cB!B23F !/$Ķõ Ķ& !4· !3rĵħB!Ķ!Ķ!ĶQ!3¶µ!¨ĶĦĦĶĶąĶĶĦAÖ÷ !C# !7R!Ėą·!Ė!!'KłĶ!Ķ!B& !'đĆĦRRĶCcĪ!!ĢõöBĆÆöĖ2 !+2cB!B23F !/$ĦąĶĶĦ !5· !3ååħB24öąĶ2d!sē!!!×ĦĦĖĖAØĶŅĆÇ !VR !&Ėąµ!$Ė!!sÕtń!ĲĶĥ!d&!!÷!ŀĦ22S!cĪ!!ĢõæRĆÆöĖ2 !+2cB!R!3F !(Ľ!+ !&$ĖĕĶĦĶ !5# !4AA#D¤Ħõ !(ĖRB!2BB!ÖÇĵĆÇ !VĥC !&Åõ!āĶ¦ĺĘĥtń!!!ĲĶĕ!!x¦·P!đæc!ScĪ!!ĢõÖ!!ÆöĖ2 !*ĶBR2BR!3F!!Ľ+Ľ!!!+ !&$ąĖ!ĦĶ !5· !5AÆ!¦ !2ÅcĦ¦ !UĥĆBB!!!æ÷İ!B!ĺ!!ñx¦Rµ!!ĲĥĠĦ!ÜÖr×µāöcScĪ!!ĢõÖ!!ÆĖö2RĦ !&BĆ!2BBs2!C6!!Ľ+Ľ!!!+ !&ĨĥĖĶĶĶ !5· !5·Öą22C¥£!Ö!R¥C !`å!B !&ĆÇm¤Ķ !&Ûñx¦Rµ!!ñĦ!!!yöµ!!āĶScĪ!!ł¤Ć!RBRöĦR!Ħ!!!Ķ¥Ö222sBC26!Ľ+!Ľ!+ !'$ĖĵĖĶĶĶ !5· !4×¶ą2B·!ē!!!×¶c¶C !'Ć·õĆĦĦç !RÅc !'ö×<ëàĦs!RĦÛñx¦RµĢõ !'ÝĤ!!>åCcxBB!ĠĆĖB!ÖÖĖ¶ĦĦĶ!!ĖsĆĖR2RRt6 !&ĘG+ !&$ĦBĖĥĦĶĶĶ !5· !4×QõĖĶ!Ķ!Rcå!×c¶×!!!ĥ¶ĥ5ÅŅĦ¦ !Sµs !'ö×<°ċõ¦!ĦcRËñx!łĦ!ĕ !'½Ĥ!!>ĆcW2!sĐĆ!ĦR×Å!RR!Ė!!ĖĖcĆĖcBsdQ$ĖąĦ!Ķ!2!BBSBĦĶĥĖ!Ħ !6· !4#ąąĆĶ!Ķ!Ħbtå!é£ė!!ĥ¶¶CĶĶ¶Õd !SµRB!!!Ħö÷ğdŅ¶Ræs¶¥ûnĆĻł!ĕ!!!3!!BHĤ!!ĲRG22sĐ!!RS!ĕĦB¦Ėĥ!!!SÅcö!×sG !*2!cCR!ĦĶĥĖĶĶ !6· !4ĆŅÆ!Ķ!Ķ!ĶQSą!éä¶C!r¶§ąĶĶ¶õC !D# !0rc2!!!ĶĆ÷ßĦ!ĦÆÆRÖ¥ûñÖċłĦĕ!!ĶĶ!!!·HĤ!>!G2!c±!!BB !(Ħ!B !*Ċ$ÕĦĶ2B·ń!!!$!!ĖĵĦĦĶĶ !6· !4ĶĕÆ!Ķ!Ķ!ĶQ3ĥ!éĴö×!Aæ§ąĶĶ´$Bö !RrR2!!!ĶĖ÷¿Ćą!ħc¶ÖBĻñĆÛ!ĢõĖ!R !'·&!!>7B!cnĥCB!!cĖ!2 !'Ķ!RĦ!B!!Ċ !-DĦĖĥĦĶĦ !7# !3S!qĆ!Ķ!Ķ!ĶQ3ĥ!éĦĄ×!aÇ§ąĶĶĦÔDö !RrB2!!!ĶĦ÷ğdŅB¥Æ¶ÖBĻ±Û!!!ÑĖ2·!ĥ!!!Ė·&!>722B]!!2!2!d!!!ĦB!2!Ķ2!!B!!Ċ !.DöĕĶĶĦ !7· !3¦£ÖĶ!Ķ!Ķ!ĶQ3ĥ!éĦĤRdaSøąĶĶĦĶ¶ !SQBB !&Ćė<ë°ąSĶ!!RĻáªtÖA~ÐĆöĆĖ!!!¥Ķx!D!!!Ġą !&2!d!!!Ħ2Ħ2!RĦBĖsĖRĊ !/÷ĦĶĶĶ !7· !2ÇaĆĖĶ!Ķ!Ķ!ĶQ3ĥ!éĦĦńRöæöCĶĶĦĶô3÷ !QQ22B!!ĦĖħ<°ëąSRĶąerë!ħcĥ~ĶĖÆdĥĦ!!B!d&D!!!Āĵ!!!Ķ!2tĶĶ!Ħ!!!ĵCRĖ!!s!ļĔ !.÷ĦĶĶĶ !7· !2r¶Ö!Ķ!ĵ!!!÷¤3ĥ!éĦĦĶa!!!ħĶĶĦä3÷ !RµĆ!22!!ĆķmŅĆĥ2!tķrë×scĥđ¥BĜ}sĆĖ!!2s!h!D!!Ā!ĵĶ!!Ķ!·ĶĶĦĥ23ĵ!!CĶĵ32R8Ĕ !.×Ħ!!Ķ !7· !1r¶Ö!!Ķ!ĵU!£µ23ĥ!éĦĦĶĦĦĶĶąĶĶÕ!÷ !SĥÖĆ!B!!Ćķ<!6Ģ!cÅ!ª$!Õµ!ÁöBĜ}cĖĖ!!2sĖ·&D!!Ā!ĥ!Ķ!Ė!×ĶĦĕ22!!Ħ!22!!!t¦ĔĽ+!!!Ľ+ !'×Ħ!Ķ !8· !1a!ħR!Ķ!ĶŅU£µ23ĥ!éĦĦĶĦĦĶĶąĶĶÕ¶d !TąöĆB!!ĆÖÕ!áÆ!ý!ą·!!!ńđs2BĖÆdå !&BĶRh!!!>Ćĕ!ö!!!÷ĦĕĶ!!2!Ħ!2ĦBB!CiĔĽ+!!!Ľ+Ľ!+!!·!Ķ !9· !1rĵħ!RĶ!ĶŅ5ąą¥RħńéĦĦĶĦĦĶĶąĶõcd !E# !3åĖĦ!Ħ!öCPĘ!!!*õJ·Ĥ.¤ö2BĖöĶæ!!!sĦB2h !&łb !'ėå !'Ė!ĶcĆcB32iĔĽ!+!!Ľ+Ľ!!+!·Ķ !:· !2rĵħRĶ!ĶŅĹĥąÖĖæµéĦĦĶĦĦĶĶąĶõcd ![åĦ!ö¶Bd!!@ßĖZĆā1Ħ!¥2sĖ!!!BĶĶBSB&!!_µx±!BBÖÖĶæsĶ!ĦĖRĶcĆ2s!!¬ċ!!ġąĦB×ě!!+!¦ !;# !3a!3Ķ!Ķć!2!ÅĖsÕéĦĦĶĦĦĶĶąĶĵ·Ė !^åĦĖ÷!!!ĝĦ¬çÖı1Ħ!s!2s !&B!3BBĪ !&đ2cs!cBæĶcĖ2Ć!cĆRĖcsĖ!¡+÷ĆĶ!!!R«!+!×Ė !;· !3a3!Ķ!ÇBB!!ąÖ!sÕÉĦĶĦĦĶĶąąB·Ė !e@ßz÷æRĀĦ!À¥!!S!BB !&Ī_!!Õ!2c!Ħ¶cBÆBĶĦ!!2RĆBĦcB!Ć( !I· !2ÕĆ!!ĶĘõc !&ąÖĦBsĸĶĦĦĶĶąąBd !fUÊzï*Ćİ!!!¶ö¶3ĵ!I!<ąt!Ħ!!!ĕ2cĖĶB¶cBĖĆBĆ2RĆĖR!B!!( !J· !2r!!!$´d !(ąÖĖĶĶb !&s¶·Ė !CąöæQ!ė2!Rc· !8%QËiÐZ!ðĆ!¶Ė2¶2Ė2SRąWñtĦĥĶĖssÕ!2CÖcBĆ!Ĝ!!ŀ!Ħ!cĬ !M· !2aħRePµ×d !)åĖ!Ħ!!!Ħ13ħĖ !BąÅ!3!!222!Ė2ç !7ØÆëi3ÇŀĖĖ!!!cRcæ!cĦ·ÕR2Ė!!ĆsĆÖĕ!2d¶ļ !0Ö !I· !2¤ĥ!Çµ!×d !>ć!Ėµ !4ąÅ3cĈĦĦĕĶĶĶĕcö× !5¹AľOi32±ĖĖBĦ!c2!öB¶Ć¶¶¥ĦĶæc!!sĆÖĕ!t« !Y· !4ąµ3ĵtÇ !3ądsö !(rRõ¨ĦÕ !2ąscĥUĶTĦĕ Ķ'QĖ· !5ĸ2ûz¿!BĈĶ!ĶĦ!c2öBRĖÆÖ¥ĦĦĖĦ!BBsĆö!« !Z· !3ąèĴĶĵCĖAħR!ĦĦQ!ėBB!B222Bµ×d !)12¥õU!å !1ARĥ×!!¸Ħĕ Ķ(ô·¦ !4UŅËĖ!B!!Ĉ!!Ć !'B!sÖsĶĆ!!BB!¥RÜ !]# !2¦!Ĵ!Ķĵ!DĦĖąĦĶĶĶ!222BBCRBĤØĥBd !(åå#s!ĘĦą !0µĦ!!!Bsuĕ Ķ)Ą×d !45êĖ!BBĶ!2ĈĦĖĶ!!!BĦsö!sĖB!ĆcRRČ !^· !1ĆçĴ!!Ķ!Ķ!Ķ!AS×PĘėĦĦĶĦĦĶĶąĶĶąc×ö !(aSB!Ķèĕ2 !)b2B2!22B!!dÕĦsC Ķ)!ĄĘ !4@ßĖB22Ķ!!þĶĨĦ!ĖĶ!!sĶĆs22!2BČ !`· !0Ė×ńĶ!!Ķ!Ķ!Ķ!ĶQ¦Õ!éĦĦĶĦĦĶĶąĶĶĦŅ¦ !)r¶Ė!Ķ·ĆėÅ !(Öä !)×d!ÕĦs3 Ķ(!ÕQ$Ė !2*õ !/Ęæ!R!!!s!BČ !b· !/ĦÇń!Ķ!!Ķ!Ķ!Ķ!ĶQSą!éĦĦĶĦĦĶĶħĶĶĦĥ÷Ė !(µ×Õ!Ķ!SėÅ !(3õµcą!!!×d !&ÕR# Ķ'!Õ¶ąDö !1íç !0dĦĶ!2¥Č !e· !.3sń!!Ķ!!Ķ!Ķ!Ķ!ĶQ3ĥ!éĦĦĶĦĦĶĶąĶĶĦĶ¶RĖ !&ÕçµĶ!Ķ!ĘRÅ !(ÇbçôÖÕ!!×d !'ą!#ĦĶĶĶ!Õbħħ !1{å!!32!!!Ķ!ĵĶ2ĶĶBĎæ2B !.Ķ!2 !0Ö !I· !-3s0Ķ!!Ķ!!Ķ!Ķ!Ķ!ĶQ3ħńéĦĦĶĦĦĶĶąĶĶĦĶ¶ !'ą×r!Ķ!ĶcĈÅ !*¦!ģSą!!tBcC !&ąµ¸ĶĶĶ!ÕB¥Ç !1Ľ¦ !.Ķ¤XĨö!B !.Ķ!2 !X· !,SsĴ!Ķ!!Ķ!!Ķ!Ķ!Ķ!ĶQķ¶ÕĉĆĦĶĦĦĶĶąĶĶĦõĵķė!!!1cRBĶ!Ķõ!DĦ!Ė!ĥ!Ħ!!èģ3ĥ!!SĆA!!222BRõ§ĶĶÕB¥Ç !1Ċ!22mÜBĶ!!!ĶÒ©Ė!!!Rđ2 !.Ķ!Ķ22 !W· !+¦!0!!Ħ2!Ķ!!Ķ!Ķ!Ķ!ĶQ!SsµéĖĦĦĦĶĶąĶĶĦä3÷ !&åå3sĶ!Ķõ !.23ĥ !0uĶĔ3÷ !2ĊĦ2tKÜĶĶB22!²wB!Ħ2BıĖ !.ĶĶ!22 !W# !*¦Põ !)3!Ķĵ!!!DöĥöĖĦĆsRBĦĶĦĖAØĶÕ¶d !(åå3c!Ķ!Ķ!Ķ!Ķ!Ķ!ĶĶĶQ!3ĥ!!ÙĦĆĶĦĦĕ Ķ(ĕĖħ !3ĪĖR!mü!!C!2!ĥö!Ħs2SðĖ !.ĶĶ!!B !W· !*ÅĖ!ĶĶ!ĶĶĶb3!Ķĵ×!!ĦĶĶ!!ĶĦB2B!!BÅħ÷ąRd !*rĖ¶!Ķ!Ķ!Ķ!Ķ!Ķ!ĶĶĶQ!3ĥ!!ÙĦĖĦĦĦĕ Ķ(ĵĦ÷ !3ĊĶc3Kü2ĦSĥdHõöcĶRĖtĀĖ !-ĶĶ!Ķ2B !W· !21Q3!Ķĵ×d !0ąÖsBd !+åå3cĶ!Ķ!Ķ!Ķ!Ķ!ĶĶ¥Bå3ĥ!!ÙĦĖĦĦĦĕ Ķ(bĦ¦ !3Ċ!t!;üSĶ2Ķ2!ĥÖ!Rtĵ!đĖ !-ĶĶ!Ķ2B !W· !2AA3¶µ×d !2Ć!d !-12¶Ķ!Ķ!Ķ!Ķ!Ķ!ĶBsÕ23ĥ!!ÙĦĖĦĦĦĕ Ķ(1çĖ !3ĚdąB]ÜĶ2BS^!ċÕ2BBĶSðĖ !-ĶĶĶ!2B !W· !2QB¶!!è!£!ĖĶĶĦĦĦ!BB 2'B!!BC !+rĵtĶ!Ķ!Ķ!Ķ!Ķ!Ķscµ23ħń!ÙĦĖĦĦĦĕ Ķ'ĵc·Ė !3ĊBCB+ÌĆcĶcĦ!°ĝĥ2SĦ2ðĖ !-ĶĶĶ!2B !/Ö !I· !2r¶!µU¤!ącd!ąĆĶĦ!RcBCRń!Ę!ą!BC !*ååCB!Ķ!Ķ!Ķ!Ķ!BBcµ2ķ¶Õ!!¹ĖĦĦĦĕ Ķ'Q!d !4ĺ!3ĵ]ü!2ĖĶ2!°ĝ!2!!!ðĖ !- Ķ&BB !W· !5¦¤åĖ!Ķ!2Bĥ!!éĦĦĶĦĦĶĦĕĶĶAĦBC !*1cR!Ķ!Ķ!Ķ!ĶBcBµ×Ööss×ń!fĦTĦĕ Ķ'ä×d !47!!!;ĝ!µ¥ĶBCKĭĶnº!2ıĖ !- Ķ&BB !W· !5¦¤åĖ!Ķ!Ħbdõ!éĦĦĶĦĦĶĦĕĶĶĦÔ÷C !*Q13SB!B2BS¥cbsĤ·Ė!!ĶĖĦQ!ħ2BB222B!!·Ė !4ú!!2°ĭĥ!C!Ķĵ]¼s¡ÊĶBġĖ !- Ķ&BB !W# !5Å2öĶ!Ķ!ĶQ3ĥ!éĦĦĶĦĦĶĦĕĶĶĦÔ×d !*å¶cSĕ! 2'Bd!¤B22B!ĦĦĦĶ! 2'B!!·Ė !5úBB!]DĤ!!!D !'©R2đĖ !- Ķ&BB !W· !4ą!æĦĶ!Ķ!ĶQ3ĥ!éĦĦĶĦĦĶĦĕĶĶĦAĆÇ !9÷s¥!!Ä!!Èå !?ĊRĦSKÌcÖR22ûRĶĦÀÜ!tðĖ !- Ķ&BB !W· !4åĶö!Ķ!Ķ!ĶQ3ĥ!éĦĦĶĦĦĶĦĕĶĶĦÖrÇ !8Ç¤ÇaBµ!!Uå !@ĪĶS2;ĝ2ąB32ĕ23õÀì2SðĖ !- Ķ&BB !W· !3ą!æĦ!Ķ!Ķ!ĶQ3ħńĉĆĦĶĦĦĶĦħĶĶĦb¶÷ !8SåõĖĥ!!Uå !AP !&üCK !(ì}ĭ!!ðĖ !- Ķ&BB !:$ !&ń !9· !3åĶĆĶ!Ķ!Ķ!ĶQ3¶µUsĦĶĦĦĶĦĕĶĶĦAÖs¦ !7ö÷ĔBĥ!!¨µ !Aú!!!222ĦĶ!!!BÂ !'µĖ !- Ķ&BB !/Ö !+$ń$ń !<· !2åBæĶĶ!Ķ!Ķ!ĶQ!3¶µURĶĦĦĶĦĕĶĶĦĶQĆÇ !7æćĄRĥ!!¨µ !AúĖB22ĦRĶ2ĦĖct^VĖ¶ĶRġĖ !- Ķ&BB !:$ !&ń !9· !2ÅcÖ!Ķ!Ķ!Ķ1 !)UBĦ£!§ąĶĶĦ!AÖ÷ !7Öėôcĥ!!Ę!!!# !>ê2B2Ķ22!ĶCĕdĶnF2sĶBġĖ !- Ķ&BB !W· !2µ2Ė!Ķ!Ķ!Ķ!1×Ö!ĵĶURĶaÅ!3×ĶĶĦĶræÇ !7rĥė¥ĕ!!Ę !6vĦcÓ !*ĊBC2Ķ!2Ķ2!Ķ2!^wB!d2ðĖ !- Ķ&BB !9$ !'ń !9# !2QcĦ!Ķ!Ķ!Ķ!2Ņ×ÖĥUc!ĴÆ¶ą!èĶĶĦ!¥Å÷Ė !6rĥ2Są!!÷C !4vö2Ră !*ú2!!°ÌĶ2B!B!¡!V¶ĦdĶĀĖ !- Ķ&BB !:$!ń !<· !2AA3!Ķ!Ķ!Ķ!Ķsĕ!!éĖôĵĈ!!a3ÇĶĦĶæÕ·Ė !6rĥ2dõ!!÷C !3vöÅöÖa !*ĊtÕs]HRĶ!!sċR¡ºd22ĶðĖ !- Ķ&BB !9$ !'ń !9· !2åÆA3Ķ!Ķ!Ķ!ĶBÖµ!UĴĵĈ!!!QstĶĦ!öÕtĖ !6rĥ2¦Õ!!×d !3Eõ¥!¶£ !*ĺ!!3KČCĥC!!!; !(ĘÕ !- Ķ&BB !W· !3åÆA3ĶĶ!Ķ!ĶQdõ!CĵĈ !&ÅĦķĶĦĶä÷tĖ !6rĥ2Çµ!!×d !2vĆÅÆBsÄ !*ĺ3ně+!D!Ĥ!!!DÊBSĶ2!ġÕ !- Ķ&BB !W· !4åÆA#Ķ!Ķ!ĶQ3ĥ¦õĈ !'Åc3ĶĦ!ööRĖ !6rĥ2Ķ!!$Õd !2fåö¶2BĔ !*G!!MĤĭ^ěĕ¡ċ^Ĥ !(ĘÕ !- Ķ&BB !/Ö !(Ļ!!!R!!!2!!2!!!2!!ñ !0· !5åÆAķ!Ķ!ĶQ!Çsķ !'ą!CĶĶŅ!ĆÇRĖ !5QŅ2ħccc¶÷ !3UÕĖľ¾RĔ !*GĶ^!ĤD!ċ^!ě!Měĕ]ĭ2MÕö !- Ķ&BB !6Ļç !2àĖ !/· !6åÆAķĶ!ĶQÇsķ !(Pĩĕĥ!Ö!¶·Ė !-Cå!R!Sc!ĄA!3ĥ!!C÷ !&# !-µ&ĆÕĖòoîĔ !*ĚB!ĦBĦB!!ĦSĵ¡Ĥü2!!3ĕā !- Ķ&BB !6ĂĶ !/İ!!àĖ !/· !7åöĵħ!ĶöÖ÷ !(r2B!Ė!RÇ !/Ć!¦!c!!ē!×ÖĆQ!3!÷ !3µ&ĖĖõĞĶîĔ !)'nĤĝnwc2Ė2Ķ!t;DêSM!!!Õö !, Ķ&BB !6ĂĶ !/İ!!àĖ !/# !6Ć!´C¶!!Ö÷ !*ą!dRĖ !0ĶSĕÅĶ!Ķ!22RÕ×!d !8fĖĥÞ¾RĔ !)* !6ýĖ !, Ķ&BB !6ĂĶ !/İ!!àĖ !/· !5#ąR!aC!!÷ !/ą!d !-Ķ·@Ķ!Ķ!Ķ!Ķ!Ķ1tå×d !7vĖĶĵ2BĔ !)í!¬ĵĖBC!2¯söî2!2!!!tĥĎĖ !, Ķ&BB !6Ļç !2àĖ !/· !4#¥ńĦÆè !&£ĖĦĦĖAė2R2BBBµ!×d !+¦!@!Ķ!Ķ!Ķ!Ķ!ĶBĵ3÷ !8¨ĖĶĵBsÄ !)ý¬Ķĥ!C2!¯B!2!!!2!2!!2ĞĖ !, Ķ&BB !6G·!!8 !,İ!!àĖ !/· !1r÷çĆPö!ĶsĨ!£!×öąöĦĆcBBRdQ!Ø÷qd !*¦ē¦Ķ!Ķ!Ķ!Ķ!Ķs!Ħĕ!3÷ !8vĦŅ!¶£ !)ýzĕĶ!2 !)223¿B2!RĞĖ !, Ķ&BB !6G·!!8 !,İ!!àĖ !/· !/ĆÕ¶4ĖĴĆĶ!Ķ!Ķ!ĶRÆµ!éĦĦĶĦĦĶĶąĶĶRĵC !)¦ē¦!Ķ!Ķ!Ķ!Ķ!sö!!!ĵ!3÷ !7¹ĦrĶÇĳ !)ýzĥ232!¯B2Ķ22!2!2!2ĖdýĖ !, Ķ&BB !/Ö !(G·!!8 !,İ!!àĖ !/· !-ĶĖÕĥĘė!Ä!Ķ!Ķ!Ķ!ĦbSą!éĦĦĶĦĦĶĶąĶĶĦÔĘ !(çÓ·Ķ!Ķ!Ķ!Ķ!Ķ¶Ös¦!!åöĵĈ !'s!Ħ!Ė!ĥĦ !&d !&¹æ!Ră !)ýX232!¯B2!!2!2!2!2!ĦSýĖ !, Ķ&BB !6G·!!8!İ !(8!İ!!àĖ !/· !,¦ÕÕc!dėĔö!Ķ!Ķ!Ķ!ĶQ3ĥ!éĦĦĶĦĦĶĶąĶĶĦėąĖ !&ė¢·!Ķ!Ķ!Ķ!Ķ!ĕtÇ !0# !(sĦĖĥĦd !&vĦcÓ !)ýX2C!¯B2!2!!2!2!2!3ĥCýĖ !, Ķ&BB !6W¦!!8!İ !(8!İ!!àĖ !/· !+¦!£!!×ö!aħRĶ!Ķ!Ķ!ĶQ3ĥ!éĦĦĶĦĦĶĶąĶĶĦs¥!ö !&å!!Ķ!Ķ!Ķ!Ķĕ×d !.aķTö!ĕ Ķ(ĕRöė !0ĺ3ĵC2+ĭ!ĕC2!2M!Ê2Ħdĵ32!ąā !+ Ķ&BB !6W¦!!8!RĀ !&iĖ!İ!!àĖ !/# !+aķcs×ö!!1Q3Ķ!Ķ!Ķ!ĶQ3÷PéĦĦĶĦĦĶĶąĶĶĦ!¥ !&aSR!!Ķ!Ķ!Ķ!ąĘ !1rĵķÖC Ķ(ĕĵS× !0ĪC!!B+ĽĦĵS!M!!!ÊĶR3ĵ!C2õā !+ Ķ&BB !6W¦!!8!2Ġ !&HĶ!İ!!àĖ !/· !+rĵķÖ×ö!!rĵ3Ķ!Ķ!Ķ!ĶQ3¶µ!ÉĦĶĦĦĶĶąĶĶĦ!äħħ!!rĵSR!Ķ!Ķ!ĶąĘ !2ą!ÖĵĶè Ķ'ŅąĈ !0GMě!MĤĽĕĖdÅ×2M(!KČ!S!M!!!µĖ !* Ķ&BB !6ht!!HĶ!!cðyĆ!!BĐ!!àĖ !/· !,aķsõDö!å¶2B!Ķ!Ķ!ĶQ!3÷P!¨ĶĦĦĶĶąĶĶĦä3÷ !&rĆÖ!Ķ!Ķ!BÖ1!3!tB!2!B!S2R B&2ĔÖĥè Ķ'ŅĖ÷ !0s!!!Ĥ!ĽM!û!ĥCn!!ĤD!!ĤĝĵC!ðĖ !* Ķ&BB !6ht!!yĆ !*İ!!!àĖ !/· !-aķÖd!!!rĵ#D¤!Ħ!!ĵ!R!!!Ė!Ć!!ĵbØĶÄ3÷ !'ąÅÈĥĶ!Ķ!B!B!!!B!C!!R!ń !,è Ķ'bÖ÷ !0ĺSĶ!^!!ê¡ÊSĥC22Ķ2Ķ;ümĝĵSMÕö !* Ķ&BB !6ht!!!iĖ !(RĀ!!!àĖ !/· !.at·!!!ååħæè !'£ĖĆ!ĵ3!cR!ÖĵØÅ!÷ !)rĆÖĶ!Ķ!Ķ!Ķ!Ķ!Ķ!ĶĶĶccå!!!ÙĦĖĦĦĦĕ Ķ(¤Ö× !0s !&ĤD!!ċ^ !)ĤDĤĽM!!öÕ !* Ķ&BB !/Ö !(ht !&iĦĶ!!2BĀ !&àĖ !/· !5AççēĘ !0ąÖ!¶d !+aÈĕ!Ķ!Ķ!Ķ!Ķ!Ķ!ĶĶĶQħ¶å!!ÙĦĖĦĦĦĕ Ķ(ÆÅÇ !0ĚBĶ2Ħ!!!B3ĕdąBĶCnĤì!B!ĦBSõā !* Ķ&BB !6xd !2àĖ !/· !5Ćç£è!å !0ą!!!d !*Ć!ĕ!Ķ!Ķ!Ķ!Ķ!Ķ! Ķ&b3ĥ!!ÙĦĖĦTĦĕ Ķ(ö¤· !/P !4ìSĵCĶBM!µĖ !) Ķ&BB !6xd !2àĖ !/· !4ĆçĤ!Æè!¤!!ÕĖA!ħRBB2B!!!µ!×d !)¦cĴ!Ķ!Ķ!Ķ!Ķ!Ķ! Ķ&b3ĥ!!ÙĦĖĦĦĦĕ Ķ(öµ¦ !/7^!ê¡!Ĥ¼sĶĶ2!!C2Ķn!êC^ěM!!!Õö !) Ķ&BB !7R !3Ė !/# !3ĆçĴĶ!ĶÖ!!!#!c!!ĥĦĖĦĦBBsrØ´÷C !(¦caö!Ķ!Ķ!Ķ!Ķ!Ķ! Ķ&b3ĥ!!ÙĦĖĦĦĦĕ Ķ(Ėµd !/'!22!!+ĽĕS!!ĦB!Ķ2+ü!2Ķ!!!S!ıÕ !) Ķ&BB !W· !2Ć!Õ!Ķ!Ķ!Ķ!2cą!DÇĦĦĶĦĦĶĶąĶĶŅd !)¦¥ĤĶ!Ķ!Ķ!Ķ!Ķ!Ķ! Ķ&b3ħń!ÙĦĖĦĦĦĕ Ķ(Ėµd !/G!ĦB!!+Ľ!Ķ!2M!!tě!ĦĥCBĶ2Ķ^ěõā !)ĶĶĶ!2B !:$ń!!$ń !9· !2r·Õ!Ķ!Ķ!Ķ!Ħbdõ!éĦĦĶĦĦĶĶąĶĶĦÔĘ !'Ć#Ĥ!Ķ!Ķ!Ķ!Ķ!Ķ!Ķ! Ķ&b3¶µ!ĉöĖĦĦĦĕ Ķ(Æąd !/'něĶ^Ĥ!ü!S2+Č !&3!Kü !&23ĕā !)ĶĶĶ!2B !9$ń$ń!$ń !9· !2rĵ3!Ķ!Ķ!Ķ!ĶQ3ĥ!éĦĦĶĦĦĶĶħĶĶĦÔ$Ė!!!ĥ¤!¦!Ķ!Ķ!Ķ!Ķ!Ķ!Ķ! Ķ&b!3ħń!ùÖĦĦĦĕ Ķ(ÆĥC !/P !(Ľ!Mě+ĝB!!M!ě+Ľ !&MěõıĖ !(ĶĶ!Ķ2B !9$ń!$!ń!!$ !'ń !1· !2ąÅħRĶ!Ķ!Ķ!ĶQ3ĥ!éĦĦĶĦĦĶĶąĶĶĦAdsö!!!Åą!¦Ķ!Ķ!Ķ!B!!R!!B!!C!R!ń !+×ķĶĶĶÆĥC !.'KĝB!ądĦB+ČĦB!!3!KüĶ2Cĵ32ĕdądĀö !)ĶĶ!!B !/Ö !3$ń$ń !4· !3a!3Ķ!Ķ!Ķ!ĶQ3ĥ!ĉĆĦĶĦĦĶĶąĶĶĦĶ¶ !(Åą!ÇĖĶ!Ķ!BõT2!22B2B3RR!!£!Ć!ĶĦĵÇ# Ķ&Æ !0G+Ľ!ĦĵS!!+ČĶ!2S!MĤĝĵ3!ĥ!S2ĦBMöÕ !)Ķ!Ķ22 !:$!!!ń!!!$ń !5· !3rĵ3Ķ!Ķ!Ķ!ĶQ3ħń!ÉĦĶĦĦĶĶąĶĶĦĶQÖ÷ !'ą¥æĖĶ!Ķ!BĆ÷ !2sĵ3Ç Ķ'Æ !0G+üd!!Ķ2!+ČĶd!!!MĤĝ2ĥS !&MěMÊā !*ĶĶ22 !9$ń!!!$ń !9· !3ąÅħB!Ķ!Ķ!ĶQ3¶µ!!¨ĶĦĦĶĶąĶĶĦAÖ÷ !)QööĶ!Ķ!2Ė¶d !1a3× Ķ(ÆRĖ !.'K !*Č3B!!!MĤüd!!M !(Êā !*Ķ!2 !;$!!!ń!!$ !'ń !1# !4aħsRÕtæ!ĶQ!3¶!!!BöĦĦĆQØĶŅĖ· !*rĥ¦Ķ!Ķ!Ķ¥Ö¶d !/r!Ĉĕ Ķ(ÆRĖ !.G+Ľ!!!MěMĤì!!!BĦ!BĦ!SKČĶ!2Ķ23ąđ !*Ķ!2 !B$ń$ń !4· !4AAçĦĆöĶ!ĶBsc !*ÖĆćĵĖ· !+QŅ¦Ķ!Ķ!ĶRRösd !-r¶¸Ħĕ Ķ(Æsö !-ĺ!!!Ķ!!mĝ!Kĝ !&BH!!!M!ĤČ!C2ĕ3!ĀĖ !D$ !'ń!!$ń$!!ń !1· !5ą!Ćö!Ķ!cBc!Btń !&$ÕÖ¶ĦB·Ė !*AħÕĶ!Ķ!Ķ!RRĖR!BCRBĤD!ĦĖĥĦØĦĦĕ Ķ(Æsö !-ĺSĶ!Ķn!Ĥü !-d!!+üC2!2!!Āö !D$ń$ń !<· !2ĥæc×QĆĶ!Ķ¥c!!ĦĶĆĵ3BB!2BĆ!µ×!d !*bc2Ķ!Ķ!Ķ!ĶRcBC!Rń !)fĦĦĦĕ Ķ(Æ !/P !)ü2C2Ħĵ!S !&+ !,ĘÕ !M$!!!ń !2· !2ÅÇsŅĶ!Ķ!ĶĆ!tń !.ØŅBC !*¤Ė¥Ķ!Ķ!Ķ!Ķ!Ķ!ĶĶĶccå!!!ÙĦĖĦĦĦĕ Ķ(Æ !/ĺ3!ĵ!S!+ìd!ĕS2Ķ!2!M!Ĥì2Ħ2Sĵ3ĵ¡ċąā !:Ö !+$ń !($ń!!!$ń !1· !2rRĖ!Ķ!Ķ!Ķ!2cą!!éĦĦĶĦĦĶĶąĶĶĕ· !+ååķs!Ķ!Ķ!Ķ!Ķ!ĶĶĶQħ¶å!!ÙĦĖĦĦĦĕ Ķ&µQ3÷ !.ĺ!3BĦBMĤČS!!ĦBĶ2M!ĤD!ê3!2ĥ!!¡ûBõā !D$ !'ń!!$!!!ń !2· !2adĖ!Ķ!Ķ!Ķ!Ħbdõ!éĦĦĶĦĦĶĶąĶĶĦÔĘ !+rĵd!Ķ!Ķ!Ķ!Ķ! Ķ&b3ĥ!!ÙĦĖĦTĦĕĶĶ!¤2BÖC !-ĺĶdĦB!MĤČ3B!!!M!!Ĥ!!!ĽĕĦ!tõdĶ!B!MµĖ !C$ń !>· !2AA3!Ķ!Ķ!Ķ!ĶQ3ĥ!éĦĦĶĦĦĶĶąĶĶĦA·Ė !*ååķsĶ!Ķ!Ķ!Ķ! Ķ&b3ĥ!!ÙĦĖĦĦĦĕĶĶÅ2ÖC !/ĺCĥC!^!Ĥ!DÚ2322M!Ĥ!!!Dê!!!S!Mě!!-õö !K$ !'ń !1# !2rĵħRĶ!Ķ!Ķ!ĶQ3ĥ!éĦĦĶĦĦĶĶąĶĶĦĵ·sö !*rĵdĶ!Ķ!Ķ!Ķ! Ķ&b3ĥ!!ÙĦĖĦĦĦĕĶõĖÖC !0'BĶ^ě!MĤ!ČSĶ^ûĵ!3KĽĦnĤĭ!!^ě!M!ěMĦõö !C$ !'ń!$ń!!!$ń !1· !2åÆ!RĶ!Ķ!Ķ!ĶQ3ħńĉĆĦĶĦĦĶĶąĶĶĦĶ¶ !,ååC2!Ķ!Ķ!Ķ! Ķ&b3ħń!ÙĦĖĦĦĦĕąĶ· !2GM !'Ĥ!ĭ^!ûĥS^ûKHM!ĤD!!!Ĥĝ!ĵ32!ĕñ !F$!ń!!!$!!!ń !2· !3rĵ3Ķ!Ķ!Ķ!ĶQ3¶µ!ÉĦĶĦĦĶĶąĶĶĦĶQÖ÷ !+aķc!Ķ!Ķ!Ķ! Ķ&b3¶µ!ùĆĖĦĦĦ¶£C !3ĺ3ĵ!C!!;!!!DěMěM!ĤD!!ĤD!!!ĤČCĶBM!Êā !C$ !'ń !9· !3rĵħB!Ķ!Ķ!ĶQ!3¶µ!¨ĶĦĦĶĶħĶĶĦAÖ÷ !,rĵ#RĶ!Ķ!Ķ! Ķ&b!3¶µ!ùÖĦĦĦA!Ė !2ĺCĥC^!ěMĤ !&Č !*3!2;ĭĥ]Č32^!!µĖ !J$ !&ń !2· !3ååħB24!¤!!ç!!ē!!!×ĦĦĖĖAØĶŅĆÇ !-åÖ1#RĦR22B!BCRń !,$Ė !3'2^ċ2!M!Ĥĝnċ;ČCĥC2M!ě!MěMĤČC;Č3!B!-õö !8Ö !,$ !&ń !($ń !1· !4AA#D¤Ħõ !(ĖRB!2BB!ÖÇĵĆÇ !/åÖ1!!ħB2RBB!!ĦĦĶĦĵħRB2BcC !47^ !(ĤĽMě+ĝnċ^!!ě!M!!!ĤĝnĤDěM!!Ħõö !B$ń$ń !&$ !&ń !2· !5AÆ!¦ !1ąĆcĦ¦ !F# !6ĺĦBĦĶ2!2!!!23ĵĶCĕ2Ķ!B3!nĤì2!!2Ķ!CB!õā !C$ !&ń !9· !Ią!d !]ĺĦĶBĶ!S2Ķ!!22!Ħ!2!ĶBMě!+!ü!23!BĕĦd^Êā !K$!!!ń !2# !¨7ąBĶ2CĶBMě!!Ķ!^ěM!ěĶ2!M!Ĥ!ìB3ĵ32^ě!M!µĖ !A$ !'ń!$ń!!!$ń !1· !¨sĤ !4Q !'ìS2ĥC!2!!M!Õö !A$ń$ń !<· !I÷r !]Ī!²!Ĥĝ22+ÜĦB!B!ĦBĦBĦBC!KD!ÚCnûBM !&ĦĖÕ !B$ń$!!ń!$ń !6· !Iø!!!r !YsĤ !)ÜB!2Ħ22!!32!!!; !.$ĖÕ !I$ !'ń !1· !I÷r !]ĺ32Ķ!BĶĶKüC!2!!2ĶĶ2Ķ22ĦKĝĵĦ !'BĦ223ĥāĶ !6Ö !+$ !'ń!$ń !6· !§ĺ3!ĵ!!SM!Ĥìd!ĥĶS2ądĶ2!MěMĤì22Ė2Sĵ!3ĵ¡ċ!ÐĶ !@$ń$ń!$ń !9· !I÷!!!r !E# !4ĺ3ĕB3BĶ2!+ĭĶ22ĦB!ĶĶBMě!M!!Ú!CĵĦ!Ķt2!ĕ3nµĖ !H$ !'ń !1· !J÷r !ZĺĶ!dĦB!M!ĤĝB !&+D!!Ĥ!D!ĤĽĕ!Ė2BC!Ķ!n!ěMÕö !_# !K÷r !Yĺ!!3!ně!MĤ!!!D!!Ĥ !*DêĦB!!SĕC^ěMěMöÕ !I$!!!ń !2· !J÷r !ZĺS!Ķ2!M!!ĤĽĦĥ!2SĶ!2!+těĦ2;üS2Mû!BMě!!!-ĖÕ !H$ń!!!$ń !1· !I÷!!!r !W'B!MěMěM!Ĥ!ĝĥ!C2Ķĥ23B+ĝ22!+ĝBĕC^!ě!M!ěM!ĦµĶ !?$ !'ń!!$!!!ń !2· !I# ![72Ķ2MěM!!Ĥ!ČC2M!ěĦĵ!¡Ĥĭ^!!Ĥ !/$µĶ !^· !¦GM !'ĤDĤ!ĭ^!!ûąd2^ûKĽM!!Ĥ!D!!!Ĥ!ĝ!ĵ32!!ðĖ !5Ö !+$ !'ń!$ !'ń !1· !¦ĺ !'3!2;!DĤD!!!ċ^ěMĤD!!!Ĥ!üCn!Ĥ!ĭ!ĥ3B!MÕö !@$!ń !'$!ń !4· !r# !3ĺ!C!2Mě!MĤ !:ĝĵS!MěMöåĶ !>$ !'ń!$ !'ń !1· !¥ĺ!SMċĥC!^!ĤDû2ĥ]ìB3ĥ!C2!2Ħ22!Ķ^ĤČĶSĥCĥ!S!MöåĶ !]# !¥'22Mċ2!M!!ĤĝB!Ķ;ČC!!!2M!!ě!Mě!MĤČC2Ħĵ3!BM!ĦÕĖ !?$!!!ń !:· !¥7!^ !'ĤDĤĽĶ^ě+ĝn !'tě!M !&Ĥĝn!ċ^ěM!ěMĦõö !>$ń!!!$ń !9· !¥sĤ !+D!!!Ĥ !2ĭ^ !*ĦĖÕ !]· !I# !ZĺĦ!!2 !&Ķ!!SĕB3!ĕ2C!ĵĦ!BĦ22S+ì !*2!2Cĕñ !C$ń !9· !¥ĺĦBĖB!Ķ!!!BĦ2!2ĦSĕ!dĥĦB!ĶC!BMĤì!2Ķ22!!ĦB!SMÊā !4Ö !I· !¤ĺĦ22!!!CĶ2!Ķ!2!2MěĶ2!MěĦ!B!M!!Ĥ!ìBĦB3ĥS2!ĦněMµĖ ![· !r# !17ąSĵĶ23!22Mě!MěĶ!^ě!M!ěĶ!^ěM!!Ĥ!ìB3ĵĶCBMě!!!MµĖ ![· !¤sěMěM !;Ĥ!ìB32ĕdĦ!BM!!!Õö ![# !¤sĤ !@ìS2ĥSĶĶB!!M!!öÕ ![· !¤Ī!²ċ2+ü2!C;Ü !.ċB!!mD!ĤüĶS2Ķ!n!!ěM!Ħõö ![· !£'2^!!!êC^!!ĤìĖcĦBCĕ2!!CĥC !&BM!!êC!^ !&ěM!!!Ħõö !Z· !I# !©ĥĦĖ !Z· !£* !PýĖ !2Ö !I· !£ĭĖ2 !KB23ýĖ !Z· !r# !0ĭĦ[í½Ķ!ĵ!Ė222!32Ķ2!!¯!Çľí!!2Ķ2!!!2Ķ2!!!2Ķ2!·þĽ3ýĖ !Z· !£ĭ(ĠĆÍ!!ĵ!Ħ!223!!!2!¯!!i^ÅB!!2Ķ2!!!2 !'2!!Ėçõ3ýĖ !Z# !£ĭĖ¬!Ķ!ĵ!ĶĶ2!232Ķ2!!¯!!BĦB!2!Ķ2!!2 !'2!!!2Ķ!2CýĖ !Z· !£ĭĖ¬!Ķ!ĵ!Ķ!!232Ķ2!!¯!!BĦB!þĶ2!!!2Ķ2!!!2Ķ2 !&2!CýĖ !Z· !£ĭĖ¬ĶŀÕX !'2 !22!!23!2¯!!B!2!!R!SíĖ !Z· !I# !XĭĖ¬ĶŀÕyĶ22!32Ķ2!!¯!BĦB!2Ķ2!2Ķ2!!!2Ķ2!!!2Ķ2Ė2R!CíĖ !Z· !£ĭĖ¬Ķ]ÅHĶ223!!2!!¯!BĦB!2Ķ2!!!2 !'2!!2Ķ2!!Ė2R!CíĖ !2Ö !I· !£ĭĖz!]ÅH2!3!!2!!¯!B !&2!!2Ķ2!!!2 !'2!!2ĶĦ2B!CíĖ !Z· !r# !0ĭĖzĵnĆĻ!!3!2!!¯!BĦB!2!!!2Ķ2!!2 !'2!!!2Ķ2Ħ!S!2íĖ !Z· !ÓÕ ![",
);
// }
var fontOffsets = [];
fontOffsets.push(rawImages.length);
// End Screen Font {
rawImages.push(
  "#2 |2 !&öb 1&bö !(Ķ1¤Ė !&Ė¤1Ķ!!!ĶA !,AĶ!!A !.A !6 ķ, !&ķķ !,ķķ!!11 !,11 !& 1, !6ħ !.ħ!!2ħ !,ħ2!!!2ķçR !&Rçķ2 !(sć ķ&ćs !6",
);
rawImages.push("#2 |2 !E11 !*11!!!1 !01!!! 1* !V ķ. !Bķķ !d");
rawImages.push(
  "#2 |2!!!b1b !&Ķ 1&!!!bĖ!Ėb!!µA !(öĖ !'µæ !)Õ!!!Rćöæ !-ħć!¤!!!ħķ !&ćķķ2!! ķ&2 !'b11Ķ!!111 !,AĶµ !'µ !&·!!!Aæ!!¥!µæ!ç!!sç !(Ç!æ!!¤!!!sħ¥!!¥ħ2 !+2×ķķ×2!! ķ& !S",
);
rawImages.push(
  "!2| !1| !1| !1|!öÕĖçs!!ö¤!Rć!!|ö¤!!!ķ!!1!!!Rć!|1 !&ķ!!1 !&Rć|1!çÕ·s!!ö¤ç¤!!ķ| !1|1!çs!ö¤ķ!!!1!!ķ|1!!ç!¤!!ķ!bĖ!!ķ|bĖ !-Rć|ö¤ !&ç¤ !'çs|!öÕĖR·sbĖ!!!Rć!| !)ĶrĖ!R÷2!| !1| !1",
);
rawImages.push(
  "#2 |2 !7Ķ 1& !,ĶA !/ĶA!çķ !,ĶA!çs !,ĶA!çs !-2ķķs!!!ķķ!!!11!! 1. !V ķ)!!ķķķ !2ķķ !+ķķ !8",
);
rawImages.push(
  "#2 |2 !3 1)!Ķb1bĶ !-rĖ!ĖrĶ !0Ėr !,·Rç!!Ė !&ķķķ!!!sćs !,ķķ !&ķķķ !)11Ķ!!Ķ111 !+AĶĶA !/AA!!!R!!!R!!!R !)·!!R÷!!!÷R !'Rs!!÷2!!!2÷R!!!R÷!!!2 !'2ćķķķć2 !4",
);
rawImages.push(
  "!2| !1| !1|!!!öÕĖ!!!R·s!!!|!ĶA !+ħ2!|ĶA !-ħ2|bĖ !-Rć|1 !/ķ|1!ķ !*1!!ķ| !1|1!ķ!!!1!ķ!!1!!ķ|1!çÕ÷21 !)ķ|bĖ!!!ķbĖ !'Rć|ĶrĖ!!ķĶA !'ħ2|!ĶrĖħ2!ĶrĖ!R÷2!| !1| !1",
);
rawImages.push(
  "#2 |2 !C 1& !Aķ!!!öb111bĶ !&ķ!!!b¤Ė!!!Ėr !)bĖ !(Ė !(bĖ !)R !'bĖ !)R÷ !'Ė!!!Rçķķķć2 !)Rħćs !,Rħć2 !.ć2 !-ķķ !?",
);
rawImages.push(
  "!2| !1| !1| !)ĶÅæ!¥Ç2!|!ĶrĖRćĶrĖ!!!R÷2|ĶrĖ !,Rć|µæ !.ķ|1!!ħĆÕĖ!çsöÕĖ!ķ|1!ħ2!ö¤ķ!!!ö¤!ķ| !1|1!ħ2!ö¤ķ!!!ö¤!ķ|1!!ħĆÕĖ!çsöÕĖ!ķ|µæ !.ķ|ĶrĖ !,Rć|!ĶrĖRćĶrĖ!!!R÷2| !)ĶÅæ!¥Ç2!| !1",
);
rawImages.push(
  "!2| !1| !1| !1|!ĶrĖ!R÷2!Ķr!÷2!|ĶrĖ!!!R÷21!!R÷2|bĖ !'Rć1!!!Rć|1 !)ķĶr÷A!ķ|1!!ķ!!1!ķ!!!1!ķ| !1|1!!ķ !*1!ķ|1 !/ķ|bĖ !-Rć|ĶrĖ !+R÷2|!ĶrĖ !)R÷2!|!!!öÕĖ!!!R·s!!!| !1",
);
rawImages.push(
  "#2 |2 !>µ11 !-µ1æ !-µ1æ !,Ķb1æ !,µ1AĖ !,µ1æ !'¥¥ ķ&!!× ķ)×æ1 !' 1(µ !1æ11 !4111!!ķķ¥ !1×ķķ¥ !1×ķķ¥ !1×ķķ¥!!!",
);
rawImages.push(
  "#2 |2!11 !,11 !& 1, !g ķ0!!11!!!11µ !&11 !+æµ!!1 !(111!!!æ11 !7¥ !&¥ !)¥!!×¥!!ķ×¥ !'¥×!!!×ķķ!!×¥!!!¥× !,×ķķķ×!!!",
);
rawImages.push(
  "#2 |2 !6öb 1&bö !(Ķ1¤Ė !&Ė¤1Ķ!!!ĶA !,AĶ!!A !.A !4 ķ0!!11 !,11 !/µ !(ö !*æ!¥!!ç!¤ !)ö!¥×!!¤ !+¤¥×!!!ķķķ !)ķ× !E",
);
rawImages.push(
  "#2 |2!11 !,11 !& 1, !g ķ0!!11 !+ö11 !.ö¤ !( 1*¤ !7ħ !.ħ!!2ħ !,ħ2!!!2ķçR !&Rçķ2 !(sć ķ&ćs !&",
);
rawImages.push(
  "#2 |2 !311 !,11 !& 1, !g ķ0!!11!!!111 !&11 !81!!!1 !+1! ķ'!11 !6ķķķ !) ķ& !3",
);
rawImages.push(
  "#2 |2 !311 !,11 !& 1, !g ķ. !&11!!!111 !&ķķ !81!!!1 !+1! ķ' !9ķķķ !>",
);
rawImages.push(
  "#2 |2 !&öb 1&bö !(Ķ1¤Ė !&Ė¤1Ķ!!!ĶA !,AĶ!!A !.A !4 ķ0!!11 !+ö11 !*11!!ö¤ !.11¤ !)ö !,ç!!ç!¤ !,s!!¤ !-ç!!!ķķķ !' ķ&s !+ķķ !9",
);
rawImages.push(
  "#2 |2!11 !,11 !& 1, !i ķ, !&ķķ !&11 !&ķķ!!11 !,11 !& 1&!! 1& !X ķ, !&ķķ !,ķķ!",
);
rawImages.push("#2 |2 !S11 !,11 !& 1, !i ķ, !&ķķ !,ķķ !d");
rawImages.push(
  "#2 |2 !,ö11Ķ !.¤!!AĶ !1A !-ç!ç !&11 !)sķsķķ !& 1. !Qħ !/¥ħ2 !& ķ+×2!!!ķķ !`",
);
rawImages.push(
  "#2|®® |,®®|!!! 1, !iķķķħ!!!çķķ !&ķķ!!ĶA!!!¤ö!ķķ !'ĶA !'¤ö !(ĶA!!ç !&¤11!!1ĶA!!çsç !+A!!çs!sç !,çs!!!sç !*çs !'sç !(çs !)sç !&ķs !+sķķ!",
);
rawImages.push(
  "#2 |2!11 !,11 !& 1, !i ķ.!!ķķ !,11 !?Ķ !0Ķr !/ĶrĖ !/rĖ !0ć ķ& !3",
);
rawImages.push(
  "#2|®® |,®®|!!! 1, !g ķ. !( 1(ö!!!ķķ !&ç !'¤ !*ö¤ !'ç !)ö¤ !'çs!!!11!!¤ !(¤ 1& !X ķ,!!!",
);
rawImages.push(
  "#2 |2!11 !,11 !& 1, !g ķ. !(ö 1(ö!!ķķ !&sç !'¤ö !'11!sç !'¤ö11 !&11¤ !(¤ !X ķ,!!!",
);
rawImages.push(
  "#2 |2 !6öb 1&bö !(Ķ1¤Ė !&Ė¤1Ķ!!!ĶA !,AĶ!!A !.A !6 ķ, !&ķķ !,ķķ!!11 !,11 !& 1, !6ħ !.ħ!!2ħ !,ħ2!!!2ķçR !&Rçķ2 !(sć ķ&ćs !&",
);
rawImages.push(
  "#2 |2!11 !,11 !& 1, !g ķ. !&11 !(1!!!ķķ !&1Ķ!!Ķ1 !*R!!A11A!R !)· !)· !)sR !'Rs !*÷R!!!R÷ !+2ćķķķć2 !9",
);
rawImages.push(
  "#2 |2 !&öb 1&bö !(Ķ1¤Ė !&Ė¤1Ķ!!!ĶA !,AĶ!!A !.A !6 ķ, !&ķķ !,ķķ!!11 !,11 !& 1, !4µ!ħ !/æ!2ħ !12ķçR !&Rçķķ¥¥ !&sć ķ&ćs!!×× !2",
);
rawImages.push(
  "#2 |2 !311 !,11 !& 1, !g ķ. !&11Ķ !&ĶbĶ!!ķķ !&rĶ!!ĶrĖAµĶ !(ĖA11AĖ!!æA11!!R !)ħ !)· !(R2R !(sR !&R÷!÷R !(÷R!!R÷2!2ćħR!!",
);
rawImages.push(
  "#2 |2 !DĶb11bĶ !&111!!!rĖ!!ĖrĶ !'ç!!öĖ !&Ėr!!!ħ!Õ!!Õ !(Ėö!!2!Ė!!ĖRħķR!!!ÕĶ !(ķć2!·!!!ĖrĶ!ķķ!!11!!sR!!!ĖA111 !)· !.Ķ!!sR !(R!!ç!r!!!÷R !&R÷!!¤!Ė!!!2÷R!!R÷2!!ķķķ !&2ćķķć2 !4",
);
rawImages.push("#2 |2!111 !Aķ !;11 !& 1, !i ķ, !2ķķ !&1 !?ķķķ !>");
rawImages.push(
  "#2|®® |/!!! 1+bĶ !0Ėr !1Ėö !1Õ !1Ė !& ķ*ç !'ķķ !*sç !1sķķ!!11 !*ö111 !& 1*¤!!R !1· !0Rs !/R÷ !' ķ+ć2!!!ķķ !/",
);
rawImages.push(
  "#2|®® |/!!!1µĶ !0æA1µĶ !0æAµĶ !0æA1µĶ !0æAµ !&ķħ¥R !)æ!!ķķ!2×ćħ¥R !/2×÷¥R !'11!Ķb11µ2×ćķķķ !&1AĖ!!æµĶ !.¥ħ×2 !,¥ħ×2 !,¥ħ×2 !.×2 !.ķķ !/",
);
rawImages.push(
  "#2|®® |,®®|!!! 1, !i ķ.!!ķķ !&µ 1&µ !+µæ!!!¥× !+×¥!!!æµ !&11 !&×¥!!!æµ !' 1'æ !&æµ !1æ !F ķ,!!!",
);
rawImages.push(
  "#2 |2!11 !,11 !&µĶ !)Ķ !(æAµ !&ĶµA !*æ1Ķ!µAæ !-AµÇķR !)R !&æAµćķķķ!!ķķ÷¥ !'æbĶ !(2×ħR !&ĖA11!! 1&Åć¥ !/æµ×ħ¥ !,Rħ×!2×¥ !*ķć2 !&×ħ !12ķ !&ķķ !,ķķ !3",
);
rawImages.push(
  "#2|®® |/!!!Ķ !1AµĶ !0æAµĶ !0æAµĶ!!!11 !+æA111 !6ķħ¥ !02×ħ¥ !.öbAdħR !+1¤Ė!¤r÷ ķ' !*R÷2 !'ķķ !&Rħć2 !.÷2 !02 !/ķķ !/",
);
rawImages.push(
  "#2 |2 !C 1& !)Ķ11 !-ĶbA !)ħ!!!ĶbAĖ !)ħ2!ĶbAĖ !+2ĶbAĖ !+ķķbAĖ !)Rħ!!11Ė !)Rħć2 !,Rħć!11 !*Rħć2ĶA !*Rħć2!1A !)Rħć2 !,ķķć2 !' ķ' !3",
);
rawImages.push("#2 |* !<ĶbbĶ !.rĖĖr !>÷RR÷ !.2ćć2 !<");
rawImages.push(
  "#2 |2 !CĶbbĶ !)ö11!!rĖĖr !'öb¤ !-öb¤Ė !'÷RR÷!öb¤Ė!!!RR!!2ććĆb¤Ė !&R·ć!!!öb¤Ė !&Rçćs!!!1¤Ė !&RçćcbbĶ !)Rçćs!rĖĖr !'Rçćs !,Rçćs !'÷RR÷!!ķćs !)2ćć2 !C",
);
rawImages.push(
  "#2 |* !; 1*!!ķ!!!ķķ!!1!!!11!!ķ!!!ķķ!!1!!!11!!ķ!!!ķķ!!1!!!11!!ķ!!!ķķ!!1!!!11!!ķ!!! ķ&!ķķķ !+",
);
rawImages.push(
  "#2 |* !; 1& !& ķ& !& 1& !& ķ& !& 1&!!1! ķ&!!ķ! 1(!! ķ(!! 1'!!! ķ' !4",
);
// }
var enemyFrameOffsets = [];
enemyFrameOffsets.push(rawImages.length);
// Guard (Main) {
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !Ņ !Ņ !J±áá± ![nnMĆÖÖĦnnn !UıÑ^ĦĦ!!¶!Æ!!¥ŀĠŀ !QÑsæĶ¶æBÆė!ĖsÆç¦!ħ^ !QĶsĆ×Íös!dÇÇçB3y×ķo đ&ıŁŁ !*uu !7ÇR !&ç8sĖÖõĠ··!!ss!rrÑærAæ¥¥¥Ć¶¶> u'!ug !6$Ç¥Du!!RÕ¦Hý!ÆµÕö!ÜÜ!rĆÖÖ!ĖĦĦBBĶÆĦ!ąĤÚgÚgugĖ !4t·µörßĠNR!2ÕÁåÍ¥Ö¥bµÕÕĆĆĖ!!! R&Ķ¥B¥!!!Ss!sgæ¥ !3t!22Ķ~11bÁ!tÖ6<!ÝÖĦĦĆRRõĖ!!2!¥sRRc×ĶR2d!!SSSÇöB !4s222ÑĖĖĖ¥đå1÷¶ÿöÝÆė·dd !&Ķ!tRssRåĆĖçs!; ^&²²Ĥ !2BĶ!!B'Ç2Bĥæ.!İ!Öÿö»õb1Å! c&¥ctt·sć··s!!!ĤĤôôĤĤĖ !22RRRBsR!B!!b!çÆ¥¦!D»ėR!d ×&ĊĊĪĪĊWĬ!s!! Ė&!!ĖĖ !3cBB!BñrĶĆC!û!¤ÖæQÿö!µB¥ą Å&_łłđłłïb!Õ! R&!!RR !3dtCBR»RRRCÛ¦ķª!¶¶RÿDëķ·S Ķ&!õb¶õĕöÆb¶Õ!D«ĽRRĽČu !2ń!Rt!ëķķć&!Ö¶Ñ!!ÖĆRö!ööB !(BB¥cĆĶBĖĖ!!sµ««µC !4ĔĔ!×D¬HĚĖ!1LĆ!B!!dÿ!ss! R&!!s!ssĖBRsd!!²ÇÇsĆÕ !6Ĕô!!ô!!Ė!!Ć22æÇąR_!!c¦cBB!B!sssæ¥CsR!!!^^mÖs !8ôô !&đĖ!sö!ąÇÇ!ĤĤĦsd¦¦!S B&dçĶ×R! Ĥ&ĖmS !>'!!Ķ×dÇ!!Ħ>>õÕRRR!! S&2ąR Ė)!Ė+Ĥ !>csĦµÅbĥæŅ!¤söĦĵ´µQ Ě''ĊĊĊ !)ĖĖ !>WcÆĖææ!å!¤¦!æõå·Æë !QW7ÆæėÆĆBĆå¥!!(ûë !T77ĪWÛÛÛxxû' !Ņ !Ņ !Ņ !Ņ !Ņ !=",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !Ņ !Ņ !Ņ !G Ł(!!!ŁŁŁ !K· !*ıÁĖÖö¶¶¶²±ı¶¶¶Ráá !3I !5×Ć$$ !'ıÖ÷sÖ!sÆćÅėÇçssÑç· ġ' !-Ĝ !4t×!!Ú|áġá!R¬ý(9BÖÆÆb9ČrõĖĖĖ!åÖ¥¥¥c±^±ġ !(üt !3tBĶ!B'Å¶Æ¤R!Ĥń+!ĽĽħ !&öÆööö!!!¶¶ssRR!ĦuÜÜÜT!!++ !2R2c!2M2!R¦ñĀĀĲöÿÿ!8čċ1rÆ ö&!!¶R!Bc¥¶sc!··!!TĶ !5c!sBĖ!cÆ«!2·6sÖĖďÿ!$¥s Æ'!¦ttÇÇ¦3Ķ2!!nnĂĻĻs !42BB!2nć¥æ×s¦ě!!c¥ætÿ!×¦ c'!åõÅÅąBB¦·d Ĥ&+!!.$ !22!!·çöXËíÏR«2!ĦR!!!Æ!ssc R&!!ÖÖÖsĵbbrĶD !&+i]ê !2B !'CłÏĆěÆÇ_!SCçQ!ÿ!!SddSS!!BRRRBĖĖĦÅ!«iÜĽ$]ÆÂ !2BtCöĖR!!t×!ĵµÅ!ŅĥQÆÆ!!!sss2ÕäĖÆ !&sR!R!c¥2rúĖ !4AõRRRB!ĚĚĚ!!āR!æ#÷¦¦¦ĤĤÅbĕR¤dÖs¶BsÆR !&ddæ¥Ķs¡ !4AĔĔõt !&Ė!!!ÖörrAĵĦ-łsÖ!!çcsÆt¥RR·cc2Ĥ!!çdds !8AĔ !'Ė!sĶR !&ą!b!!¥Õ÷s÷·BddÇ!¦c !';;² !:ń !'dR!!RRR¥öRÆR¥cd!ÇBĦ!BBĦĶ2SÇ!;;;ĖĖĤĤĤ !>Ě×!! s&×RdÆÇ·RúĚĚĚ ú&ĪĪĪÚ Ė&!!ĖĖĖ !?Ěª× ¦&B÷B¦Rúú !VĚ ú+ !Ņ !Ņ !Ņ !Ņ !Ņ !¡",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !Ņ !Ņ !Ņ !à¦ !bö !KĜu !3ttÇ!!Ġ !)TTT± !PdĖB!Bñ!Ġ^ŀ!!TT+[ďčT±ā!!~^^^>ÁÁ !1ĜĆ !3BsRBBıd!å!RRµĵĻĆR[ďčcctĦ!õõåĆĶ===Á!==Á !*c !4RBBRÜÖddXı!ÆÆŁ!2R¥!YĶĥĶĶ!2bĦRBBBĆÁsBĆ±ĬĜĜÌ!Ĝæ!Ĥ !3B!öõxÇÖ7^Ė!1Ð!R¥Ė¥ÿńnnssć!!!·R!RRĆs !&ĆĆ2ÜB¥B !32!!ą!2ÛË±R!!ā!2ĦæĖÆÖĲ Ć&Çç¦Ćcc!sBRR!!c²×¥¥Ă!B !7××!ĖĲRRh!!!c¶cc2!ĕ!cc¶!!Æx!ĶRtcRSR¶!!!SCĤ¡S !4 B&·R22¦¦ !&¶!RRRĖĆcRRc!Çd!ĖsÆµtsRÆc·!MM;ĭĤMS !3µĦCC! B'!!SÆS·ccR¥!Rcç¦Ķ !&CC×R¦ !&ĤĤĤ!įĖĤ+ !4bą!!tBúúú!!R·ą!SS·¦¦·hĖĖ !&Rcccúúú¦¦R Ė&!!ĖĖĖ !4bńĔ!C!!!ĖĖúR·RRRĪĺĺĪĖ R'Ė ú&!!!úúú !@Ĕ !) ú' !' ú' !Lń !Ņ !Ņ !Ņ !Ņ !Ņ !ô",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !Ņ !Ņ !ÊI !@ -&^!^!^^^ġĠ== !3Iõ !63 !*-!RRR!^s^!!R!ć!!= !2Å !4ttÇB !)-!Rs!!!ħ!RRRsd!sösđMM~~MM~ !)IĶB !2tĦR!B·ñĠĠŀ!!!¥ö×ÖÖħõcs÷÷¦BÇ÷t¥!RR!öĦ!Ė~ĬĬuuu!µ2 !4scĖĥĦì!!X!3RĦöĕtt!tt¦XBBĦĶĶ!!!BBĦĆ!22BCöggêļÇ!S !32!ĥ!!!yyĀTC!!!ö ĕ&26ĤĖĖĕĥĥ!!ĦRRcæĆĖc2BÇÇÇĆC!· !3R!!××22!ÁS!!c!!!ĖĖ!!&!!ĥĥ!!!R2BBBsRtÆ2c+;;;À;;;+ !32BBB22!cs!!R !'2h !, d&Ç!ccd !&DD !52B!!C22!!Bńń!R!!!cW!ā !*¦RRR¥ss··R!DDDĤĤDDD !4CC!B!!!c!!·¶ssÇW!ā !+ R&!ö¤RRR!ĤĤĤ!!ĤĤĤ !2µ !&cB!2R !&tÇĺ!āSS!!CCS¦¦!æææöö!ÇÕöö !<bĥRRCcĖ''!!6hĺĊ.ĲS !&ĥĥĕåå!222 !-ĽĽ !7AĔĔRC!!!Ėł$!!Ĳ !&s !*Ķ ĥ'Ė!ĥĥ!ĽĽĽğğĽĽ !8ĔR !&ĚńĲĲ!ĦsssöĲĢ Ķ' !)Ī!!!Ėğğğ!!ğğĖ !8Ĕ !'ĖÕĕ22öĆĆ22!B G&úĺ ''!''' !Hx7ĚĚĪ Ě&ĺ' !Ņ !Ņ !Ņ !Ņ !Ņ !Ņ !£",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !Ņ !Ņ !©ÑÑÑ ^(nŁ !UÑÑÖÖÖĦĶĶ222R!Ñn~ !QÑöµĥ!sRcc¥¶Ö¥tsÖR~ !Pöą·ħ3çæÆćÇ·B¦Ķ¦¦¶c á&Mŀ^á !)Ĭ9 !>Ñą!B!ą¥ÇÇc((dårrrCĦĖÖÖĆĕ¦Ħæá999!!üĖĥ9 !7·d !&Ė!CĆæ2ÕĆĆ!ÕÕåæÖÖæ!!Ħ!!ĖCB!sR!!åĬĬc¦C !5·CħĆBÇ!!ħ !&ĖÖæĕĶĬBĦ!Ė22!!!R!ss!c¥RR^^¦SS¡^^^ !3d!sÖ¥!!đđ!æ!!Ħ!Ķ!ĖX!!c!! B&!!sÆ!¥B!RCĤĤ;;; Ĥ& !2dĦBRR2B2æAC)C !&cÇ !' 2&!¥ccĆÆRtçS !<RÆ2!!c2!¥SRR!!!RB!Ī!ŀCCB 2&R t&·cĶs!sDDĽĽĖĖĽĽD !4BccC22B2!!RRÆ¥R½!!Ė!!Scc¶çł_¥¥cĦ¦sĦs!ôôğğ!!ğğô !22 !'BBd!BBĖ!ĆĶtĤDĐą!!ĦĖĖæµ&&ĆĆĶĶÕĖĖÅĖ I&!!III !4B!!!BB!¥ !&Ħt6!lą!RR! 2&ĆµÕÕÅÅĆåĕĖą M&II+++ !22cCCC!C!!¥ĤĤR!ýĬ!±!!·BB !(æĆöööĆ!æ!C Ĥ&++ !5µĦ!RR!!tBh!_!ý!!n!BBĦĤĤBR !+ĦĦ!tB !<bĥĖĖRR!úĖ$Ċ¼!!¿!B·Sc!!!Bsss!c2!!!B!¥B !>AńńĖ!Ĕ!!Ĕ$!!¿!çÇcc!__c t&!¦ s&R¦æõĦDDDĖĖÌČDD !7ńĔ !&ĔÐlRçBĦÕÕÕöĖöccc&c2·ccc¶ĥ¶BĪôôô!!m!!ô !>c!æąĦĥĦĦĦąą!ÕĦµñAbú ') !),ô !?»cRöµÖ ö&ÖąĦÕöÆĦÛ !Q»Ë»!!!2!ĆĦÖöö»ëÛ !U»»»ª»ûÛÛ»» !Ņ !Ņ !Ņ !Ņ !Ņ !=",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !Ņ !Ņ !Ņ !F±± =&ÁÁÁđ !W±öcĖÖÖÖRRĦöđđáá !LS !'±öR¶¶cccÇÇė¥ĖÖĆĆġ Ñ&~!~ÑÑā !@SB !'ö!Ė!Ć¶!j(ûûĆæĦĦĦ!ĖÖĖ!ĆāĆĖĖ! I&!!III !4¦¦¦BB!!!ħħ!ĥ!!cĝjÿßCC!!ĦĦĦBcccĖcĖc¥ÖRĕµµĕIIŅµ+ !3¦2BRB2.ñ=CC!CBBĝ!İ¶Ö!!·RsÆĆS×÷·¥¥Ė÷tCC]àà]µµ,à !3¦Ħ!222B !(ĥĦĽ!ÿb !&ÕĶöÆc2c¥¥÷÷3!¥¥¥ Ľ&ààĽĽĽ !22RB!BBB !'RC9!ÿ¶!!!RRcĦBBBĖÅAAAÅĵ¥ąrrĕµµĕĽĽŅµĕ !3BRR!BBB!RRRB9!ÿR!!!¶BB! R&!¥ĆĆĆ¥ĆÅ!æĦ!¥¥!µµĖ¥ !42BBdBt2RBBBR!!R!Öc!ÖĤĤSs !' 2' !& S&¥¥SSS !2BcCCRt!ĺx¶!!Ý!įÆĖ!sćć!!B·sss!scB!ĖRtR!s M&SSMMM !2R !(ññxĤr!įsöö¶¶bbM^Åĕc¦RR·ss¶¶¶!cæS Ĥ&MM!ĤĤ !8ïææñĖÕ!!Ħ!ö!ĦĦR!!!ööÕSĦ2SRR¥Ħõ¥C !'ĤĤĤ !4bĦĥĥĖĔGËËG!Ėï¶!ccRÆB×RBĦ !&ĥĥBddd×tdBB Ė( !6bAA !*GR¶RRR¦Öå×¥¥22cąB¥ Ċ+ !(Ė !8ń !*h!!R¦!SRĪSS¦cĶÆc¶ !Rhh7ĪĪĪ7!ĪĪĪ'GëëW !2Ė !cĖ !Ņ !Ņ !Ņ !Ņ !Ņ !h",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !Ņ !Ņ !á¦ !a¦Ħ !(ÑoÁÁÁ !' Á' !H¦¦¦ĦR!!!$$oćŅööö M&R Ć'ñ Á&!!!^Áā !<¦BBB2!ġnĠ!!ĬŅĆĕĕ Ħ'ŁĶĶcccRÖÖæµ±^^õĆ!ĬĬĬI!!ĬĬĬ !2¦Ć222B2B!BRR!Ćĵ33BB!s!ĦĦRöRR!¥R2dösBtR!²ÆÆÕ9RÆÆ !4¶2RR22C !(tccBBBcBB¶öBRRB!Ħ2RcR!BBR!¥s22üs¥ !3B2B!!2R6!dßB!!!BssscÇÆ¶Ħ¥ÖĆÆ!!Öæ!RRćÆsd!¦·¦MmÀ¦d !22cBBBĶ±ÁīsĆ!ńIĦĶ!¥¥ÖR¦·Æ2Ė¤ÅBçcĖs¥Ķ!dd!Ĥ+++Ĥ!!++ !22!!!æñÅ¶ıëcĤtń)s¥öö3!FFdç¥¦!ąĵS··S·R!R !'Ė !6BCCC2°æRRĐª!¥tńËĶRRĕ!t×!!¥öÇ¦C R&ú!R!Ě Ė&!Ė !6RRRsW!!¶tĖĖt÷!!hx¦dĖÅb!!÷3ćħ! ú&!úúú !<bÕ!!CW!ûhû!!ĔĔāā.!ĺ6Ī!! Ī) !1Ė !5bĔĔR!û !)77ĊĖĖĖ !}ĖĖ !6Ĕ !Ņ !Ņ !Ņ !Ņ !Ņ !Ņ !÷",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !Ņ !Ņ !ê ±*ÑÑ !V±^ ö'ĖĖĖĦö±± !S±ĖĦ B&sR!BĖ!ĖĖ± á'Má~~á² R&!!RRR !8S !'H!! R'Æ!¥!RR!sbbĆĆĆR¶cĖĆÅ!ÜÜÜRRČyČ !7SR !&RR!B!RRR!d¥·¥R!ÆĦ!!ÅĖĖĖ!!RB!!!ĆĆyĭÖ¶3 !3·St·R2!!!R!!ÖĦsÇÇ÷÷BÛ&s¥R!bÇSBsRRBB!RĶDB¥¥¥;!!B !2·ĆcRR2BġÁİ!!µļö¥µĕååå!!Ç·ė¦ć!Ė¦RsBRBBsBĤ d&!¥S+ !2ĆcRcBB!t2S!ķ×ñ¬ö!æĦĦ!!!öööĶ·ħ!Æ!!RBB¥!!! +&!m+ !3RRB!BĶs&čĶġæÖĊ!ªc!!!t!!BĕĕĥĥRBBsss¥!BCt !&üü. !4 B&æ¥nġÿjsàĥ![!ª!!!õ!!Ħ !'CC33CtttBĶ!üüüddð.$ !3B!!Bû¤!cµÆ!Ñ!!~!ë!B!t× !'ĊRRccRĦĖõĖĖ!ddd++dıĻ !2BCCCBRĆcÆÐ!ÆBĲcBā!ªtt!!B t&!ĖĖĖõÕ2ąĦĕĵ!+++!!+++ !2BRRR!7ĖR!Rxxx6ĦĦĦá!ĺõõµĦ õ&!ĥąąĦ!ą!!!Ć !'Ė !5bĖ!!·āĆBdBĖ!D$ !&á!h !*Ħ!!Ć!!!ĆĆB Ė' !7ńĔĖ!²Iªĺª!Ėßl¥¥BBBāłā.sC!!!_SĆĆBĆĆGªªG !(Ė !7ń!ńń !'7¶ÖĦ d&!ÇĶÅBddhQÕªªhªª !-Ė !7Ĕ !*7ËR ĕ'ÚĚ7ĕĕĕĖªª !3Ė !A '(!!!''' !Ņ !Ņ !Ņ !Ņ !Ņ !Ġ",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !Ņ !Ņ !Īñ±nnn-Mn !Y±ÆĖĆĆĦ!Ħ!Á !PÇÇħ!!!ççĆBĖ!RĦ¥!Ħ!!ÁÁÁıáÁÑ!... !CÇöė·!!RÕ¦¼ýc¥sÖæ!Ķ!ñRĶĶÆsĶĶġÕĵRu !@t·Ķ!Õ|NN!×ÕÁå!ćç!B!Ķ!!BB22CcRĆ¥!ĦİuRļļÜļ !9tĖ!!ĶĀrĥQÁ!æĬc)(Å·s!Æ!RBBRR!!BRĦ !'ĦæĖS !:ÆBBRÁĖ!Ħ¥µBsmÕBÍĕĦĥµĆ!!cB!!B !*t×ć !:BĶ!!!ËÇ2¥ĥ.ĥ¿!°Ħ!2öĶ!ą!ĶĶB·BdddBC2ĶİD!!MM!!!II !42R !&s!!!b!çæRßĖ2¶!dd!ddĖÅĕąąõ3õAĶąĐ++Ĥô!!Iĕĕ !4cBsRBÁ¶BĆtÍ!¤ĆÆR]YçėssdÅÅĖ¥ĆÖÖærÆsµÖĥDD«IRļĕĖ !5dCCBBû!!B¶RCªöÖĖąİ6íëëĶĶĶ!!æĦĦĦĶ!ĆĖĶĖ!g!å«ææ !6ńRRCRªæķ÷ËÕ!D!BB3ĥDĤ!!B!!Ć !,2!ssBssĆĦ !6ĔĔRBDíĚĚ!Ħ#KR!ÖĥĖĐ !&2Ć !)BRR2!! ²&mÖBS !7ĔCö!!!ĖÕ¯ĶBBĖĆ¦ĥ_!!cRsR!¥ÆBB!ĦRssB Ĥ'Ėm°+ !8ńńô!!!đöB2!ÆÇądĖ!!ĦtRs!t!¥æööĆB¦d Ė'!ĖĖĖ !>'s!Ķ¦¦cÇĖĖ>>õĥ··dR··'''÷SĊĊ !HhR!µąĦæąÅŅŅ'' Ċ&ĚĚ!!!ĚĚ !Kh»s!Ć!!!öû !Z77ĺĺW»' !Ņ !Ņ !Ņ !Ņ !Ņ !£",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !Ņ !ĭĠ- !`ĠS!n !^Át!BB !:II !7¦ !+ÁÁÆsĆcs !:õ !7×Ė$ !)Á!2!ÆRć· !9I !6tÇĦ!Ú~áġÁ!ıÁRæÖBĆĶ!ą !. ±&ġ !(µ !5tRBBB»ĖĆöĦu¬ýzĖBBÆÆÕ¬uāāġġġ !&±n ö&ÖIIļIIÜĶ !5RB!2!ÆĦö!åĤĤń,jĽöc!ööö!Ćææ!_ñÁnöõĥĥ!!cąµĖµµcst+ !5BB2^ĥ!ĖCĀĀĲFÏĖjÆc2brB¥BBÖQÆæõĥ!!!22!2¥¦R×tt+Ę !32cBBBĖ·cöì2·6-Æ[ĖYsRĦsÖÖææ!ĆĶĥ !'s!!SS!¦!++ !52!!!2ns¥æ×¦ÆD!!![ĖYsæcs!ĶĶ!!2 !&Ç!öĆR +' !7B!!·çöXËíÏ«ìĤĦÆs¥[ĖY×·Ķ!!!B!!33S!æ#ĕcB !'Ė !6BtC!BR!łĠtĆæ_!!Ö!#¯!!!c!c!B!!¥BĕÇR!ėĖ! Ė'!ĖĖń !3AõRöö!!ĚĚ&c1b!B¥ĦĖ!Ė!!Cs!!2!c!ct2ėĖ!'' !=AĔńĥB !&µD¶!Ö¶¶¤sįĤĤ!!scBÖ!B¶Ö×åĆĆđ !AAAC!!Ė!ß!!!C!ÆRC!!2t!!ĦÇ¶sddĕRĦææ !Cń!!!Ė!ss2 !'ĖĖ!2tst!··RBC!¥¶RI !Gd!!ĶąC77ĺ!!ĪĥĵtĵĶ!ĪúĊ!tBR!ą !GĚ¶R2!!đđđġáĠ¥öĵ'ĚúĖ!!ĺĖCBý!Ĭ!!!Ü) !BSRcBą!!!B¤d!!' !)ĺ!t!dC!!!c !Cĺd!ĖBBB2Sçc !-Rĺ!MBIÜĜSB !Cĺ¦¦!!CSĦ÷ssx !+Ċ!ĤĤM!× !GĪĪSSBBR!xx !-Ė!DĤMõ}K+ !FĪĪĚĚĊú !0Ėô!Ĥ} !dĖĖ !] Ė& !Ņ !Ņ !Ņ !Ņ !Ï",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !Ņ !Ņ!!!Ĝu !ÃĜĆ !Iİİ± !7c !Jć!± !,±±ı!!ÌÌÌĜæ!Ĥ !G^#!c !*±İŀÕÕÆÜÜ222B¥B !7¦ !1^ !&Û !'±ŀÅ!· !'c¥Ă!B !8ö !3öcx !&±ŀÅĶd!ÅħdcĂ×BCĤ¡S !5ttÇ!!n !)TġMM!^sss!!^^ā=öĶ!2cd!Ö¶!!!S;ĭĤMS !3dĖB!BñõĠ^ŀ!!TT!z)öMRĦ¥!¶^õĖ!ĕĕ22dBc·!c·!MM!įĖĤ+ !3BsRBB!Ħ!Ė!RRµrńĿĿz)ĆĆx«öĖ!c!22ĶĶRcRėÆ!!ĤĤôĖ!!ĖĖĖ !3RBBRıÇ!ĕħı!öBŁ!2¯!)Ü¦sccC2B!!Sėöts!!¦RĖĖ !:B!B!²Æççxc!sÐ!R¥ĖÏ!µÕÕRR¶B!ÇCBöķĶd2¦úú !;2!!æõÅIûû±í!m!2ĦæĖBïĲ!!c222!!¥RÆõB22ú !@ÇĘ2Å!áRP!!!c!!!¶!ĕ!!!RRRĦÆ!cCt22A !>BBBĥRR!ł¦¦ !&R!RRĶĖt!! B'!Æ¦!B2A!±Ñ !<µĦCC!BcBBB!!SÆ·RcĖR¦åÁā·Æ1ĦædCRcBĆçB¥ĦÑ !<bą!!tBúúú!!R·ą÷!¶¶å!ĖÖĖÕ2b!!R2ĦĖ!Bsæ!RÑ !<bńĔ!C!!!ĖĖúR·Ķ!!¥ÖĖĆĆRć!!¥2!Ķ2Bcõ!!!R¥ !?Ĕ !)úúĺ¦¦¶ !&ĵÇçħ!!!222ĶSdć¶!SuĜ !>ń !+ĺĺ¦ė!¶¶¶Ħ!!xúúú!!2RBĦBSX!tÜ!!!Ĝu !Dĺ! ¦&ĺªGĖ!!!úúú2!!CR!ě+¥ !J ĺ' !,ú2R6ĪĤ+ĽC9!ĜĆ !Vú2 !&M;!Ĝ!c !WúĖ!!!Ĥĭ!Bæ!Ĥ !XĖĖ!!^ĥC!B ![Ė!!SĥÆS !^ĤMS]+Ė ![Ė!Ĥ+ĖĖ !^ĖĖĖ !Ņ !Ņ !Ņ !Ì",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !Ņ !cĬ !aĬĆI !aĶĕ !`ö2ĦI !V~~Ł Ü&Ĝc·d !T~~-öĆ¥ !&dd!!M !Q~-ÕÕ!!ĶsÜÇÇB ;& !83 !9--ö!!çR!s!!;;ÀD !8ttt !+--^Máġ!!!Ġ-!!--22!ĥCĖssRB!!!DĤĖĖĖô !3tĖ!RcñĠĠĠŀ!!-!!ĖĦæs±ġ=ćRġĠĥĆs!2d¶!BR¶B!DĖôĖ !8RRBÖìė !&·!RRRsB¶BcscĦcć2Qöö!cĦs!¶SĖĚô !;ccör!ì!!XTĆR!BcBB!Ħs!c¶s!C3s2sBÆRs!!h !<R!!ħ$!!yyĀ!#c2B¶¥BÇ¶RRÆs¶!cĆ¶S¶s!BC'Ě !>2!ÕÕB!!ÁÇ!!R!!s2ÇĥBccc!ĦÇćÇS!BBdCÅá !>2 B&!B!sBńń!!!söÅ!WxxxSRĕĕåR2CC!õ!Ė± !?C!!22!!B!!ĶR2!!¥W!. !*BBĶą2BB¶±± !;µ!!CCB!!!R!!sB2×çW!.Ħ !,2BB!sÖsÖŁ !;bĥRRcBĖ'G!!Sçç6ĺ..Ħ!!!BCS¦¦!!Ħ!CCÇĦė!!SR !;AĔĔtc!!!Ėñ6ĺĺ!.!Ħ !&ĦĥĕåĆ!ĶĶ22!!ÇĖcS&!9 !&9 !8Ĕt !&GđĲĲĲĦĦ!ĕĪĖĖĕĶĶĶĕĖĦ!ĦĦĶ!!ĵS&!!ĕ9!!ÜÅ9 !8Ĕ !'' Ī(7!!!GG!!!ĥĺĺ!!!Ė!Ħ !&m;9!Ç !MGGG7!! ĺ&ĖB !'ĭĕ9;s !Vĺ3Ħĭĭ!!;m;!m^ !Vĺĺįįĭĭ!!!DD ![įį!DD !dôô !]Ėôôô !Ņ !Ņ !Ņ !Ņ !Ņ !)",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !Ņ !Ņ !é Ñ&^ÑÑÑŁ !WÑÑĖÖÖÖsccc!Ñn !TÑöµ2ÆÆĆ¥B¦¦S¶ö Ł&áá !Oą!BcsdSSc((!ĦÖÆÆCĦĖ~~áMŀ^á !A·d !&æ!CĆæöÅ22ÜµµÆæÖæÆr!ĦĖĖÖĕ¦Ħæá99I!!!Ĭ9 !5·CħĆB¦!!ħ !&ĖĶ!µĜ!BBBĖ2Ķ!!!Ħ!!R¦B!sR!åÕĬIüĖĥu !3d!RĦc!Bđħ!s!!Ħ!Ķ!s!R!!c !+B!c¥RR^â¦Sąc¦_ !3dĦĶcĖBB!æ+CÆC !&c9R<BB!2!!!¥Bss!cB¦!RCĤĤ;;m¡^ !4RcR!!2!2¥!RCBB¥¶¥zR<Ė!!B2cÆ!!RscÖĖÆ2çS !(ĤĤ !5c2R2B2!Bd!8!2ĦĶI!ńĖĕCCSBÆ2Sttt¦¦ħCĶs!sDDĽĽ !72!B!Bd22!!BBĦ!!XsńĲĕĶ!!ĦRö¥!sąąąĶµĥąö6ĊĤĤ++Ľ!Ľ!ô !2c B&!cBd¥!!c!yCĤĲÅĶ!RR!!ĶÖ¤ĆBBSB2CB!D !'+!ğĔ !5C!!!CB!RĤĤB¼d!áÅ!!·BB!!R !*23B !=bdRCCR!tB»D_idįďæĖBBĦ!!BR!RR!ĶĦĕĦ!Ķĵ!Ĥ!!! Ė& !6ńĖRR!R!úĖôĬ!įĦö!s·ScĤĤ!2RBB!ĖĦĆĕSÅĦĦDĖĖĖ !;ńĔĔĖ!Ĕ!!!ô,Ħöö÷ÇĶĕæĢĢĦ3Ctt!cĶRBÕRBĪô !AńĔ !'ĆöRķĥÅĥĦõõõĕĕĕĦõ¤¶xW'xW' !J»2Ėµ!!ĆöĖÖĖĦ!!ÅÆĦÛ !Q»¥!ÖĖĖĆ!!Ćööö»ëÛ !SG»sssû»ûûÛ»» !XGGG !Ņ !Ņ !Ņ !Ņ !Ņ !D",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !Ņ !Ņ !ÅĬuuu !_ö!!!uu !Z9Č!ěě !Y~~9ČÅĖcµ!ěě !U~~ö!ÅĖÇRd×!!+Ĥ !? á' !)áááā! ~&!R!!ss!tĕ+ğ !;t !'á Ħ'áá!!!ánöÖBĆMĖööĶö!!c'S!;mĖ !;t2 !&ġĆöööĦĦ!ÝT$$!ĶĶ2!!!Ħ !'c!ö;;!Ė!!ğ!Ė !4¦¦×22!!!TzĖ!!RcĝÝÏďĥĥ!!Bs!R B&cc2cĖcĢ!Ė !&Ė !4d2B!22.ñİ!!ĦĦ¶ĝÝ¯ğ¶R!!cBĦöÆ2¥RR¥!cBs¶B!Ė !9dB2BR2B!!t!!!ÖÝ¯ğÖB!!CC!ĦĖĖ!!¦¶¶2s¶cStSĺ !:RBcBBBc !'ÖÝğ¶!R¶¶¶ğğ!!RR!R2Ķ!RS3SBĚĚ !<2!BCcC!!RńńÝğ!RĦ!Ć¶¶RÆÆsRRÆCĶ!ĆĆĕĺĚĚ !=22BC!CRFËÅ!S!!¥öBöö!ĥ!!!ĦB¶ĖÅ!222Ķġ !?2cC!RR!~Mi!c[RæB¥RÖĥć!Ć !&öµĕĶB!!öııā !<R !'ï!RMĖ÷BR¥¥!R!C¶ĶĆR¶s¥!CĶBBc2!Ħæ!ŁI !?ïö!!R!ôcBBBRsBĶĦ!!s!ĆR¥öRB!2!!R!!!ĕļČI !7bĦĥĥĖG »&!!WcccRcc'''ÖÖGªć×d3!B2!s!sB!ĦĦ¦ĕļļļI !4bAAĥ !* W&''!!!ÛÛ!!ĚĚBB33!BSĦ!2Sdd Ħ' !8A !9ĚĚBBSS!B2d!;;Btt !T Ě&BSd!&!!+++}t !V Ě& Ė'Ľ!+ !cğ !_+ !bĖ!Ė !aĖ !Ņ !Ņ !Ņ !Ņ !)",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !ĄĬĬ !`ĬÆ!ĬI !^Æ!ĖĦąI !ZĬĬ!Ĳ·°d !ZĬÆ!çě+!+ !WāIČÆcĆå+ !Y~æÚ!¥sÇÇ!ĖĖ!+ !E±MM !.~öĦ!Ļ!S++Ė !<¦ !+MMMÅ!ąM^ !+~!!¶æ!°+ !'Ė !8¦Ħ !(onM!ĦĦ!Ħ!ĦĶ^ġġ~Ł!~~~öö!öÆ !&Ė !&Ė !4¦¦¦ĦR!!!$$oŅĆĕĕc¥C¥C¥cĶĖAÅBÁ¶¶B¶sĖ!·R>>Ė !9¦BBB2!ġnĠ!!ĬĆĵtts2BRÖR2ööStąÖ¶¶s!¶ÆķåS!ú !9¦Ć222B2B!BRR!!tss!BcÇ2!B!!R!tÖĖĦ¶sĶÖĖ¦Rú !;¶2RR22C !+¥¥ÖR¦·c!ĶÆö!!!ĶĖ¶¦SR!ú !;B2B!!2R6!dßB!IĦĆcööĦÕFFddėÆdķĖR!!ĖĵRúú !<2cBBBĶ±ÁīsĆ!ńÏÖ¥Ė!!Ė·!!ĕĕĕć!ĥssRR!sĵİÁ !<2!!!æñÅ¶ıëcĤt»½2BBB¦ !'Sĕ!Ć!RRBR!Ėt!ā !;BCCC2°æRRĐª!¥tńªB22ĕ!t×!!!¦ĥc!!s2!BssÖ!ĬĬ !:RRRsW!!¶tĖĖt÷!!hx¦dĖ!!S!ĕ!!CccRs¥ĆĦs¥!²Æ«I!!ĬĬĬ !2bÕ!!CW!ûhû!!ĔĔāā.!ĺ6õmĀR¦¦!tĪC32RsÖsBBR!¥!Õ9«ÆÆ !4bĔĔR!û !)77ĊāāñBĶ¶ÕQúúú!Ī2CCCR¥!s!!¦s22Æs¥ !D77GĶB!d¥Áđ!!!ĪĪ22CC32CĤ+·¦MmÀ¦d !6Ĕ !1GGĶb!B !(ĪĪĪ22CB!!++Ĥ!!++ !HGsÆ!W !*ĪĪ2ĶĖĖĖ!D !Mxëª !-ĪĪ!!!ĖôĖ !ÆĖ !ÆĖĖ !Ņ !Ņ !Ņ !Ņ !Ņ !'",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !Ņ !Ņ !«ŀ==n !4IIIR !Fā=!!RĖ~Ñ !2µĕ!ČR !Dā¥¥¦¥Ė!ĆĖ~ !2S+]!R !Bā¥!ĖR¥!!cåå~ !.ļļà+ !F¥!RRR!Ö¥å!!R !,.ļ !Iā!RRBRGxË3¦×c!nnđ !&±á¤»]¡ !GæcĖRsC±±!Ļ¶cÆn!BĆđÁÁÁRĖ!RÑĤ!ĖĖĖ !>t !&Ì!c2S2Æ!±$YĖ!BBc!æĦRR2 R&. !&ĖĖ !;t2!!!R!Ì¥!ååĖsB!!BB!cBĖĦĶÆÆĦccBS!Ė !<·St·22!!R!r!óĖ!222cRRRBs2RR22RRĆĶSCĶĊ !<·ĆcRR2!Nġ!tCÑàčĆĶ!!2BBCRB2Cs¥RBĶ!öb¤µñ !<ĆcRcB!ā&½ñõRĊ«öĝĦBB2ĤĤ!R2B!BBRccBĖB¥sĆŁÌļ !9RRB!ĆāÅġÿ½ŁõDE«8ý2!!t×B!!!23Bccs¥sRdBÆCcÖÌļ!ļļ$ !3 B'°öcsÿöñĤs¹!8zddB!2!!!22333BRRcĵC!B¦çcSÌĖ !6B!CBRö2!s!!ĲxĶ¨!8HHcBĶdCCĖB!!!33dS3!S2++d!c!S !4BCCR!ċsRÖRtt6~BBÉ!88rr!ĕĵĵĵ!Bĺ2 !(ĶB!!KĦ¦R !5BRR!·×ĖBCBHHÑc2!SúÉ!!!2 3&ĊĚ!Īĺ2! 2& !&K+]!G !3bĖ!!!ðöR2côß2!!Sõ!Æ%^ĲĊ ĺ& !'ĪĺĪ!!B Ė&!!!+ !5ńĔĖ!_IGĪ7!7B!ĖĕtĥµĖĖr !/ĪĪĊĊ!!!ĖĖ !9ń!ńń !'7B2ĦĕödBBR !8Ė !9Ĕ !*7GBĶ!öcc !;+ !B7GB!RRª !9ĖĖ !D W& !Ņ !Ņ !Ņ !Ņ !Ĥ",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !Ņ !Ņ !I~MM±± !Z~nn!!cĆĦnn !Vı~ĦĦĦĖ!c!2!Õŀ !TÑsĖĶccB¥¦RcÕ¦!Ñ !TĶBcBÖö¶!Æ!·Öd!N!!!ñ==!> !CÇÇT!!!ç8s!2sSdtc·¥öĆscĦÁn-r!ÖŁĥ_uu!!!uu !:Ç!¥Bu!RÕ¦Hý!ÆĕĦĶĶ(zS¥s!åĖõĵ!!ĦĦĦą<ÚĬRĜg6u !7Ç·ĶörßĠN!×bÁåÍ¥ĦĥĦ !&ĶĶ!!Ė !)3!mS!Â¥¥ !7ÇĖ22Ķ±11bÁ!B6<!ÝĦ !'ĕĶ!!c !'BöB2!!;!Ĥ¡B !7Ės222ÁĖĖĖ¥µĕ÷¶ÿöÝCB !&ĆĶĶ!¶CC!¥RĶSBĊ !&Ĥ²Ĥ !6BĶ!!BËÇ2Bĥá!İ!Öÿö6Ħ!Qr!!Ė!Ķ¥¶R÷æĖç!!D !'ĤĖ !62RRRBcR!B!ö!çÆ¥¦!D62B!C×sB!¦ÇÆBööõcĶĠ_ĽĽĽĖĖ!RÌu !3cBB!B^rĶĆCû!¤ÖæQÿö!Ė!cĥą222!!RRRæRöĶ!ĆMMĕIČČys !4dtCBRċRRRC×Sª!¶¶RÿD6÷·3!ĦĦĦĖĵ Ħ'ą!Ķ!ěěSĕBB2B !4ń!Rt!xķķć&!B!!!ÖĆRö!!!B!2!!ĥ Ķ( !&MM!Sd!cS !5ĔĔ!dD¬HĚ!µõn!B!!dÿ !&B222!Ķ!!!Ħ22!!2!!MMMmt !8Ĕ!öĦô!Ė!ÑĆ22æÇą¦_!!232BBdB222RĖ2!!R Ĥ'Ė++Ĥ !7ńńĔ!!!đĖ!2ö!ąSR!!<!2333R3 S&sĦBB Ė(!Ė !?'!!!B2¦R!ĆĠ!RBĺĺĺÚ ĺ''tĶĊĊ !)ĖĖ !>»s2ĦĆÕåĶĦĕĬ1b_ !+ĚĚ !J»ÆĖB!!ĖĕĆlĦĦA !V7Û!dĶĵ!!!ccB !XGĪG'Bc¥22Ë !]'''xx !Ņ !Ņ !Ņ !Ņ !ġ",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !Ņ !Ņ !LÁÁÁ !`æææ !N· !1Ł!¥¥ !M×Ć$$ !(ıÁđÑñ!!¶tæË !)nŀŀŀ !@t×!!Ú|áġá!!ıÖ÷sÖ!āıćÅC !(nŀõ!ĶS~ !>tBĶ!B'Å¶Æ¤!R¬ÍĜĆÖÖÆÆb9Č².ānġáõ !&RRŁ !=R2c!2M2!R¦R!ĤPğIzčæ !&rõÖĆ!Ć!!Ķ!2B!Ö !>c!sBĖ!cÆ«ñĀĀĲ2įį!IÝÆ1röÆĶR !&2t!!Ķ¶ġ !<2BB!2nć¥æ×!2·6sÖĖď¿!9¥s Æ&2!CCC!ÇÅ!Ħ !=2!!·çöXËíÏs¦ě^!c¥Ės¿R×¦Ææææ!s¥¥æ¶÷ć2!t !<B !'CłÏĆR«2ċĦ2!!!Ķ!ssc!!!ĦĶ!!Ć·!Ėçt!R !;BtCöĖR!!tcěÆÇ_!!öRæ!ÿ!!cBB!Öç!öĆbr!¤¤& !*ĬT !2AõRRRB!ĚĚt!ĵµÅ!ssæÆÆ!!!Ķ!!BB!!!ĶĖ!B!¥āłu !(ÖĊ !3AĔĔõt!!!Ě!!āR!æ#Ö222!!B¥ !&R22ĶĶ!!ĶĶą!9Ĭ!!!_!Ħ !6AĔ !&Ė!!!Ööõ C&!!ĥcĦÆs!ĦsRB!Ö !(SČIT]ÆÂ !8ń !&Ė!sĶRæõ2!!Ï[t¶sC!!c!BcsėöSĦ2!;!2rúĖ!Ĥ !>dR!!!B!õ¤¥!¶!!!t!!sssR!¥ĕt3Ĥ!;2ĀĶs¡ !?Ě×!!ÆÆą¶Ć!¶2B·Ī!!d··td¥ª!RB!!!m!ds!Ę !?Ě×söRöR!¥Ħ·çĪ!ĪĊĺúúĚĚÚ!t!2 !';²Ĥ !AĚds!sR¥Ç·Īú !-ĚĊĊ Ė'!Ĥ !CĚ7s!s÷Īú !7ĖĖĖń !C777ú !Ņ !Ņ !Ņ !Ņ !Ņ !¥",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !Ņ !Ņ !Ņ !}¦ !>ÑÑ !Cö !;MM^µÖ± !?ttÇ!!Ġ !)TTT± !)~-~^^ĦĕąCĥ!Ñ !=dĖB!Bñ!Ġ^ŀ!!TT+[ďčT±ā!!~ÁB¶BĖĖĵ!Cæ!Ćcđ !<BsRBBıd!å!RRµĵĻĆR[ďčcctB!µµcRRÇdsĖS!!R !*Ĝu !3RBBRÜÖddXı!ÆÆŁ!2R¥!YĶĥöö!2bĦRæąÕÆcc!!R !<B!öõxÇÖ7^Ė!1Ð!R¥Ė¥ÿńnnssć!!!RB!!!2ösz !)ĜĆ !32!!ą!2ÛË±R!!ā!2ĦæĖÆÖĲ Ć&Çç¦Ć·Rd·ĵÖs!į^ĬĜ !'c !6××!ĖĲRRh!!!c¶cc2!ĕ!cc¶!!ÆxccĦs×ĵs !&ĆÜÜ!Ĝæ!Ĥ !2 B&·R22¦¦ !&¶!RRRĖĆcRRc!Çd!!ĶstcçRB!c²×¥¥ÜB¥B !3µĦCC! B'!!SÆS·ccR¥!Rcç¦Ķ!!!ĖsÆµtsSR¶!!!SCĂ!B !5bą!!tBúúú!!R·ą!SS·¦¦·hĖĖ !'CC×RCRÆc·!MM;Ĥ¡S !6bńĔ!C!!!ĖĖúR·RRRĪĺĺĪĖ R'ĖRccc!c !&ĤĤĤ!ĭĤMS !8Ĕ !) ú' !' ú'! ú)¦¦R !&^ĖĤ+ !9ń !?úðġ!!!Dô!ĖĖĖ !WS!!DĖô !]ğ!Dô !`ğô !Ņ !Ņ !Ņ !Ņ !Ņ !/",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !Ņ !Ņ !é -&^!^!^^^ġĠ== !I3 !*-!RRR!^s^!!R!ć!!= !EttÇB !)-!Rs!!!ħ!RRRsd!sösđMMMđđ !,ļ !3tĦR!B·ñĠĠŀ!!!¥ö×ÖÖħõcs÷÷¦BÇ÷t¥!RRRÖ¥M~Á !(ÜĦ !4scĖĥĦì!!X!3RĦöĕtt!tt¦XBBĦĶĶ!!!BB!öĦ!ĖĦĬĬu !'I !32!ĥ!!!yyĀTC!!!ö ĕ&26ĤĖĖĕĥĥ!!ĦRRĦĆ!æ2BCögÜļļ!Ė !3R!!××22!ÁS!!c!!!ĖĖ!!&!!!ĥ!!!R2BBBcæĆcc×BÇÇÇĆCÇ !52BBB22!cs!!R !'2h !,dddsRtÆ¥!+;;;À;!· !32B!!C22!!Bńń!R!!!cW!ā !*¦RRRdÇ!s!!! D';;+ !4CC!B!!!c!!·¶ssÇW!ā !+ R&¥ss¦¦R!ĤĤ !8µ !&cB!2R !&tÇĺ!āSS!!BCS¦¦B!!Ėö!Ė!ĺĺĺ !'ôDDD !3bĥRRCcĖ''!!6hĺĊ.ĲS !&ĦĥĕååĦ!öĊĪĖĊĖ !&DD!!!ôôô !4AĔĔRC!!!Ėł$!!Ĳ !&s !)ĆÚĪ!!Ċ!ĊĖĖ!D!!!ô !;ĔR !&ĚńĲĲ!ĦsssöĲĢ!CC77ĺ !+Ė!!!ô !=Ĕ !'ĖÕĕ22öĆĆ22!ĵĺĺ !/ôôô !Ex7ĚĚĪ Ě&ĺ' !Ņ !Ņ !Ņ !Ņ !Ņ !Ņ !£",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !Ņ !Ņ !©ÑÑÑ ^(nŁ !UÑÑÖÖÖĦĶĶ222R!Ñn~ !QÑöµĥ!sRcc¥¶Ö¥tsÖR~ !Pöą·ħ3çæÆćÇ·B¦Ķ¦¦¶cá!ÑÑÑ!á !HÑą!B!ą¥ÇÇc&&dårrrCĦĖáæ!öác999!!!ļ9 !:·d !&Ė!CĆæ2ÕĆĆ!ĘĘåæÖÖæ!RcĆ¥!Ħæ½!!åĬļü¡^u !6·CħĆBÇ!!ħ !&ĖÖæĕĶĬĥĥ!Ė22!!ccÖ¥×¶æ!^^¦SĆâ !8d!sÖ¥!!đđ!æ!!Ħ!Ķ!ĖX !' B& S&Rst!ĤĤ;ĥcĤ !7dĦBRR2B2æAC)C !&cÇĤ!CC! 2& !(dĶ !&]] !8RÆ2!!c2!¥SRR!!!RB!Ī!ŀ!!B 2&R2ĶR!!s!<DDĽĽĖĽě!ô !6BccC22B2!!RRÆ¥R½!DĖ!!Scc¶çł_¥BR!ĦsĦ<<ğğ!ğğô !52 !'BBd!BBĖ!ĆĶtĤDĐą!!ĦĖĖæµ&&ĆĆĶĶÕĖĖÅĖ I&!!III !4B!!!BB!¥ !&Ħt6!lą!RR! 2&ĆµÕÕÅÅĆåĕĖą M&II+++ !22cCCC!C!!¥ĤĤR!ýĬ!±!!·BB !(æĆĖĖĖæ!æ!C Ĥ&++ !5µĦ!RR!!tBh!_!ý!!n!BBĦĤĤBR !,Ħö!B !<bĥĖĖRR!úĖ$Ċ¼!!¿!B·Sc!!!Bsss!c2!!!B !AAńńĖ!Ĕ!!Ĕ$!!¿!çÇcc!__c t&!¦s R&¦sBĦDDDĖĖĖČDD !7ńĔ !&ĔÐlRçBĦÕÕÕöĖöccc&c2·ccc¶ĥ¶BĪôôô!!!,ôô !>c!æąĦĥĦĦĦąą!ÕĦµñAbú ') !H»cRöµÖ ö&ÖąĦÕöÆĦÛ !Q»Ë»!!!2!ĆĦÖöö»ëÛ !U»»»ª»ûÛÛ»» !Ņ !Ņ !Ņ !Ņ !Ņ !=",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !Ņ !Ņ !Ņ !©±± =&ÁÁÁđ !1ļu !F±öcĖÖÖÖRRĦö !0Ü!!uu !=S !'±öR¶¶cccÇÇė¥ á& !.ê!!u !;SB !'ö!Ė!Ć¶!j(ûûĆ!æææāāā !(Ü¥æ!ě!!u !7¦¦¦BB!!!ħħ!ĥ!!cĝjÿßCC!æĦĦĦcBBāā!!!Ü!!×S+ĤĤĤHÜļ !3¦2BRB2.ñ=CC!CBBĝ!İ¶Ö!!·RsÆĆSSæĆĆ!Á!WWěĕµ«Č««Ė¥ !3¦Ħ!222B !(ĥĦĽ!ÿb !&ÕĶöÆc2µĖĖĖnĦñ¥ĶĶ!¥¥!¥¥SSS !22RB!BBB !'RC9!ÿ¶!!!RRcĦBBBĖ2 !&Ć!!æĦ S(MMM !3BRR!BBB!RRRB9!ÿR!!!¶BB! R&!Ć 2'c!!! M(!ĤĤ !32BBdBt2RBBBR!!R!Öc!ÖĤĤSs !'c!!ĖRtR!s Ĥ) !4BcCCRt!ĺx¶!!Ý!įÆĖ!sćć!!B·sss!ss¶!¶!!cæS !&ĖĖ !5R !(ññxĤr!įsöö¶¶bbM^Åĕc¦RR·SRæ¥sõ¥C! Ė&!!Ė !:ïææñĖÕ!!Ħ!ö!ĦĦR!!!ööÕSĦ2Bddd×tdBB !;bĦĥĥĖĔGËËG!Ėï¶!ccRÆB×RBĦ !&ĥĥĊåąĦĦ Ċ& !)Ė !4bAA !*GR¶RRR¦Öå×¥¥22cąB¥!G'ĪĪ !.Ė !6ń !*h!!R¦!SRĪSS¦cĶÆc¶ !Rhh7ĪĪĪ7!ĪĪĪ'GëëW !Ņ !Ņ !Ņ !Ņ !Ņ !z",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !Ņ !Ņ !ÂüĬ !cIR !=¦ !AüRd!!R !;¦Ħ !(ÑoÁÁÁ !' Á'! Á&!!!^Á'd!+!!!ĬĬĬ !4¦¦¦ĦR!!!$$oćŅööö M&R Ć'ñÖÖæµ±^^õĆ!ąąüĽĭRÆÆ !4¦BBB2!ġnĠ!!ĬŅĆĕĕ Ħ'ŁĶĶcccR¥R2dösBtR!²ÆÆÕ2üs¥ !3¦Ć222B2B!BRR!Ćĵ33BB!s!ĦĦRöRR!!Ħ2RcR!BBR!¥s2MmÀ¦d !3¶2RR22C !(tccBBBcBB¶öBRRB!Öæ!RRćÆsd!¦·¦Ĥ!!++ !2B2B!!2R6!dßB!!!BssscÇÆ¶Ħ¥ÖĆÆ!çcĖs¥Ķ!dd!Ĥ+++Ė !62cBBBĶ±ÁīsĆ!ńIĦĶ!¥¥ÖR¦·Æ2Ė¤ÅBĵS··S·R!R!!!ĖĖ!Ė !52!!!æñÅ¶ıëcĤtń)s¥öö3!FFdç¥¦!ąC R&Å!R!ĚĖĖ !9BCCC2°æRRĐª!¥tńËĶRRĕ!t×!!¥öÇ¦!ĖĖÅĶBĖĶú !)Ė !5RRRsW!!¶tĖĖt÷!!hx¦dĖÅb!!÷3ć#B!!BõSB !>bÕ!!CW!ûhû!!ĔĔāā.!ĺ6Ī!! Ī&ĕĦĦBBSSB!Ċ !+ĖĖ !3bĔĔR!û !)77ĊĖĖĖ !)7ĪĪõĦBB!Ċ !]7ĪĊĊĊ !CĔ !Ņ !Ņ !Ņ !Ņ !Ņ !Ņ !·",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !Ņ !Ņ !î±±± !_±ööö± !8ĬĬ$ !B±=öĥĥĥ!Ñ !+M!~~á² Ĭ(2æ !A±=ö!B!çdĖĦ!nná ~'R-cĖĆÅmĦĦĦæSÖR !@±Ė!!!¥ç¥!ĦĖn!!! Ė(!!RB!!!ĆĆ¥;!cG !>±ĖĦBBB!¥Ss!Rs!!2æ R'!Ħ!!ĶDB¥¥d!¶ !@H!!RR¥sS!¶¶sÖĦ2B!sRRBBR!BRBĤddd+!S!+ !8S !&RR!B!RsdBBW¶sõõ!ĖdRccRRc!RB!!+++!!+S !8SR!!!R!!ÖĦsÇSBåå!SĕSSs·2BB2BBRssR3 !<·St·R2 !'µļö¥µĕåĦ!!&Çsæcĥ!32BRRsR3Cc!!!Ė!!!+ !3·ĆcRR2BġÁİ!ķ×ñ¬ö!æĦ!t!!ħÖc!!2! 3&CC26Ī!!Ė!ĖĖ!ĖĖ !2ĆcRcBB!t2SġæÖĊ!¦c!!!õ!!Ħ !' 2'ĶÅĥ> !)Ė !4RRB!BĶs&čĶsàĥ![!ªç!B!t×!!2Ct2!ĶĶĶą2R!Ħ!!Ė !9 B&æ¥nġÿjÆ!Ñ!!¤ł&¦tt!!BtSBĖ!ĶĥĵĵBą2!Ħ!Ė !;B!!Bû¤!cµ!ÆBĲcBął&ĺĶõµĦąĕĕRĖĥ!ĶĶĶ!!3 !=BCCCBRĆcÆÐttx6ĦĦĦåł!& !/22!ĥĖ !;BRRR!7ĖR!RĚ&D$ !&åāłā.2SSSĺĺ7 !DbĖ!!·-ĆBdB!Ėßl¥¥BBBd!ÇĶ Ě&Ė!!77 !&ĥ7 !=ńĔĖ!>Iªĺª!!7¶ÖĦdddĶĕöĶ> !* 7' !@ń!ńń !(7ËRĕĕĕ!!µõõ !NĔ !, '&ĥ!!ĆĆ !^'' !c»»» !Ņ !Ņ !Ņ !Ņ !â",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !Ņ !Ņ !êááá±±~n !Z~öÖĖBĦĶ!ŀĠ !W~!BÖs¶ccćçÇ!ġāÁÁáāā!Ñ±Mġ !CÇÇT!!!çiÌ¼ĆĶöB¶B¬í.æÖöBĦÆÆ^æĆ¥!ġġ !)$$ !7Ç!¥Bu!RÕ¦ĆCÍĦÖĆÖµąąĵĖĆĦB Ķ&!¥ĖÆĖ!RĬĬĬ!!9ĺG !5Ç·ĶörßĠN!!ÕÁÿ!čöĖĖĆĖĖĦ!22!Ė !&æ!!öĶDöööÜRĕĖ !5ÇĖ22Ķ±11bÁ!Ö6Ćÿ!¬ö!ÆRR!!BB !. s&ü¶Ħ !5Ės222ÁĖĖĖ¥đ1÷öĆ¯!tæ¶¶Ć!B22!B2 !+ ²'ÆBM !4BĶ!!BËÇ2Bĥæ!İcĶööĺdö2!!Bcc!cBRRs2sRRR! Ĥ'td !52RRRBcR!B!!!dĖRRÿD!ĆćÇd¥cBĦ¥¶¶¥!Öö¥¶·Ĥ!!!ĖĖ+n !5cBB!B^rĶĆC!!ļcBĖRįôQ]!ąöĖcs·ddt¶!ÖtzĊĽĽDDR!Ėöö !4dtCBRċRRRCÛķP!!ĦĆõSS1!!BBĖĖæĵĕĕĦĦSĦ!!!õ©ºD!!ńń !4ń!Rt!xķķć&!¶!ĆĆÆ!ĶBBR!S 2&!!22Bc!2!!!BcĶ !:ĔĔ!dD¬HĚ!!ån!ööĶ·!!ķĿ! B&2C2!!S!2!!M¡¡c !<Ĕ!öĦô!ĖĖÑĆ2BB×æcc¤ĶĵSCCCB2CCCĕB8ĤĖôôô,ô !<ńńĔ !&h¥!BĖbÆ !'s2BR!2ĪĺĺCĖôĖ !Jªs!ĦĦĦR !&ÚĪĚĊĊĊ!!!ĺĺ !MªÆæėÆĆÆR2' !Y77ĪWÛ''' !Ņ !Ņ !Ņ !Ņ !Ņ !ã",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !Ņ !Ņ!!!II !aõ !aI !:S !Hµ !9×!$$ !<ñ±±! I'¼Ķ !7tÇĶBğ|áġá!!ÁN== !'--Á !(ñ==¶öö±!µrrµ¥st+ !4tBBB!ĆÅ¶ö¤Ruý(99Nā!!ŀcc2!!!ñ±±¶ĥĥĥ22!ąRss×tt+Ę !4RsBcRŁ2!ÖCMĤńÿÿÿ(½RuĦ!!!^đáÖÕÕĥ!!!B!c2R¦¦!++ !7BB!2nćcĶìÕĀMSÆÆ[+á!§R¶Rö!æą !&3dĶĆ!SS!++ !82!!æçöXīj×2·ěA!öĦR¶ß¤!Ėcs!B!!CSd!!!Ös+++!ĖĖ !72C!ė!!CłÏÏ¦ě¦Sc!!c!!æ !'B¦S2RB¶Ė2¥!!!ĖĖ!!ĖĖń !4BRCöĖR!!!Ć«2åÅ!ÖĶÖc!!!2!2Ķ¥ÆÆÆBcsSÖBSĖĖ !;B!RRRB!!t×·Ķ±R¶Öæö¶ö !&B!dĖöĦsRRĊG'Ě !=Aõ!!!t!ĚĚ&ńĢÆ!sRæs¦ÖB!!!c!!Ė!ĖÖĶ' !BAĔĔõ !&Ė!ĥ!¥!!Ķ!rsĖ!B!BRĥ !&ĆÑā !DAĔ !&Ė!sB R&!Æ¶!B!B2ĆcBBB!!Ėā !Eń !&7¥ !&RĖĆĖ¥B!SC!!cc22!!RŁ !JWªRsssÆtçt3t!!cBB!RsRs!!. !KW7CCCĺĺĚ2ĖRBd B' !'9 !Lĺĺĺ!!!ĪĪúĊĊdd¦SdBd2!R !XĊĊĊĺ!¦ĥ!3!ąČ !ZĊĖ!3R8d¦I!!ļu !VRCRĺĤ!Ķ!IR !XĊĪĺ!!;!!õÌ¡ !YĖĖ!!;ĶdR !]Ė!!;;²!Ĥ !`ĤĤĖ ![ Ė( !Ņ !Ņ !Ņ !Ņ !)",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !Ņ !Ņ!!!Ĝu !ÃĜĆ !IÑÑ !8c !HİÖÖÑ !-±±ı!!ÌÌÌĜæ!Ĥ !JĦ !*±==ÕÕÆÜÜ222B¥B !73 !2ÇÆ¥ !(±±±ö!s !'c¥Ă!B !H^æ¶Ķ¶!!!±±!ööR!öħdcĂ×BCĤ¡S !5ttÇB!~ !)TġMM!!ą2!!!^^-ööö!RBR!Ö¶!!!S;ĭĤMS !3dĖB!RÜÅĠĠŀ!!TTõ(üöŀá· !&õĖ!Æ !&BBc!c·!MM!įĖĤ+ !3BsRBBhddd!RRµrrmmzçÆÅR!¶Rts¶!¶sRBcRķÆ!!ĤĤôĖ!!ĖĖĖ !3RBæõìÖ!!Xı!öõĐ¶¶įÆ2SĆ!!!ĖöÖ!µÕ¶!ts!!¦RĖĖ !:B!ĵ!!Ç77^Ė!ĥĐ!¤Æ!!Bc!Ė!R!!!·!!bÕĶ¦!¦úú !;2!!××2x!±R!!ā!dC!RRscĖxæ!RRĆ!dd!!Ĵô!ú !>BBB·R2ĲRRh!!!c!!!B!cx! c&Bĥc!dd!!ôŀ !=B !&BR2¦¦!!!SRB!Bc2¦!!BRRRS!B¥!!!··!ŀ !<µĦCC!t B&!!SÆ·RÖBR¦å!!BRRRsS!!¥¥d2Bd·Ñ !<bą!!!Cúúú!!R·ą÷!B!2d!!CBBB!!Çss!!Bs!!RÑ !<bńĔ !'ĖĖúR·ĶRRd !'CCC!!R!!s¥c¥R!R¥ !?Ĕ !)úú!SSąÕą^^ R&Ħ!!¦SSÇĆ¥ħ!!SuĜ !>ń !*ĺ!!S¦!¶¶ÕĆrúúĪúúRR!Ç÷AÖSX!tÜ!!!Ĝu !Bĺĺ!! S&ĺª !'úúĪRĖçCR!ě+¥ !I ĺ( !,úRc6ĪĤ+ĽC9!ĜĆ !Vú !'M;!Ĝ!c !WúĖ!!!Ĥĭ!Bæ!Ĥ !XĖĖ!!^ĥC!B ![Ė!!SĥÆS !^ĤMS]+Ė ![Ė!Ĥ+ĖĖ !^ĖĖĖ !Ņ !Ņ !Ņ !Ì",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !Ņ !ĲĠ== !2Ĭ !L^ġć!Ć~ !0ĬĆI !H^^^!¥Bs!ë !1Ķĕ !C -&^ !&Æ¦÷G !1ö2ĦI !83 !*-!RRR!!sÆÆRĕĪ !(MMM~ĬĬuÜuĜc·d !6ttÇB !)-!Rs!!!ħ!RR7¶~~Á!±±M!BBĶ»ög!gdd!!M !4tĦR!B·ñĠĠŀ!!!¥ö×ÖÖħõ¥!SÁBBB!-ææĦĦ!!2ÆÇÇÇB ;& !6scĖĥĦì!!X!3RĦöĕtt!tShXB c&Ħcc22ĆõB2;;;ÀD !92!ĥ!!!yyĀTC!!!ö ĕ&6!Ĥ·!!!c!¥R¥cR3Å !&DĤĖĖĖô !4R!!××22!ÁS!!c!!!ĖĖ!¬ !&RRRC!!RBBc!¦¶!!ĖôĖ !92BBB22!cs!!R !'¬Ĥ$ !)2BBRsBsRc^Ė !;2B!!C22!!Bńń!R!!!ÝĤ$ÿ !(R !'¥R2BBÑŁ !<CC!B!!!c!!·¶ssÇĤ$ÿ !*3 2&3c·ĖssSR !9µ !&cB!2R !&tÇĺ$ÿSS!!c !&cSS!!!2R!Bt&!9 !&9 !4bĥRRCcĖ''!!6hĺĊ.İS !&ĆSS¦!!BBSS!¦!sS&!!ĕ9!!ÜÅ9 !4AĔĔRC!!!Ėł$!!Ĳ !&s!!!ĶĶĆĆúĚĚBBBĶĶ !'m;9!Ç !9ĔR !&ĚńĲĲ!ĦsssöĲĢĵĵĺĺĺ!!!ĚĚĚ!!t !'ĭĕ9;s !9Ĕ !'ĖÕĕ22öĆĆ22 !.ĚĚĚ!ĭĭ!!;m;!m^ !?x7ĚĚ2 !&B'' !.Ěįįĭĭ!!!DD !D Ě( !3įį!DD !dôô !]Ėôôô !Ņ !Ņ !Ņ !Ņ !Ņ !Í",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !Ņ !Ņ !ì~~~±Ñ !Z^^^Ħ!!RĶn±N !U±ŀĦ!!ccc!ÆsR!M !S±ÕCcBÖsRR¥!¥s!önnāMMM !G·d !&ö!¥c÷dd¦¦SĬĬdĕBÖ!RÆRRñMMñ !@···ĆBÇ !(Bĕĥ2ąåc!!µĦĦĦcdcssöÆRöñuüĜĜ !:d!!!¥B!đđçÆC!Ħö!ĕSçĊCCc!!Ė!!2ssæcćæ·!¦ddĬĜ9R !5d2BRRR!2æcc¥R!!!Ķ!ĕĊ !'ös¶c S&d2S!Ĥ;;;m}åÌIT !3Rs2 B&2¥2!C !'Ķh!_!!BĶ¶B3öĕĕµrcrrQ-á!ĭìÌ!c+!u !4BBBC!!BRt8!!!BĶt!_ĖRRSĆÖÖ2õÖsöĆAö!ĦĶĶČåĦc !72 !'BBdRBBB!Ķc¦&_öĦ!!ĦR !'c2BR !']B¦C¦!!ń !5dCC!dB!R!!2!2d&_ö!!BB !'2B!R22R !'};;!Cĭ !42cR !&C!RĤ!!BÇ&_ö!!BĤĤ!!BB!!!BBc2!¥!¶t !&;;;!Ĥ !2µĦĖRRR!RBxDĐsÇs_ö!BBR!!BRc!!! R&!æĆĖ·!Ĳ!!ĖĖĖ!!Ė !3bĥĖĖ!R!úĖ!8çsööĥB !(CCcĕ·BBBSS3·3!ĺĪĖĖ!!!ĖĖ !5AńńĖ!Ĕ!!ôßČČąĕC!!ĖÅñĢĦBBddĦt33 ĺ( !AńĔ !'ïïSCĶõÕµÖĦõÅ Ě'úĺĺ !MWĶ!ĕĕĕĶ!ccBR» !VWGG!!!2RRG7 !Z G&77 !Ņ !Ņ !Ņ !Ņ !Ņ !¥",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !Ņ !Ņ !ĭ-ŀ==~~ !4Ü u& !C==2!!!Ć!~~ !7u !@±±!!¥ÇRĆ¥RRRÑ !/9Č!ěĤ !B±öcĖÖR¥Ö!¥¶¶¶R !+~~9ČÅĖcµĽĤĤ !9S !'±öR¶¶cc2tttĦæ¶ö±ñ !'~~ö!ÅĖÇRd×!!!Ĥ !7Sc !'Ķ!Ė!Ć¶!j(ûûĆĖsssc!!n~~öĶ!!ss!tĕ+ğĽ !6tt¦c2!!!ħħĆĥ!!cĝjńßCC!ĖssBĆ~-ĆöĶ!!!RSS!;mĖ !7tBRR2B.ñ=CC!CBBĝ!İMÖ!!·R !&ö !'¥cc7;;!Ė!!ğ!Ė !2t2!2RBB !(ĥĦĽ!ÿb !&ÕĶ!!d !&B¥cĶħæ!Ģ!Ė !&Ė !42B!!BB !'RC9!ÿ¶!!!RRcĦRRąĶsssRBöBĦć!Bł !9BBRRdBCB!RRRB9!ÿÖBBB¶BB!RRRĆc!!sc2!c!!!ĚĚ !:2Bd!CR2RBBBR!!Ö!¶B!öĤĤSBB!Ķ2ccB¥S3SB!ŁI !:BcC!RR!ĺx¶!!Ý!KB¶ö!BB!!2R!B!Cç×¦SBB!!&ĕĕČI !8R!!R!!!ññxĤr!K2öössÇs!!!R¥BBRĶ !&ĦÅ!!]S¦ĕļļļI !7Ė!!ïææñĖÕ!BĦ!ö¶¶bS!!2!!cc!!Ħ!ÕĦąRĕ!!++]SĦĦ !5bĦĥĥĖÿ2ccG!Ėï2RccBĦB¤náĶS777ĊĚĺ!·B2SS !'+}} !6bAA!77hh!!!GRcRR2Æ!2!öõĕ> !'ĚĚĚtB& !*+ !8ń !*h!!RR¦¶×22!!ĕ> !)ĚĚ Ė(Ľ !Ehh7¦!Såc¥B !7Ė !EĪĪĪRtS!!!¤ !1+ !K7Ī!SÖÖ !2Ė!Ė !KĪĪËËË !2Ė !Ņ !Ņ !Ņ !Ņ !Î",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !ĄĬĬ !`ĬÆ!ĬI !^Æ!ĖĦąI !ZĬĬ!Ĳ·°d !ZĬÆ!çě+!+ !WāIČÆcĆå+ !IÁÁ !0MæÚ!¥sÇÇ!ĖĖ!+ !CMMĖBáá !-~ĦĖ!Ļ!S++Ė !EMMBBs¥¥!áÁ !)~~öÆ!æ!°+ !'Ė !9C !)M2Böö¥!!¥Ħ!ÁÁā!!~~ĖR!µ¥Æ !&Ė !&Ė !7CB !(Ñ¼#ķ!æææ))ĶĆĆĆ!±-ööĦÆÆħ!·R>>Ė !:¦¦¦BR!!!$$o8áĵĵRÖĖĖPPBĶĖĖ !'BsĶöćåS!ú !:¦BBB2!ġnĠ!!ÛáĕĕĕBcöR!!cĦ !(BRBc¥Ė¦R !;¦Ć222B2B!BRR!ĕĵ33Ėös2.!R!c¥B!BBRBc¦SR!!ú !;¶2RRBcC !&t!SB2!!öÆr.!¥B!¦¥cÖ¥¶RĕRĦĦú !;B2B!BĶ±6ÜdßB!!!csRs2!ĖrdRRR!!s!R!SSĦĚĚ !<2cBBæñÅı]ìĆ!ńĦ!Ķ!!ĆÖÆR!ąÇccĖ·RR!S!2r^^ !<2!!!2°æB!]cĤ×hĆsÖ!ÖĆsĶĦÖBBB!!CSSR¤¤Ħccā !;BCCCsW!2æBª!BdScĶÖBRÖĖ!!ąCC222ĶĕµBĶB2!!ĬĬ !9BRRRCB!cccĖĖtć6hS2¦·»sR!!BRR!RcCRss2sĶ!²Æ«I!!ĬĬĬ !2AĖ!!R7Æ»'Ë!!ĔĔāāBhĺ6!ª!!Ħ!úúĆ!!cCC!¥dBR!¥!Õ9«ÆÆ !4ńĔĔ!!W !)77ĊĖĖĖ!!cs2Å!!ĺúĆ!ccdC!s!!¦s22Æs¥ !IGR¶!ġ!!!ĺúĆ!ccR2dĤ+·¦MmÀ¦d !6Ĕ !4ĻB !)ĺúĆ!!S!!!++Ĥ!!++ !JËhG !)ĺúúRBĖĖĖ!D ![úú!!!ĖôĖ !ÆĖ !ÆĖĖ !Ņ !Ņ !Ņ !Ņ !Ċ",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !Ņ !Ņ !_ÜÜĜRR !_cB«ČR !ZļÜ!!SàSìR !V^ñļ!¥ct!!!B !V^!Æû]¡t++!+S !R^^MM!Ķ!2.Ĥ+ !S±ā^~BBcRĶÖcBą!!ĖĖĖ!+ !M±Ć¶Æ!22Rccö¶B !(ĖĖĖ !C^^--áá±TT!RR¶¥!c!R¥¶B!3!Ė !Bt !&ć^ĖĖRRææR!!çcsÆ!c!R22B!3!Ė !Bt !&R!Ö!R !&æKß !&tRR2!B!3!ĺ !?·t¦·!2!!R!µļ2RR !&Ħ¥rBBB! B&33ĺĺ !?·ĆBBB2BNÑıD×ñcöÆRR!Æ!!BtdRR!!3Sĺĺ !AĆcRcs2¥&čĶ!ÖĊÖcæÆ!Æö!s !'3SBĦññ !ARRB!Ö¶<M¯j+ĥ×jÖcæÆR2R!c!!3!B!ĕĵBBđ!đđ != B&2ûsåÖµ!Ñµńhd !&2RR!BcĶĦĦ3!RB!.B!_ļļ !;B!!BR!tæÐÆBĲD!FÇ!!RR!!!ĦBĦ!!!3!2R!2R!ĖÖČIļļI !5BCCCBěĖRĦR¦d6¿đ!FtĆĆĆ×d !*333!33!¦ç°+Ö !7BRRRBcÆ¥dBĺX$!Ėđ!ĺ¶!!µ!BB !/++!!cS!I !4bĖ!!!ġ¬!ĺªĖßď!!ĖđłÖcccĚĚĚÚĺĺ !0¦+ !7ńĔĖtâsG!!!7ĶRR¦SĚxRs7 !(ĺĺĺ !&2BĶ !&+ !:ń!ôô !'7''ĚĚ!!G' !,ĺĺĺB2!Ě Ė&!!+ !9Ĕ !?ĚĚĚ !'Ė!!+ !ÃĖ !cĖĖ !Ņ !Ņ !Ņ !Ņ !g",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !Ņ !Ņ !I~MM±± !Z~nn!!cĆĦnĠŀ !Uı~ĦĦĦĶ¥c!2Õ¦!Ñ !SÑsĖĶcc¶R¦Öc·Öd !UĶBcBÖcc!BcöĆscñ>āāā!!!āā !BÇÇT!!!ç8s!2sSdtc·tSÇ¥!!Ķ!ĆÖnnnÖ!Ł_ !?Ç!¥Bu!RÕ¦Hý!ÆÕĦĶĶ(H!!CR!ĵ!!RRRĶsc! R'!!Rļļ !4Ç·ĶörßĠN!×bÁåÍ¥!åõ !&ĥ!!c!Ķ !&2!æ!ĖČČÜÜČRÜĖ¡ !3ÇĖ22Ķ±11bÁ!B6<!Ý!!ĶĖ!!ĕĦĥĶ!!! B&s!R!Ķ¡¡¦RRÜĦ !5Ės222ÁĖĖĖ¥µĕ÷¶ÿöÝ¦ !'ĆĖ!!C !(R!!!ĤĤ+]]°!R !4BĶ!!BËÇ2Bĥá!İ!Öÿö6S!Qr!!22S!Rc R&ttS !)·CĤ !32RRRBcR!B!ö!çÆ¥¦!DFcB!C×2ĦąRööĆĶdÖõs!c !(; !5cBB!B^rĶĆCû!¤ÖæQÿö!Ė!cĥąĆĆ2ÕĆĆĆĶ1ĆtĆ2ĬÜĭ !&Ė; !4dtCBRċRRRC×Sª!¶¶RÿD6÷·3öĖĖĦ¶ĖĖĖr¥Ć¤cRĤRą!!ÜÜRĖĖ !3ń!Rt!xķķć&!B!!!ÖĆRö!!!B!!ö!Ė!!Ķ!æĖ2öĖ_St!!¦¦ !7ĔĔ!dD¬HĚ!µõn!B!!dÿ !)2!Ķĥĵ!!Ħsą!!++!!++ !9Ĕ!öĦô!Ė!ÑĆ22æÇą¦_!!2cRÆBs2S3!s !EńńĔ!!!đĖ!2ö!ąSR!!<!tRR3¶RB¥!öBBd!ĬDĖĖĖ!!Ė !?'!!!B2¦R!ĆĠ!RBWWĺGûûÛ(s¶'!Ċôô!!!ĖĖ !A»s2ĦĆÕåĶĦµQ´Ņ_ !)Ûī!Ī !J»ÆĖB!!ĖÕ!b¦!Ņ !V7Û!dĶĵ!!¦!!c !XGĪG'¥RÖ¶¶Ë !]'WWxx !Ņ !Ņ !Ņ !Ņ !ġ",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !Ņ !Ņ !LÁÁÁ !`æææ !O· !+ Ł(!¥¥ !N×Ć$$ !'ıÁĖÖö¶¶¶tæ¶ !Lt×!!Ú|áġá!ıÖ÷sÖ!sÆćÅCÇ !KtBĶ!B'Å¶Æ¤R¬ÍĜĆÖÖÆÆb9Č !LR2c!2M2!R¦!ĤPğIzčæ !&rān-ġ !&ŀİM~ !@c!sBĖ!cÆ«ĀĀĲ2įį!IÝÆ1röÆĶR!^ġŀŀ!!2RÁ !>2BB!2nć¥æ×2·6sÖæÏ¿!9¥s Æ&ösA!Ķ!2!!2Ł !=2!!ĆçöXËíÏ¦ě^!2ÖĦ2¿R×¦ÆææöRÖ!!2t!cĶ¶ĦR !<B!!÷!!CłÏĆ«2ċĦ!!!BĶ!ssc!!ÆÖ!CCCõÇÅ!Ħ!!R !(ĬT !3BtCöĖR!!t×ÆÇ_!!¶cĆ!¿!!cBB !)÷ć2!t!ĽN!!!IIĶĻ !3AõRRRB!ĚĚ&ĵµÅ!ÖÖĆBcB!!Ķ !'R!s#!Rçt&!!ı!!¼õ!t !5AĔĔõt !'āR!æ#¥cBR!!B¥!!ssBsR!!!¤&!!+!RR!!Ķ!M !7AĔ!!!Ė!!!ÖöõtttC!!ĥcĦ2s!RR¥S!Çs !&;!ìs!;!Ĥ !9ń!!!Ė!sĶRæõ2!!Ï[tBĦC!Ė·¥tBBæd__!!!ĭ}°}ĽM !?dR!!!B!õ¤¥!2!¥!ĶöĥSĦĦúĺĪĖĊ!!!; !'Ę !>Ě×!!ÆÆą¶Ć!¶¶¥Ç!2!C!ĚĚ!!!ĊĖ. !(MĤ !@Ě×söRöR!¥Ħ·÷ĶĶCCĺĚ !)Ċ !(Ĥ !BĚds!sR¥Ç·Rú ĺ& !,Ė!!ĖĖ!!Ėń !AĚ7s!s÷Īúú !2ĖĖ!!ĖĖ !E777ú !Ņ !Ņ !Ņ !Ņ !Ņ !¥",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !Ņ !Ņ !Ņ !}¦ !>ÑÑ !Cö !<M^µÖ± !?ttÇ!!Ġ !)TTT± !)~-~!^-ĕąCĥ!Ñ !=dĖB!Bñ!Ġ^ŀ!!TT+[ďčT±ā!!~ÁĖBB-Ėĵ!Cæ!Ćcđ !<BsRBBıd!å!RRµĵĻĆR[ďčcctĖö!!!ĵĵ!!s!S!!R !*Ĝu !3RBBRÜÖddXı!ÆÆŁ!2R¥!YĶĥssĦącd!C!2Rcc!!R !<B!öõxÇÖ7^Ė!1Ð!!ĶÖ¥ÿńnn22ĥ2bĦ·BdRd2ös!> !(ĜĆ !32!!ą!2ÛË±R!!ā!222!¶ÖÑööæĆć!!!RRc¦ą2sĦtĪĬĜ !'c !6××!ĖĲRRh!!!c¶cBBĖÖ2B2ĶĖç¦Ćsc!BÇ¶ÖtĪ!dtĜĜ!Ĝæ!Ĥ !2 B&·R22¦¦ !&¶!R¥R!¥c¥c¶÷!Æx!¦×c!ttĪ!!+!tBIt÷B !3µĦCC! B'!!SÆS·ccR¥!Rc¶çĶÇd!!¥¥ĆĆBĪ !&+!Ćåĕ+ !5bą!!tBúúú!!R·ą!SS·¦¦·hhĖ !&ÇææĦBĆ> !&Då¦t¡Ľ !6bńĔ!C!!!ĖĖúR·RRR!226Ė> R&ĖĦccc!Ě !&ĝět!!ĤMS !8Ĕ !) ú'ĪĪĪĖ! ú'! ú'!ú>!!K!2;^ĖĤ+ !9ń !?ú!!!++Dô!ĖĖĖ !ZDĖô !]Ė!Dô !`Ėô !Ņ !Ņ !Ņ !Ņ !Ņ !/",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !Ņ !Ņ !é -&^!^!^^^ġĠ==!!! M& !B3 !*-!RRR!^s^!!R!ć!!=MM !&M !>ttÇB !)-!Rs!!!ħ!RRRsd!sös !)~ !<tĦR!B·ñĠĠŀ!!!¥ö×ÖÖħõcs÷÷¦BÇ÷t¥!!!R!!æ¶ !=scĖĥĦì!!X!3RĦöĕtt!tt¦XBBĦĶĶ!!æ!¥!!æ¡¡I!!!Üü9 !62!ĥ!!!yyĀTC!!!ö ĕ&26ĤĖĖĕĥĥ!!!¥!¶Rª+!ĕI!Ü¥c;!ļ !3R!!××22!ÁS!!c!!!ĖĖ!!&!!!ĥ!!!R2!!cRö!!+SĕR¥]¡DÜĦ !42BBB22!cs!!R !'2h !+BR¶RdĆ!!!+]Ľ]D !&I !22B!!C22!!Bńń!R!!!cW!ā !*d!!d!t !'+D!!ċ!Ė !5CC!B!!!c!!·¶ssÇW!ā !+R3d!Ħ!.!!!DD !&Ç !4µ !&cB!2R !&tÇĺ!āSS!!BCS¦¦B!R!!BB!.. !'Ĥ;!· !4bĥRRCcĖ''!!6hĺĊ.ĲS !&ĦĥĕååĦ !+.!!!Ĥ!!;;+ !4AĔĔRC!!!Ėł$!!Ĳ !&s !)Ć!RR !&ĊĊ!İİİ !=ĔR !&ĚńĲĲ!ĦsssöĲĢ!CCttRÚÚÚ Ċ&!! Ċ&ĖĖĖ !;Ĕ !'ĖÕĕ22öĆĆ22!ĵĺĺĊĊĊ !2ĖĖĖ !?x7ĚĚĪ Ě&ĺ' !Ņ !Ņ !Ņ !Ņ !Ņ !Ņ !£",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !Ņ !Ņ !©ÑÑÑ ^(nŁ !UÑÑÖÖÖĦĶĶ222R!Ñn~ !QÑöµĥ!sRcc¥¶Ö¥tsÖR~ !Pöą·ħ3çæÆćÇ·B¦Ķ¦¦ħėoŁŁŁÁÁÁŁ !GÑą!B!ą¥ÇÇc&&dårrrµµQsssĖR2Æ>uuu!!!ļuu !7·d !&Ė!CĆæ2ÕĆĆ!ĘĘåæÖÖæ!Ħ! Ħ&2ö!BĤĤĤRRR]ĤĤ !4·CħĆBÇ!!ħ !&ĖÖæĕĶĬĥĥ!Ė22 !&¥¥¥2c!c !=d!sÖ¥!!đđ!æ!!Ħ!Ķ!ĖX !'BBB !*s!Ħ !;dĦBRR2B2æAC)C !&cÇĤ!CC! 2&!¥cRRR¥!¥!ĥ D&ĽĽ !5RÆ2!!c2!¥SRR!!!RB!Ī!ŀ!!B 2&×S t&cdSRd ě&ğğĽĽĽ !4BccC22B2!!RRÆ¥R½!DĖ!!Scc¶çł¡¥¥cc·RRÇR ğ&!!ğğğ !22 !'BBd!BBĖ!ĆĶtĤDĐą!!Ħ!!Ėå&ĊærbÕbrBĬĬII!IIu !7B!!!BB!¥ !&Ħt6!lą!RR !'ĖĶĥBsSstĬĤĤ++R+M!u !42cCCC!C!!¥ĤĤR!ýĬ!±!!·BB! 2&!!S22c !(ČČ !8µĦ!RR!!tBh!_!ý!!n!BBĦĤĤ B'ĦĶĶ!!ĶB!!DDĭCĆD !8bĥĖĖRR!úĖ$Ċ¼!!¿!B·Sc!!! B&!!!CC !&ċċåĕc© !9AńńĖ!Ĕ!!Ĕ$!!¿!çÇcc!__c S& !'Ė3!ï!!¦<,mêċô !9ńĔ !&ĔÐlRçBĦÕÕÕöĖöccc&ĥ!!ĺ!!!ĺ3įįį!!!,į !Ac!æąĦĥĦĦĦąą!ÕĦµñÖ¤ĺ!ĺĺĺ!ĺ !I»cRöµÖ ö&ÖąĦÕöÆĦÛ !Q»Ë»!!!2!ĆĦÖöö»ëÛ !U»»»ª»ûÛÛ»» !Ņ !Ņ !Ņ !Ņ !Ņ !=",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !Ņ !Ņ !Ņ !©±± =&ÁÁÁđ !W±öcĖÖÖÖRRĦö !PS !'±öR¶¶cccÇÇė¥ á&ÑÑÑ !,RRR!HÜļ !7SB !'ö!Ė!Ć¶!j(ûûĆ!æææRĶĶ~~ÑÑÑMM!ļu!!!ÜĖ¥ !5¦¦¦BB!!!ħħ!ĥ!!ìĝjÿßCC!æĦĦĦcÆÆ¥sĶæĶ!æÜ!!DD!ĂSSS !3¦2BRB2.ñ=CC!CBì·!İ¶Ö!!·RsÆĆS3ĆRc¶Ć¶Ć¡!!ê!!DĤ+++ !2¦Ħ!222B !(ĥÌ·!ÿb !&ÕĶöÆc2µ!ĖĖSSĆñµ¥æ!ě !82RB!BBB !'RC·!ÿ¶!!!RRcĦBBBĖ2ÖÖ!å1Æ!!!×S+Ĥ!DD !5BRR!BBB!RRRB9!ÿR!!!¶BB! R&!Ć22!c!ĆR¥SMM!!Ĥ !72BBdBt2RBBBR!!R!Öc!ÖĤĤSs !'B!æ!!t¦S+ĤĤĖ!!ĤĤ !4BcCCRt!ĺx¶!!Ý!įÆĖ!sćć!!B·sss!scB!!!bº+!!Ė!ĖĖ!!Ė !3R !(ññxĤr!įsöö¶¶bbM^Åĕc¦RR·!cc!Æ!¥ĲĲ !'ĖĖ!Ė !8ïææñĖÕ!!Ħ!ö!ĦĦR!!!ööÕSĦ2cRBSĖ!ÆBBĖ !:bĦĥĥĖĔGËËG!Ėï¶!ccRÆB×RBĦ !&ĥĥdCtÕ÷×ć!Ċ !<bAA !*GR¶RRR¦Öå×¥¥22cąB¥!RR·!B!Ċ !@ń !*h!!R¦!SRĪSS¦cĶÆc¶Ċ!!22ĚĊ !Khh7ĪĪĪ7!ĪĪĪ'GëëW! Ċ& !Ņ !Ņ !Ņ !Ņ !Ņ !u",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !Ņ !Ņ !Â«Ĭ9 !b2R !=¦ !A«ÆĖÕ!R !;¦Ħ !(Ño Á& !& Á'!nnn !&ñ«sĖR!Ľ!!ĬĬĬ !4¦¦¦ĦR!!!$$oćŅ ö&MMMRĆĆæææñRRRÁ±ññ-Æ·RmR!ĭRÆÆ !4¦BBB2!ġnĠ!!ĬŅĆĕĕ Ħ'ŁĶĶ¥¥¥æµö!!cÆ-Rd+m!mĶ!!s¥ !3¦Ć222B2B!BRR!Ćĵ33BB!s!ĦĦRöRRÖÇĕööRą·d+!!ĽĽ;;!À¦d !3¶2RR22C !(tccBBBcBB¶öBRRB!SĶąĶ!ĺú !'Ľ!!!++ !2B2B!!2R6!dßB!!!BssscÇÆ¶Ħ¥ÖĆÆ!çs¥SĆS!cĲ!!+++Ė !62cBBBĶ±ÁīsĆ!ńIĦĶ!¥¥ÖR¦·Æ2Ė¤ÅBĵc!!Ö!sæRł!!ĖĖ!Ė !52!!!æñÅ¶ıëcĤtń)s¥öö3!FFdç¥¦!ąCcc¥¥ssc!ĚĖĖ !9BCCC2°æRRĐª!¥tńËĶRRĕ!t×!!¥öÇ¦!!2s!Æcdú !)Ė !5RRRsW!!¶tĖĖt÷!!hx¦dĖÅb!!÷3ć#BCRB¶Sd !>bÕ!!CW!ûhû!!ĔĔāā.!ĺ6Ī!! Ī&ĕĦĦBdS2B!Ċ !+ĖĖ !3bĔĔR!û !)77ĊĖĖĖ !)7ĪĪõĦBd!Ċ !]7ĪĊĊĊ !CĔ !Ņ !Ņ !Ņ !Ņ !Ņ !Ņ !·",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !Ņ !Ņ !î±±± !4ĬRR !H±±ööö± !2ÌĦyüRR !E±ööĥĥĥ!Ñ !0Ì!!!ĦüĽR !C=ö!B!çdĖĦ!!nán~~!!!ÁÁIĬ¥ð¦ç!d !D±!!!¥ç¥!ĦĖnn!!2Ķ!~.ÁÖĆ6ddĽ++¦ !D±Ė!BB!¥Ss!Rs!sĆ!Ć!örÖ!ccĊ++Ľ!+++ !A±ĖĦBR¥sS!¶¶sÖĦsR!!ö!ö !&Ė.!+ĽĽĽ!ČR !?H!!RRsdBBW¶sõõ!!Bs !&¶ !(ĕĕĕÜ!Ľ !9S !&RR!B!ÇSBåå!SĕSS!2B!¶!!!scctĺ!ĽSS] !;SR!!RR!!ÖĦsµĕåĦ!!&Çsæ!Çc¥!¶ !&t!āD!!+!¦!+ !4·St·R2 !'µļö¥!æĦ!t!!ħÖc!!!BcBÖÖĶR!ĥSĤ++Ė!+S !4·ĆcRR2BġÁĀ!ķ×ñ¬öc!!!õ!!Ħ!!C!SSBcssR!!S!!!Ė!Ė!+ !4ĆcRcBB!t2SġæÖĊ!¦ªç!B!t×!!2BB!2dd S&2RRĖĖ!!!Ė !5RRB!BĶs&čĶsàĥ![!ł&¦tt!!BtSB2R !(22úú !(ĖĖ !3 B&æ¥nġÿj!ÆÑ!!¤ął&ĺĶõµĦąĕõĆ2!222ĪĪĚĚ !>B!!Bû¤!cµÆ!BĲcBĦåł!& !'3!!!ĚĚĚ !ABCCCBRĆcÆÐ!!x6ĦĦ!!åāłā.2SSĺĺúĪ !DBRRR!7ĖR!RGxD$!!BBBd!ÇĶĚĚĚ !HbĖ!!·-ĆBdB!Ėßl¥¥dddĶĕöĶ> !KńĔĖ!>Iªĺª!!7¶ÖĦĕĕĕ!!µõõ !Mń!ńń !(7ËW'''ĥ!!ĆĆ !NĔ !0'' !c»»» !Ņ !Ņ !Ņ !Ņ !â",
);
// }
// Guard (Death) {
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !Ņ !²İİ^ !N5 !1İ!·ċ !Nĳ!!¹ !,=ġt!Ć !M·¦!5!Ó !+=!Æ¶8ī !L·æ¥!ĳ !,=!c !Ndtæķ×Ġ !,^¥!!ss !6ĬĬI !4dĦBB!;!ÐİM !&Ñ==ĦæÖss' !)±±==± !)ĬĖĖ !5Bs!B!ġ!sdR!!Ñ=Ö!!ÖÖss !)±±öö!!ö=±üĬ!!ĬĖ!B !6Rs!!7!BRs^R½ĭĭÖ!¶öö!'!!==ı=öö !*ĖĜĬd!Bt !6BÆĥ¤ėÇCszĻ!;;ïzĭ¥ĆöĖuđ=!æÆ !'Bs!B!¦BSĖ!Bt!+ !42!ć!!ûĽČzP!ı!Æöï!Í¥BÌŅĶæsöö!csssRcBRÆ!dK¦!t!+Ė !6ą×cÖ!Àďķ!!ÆÆcĖï!Íæĵsæ!sÆææ¥sss¶!¥Rt;;!;+++ !6ÕĖBB×2öėÌ1ı¥ÆÆÆæĖ!!c4LĆ¥ĶÆ æ)Ėccĺ!!!ĖĖ!!Ė !6RCC!B!Bĥı!B!!cöæï!Ľ!Ć !&Ħ Ć'ææcæñĖĖĖ!!ĖĖ !7bą!!!ĥ(!!!ÆÆR¶s!¶s !2æc= !>bńĔ×Ć !'Ö¥¥2ccÏ!Ĥ !.¥!!!BI !(ļļ !8Ĕ¦ôĖc!!cÆöÆ22Ė!!cc!Ć¥cB!!!B¥æ!!!Rĕļļ!!!ļÖ !:ń !'ĦBSRcc!ï!BRcĦ·! c'¥B!!sċ!ÖÖČI!Ö !AĖÆąSRR·C!S!Rc!¥Rsss¥!æss!!!¶¶!¤Č!R !=ëc !&2dd!!Ė6×sså¦RRR·dd!¶¶¶!]S!¦¶!!cS !AÆÕ Ī&!ĖĪdd!ĦdddĪĪĪdd !&+]+SR¶S+ !=ëcRĖĖ¶ñ !(ĪĪG Ī&!!!ĪĪdd !(SS+ !?RBs!Öæñ !3ĪĪ Ė&!+++!Ė !>»s!!¶!ænnđ !6ĖĖ!!Ė !@hssR Ė&!-M !6ĖĖ !Bhs¶ R&!!ĦM !Xhh ¶&RĻĻ ![ h&'!!ě !Ņ !Ņ !Ņ !Ņ !á",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !Ņ !Ņ !DMŀİ- !^MąĶCs !<$$ !@Ms2×!ë !:Čì!!$ !?Ķ!!2Ħ !5±±±!ČìĦ !C2ö×¥2 !,ÑÑ !(±æBòļĦ!!B !AMsB!!!^M !(ÑMæĶ±MM±±±æ!!!ö!Rs!ĺ!!$ !=ĶöÆ¥!3R2MMđ!$āæ!sĶæĦĦæö!!B!!ÇÇtSR !CĆ!Cĥ2c2!Ö$Ŀ¶Ħ!2 !&2!Ć2!!Ļ!!++!] !Fs2!2!!Ć!!!c!!22!!c2!Ķĥ++ !&P !<t¦!2!!!ĥĦĆĶĶc !*B222!ĶssBöĢĢ!!]Č!PPR !6tttsÆ!ĝ!ÇææĆĶ!s !'2!!!B!!!2ĶBBRR!F!!!] !9t2!s¦!!KĝRææĦ!!!s !&2 !&BBcssRR!d !>t2BĖ¦<ŀMõ!Č3RþĦî!ö¶P!ccc!cBBRRBR!¦dą !>2!2R!!Æ!BRÿĺěs®Þccd!×RRR2¦ÆÆ¶××¦då!R!Ģ!!!ĖĖ !7ĶR2 !&'!!¶Ñ!ă³**Ç!tÛ÷ss2cSddĦĕõĕ2ĵ3!!Ģ!Ė !9R2BB!6ěñ×ß¥»!!!³³ĺFcC!¦¦¦!RBĕĵ3SSS3!!ĺĺĖ!!!Ė !62cB!PĘÁĖ!Ć!!ññf !&µPĪĖĖĆĖĖú''ĺ !&ĺĺ !)ĖĖ !42!!2Ę¿¶¶!¶c!x!ßĢĢĢ Ė&ĪĪĺĪĪ !& ĺ& !?B!!Ė!¥!c!!WÑÁ!ĵ¬9ĵ.. !OC!BĥĶR¤!!!h2kĦös3!co !MbątRC¬¥iĎ'!!hÞĦþÎ!õQrá !MbĔ¤ĥ!Í!Rv!!!hhĦ!ĵæB¶Ć !PA!Ĕ!Ãó !'h'!ķĆsc !QĔ!!v !*'õææª !QĨ!!ó !+''' !R@!v !bó !Ņ !Ņ !Ņ !Ņ !L",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !Ņ !Ņ !Ņ !_Ĭħ !`ĬĖ!ħħ !^ĖĦ'r!ħ !;u !?ĬĬüĦs!!r !9·S¦!ćć !<ĬĦĖĦsdm!!!ħ !6·ĦBRb×ÖÇç !8==dBRsd+!!!r !6·!RRĶĆ!Öõc !7±!!©ddd+ !'r !5B2!Ħæ#Õr!r !.n=áŁ!!!MMĶ!2Ė©++!!ĖĖ !82!æ!1Ĥr !0MĦÆösnnM!Ķ!cRR~÷÷ĖĖ!!ĖĖĖ !5Bæħĕ !'Ė !+ħnĶ!!!ĦĦBÆRcĆ!R~ö!!ħ !;ÖħP !&áŅQđ!!~~~Ĩ5TàĖ2¥öĖĶĶĆĆÆR¶s~Ė!'!!ħ !:R !'ŅSēâ!~~ĆBĆ[å !+ĶĦ!B~^ĖRRd!!!ħ !;Ę!!ŅēvÅRÖĆĆ!æ¥!¯ !,ĦĖRööR!¦!i !<Çą!ĘĘē!!Ě !' c&!!2 !)cĆcssdd!++r!!ħ !8ńd!!ń!vÙĦt!!!cĦĦ¥!!sBBĶ¶R !&ö!Wm+++Ę!!r !;ńńń!!ó:V!ļ!c!B!c¶ď¬RRRcÆs2!Ć!!!á!!!ńĖ!!r !?ń!ÝôŁ!Ć!!Ħ!RĖ!ûRR!R¥c2Ķ!ss!Ĳ!Ė!!ĖĖĖA !Bbc!!!ĦWW¦ĆtËS3tB¥¥Ķ2Ħ¥R!Ė !F×!!!RĆĆB¶á!&×$!ĺc!dBcÆ¥cRCĪ !E&×Ć !'csAAđđ!µĖ!úúĚ7W¥¥¥CĪ !G»û××!sGëA!!RWÃ0 !)777Ī !J»»ĮG!!!dd!đ!!!É !SÉ!Ó¹!!8k!¶æ!!!Ã !KĈEÉ!!!É!Ã!!Ó!!!Óěªª !Oa2Ã!!!æ !.ĸÉ !Nē !&ģ!ĉ !,× !KÉ !,` !,ÃÃ !JÃ !'Ĩ¨ !a¦Ć !^ĸ!Ecģ !^0!ģÃ !¿Ĩ !bt !bē !Ņ !V",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !Ņ !Ņ !Ņ !¥¦¦¦Ç !^¦Ć!!ė×ud× !XÇ!cBRbćĵæć !YBBB2Ķ!ær !0$$$ !IBBĖæ!!r !0$!!!$$$ !Ec!ĖöĵõĤ !8$ !FĶĆ !&Dô !-Ü !*$ !CbĦÆr!!!Dô !-=ĶÚĪ7P !HÇBr!!DDô !-=s2sS;!PP !G¦!!Dôôu!Á!±±± !&=!!sS2 !&PPń !CB!DD !&±Í±!ÖÝÁ^--ĶĶ!'2+!! Ė& !D¤å!!ô!u;Ý¯öÖÆKæĖ!¥!!R!+!!Ė !I¤ôô!u;¼ !&ö!2!!!¥¥s!ĲĲĖ !MÁ!¼CÿöĦÆ!!!2¥ssÝ9 !QĝÕĐ!öĦSĶ!Rcss!j!!9ĬĪ !NÕĐ¶!!Æĕ!sÆÆÆRR !'$ !MÁ!¶Ý!!æ!2!Ć!!!ñ !($$ !JQ¶ !)ĦĦĆö!RĶÚ !)$ !HQēļĐ !(ĶĖĖÖÆĶ2s7G !Q¶!¯!s !*ËS;+PP !SBs!RBĶ!B2¥Ê !&PPPń !IU,!!!ÿI!BÆBR!Ħ¶æRāĲĲ Ė& !I2!Ć!!sö!ĭĖæÖBcB!öBS!Ī !Mc2Ė!!!B,!¬sæÖÆ¥¥BC !PÇcĖ!ssRĥĀ!h·3dCCS2!Ī !O6û!!RtCBĠfBB!ÝÝĪĪĪ !Mĸ!Ù³!!öCĕĥĚĚÓĚĚĚĦ!é !LĨv!¦!¤!!s!ÅöĶ!!!é!ÉÃ¢¢ !L·Æ!ó!0 !&Ć!Ħġ!!¢!Ã !OóO !(ÛsĖĆĖĦġ !Sĸ!ĸ !(ÛRĖĆĖĦāġŁ !P0!0 !)ûs!!Ė!!!n!ŀ !J¨ !/Ûc!!!BÆõŀt !Jã !0»»R!!!ttû !Q%é !*hh'Ëûû !Ræ¢ !a¢!Ĩv !a@ó !F",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !Ņ !Ņ !Ņ !µÇ !]d¦!¦dÇ$ !)$$$ !Pd32¦ĦćPP !()!!!$$$ !LdĦAħķ2P !*ĕ !($ !KBB2rb# !+ö !)$ !J2cBBĦĤ!!Ė !)' !RBBB !-s!PPP!!!P !JRBBÖą!!Ė !(~W !&PPPĖ !JBBöB!!D !)ö!g!!!ĖĖĖ !MĦs!!ô !,=Ñ. !NbC!r !*~-¶c!¶R !PńB!!Ė !'~ö!!æc2 !Ou!uRĘ !(~RĽĽÍ!!Bd!- !Lôuôb!Ę !&~öÂ!!!9½!!õcá^~ !Jô!!ńń !&ö!Å !'9Ĝds¥ÖcÁ !Q~!Ħ2ą !(Ĝs'öRB !Qö!!cĻ !)7!ËWª !Pñ!!ÆStPPP !^& !&PPPń !Z&±āāĢ.Ė !]¶ö!!!ùùÉE !Væ¥ !)pÃģ !S¦s!!æĦĦsC!!!ùÉÉÉU5 !Pĺss!!Böö!B½ppÃÃÃēĳ !Q¥÷æ¶¶ssHÍ!ù!É !MĨ!!!Ĩ !&ŅÍûûh¬Ç!Įp!ÃÙf !K@!!!÷!ĸ!s![MM±Ï!ßc!!!³ă !MÙ!³!0!ë!æ22!2!!G !Rr!!¨ĸ!!s!!Bs¦ßĆ !KÙ !'Ù!@ĸ!Õ·!!ë!cc¦ĦĆĕ !K³ !'³!!0!0ã!!!Ļ!ĆÅąĥ2ā !QĸU !*xcĦĆĦĖ!ā !'= !Jd¥ !+WBBĦĶ2!āāŁ~=c !Jē³ !'E !&WWBB!2!!!scÆ !LE !&ģ !'UĎWBBRBtcÆG !Lģ !,ē³!77!2ú7G !PĸÉ !-77 !S×Ã !8",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !ăĸ !bt !bă !Äĸ !`¦!t!ĸ !]¦Ħds!t !Z¦¦Ħ!R*İă !Y¦BBc2L¤ç !Y¦Ć222B¤¦!!$$ !W¶2RR23¶»$!!$ !UB2B!!2!!$ !Y2!BBBĶÖļ !&s !U2!!!æÅHd !ZBBCC2-ċ !&s !VB!RRsĵ!G !&ô !UABõ!C !'s !XAAĔ+!!Ħss !]ĵÇË!ûû!ŀ !^º!!Ā ![×Å!Ķwê!ú !Yŀ!!¶2¶Bc !^öRĦd !`ĖBcú ![Î!sĶā°Ĭ) !XQ!R!Ħ=ĶR>Ł !Xē!¥!B!¥>!!$ !YĮ!Ös !aB !($ !ZĦı!G !ZUªÞėÝ!Ļ ![ė!ĝ!!ĀĞõG !Zç!{[¥!ē !]¦ĝkĎ!!õG !Zë!:ÆĦĦģ+Pń !Y3ĖJ!ĖĦĖĖ ![ĝ!k !_sK!!!2 !]ë!!!R2 !_Ėök!!¹ !ZÙsĶ!!2!B !Z³Ķ!!!` !^û!!!Ù!B !]BÆR!!p !ZÙ!ĦŅÖ³ !_s !`³!ë !cçæ !aªě !&",
);
// }
// Guard (Attack) {
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !Ņ !«==áā !]ŀnĥĥ¤¥>ı !YŀC¥!×!#¤Öı !7RR !@ŀCRs·st!æµRı !5RĝD !?ŀCRcĦħ·¥!ĕėR !3RRR«ą !?ŀCRc¥·úúç6dÝÜ¬ !*±~~=ġRRR«Ü«Ć !?Á3R¥s¦!!!úĖħÕ¶bu !'±±öĆĆĥÖ!«ìĦBÇst !>ÅĵĆÖd!ú !&1M0Ć¢u!!±=ööåĕĥCc!Çds²^s2 !8ÇR !&ííRĖArı.!!R!µóP!¢o±ö!ĥåRćCRR!^^¦Ĥ!SM !6$Ç¥Du!!RÕ¦«ĽĖĦöĥ.NDĆæĕÓĖ!ĆcĥĥC×2ĦĆcd!!!+!ô+Ĥô !3t·QėrßĠNR!2Õ]åĽĖöÖÕµ!·¥¶!ăÓRĦCCRÖ×µ¦ss!ĤĤĖĖ!ĖĖ !3t!2ĶĠ~RAÅÁ!tÖx]!)!ĖöĦöĬćRõRĖĖB¶Rc!×ħ!·ĦĖĖĖ !9s22ĕÑõåĖÆđå1÷R+ö)!Æs!!Qć!!R!RBcs·R¦Ċúú !;BĶ!BĖĚçS÷ąæđ!ŀ!!löīÆĖ1r¶åBæRcScć·!úĊ !>2RRB!ÇB !&c!¦ÆĦķ!DīÛR!xxxFĊ!c¦úúú !@cB!BRñbĕrd!Ļ!åÆBĕlö!=B¥nnÁÁÁ!ÕåoNoġo!oo !;dt!RS»t¦R#Û¦ķx!ææÆ¿Dīç·RĖæææ!!cĥµÅÖĦNµĦ R&!!RR !3ń!·!HëĖħÇ&!Ö¶n!!¥Ķ¶ö!R!Ė !(BB¤QĆĄb¶Õ!D«ĽRRĽČu !3ĔĔ·!D¬HĚĖ!1İæ!B!!t¿!!!B R&!!s!ttĕĶBĕĖ!!sµ««µC !6Ĕô!!ô!!ĖÑĖ!!B3Çå¥łBĤ×¥cBB!S!sssçBRtc!!²ÇÇsĆÕ !8ôô !)s¶ą!¦×cĤ!Ħ¦c¥¥!!·!Ç¥c¦BsR!!!^^mÖs !@cĶÖ2RRĦÚĖĖR!dddB¥¥ėsd×ćdÇd! Ĥ&ĖmS !>hcĶĦ¶ærrõ²!! Ċ&Ķ Ú'ĊÚsssR Ė'!Ė+Ĥ !>»cBĖĆÖĖtæNN²²İoA !) Ú& !)ĖĖ !?»ûBĦĦĶÕAĕ¤µĆS¤ !Vû¥Böö!ĆĆĦ!¶æû !V»ö¥ĆBöBBµçû !X'»ööÖÛGªĚ ![''' !Ņ !Ņ !Ņ !Ņ !£",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !Ņ !Ņ!!!Tu !`T© !@Ñ±± !5ÁÁÁā R'ļ©s !?ĠµÕµ±. !/ Á&ĆĆööDì«8«æĆ !@B!!tB !,~~āÁĦĦĆµĖĖĦ!!!ÇÖÇÇÆd !?¦C3¥2!ġ !(~~ĆĆ2ĆĖöõ¦ĥĥ!!!t2t2^dĶ !>ŀcĶ!Ć2!×đ~~ćć~ĆĆ!!BĶĦĥ!BÇÇ¥Æ! M&Ĥ^^Ĥ !9¦!!!ScĵĵBBB!¦¶ĆBBĆ!!!R!!!C#öćs¥ !'ôĖĤĤĖ !8¦ !&'¦!÷Ö!BĖctÖCCÖBRR!tc¥¥ÆĖą·dtĤôôô!!ĖĖ !6t·¦ĖėıNR!Ļėbĵd(ĦĖ2·ssæ2!!R!ç¶¥çÇtc¥ĊĖ !<tĖ!BĖ!æĵÁ!ŅĕÇ!ą!Xå2B!!æRRR¶ĺR¦ç¥ÚRÚÚ !?sR2R!ÑõíS×Ü2×!<!½å!Aµ!¶¶/ã_RRÚÚ!Ú !@BsBRc!ĚÎõĕĆ$Å¤!Ċ!!xĺ!!tãã!ĪĦÚÚ !D2!!!B!Ç[tScńdBĆłÕ!Dás!õ¨¨Ú>B²² !DcBBB2!ñbğķµ^R·ħ!°Õ!ª××!!öÅ¨Ċææ²²!² !@BCCCB!»t#Ĥ#ċ !&Rà !&¦!BBĖ!Õ¤rÕ²æ²²² !=Aĥss·ń¥3&!-!ccĊr!B¿!!!õĶ!!2!ĖĖÖĶŅ!rræRRR !;AôôB$7ĚĖ.rġ¦¦!ssRdĢĤĤ3BcB2!ĖĖĶĆæÕöÖõD«ČuR!uR !9ôB!!!Å!!bÅĢ¦¦dc¥!!¥SStt!¥¶Ė¥RæĖ!!!sægČuº«R !9ô!!!Ės!!!ĥcccúÚĖĖÚ B&!cB¶!¥Ė!!t!dÇöægÖBD !=»Ė!B!!ĦÚú !'úúúB_×çć#!Ö¥s!!!2ħÇsRR !?ææ!R !.ÚÚÚĊĊRç···¥Ĥ++M^d!d !?ûĖ2R¦ú !1ĊĊ¥¥¥!ĖĖĖĤĤ+¥ !AËË7ú !4 Ú&!!!ĖĖĖmM !aĖĤĤ !aĖĖ !Ņ !Ņ !Ņ !Ņ !Ê",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !Ņ !Ņ!!!Tu !`T© !@Ñ±± !5ÁÁÁā R'ļ©s !?ĠµÕµ±. !/ Á&ĆĆööDì«8«æĆ !@B!!tB !,~~āÁĦĦĆµĖĖĦ!!!ÇÖÇÇÆd !?¦C3¥2!ġ !(~~ĆĆ2ĆĖöõ¦ĥĥ!!!t2t2^dĶ !>ŀcĶ!Ć2!×đ~~ćć~ĆĆ!!BĶĦĥ!BÇÇ¥Æ! M&Ĥ^^Ĥ !9¦!Ę!ScJĵBBB!¦¶ĆBBĆ!!!R!!!C#öćs¥ !'ôĖĤĤĖ !8¦Ę!ķĉ'¦č÷Ö!BĖctÖCCÖBRR!tc¥¥ÆĖą·dtĤôôô!!ĖĖ !6t·¦ĖŅĉĆĒ¤Íėbĵd(ĦĖ2·ssæ2!!R!ç¶¥çÇtc¥ĊĖ !<tĖ!BĖ¢ĵĒæºĵľľ!ą!Xå2B!!æRRR¶ĺR¦ç¥ÚRÚÚ !?sR2R!ģóēõãĒß×!<!½å!Aµ!¶¶/ã_RRÚÚ!Ú !@BsBRc!æ!'Ã!!Å¤!Ċ!!xĺ!!tãã!ĪĦÚÚ !D2!!!B!¥!Łēc!ÛBĆłÕ!Dás!õ¨¨Ú>B²² !DcBBB2!EvU)EVĢ·ħ!°Õ!ª××!!öÅ¨Ċææ²²!² !@BCCCBé3c¥Ò3³ !&Rà !&¦!BBĖ!Õ¤rÕ²æ²²² !=Aĥss·ńJãççĒ!ccĊr!B¿!!!õĶ!!2!ĖĖÖĶŅ!rræRRR !;AôôB$kĚĖ.łġ¦¦!ssRdĢĤĤ3BcB2!ĖĖĶĆæÕöÖõD«ČuR!uR !9ôBē!!Å!!bÅĢ¦¦dc¥!!¥SStt!¥¶Ė¥RæĖ!!!sægČuº«R !9ô!!!Ės!!!ĥcccúÚĖĖÚ B&!cB¶!¥Ė!!t!dÇöægÖBD !=»Ė!B!!ĦÚú !'úúúB_×çć#!Ö¥s!!!2ħÇsRR !?ææ!R !.ÚÚÚĊĊRç···¥Ĥ++M^d!d !?ûĖ2R¦ú !1ĊĊ¥¥¥!ĖĖĖĤĤ+¥ !AËË7ú !4 Ú&!!!ĖĖĖmM !aĖĤĤ !aĖĖ !Ņ !Ņ !Ņ !Ņ !Ê",
);
// }
enemyFrameOffsets.push(rawImages.length);
// Officer (Main + Death) {
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !Ņ !Ņ !¥·d C. !SdĕŅAĦĦĦRĦR Ħ'Łn±± !NCŅėėC¥¥¥c¶¶ ¥'!åÅR± !LÇA!!RĦ!¥c2sĖR c&YkĝČļ ¦&!ÇtÇÇ !))Y !0ì$$ !)¥d#QŅĦĆæĖ¦dååc!ĶĶ¤Õ¶ Ć(dÆöĆ!)YYYR!)R !0Ü³PÚ$.ā!!Ru·ė3d!!!ĆĦµą!!ĆĖöÖÖĆ! Ķ(Ć2bĖĦR !&YR22 !/¡ô«Łąĵöāġñöõö!ė¦!!!ĶĖĆDDĖÖĦ!!!RBB 2'Q#Q!Ŀ222!2 !2Ć!àæ!ÆÕÖcsÿ#b!Ĥ÷Æ !&Ħ!!Ķ !&B!BBRRR!2ćB3B!222!22 !1cÖ!B!-Ħõĥĕöÿ3Ĥ3!÷S¥2R2!!BB !&B R'Æ¥¥¥Rc !(22- !/Cĵ!R!Ļć!d!!¶Ĥ#ŅĴÕ!ėR22À/! 2&! B(cBcBBd!ğğğĖïğğĤ !2cBĶö !&¶!!ķSöÕ!ėcc¨c¥ R&× B(ĦB¦ĦBs Ė&!!ĖĖĖ !03!!!=Õ!ą!R!!Ņ1ĕÖcÕ!××!¡æ Ħ&µ! Ė(BÕĖBbYYYR!!YYR !/s¶!dCĻBtCS·Ç!!!ķĦR¶b!!Ez! 2&!Ć ö'ÆÖĦöÖ !'RY!!9 !0d!!!Æ·¶Ćö26C !'ĵæŅ !+ Ħ'Ć¥ĖæĆĖ 2&9 !4£¦DP!3shGx6tĥė !(2b!!! B'! B&RæŅQsĆBį22!!B!!2 !/bsöĘńĺh!!ĖĖõS2ć!!!C2BRĤĤB 2&·B R'c3ćBsBI!!2!ğB2 !1pńń !)·!!2ĶcĶĦBcd!! c'ń¥ssRRcsss!cC ğ&!Ėğ2 !;¤!22sc¥¥cĦå··Ć Ħ&DtBB c&¤Ö¶·R Ė'!Ėğğ !;cB!ĶĦĆĆĆBĖB Ć'}ÞþĀÐ A&!AAńĔ !)ĖĖ !;¤¥BĆĦĦĆĆÆÖö Ħ'!¦ÇĖÛ !N¤¥¥ c'¥2 c''ûÛÛ !P¤ÅÅÅååÅå Å( !Ņ !Ņ !Ņ !Ņ !Ņ !>",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !Ņ !Ņ !Ņ !CÇ ×)!!!××× !FĜ!!!ć !*dÖööĖĖ¶¶¶t#Ç¶¶¶Á==ġ !4I !.ĜĢç!t !*dsÆRĦæĦÆÆĦ#t2¶ssĜÌļ« d'· !-Y2 !0å9ĵBÜ~áġá!Rćççćħ¶ĦÆÆæ!!Ħ ö&ĦRĖ Ć'Ö#33· !(Y !23Å3C'Å¶ÆrR!PńÕĖRć3æcÖ!!ĦĦ !'Ķ B'!RĶ2Ħ Y&z!!!2 !/Rs!c!M2ĥB!ñĐĀ×ĆÅrõ!×sÆą°2 s&!cc B'c¥¶Rc !'z!!į !/×tM·!1!Cµ!!S9µĖÖą¶µĖçRñ¹Ķ ö&!B c)Ķ!2 !'ğĦ!Ŀ !/LB !&ÜSBS2ĆĜQCö2!!Æå!·ÜE!cBBB!ĦĶĦĆĆĦ!2Bsc2 Ŀ&!Ķ!)) !/c!yą!gscsç!Ć2ĥB !&öõ!!!R2BBB!ĆÖæĆĆæÆ¶¶¥ÖĶI !&+ !2EdÂBR.ĶcÖcÛÆÇD!!CBR!¶õ!!cccRR!!B !(ĶĦĦĖ!)))!)!!2 !/CcæC!Çws3S!ĵµŅĦ!Ćö!BBÖ!!×scRB!B! 2(R2Ķ2 !)22 !/įB!Rń!¢CĺF!!tĖ!Ħ2RB222!!!tBB2ÇBcBRRBc¥¥BR!!222 !5cR!!ĊĺĪ!ĖĖ÷ĖĦ!¥Ö¶ć÷÷õĤ!!B·BBąc!cBBsRRsR22ğ !(2 !1g!ńĖ !)R2cæcs1Q¤S¦ ĵ&tĠ;ĀðŀccBBB!ccB!222!ĿB !2įēĖ !)ABcĶB2!ĖöĆæ Ć&Ė!¤dÖs¶ B'ĦBcc!ğğğĖĖğğğ !1Ė !+cRB2 B&Ħ2!222BbçcsÆt B&AdddC Ė&!!ĖĖĖ !;A¥R s'RB2¶BBcs÷s÷·Ě A&! ń& !EA¥¥ ÷&ė#ė÷ÖÖć·!Çĺú !PAA Ĕ*bbĔĔúĚ !Ņ !Ņ !Ņ !Ņ !Ņ !<",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !Ņ !Ņ !Ņ !ÝÇ !]üøÇ!ÇĶ !+ ħ' !@YY !0ąìĖR!ŀ !'ħħö¶ĆĆ!T !' C& !D2!dĶcB~!Ġ^İ!ħrråöææÆõT×â¤t Ħ&tdC333C !.Y !02RccRBñĶ!å!!r·ķ!!ĆĆæ¥õshÈĦ !'ĖĦĶĶĶĦddCCt !8L¦ĈN·Cª2Sd!Á!ÆÆ#!!!¥Ćötrr !&įßÆ]22!!ĆĖĦĦĖt Y&!Y !2¶Ė!õRR3Bĥ!ý!1ĆĖ!RR!¥Ħb#S!RRR!2¯Ħ]c2B!Ķs!ĦĖ !&Y!!!B !/fR!!!ĪÆc·×!!÷Ė!!ĖĖæææöĖĖ Ħ&ć!!!Ö!RR2RR!!BBĶ!!B !42÷CńNĦcÆ¶ńĘæĖ2 R'B!!Ħ B&8ç¦ĆĬ!BBs!!BBR!B22!222ğ !/,BĦ!!&¥c!j!ĥ!!2 !(222!!!2!!ÆĬĖc!RRRcBcB !&ğ2 !3w!R!_BSSń!ĦBc! c)¥¥css¥!¬ĬĆĶĶB!RBBcRR!22įIğ2 !3R!!S7ĪĪ!!dBssB s&RRsõ¶¥¥cB!BcBBBcBÇtBR!ğğğ!ïĖğį !12!ńĖĪ!!!ĖĖń··sRBBdd××µ!t C&!!BcccCAńĔcdd Ė&!!ĖĖĖ !0į©Ė !*ĔR··ttRRĔĔĖĖ! R&ń A'ń!!!Ańń !:ğ !, Ĕ) !& Ĕ' !Ņ !Ņ !Ņ !Ņ !Ņ !á",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !Ņ !Ņ !¥tC #(S#S###tĠ== !3I !1E!!ç !*tĖĶ 2)BĦ22cBć!!= !1I!I !/ÜõÜÇĦ !)tĖ!2! B&RcBBRRcs!sös###!###C !*22 !.ìötpĖ2! ±&!!ö!¥¶ÆcccsB!ÆÖÆÆcdÇ÷t¥ss23!22Rt I'!!BB !/c¥öc2MµµµÕ!$!ĶĖ!Rsssc¥c×dd!!ąĬªªÜ!!22c2c!B 2'R2 !0BRcĶçBÖB¦!C$1!B!!ĆĖĖĦ!!µĤĥą!!!ĥ2!!22RR B'222BB!Ŀğğ !.BBB2ĖBĚ»cdĭ!R!!!Ħ!ĶĶĶĦB!!! Ħ&!2!222BBcB222įįįğğ !3Bg!!CBc¶ÖRR!2B2 !'Br!!Ħ !( B(cc22 !823!B!RooĊc!!BR !(Rµ !+BB 2'!B22c !&II !13!!!R!CCo!ńń!B2!!!ccµ!÷ !*dB c'Cd¦¦C!IIIğğIII !.Ŀ!!B!B!!S!!!RBBB2cd×!÷C!!B !&C! C(!R !&ğğğ!!ğğğ !4BB22!!2BBcÇµPĤ÷Ħą!!!BBc¦!!! ĥ'!!!ĥĥ !8Ŀ!!!Ĥ!!Ċ'!!¦¦ÕµPDD÷Ħ !&ĦĦĦĆå!!ĥ !'ĥ!ĥ !(II !3ğ!ńĖĊĊ!!ĖĖPPDDĘµµĦ!!B !*ĥ !)Õ!!! I&!ïII !2OĖ !)ĖĘµµąBBBd×·ĘĘd B&! Ħ*bĦĦĦ ï'!ïïĖ !;ńĖĦBtttRöÕĥ!ĥ B&<~ b)!bbb !Eµc! õ&ĥ!!ĥ!!AAAĪĪ !Q A. !Ņ !Ņ !Ņ !Ņ !Ņ !Ņ !A",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !Ņ !Ņ !¥t #&ccc# c&d !SCöbbbBćććc ħ&!āİİ !OCĶ!ħħħBcBc!RRssķc3¦İ !NĶĶ¥¥ĆæccĆææccssÕČÜiÍSSSC3ctcS !)Ĭ9 !1ĸ¹¹ !)dQbĥĶs¶Ħ2!··ć·Ėæææ!ĦÖ111AQ!Ė!ĖS999Y!YtBY !/üÇbETđđđ!!ħĶ!!ėæĦ!ĶĖöÕ!!ÕæöööĶĦb!!!ėėć2ćBR!!B!Y !2Ĭ!5!Ė!¬úĆÑħ !-C!!ĖĦĶĶĶ!2 ė&R!2cBRRcc!!! B& !/2B!RĖĖĖ·Ö !*BRBss!!!Ķbbb!R!RRRssR!BRRğğĿĿĿ ğ& !.22!Bc!ĥ!!!CC!ć!!2BRBÇC!!!2 !(cRRRĶRc¶Æcd !822!!!C2!!RR!!ė2BBB¦ss!ĤĤB!ćććB!cBBB2!c!!ds I'ĖIII !.3!2B!RR!UB!!2!!BRR¦P!öµ!!scc¶æc R)!Ħds! ï'!ïïï !/2!·B!!B!!BB!2!ĦĶcPDµąĦ!!ĆĦĦöÆĆ!ĆöööĆ!Ć!ąQö I&Y!III !0BB !'c !&Bc¥d!µĆĆĖ!!B 2&ĦĖÖæææÖöööĆĖÕ R&Bz+++ !.B3223BBRò¥ĤĤBBcR·P·ÆĶĶs!!! 2&!Ė! Ķ&ö1!æ!! ğ( !1ğB!BB!ïoBGĖ!cÖ×ćB·æ!!!Ħ!!BcRRRB2 !(ć!!Ķ2 !8ğăº!ô'''!!ĖÕ×s!bæ!RRRc!!!cRBB! 2(!2!B2 !:pğğ !)$öµbĦcsRc¦·DD!Bcssccs c&sc B&III)Ė))II !:µ¤æösÇsBĆÕµöµĦ C'BR c&BcsRBbïïïď!ď!!ï !:¤!ĖŅöąöööĆöµĖĖÕåĥĿĿÐ° µ(Aµµ !)ďï !<åRķö¥Öö Ė&ĆĆĆĖĆĆ¶æĻ !Oås¥ c'BB222ĶĖhÛĻ !QÅÅ å-Õ !Ņ !Ņ !Ņ !Ņ !Ņ !>",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !Ņ !Ņ !Ħ t, !WtĆ ö*Ć333tt !QtĆ!cÆĆĆĆÆÆ¥RRssĦĦtt ×(!××× !EĆ!ĶŅąss¶Ħ¥ėķRĖĥ11ĶĖÖ ¶&õ×ĆÖÖt I&!!III !1ĸļ !)¦!Ķb!!!¶#ėC!!Ć1!!!BĶAbb!!!ĆĵAAR !&RI!!2 !0«ĦĆ$ħÕ!!ħħĆĶb!!ķö÷!ĖÕ !*B!ććbbħĖħħ3! 2&!!!2B !/¼!!ĦĥĆ!b=CC!b!!ķÖ·ĖrQæ!!RććķS¥s3¶¶SSsRRs B(!22B !02!B2!!ĦĶ !(ķÖ·Ė¤Ö11!!Ėbb1ĕĦĦĦ Ć'¶RĖĖB Ė&!ĿĶĖĖ !.ì!2!2Cc!!2!!B!ķ¥·Ė1öQ!ė!!c ć&ĦĖĶ Ė&ĶÅĖŅŅÖ !'Ľ !12!2S2!CBBcRRBħ¥çĖ1QQ!ėsBB!B!!!ĦĦA b&!!Ė!!Ħ 2&!22 !1B!BBR!!RBBBRsç!1Q##ħ!ĆĤĤRRBBB !. B'!ĿĿ22 !.2!Bs>!R!NBĠ!2ćĖĥ!!RR2B2 !&222!!ć !&A!RććB ğ&!!!ĿĿ !.B!Ń!P!!ł2RõĤ×!QĶBd22sÖÖ¦¦Bccc2R!2ėėćħććcBB2 !82BR!ńïsĆæĖĖńr1b1öąąąÅÅõ¶¥ÖĆĖs!ÆÆss¥cR¥!c¶c!!!ĖĖĖ !22!b!!GBÆÆs!ĖĖ!!!1 !'ħbĦĦĖ!ĶÀÀÀ R&¥ R&!ĖĖĖ !4<B!s!!! '&!!õ ħ)3!sħBBBĦĶ¥¥¥ ·'µbµbb !(Ė!Ė !/<!ôĖ !+cB R'sdĦæ ¥&sssÛ ń' !.Ė !1`!!Ė !*å c(!cRĦ c&!hh !QÅ µ'¤bÅ¤ b' !Ņ !Ņ !Ņ !Ņ !Ņ !~",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !Ņ !Ņ !ÚĨ !,çç¦ttt !PÌĖ$ !*ħ!ĆöĆĆĦStt·!! 3&· d'¦!!!ddt !:BĥćÕ!!!$$d!ĆĥQQQ11ĵĵĕR#ĶQQQ2Ħ Ņ&ĥ#ccŅŅ!ĬĬĬI!!ĬĬĬ !0R2!ĦĖQłĠ!!R !-2bbććė !/ttt2zRttt !0Ń¦CBĶ!!dąRs!Ć!! ė(!!ėė22¥¯ďðħćć!bħħ!ćR !') !2üĖ¶RdñđbBÀ!· !( B&ķ!BBBR!tS!ď¥¥ħħR!ħB! B&!ĿBBB !1åB!ËķRååĖB!RėėBB!BcsÖ3sBB2]!BtÇBBcBR¥ss¥ ğ'!ğğğ !/Ń !&>RĶ¦¦ğ!rÖ2!BB¥cB2·s!RRRĶRR¶c¥¥BcĶcRR !92c!ö!ĦBĦc!!ÏC!¥RccsssçńÕ ¥&i¶yRX!!cc¶BBcC !7ļ!µÊRRġ!BĦBGxÖr¥sĦĦĦööõ!! Ħ'IdICCCddt!B !'ĖĖ !4õBń!»R2¶2!Ė!$rsssĦ22!nĲ B'R! R(ĔtttńĖĖĖ!!Ė !3ĦS!ńW!ÛWÛ!!Aõ$rµµÕ¦cCËĪ C'!! Ĕ(!ĔĔĔ !:Bğ!!!Û !(AĔ÷ĘĘ!Prń!! ń'Ĕń !3Ė !0,`A!Ė !-AńńĖĖĖ !QĖ !NĖĖ !Ņ !Ņ !Ņ !Ņ !Ņ !Ņ !Ì",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !Ņ !Ņ !ç #+CC !U¦c b+ĦA##±± !FÙR !*¦ĥ!! ė'ć!ė2ėbböµĠ=S333CtÇCSu R&!!RRR !0ibĘ$ !)¥!!ć B'ÆėcBBķķ!!!ąİ22QAĵĖA1Q!ĽĽĽRRĽĽ) !/ic!!ąµQ!!$$ć·!!! c'¥BÖ c&Ķ··d¥ĶĶėė!ĵ!ė !'IĽ !3s2!B!!Ē=ĥ!d!t!sssćććtŅr ¶&ĖĆRsĬBBB2ħħėRĶI222!+ !1ic!d!C.đµcÀRR!çtĵ¥Ćrr¤Õ!! Ħ&IĜ((!RRRcccssBğBBB!!!22 !.c!tsR!BÇĶĖĖ!ĵÕBççBĆĦĦĖĆ!!!ĦĦĦå!22 B(RB!R! ğ&!R2 !0s!B!RĶĖBcBïæÖĤ!ræ !&c!!d Ħ&!! 2)!2R· !7sBĂs!ń°Ķ!ĦB!<ĥ!õ!ræ!!!Ć!!ą !' 2)RRsdĖ !(ğ2 !2ĤB!ėccÆBBBđ!ö÷!rÆ¥B!ŅÅ! 2&! c)B!öåå !)ğ2 !.B3!ĖĤ!ī!2B2CCC×öö¦÷rµÇÇc!d R&!ĦĦĆĆöööĦĦĶĦĶ !*ğ !/2!R!!ıRcCc666µĦöĖö÷÷PĥćÇą Ħ&!ĖĆĦĦĶĶĶĖĦ!22 !'Ė !1,!!ě!!°xGĺGĖ!D$B!ĆĖöö÷r !* 2)!2BRc Ė'!Ė !1į!°Ė !)ĖQ1cc!BĶĶæ÷tĘ× B&!! 2&RRsµ¤bA !)Ė !1?!!Ė !)ÅcĦ!Æccc¥!ėĥQBBBµÐĐ ¤&bbA !.Ė !<Åå2ĶĖĖĖööôAÅöööĖÛÛ !R µ)!!!µµµ !Ņ !Ņ !Ņ !Ņ !Ņ !Ģ",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !Ņ !Ņ !ª d( !Ztt Ħ&ŅŅc !XtĆĵ A&!!!¦ !VçĆQ!!ėė!3ėė!ÇÇÇç ¦'×·× !@ì$$ !)c¶#!#RRCĆQRBB2!Ħc 2&ĦBsu !>ù³PÚ$.ā!!u$!¥cSR¥¥B!!!BB22!! B'!!öuRIIIļ !8Eĥ×âÕĵö±ġÏŅC!÷s!Ė!ĖQ!R!BB2Bc 2' !'2+2S !9Ć!ńæöÕĖcs#b·ń·s!Ħßð32cC!BB! B'R !&Ŀ!!+ !9cÖ!BġĦąąĕÿ3Ĥ3B·¶ð!2İ¥t!B !JCĵ!R7d!Ć!ĦĤ¦ŅA!tĦĶ!2n!R!dB! Ħ&!BöÅöD!!Ŀ !=cc¥ !(#!b!¶¦Sc!!õĆÕöĆ Ė&Ćæö2ĥö!!!Ė!!III !53!!ñ¤!c!!!åŅ2Rµç¶¥s!ĖöĦĶ2Ė Ħ&ĖĆs2ĦąIIĝ)zI!!2 !4s¶!dGBddSÇ!!ķĖĦĶËËčx&!ĶĦĦĖæ Ć&Ħ! Ħ&!ĖBB !:d!!s·RĆö6C!!ĖĦĖĶĘĤ!!!ĶĶĶ !/222!22 !5d!sĘ!3sÛxxtĥ#!!2!Ķĥ$ !&ĦĖ !)B !'BBB!Ŀ!2 !4âsö!ńĺh!Ė!õd2ĶB!!2 !5B!!ğğğ!Ķ !5ppńń !'¦d!2cR!Bs!B!DĥB2BR¥¥¥cc2ĦB¥cBğğ!!!Ė+ĿĿ !<R!Ķ2!BBc!CĤ!Ħ!sssBR!!Bs¥¥öĆ!! Ė'!ĖĖĖ !<bBRRcRsdC!đđďCCssBcRRR¤¤¤¥!AA !Fµ!2!!CąąĥÖssńń A&¤¤¤!!!¤¤ !Iµ¤BBą!!!Xöû !YbAbbbAb' !Ņ !Ņ !Ņ !Ņ !Ņ !A",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !Ņ !GCCC¦ !]¦C!!ÿ¿ð !Y¦¦Ħc!ÿ!Ė¦n !W¦ĦĆĦĦ!!Ė¦BB !LĜ!!ć !(¦ĖĦ !'R¶cÛ !:I !2ĜĢćt !)ĖĶBccc¥Hç!Û !:ļ !5ĦĵBÜ=áġá¦!!ĦĆöĦB!ËË !:ļ !6B3Cª!æĕæĕ#3Ć¶!öĆçuu !6II!ļ !6RBc!æõĖ!ąñ!ĖtçĖÆ!ĦÕ!uć !-3tSd×IIĕ!ISdtB !2Btø·!}BĥĶĶ!ńÕ¤ĖtçRĆĆöödÇ··× !&·t3BĶ2!!ąĕ!!+!2!į !7ė!2s2ĆĲåĦÕ¤ĖçæĖ !&ĦĦ!Ç·tSöĆ !)dd!9+2įD !5ą!ëSdtC!6dæÆöÕĖt¶åĐ¢ĖR2ĖööĆĦĶ!!Ķ!!R2t!2B!!ğ!Ħ !3c!BRgsĶĶöÛDħ!!ĖöÕĖt!¨cRÖĦöĦĶ!!!22!2R2!Ķ2!įį!!!Ė !2C!ĦC!.ĶÆæd!ĕöR!cĶöĥ!B!¡Ö !(222c!!!2!-įį!!Ė !5į¥BRńÇ÷·dF¦nÕ!!2Ķ!¥!dEz!!! 2'BR!¥ÖB2BĖ!!ĖĖ!ĖĖń !3g2ńĖĊĺ6F!å'Æ!!!ĶR!ÕR!!!cĖB2BRBB!B2Ć·Ķd!ĖĖ !9įÓĖ!!!Ė!!×æ!!B!!!BĦ!!!R!!BB222BRB2cĥ·ńń !<Ė !'Ė×ö!!RÖR¥2ĦBńĤĦc!cR22BBBR¦¦!CRR !FRR!ĦsB2¥B!!Ė2R!sBBBcB·RĥCRń !&Ĝ) !?bB!!!ĦĆs2cr!!ĥR2c! B&d!ĖCRB!!RIISB !AB !'cCĐðMCBRRĦ¦cB!ń!!sBĤ!!!BRcB !@µ!R!2ĶĦĦå!dåį!BBd!AAA!ĔRĤĤ !&2!!į !AR!!ĦRĦĖĆ!!¦¥AAAńń !'ĔĖ !'ğğ2 !BµB!sĦĶĦ2çc!¥ !.ĖĖ !'ğ !CRĶĦBĶ2B(ssx !0Ė !'Ė !Bb¥BĦB22!xx !2 Ė' !Db!BBR¤¤ !] b& !Ņ !Ņ !Ņ !Ņ !Ĩ",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !Ņ !Èļu !ÃļS !b2 !`ļS!Ĥ !Hİİ± !0ļļļR9!!2 !Jć!± !,tttSSSĽ;C22 !Hd#Rc !)SC3#öĖ!!222!BBğ !5Ç !3d!Ì!Rc!!!SC3ĖĦĶs!!ö!ĿĿ!!Ŀğ !1üøÇ!ÇĶ !+$$ħćÇ!!d!RBüĖ«333ĦĶ2Bc!Ė¶Ħ!-!!Ŀ) !5ąìĖR!ŀ !'$T!!CdcÇdRRB!ÆÌ!R!!!2!B!!B!¥¶Ė!!!ĿĖ !22!dĶcB~!Ġ^İ!$ĥµrrÅą·÷sĖ~ĔÆBĦ!! 2&R!!s2B2!ĥ!!!Ė!ĖĖĖ !/2RccRBñĶ!å!RPrÆĥĆÖÆ¤!çs¨cc!!!B22B2!2B2¶sBBĦ!ĖĖ !4L¦ĈN·Cª2Sd!ı!C1ħ!R!ö¤!ç#×B2!c22B2B2BRRĖ!sRbĖ !7¶Ė!õRR3Bĥ!æ!ĥħ!RĖĖ!ĦÕń!!B2c!2RBB22B!2R!!b !9fR!!!ĪÆc·×j!÷!!ĖB!Ė!ĖĘ!!RBBB¿Ï!!BB22B!AA !;2÷CńNĦcÆ¶P!Æ!R!ĦB!Ėöą!!!BBÏĶS,B22BB!ö· !;,BĦ!!&¥c!j !)ĦRĖĖöħ3sÆÆĶ2ĕ!2BcB!!2!· !;w!R!_BSSń!!RsĖRR!Ė!!Ė!!22Rć!!¥Bd!!BĆBRBç !;R!!S7ĪĪ!!!sR¥ĖRR!R!!!Ħ!R2Ççħ!d!C!!ÇBB2B$ !92!ńĖĪ!!!ĖĖĖARBÆ!R¥Ħss!cc2cÛ!!I!!!C!!d !&R !8į©Ė !+bµRBB!¶R!¥22RRd¬GRRR!!C!!BcdR!R !8ğ !.bµµÕµ!!BBÕµbńń!ĔĔĔRR !&CRB !L µ& !+ĔĔRR!CRBĤ!!z!!!9u !SĔĔRsńĤ !&I !YĔĤ !)II2 !WĖĖ !&ĖB+2RĤ !XĖĖ!9+į!2 !]Ėį!!!įğ !ÀĖ !&ĖĖ !] Ė& !Ņ !Ņ !Ņ !Ë",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !ŃI !aI+R !cR !¿III+!!!R !USStRR++ !WtSSS!B!C!!!+ !8E!!ç !+ 3'¦ !(ĠĠĠtSĦ! B&!B÷ !:ÜõÜÇĦ !*3 !'ö 3(!!!< B's!BR !:ìötpĖ2! ±&!!3!RR !&Rc!RRRí×ė!cBR2B!¶RB !' Ė& !2c¥öc2MµµµÕ!!!R!! R&B2¥Rcc!csc!RBB2B!B !&ĖĖ !5BRcĶçBÖB¦!C$tB2c B)22!!!s!sR B&!C!B!ĖĖ !7BBB2ĖBĚ»cdĭ !' B'!!BB¥ccČČ)B!!!BB!BAA !:Bg!!CBc¶ÖRR!!!ĖĶBBBccõÕÕC !(BBB!!ĥA !;23!B!RooĊc!!B!!B!Ħ!!!d !& B& !(AA !<3!!!R!CCo!ńń2B !(BR !.CĦÇÇ !<Ŀ!!B!B!!S !,ctńD !,Cą!BBÇÇ !@BB22!!2BB!2!¦tńDĦ!!R !'C!ą!!BB!Bçç !9Ŀ!!!Ĥ!!Ċ' !&22c÷PńDÕĖ!!Ė!!!CRĥ!BBB!!cBccħ !9ğ!ńĖĊĊ!!Ė!ćć÷÷µńDĘÕĦ !)ĥĖ !'BdBd!CCR !9OĖ !(ĖĤńńńDĘÕąĦ !3CĥC!P!I !A÷ĘĘĘöĥĦ!BB!ĖĖĥ !-R!!!P!!!R!!!RR !;A ĥ&!BdAAń!!AA !&AA!!!C !)+!R!I !> A(ń !)AAAń!!AAA !-I+ !UńĔĥ !*+!!D !UAAń !)DD !YĖĖ!!!DD !^ĖĖ !gôô !]Ėôôô !Ņ !Ņ !Ņ !Ņ !Ì",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !Ņ !Ņ !¨ d'· !Zdd!!!22Ķ·ç !W#ĶR 2'!B!·t !T#!!Bc¶¶ccR!!Rs¦SSÇ d&¦CC·Ç !H2ĖĦæ¶öĶBRç×!ÆĆĶRæ Ė&ĆĦĶ2öSÇ9YY!!!99 !2ĸ¹ !*3!!2æĦĦĆĦĆBBB Ħ'A Q&Ħc2Ė1Ķ¥!!ĿRRRBBu !0üÇbÜTđđ!!!ħ !*Ķ2rĤĤ !,cŅ!Ħ!cXBĶI!ĭĽ2= !0Ĭ!5!Ė!¬úÑÑħ !*2RR!!!2 !& ė'B !&B !'2 !42B!RĖĖĖ·Ö!!!2 !&R!!µ$!!!B!!! B'Ħ!!c#B;!!Ħ) !422!Bc!ĥ!!!CC!!!RR¥RsåDõ!!2RBB¥s c&R¦sBRB!Ŀ+ĿĿ22į !222!!!C2!!RR!!!Ė!ĖBå!µĆ!!¦!R¥cc 2'ĦRĶRBD !&ĿĿ!!ô !/3!2B!RR!UB !'BĶså!¦æĶ!!ĥ!!Ėæ! B&c¥cccrĤ !(Ėô !12!·B!!B!!BBB!B!¥ç!¦ö!2!!!22BĶB 2&dĦC!!D !;BB !'c!!!B!¥çB¦ö2 !'22!!! 2&!2 !=B3223BBRò¥ĤĤR¥¥ç!bö222 !&B222 !'ĵ!ĵ!!Ĥ !(Ė !2ğB!BB!ïoGGĖ!ķçç!¤ö222Bc !&222! Ķ)!!D!!!ĖĖĖ !4ğăºğô'' !&ĤB!¤æ22R¶·C!!! 2&CĶĶĶRĆBĆBAôĖĖĖ !8pğ !)Ė!öÕæR2RĖc¤ASdÖĖĖBBń¤¤¤A¤A¤A !GĖąÖ!ĖĆÖĆ!Ć!Ķ Ħ&ŀĀá !PĦRB !'RR222BBĖ¶Ħ !P¤2RcsscR!22BB22ĶÖË !QµÅBBBcBs2R 2&ËË !Tµµµ¤Õ¤Õ¤ µ& !Ņ !Ņ !Ņ !Ņ !ġ",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !Ņ !Ņ !cuuu !_I!!!uu !VCC9IIR!ěě !VtCCAĦ2!!!B!BĤĤ !@ Ç& !*ÇÇ×!ttC#ĖA!!!222!įBį!!Ĥ !>SöööæÇ× !&¦dĆĆötĵöAb !&Rđ!2!!į !AtĦĦĦĶ¶¥çTTTÇĦŅŅŅĦĵ!b !'ķ!ąĿį!!!Ė !@ĆQQ!¥·tõÕ!!!Ņ !+cħ¥BBĦ !&Ė!Ė !5ĸļ !)dQ!#¶÷RõĆöBB!ć!!ķ !&ķķBcĶRBĶ·!ĖĖ!!!ĖĖ !2«ĦĆ$ħÕ!!ħħĦ!#c÷ĖµÆĆ!!!Bb!3c¶#ķķ!BĦB!!B2¤Ė !8¼!!ĦĥĆ!b=CC!ħc÷õ¤æĖĖ!!!Ħ!!ööĖssBcB2!BBµ¤ !:2!B2!!ĦĶ !&¥÷õÆĥŅĶ!2 !'b!Ķ!2cRRRBµ¤ !;ì!2!2Cc!!2!!¥¥õ¤ĥ!ė2 !,2ĶĶĦ!c¤ !=2!2S2!CBBcRR¥tÆ!ėė2!B !&3ħħB!B!!!ĦÖ· !>B!BBR!!RBBBtõĥ!QsĶĦöÆõõÆöĶĶRB!2!!!R!·· !;2!Bs>!R!NBĠ!!Ć!ėćæĶĶ!B!¥R!ĶĶĆİàsB2!!!R!·I !9B!Ń!P!!ł2RõĤ!ö!! B'2c!RsssBBBÀĶ2B!2!B!!II !82BR!ńïsĆæĖĖõ!ė! c&2c!ĦBRRRmBBB2!B!!B!s2B!II !62!b!!GBÆÆs!Aõss2BBBc!Æ¥ B&!!!iBB!!B!2!!2R!RIII !2<B!s!!! '&!!!åB2BccÕÕb ¤'iii!!B!BcĦBd!ğğ2ğRR !4<!ôĖ !,ÅÅ¤bb !*AAABBCdd!BdPĿ!!Ŀ!ğğ+ !4`!!Ė !;AAńńńCdP !`ńń Ė& !cĖĖ!!!Ė !ÄĖ !`ĖĖ !Ņ !Ņ !Ņ !Ņ !*",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !ŃIIRR !^I!2I!RR !^2ğ !^I!Rį !]II!2Ħ ![II!22BĿ)!!!D !UÇÀ!2BĿğ!ĿĖĖ !UÇÇæÖÀ=ğ!!!Ė !Hccc3 !+ÇÇææsĶÖrD!!Ė!!!Ėô !2Ĩ !,çç¦tt3cė!!Qcc3¦¦!çÇÇöö22ö2BĦÕ !9ÌĖ$ !*ħ!ĆöĆĆQ!2!ħė!!QöÏİĆĦö!!!B2B !&Ė !8BĥćÕ!!!$$t!Ćĥ!!Q !&B2ħėėŀCCÏBR!!R!B2B!CĖ !8R2!ĦĖQłĠRRs !&Q!!ė2ė!B!2RBBR·ÖĖRR!BB22Bń !9Ń¦CBĶ!!dÕ!×!Ć!!!ėė!!¥!BcB!22BB!Ħö!!222B¤ !9üĖ¶RdñđbBÀ !(ė!BB!sĵĕ¥ B'Č2QQöĥĖBB¤ !<åB!ËķRååĖń!Rė!BB!Bcd !'(!Ħ!2ħćQ!Ćö¤ !;Ń !&>RĶ¦¦ğ!rÖ2!BB¥cBP!!ĖĶĶĶļH!!2RħćQĦ¦ħ !:2c!ö!ĦBĦc!!!C!¥Rccsss$!!Ķ!2!B!2BBB2B!!!¶3 !8ļ!µÊRRġ!BĦBG!ĥr¥sĦĦĦöĦõĢĢ!!2!2Ķ !&B2!RBĵ!¦I !8õBń!»R2¶2!Ę!!rsssĦRBCvé!B22!Ķ222!!B!ĖöėQB!II !6ĦS!ńW!ÛWÛ!ńĘ×$rµµÕµrP4ØĆ2!22B!!!2!!C11cķc!2!I!III !1Bğ!!!Û !'ńbÕ×÷Ę$$×d!R!ĆİÕ!!BBB222Ħ3S!B·RB22z2 !1,`A!Ė !,bbAńĔĔbÕ!!R}R±µÅÅBBRBBR!222ńğğBB!!2 !5Ė !3Õ!Lc2c!!!¤¤¤BBRs!BB!!!ğğğBBR !GÕĆĖ!R !( ¤&BBB !(ğğğ !IĖRG !,¤¤¤ !QëËG !0 Ė' !cĖ!!D !ÃĖ !ÆĖô !Ņ !Ņ !Ņ !Ņ !&",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !Ņ !Ņ !G C& !]cc!!A!CC !Yc!!!A!AAÿĠð !Vc!3!R!!!à!ĖÇ~ !Td!!ĵ3!ħ!!!ĖÇ !2 I&R !DėĆBBħħ!ÇsRR !/I!2RR!R !?dŅ!!!RĖąĥĥçĦ2Rü3d !(dSçII!RĿğğ !DėRRBd3!Ë¶ìÌ!Q!dCdttt2Böġ+BĶ !C·R!ćRRB!2R3$ýsB2#!Ħ!ĖöööĶ22ą!į!9 !Dćb!BĖ!!RB!!B22!BR2Ķbb!ĆĆĦĖ!!įį !<ÙR !&××ÆćĶĖĶĶ!ĖcÕ!×!2!2!2RććbbAŅ!tt!!ĖĖ !9ibĘ$!!!P!B¥ĦĆĖ!!B!ĦBBĶĶ !'22ć!!!ĆąĆtĽI!ĖĖ !6ic!!ąµQR!!¦Æc!!!2!22!!ĦĶĶ !&BBBħė!ĵėĦĶ!!II!II$ !4s2!B!!âĀåµCÖ¥R!!B2!ĤĤc2!2!2BB!22Bķėcs 2&!R!!R !2ic!d!C.đµ!ląP·¥cR2!ĶBQ±BBB!RBB! B'¥B!2ĿĿ22!22B !2c!tsR!BÇĖddñ!Ĥ·ç¥¶BB!_sB2BB22!BB !,įĿ!BB !4s!B!R}Ć¥c!öt!Ĥń·t×ccs!Ķ2sc22BB! B&!!!2 !'ğğĤ !2sBĂs!ńėcBr¥!õt×!ĤńBtthhB!ĦĆBRµµ B)RB !=ĤB!ī!2c2ë!Böd÷$Ĥńń!$ B&bb!! µ'22B! Ė&D !5B3!ĖĤ!s!Rt!··Ė!ĦæÕ·×$$õBBbb !+¤¤bb !&ô !62!R!!ásRÖcĦĖ!!BcĦc!ĔĔAAA !6Ė !4,!!y!!°W'GČ !&RBcĦb !<ĖĖ !3į!į$ !'¤!22B!öÆÖt !P?!ĔĖ !'Å!!2!ĖĶ!ĖĠİ- !WÅ!ĦĶ22!ÿSC !YÅÅĶĶ!2!sss !ZÅåRR½¥¥¥ !]µµõhhh !Ņ !Ņ !Ņ !Ģ",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !Ņ !ĩc¦SccS !ZccėĥR!ćĦSS !Wcćė23!ķRĶïïĠM !TC!222!cRBÿĦ2tR !StAėB2BR!Bs!c·RR !&¦SS¦×çħ !HĆ!Q2cBcc¥!×!!Rļ·×·dĖĶ!BĶ!ĆRII!!!II !6ì$$ !(TCĈĈ¥ĆBĖĆC¦){í(!BĦĶ!Ķ!BĶ!!!÷R2IYY!!j !4ù³PÚ$.ā!RuńńRR¦ėĶĶĦå!!!ĥ !&Ħ !+ğB2Ŀ22 !6Eĥ×âÕĵö±ñÏ!ėĖ¤RPõÇ!!ą!!!Ķ!!Ķ!Ħ !,2!!2 !7Ć!ńæöÕĖcs±Qbć¤ĘDPÇ !(ĶĶĦ !&2!ĶĶ!!!ğ2!!!2 !6cÖ!BġĦąąĕĶ^3ĤĖÕöDP¦ !'Ħ!!Ķ!!B2 !)ğ!įį2į !5Cĵ!R7d!Ć!!ĆĤ¦ĖĖÕö!Rd/K!!ĦĆB22BĦĶBB!crD !'įĖ !8cc¥ !&c!!RR!Õ!ńR>c!2RB¥scRsĖ Ħ&!ĦĽĽ99ĖĖRIj !43!!ñ¤!c!2B!åĖææRĘ!Bct!2Rc!RsB2s22BĖ·õ!!Ħ2RI9 !5s¶!dGBddS!×!!22RĆąDĤÝi!!!ĶĖ!ĖĶ !&Ħ!BĦ22 !;d!!s·RĆöÛċC!!ĦĶĦĆö !*Ħ! Ķ'!2!!BB2!!2 !5d!sĘ!3sÛxx÷æĥ# !&Bą !/Ķ!2!!!ğ!B!!B!2 !3âsö!ńĺh!Ė÷rõd2 !'Ħ !'222 !.ğğğ!!!2 !3ppńń !'A¦d!2!RRcĦcD!Ħ! B' 2&BĶ!ĶĦB !&Ė!įįį !<µ2ĖĦ !&cCĦôĔ! B(ÅcccBĶ2ct Ė&!ïĖĖĖ !=ĦBRBc¥¦!åµÇÇĆ A'b!bbbÅR!AĔ !Få!!BĶĆąB!ĖĶĠÐÁñ !+¤¤ !Iå B&!!!ĦĦĖR !WÅĦĦĦ!ĦĶRB!BR !WÅÅB!!RcsÜixx !X b* !Ņ !Ņ !Ņ !Ņ !ã",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !Ņ !ªCCððð !ZCCC!!BRÇM !XC!c!!ï!Ssc !JĜ!!ć !*¦C!!!c!!!¥ĶÛ !IĜĢćt !*¦Ć!BcBBcýý!Û !LĦĵBÜ=áġá!¦R¶sRöĆĦåÅÅÛ !MB3Cªcæĕæ!ĕçç¶¶ÖĖĦ¦×u !+¦¦dd#¦ !>RBc!æÅĖ!ąġĢ!ĖCC×CsĦ2Õućć×3·S##ææĆĆRBÇ !<Btø·!}2ĥĶĶ!µńÕµÕ¤ĖçæĖĆödæÆ!ĦĖ !)ĖĶ !Aė!2s2Ħ!ĲåæÆöÕĖt¶!Đ¢ !.2!R !>ą!ëSdtCĦc6·Ö!ĖöÕĖtc¨cĦ222R !&R!!2!tR !;c!BRgsĶĶ¥Ħ»!æĦQcĦöÕ!C!¡cBcB! 2&!2 !?C!ĦC!.ĶÆæĦÆ!ķćĦ!2Ķ2ö!!EzĆB2!ssR¥sR¶¶!2B!R !9į¥BRńÇ÷¦t÷W!nÕĦė !&¤!!!BĖĆĖĶĶ!ĖBcBĖRB !&9I !7g2ńĖĊĺĺ6F!!'Æ!B !'R!î¿L!Ħ!ĶĶĶöööĦĶĶÕ!!RB!R!!ĬY !2įÓĖ !&Ė!!×æ!!!ĦRĶB!![!då<2!!ĶĶĶĖĖĦĆöC·D!Ŀ2!!!2ą !3Ė !(Ė×ö!!2BsRcĦRńµ!!¦!!!2 !'ĶĦ!!Ħb!)Ŀ!!ļ!3 !;b!RR22Ė22¥B3jçc!¥22 !)B2 !&Ŀ)ĭY!CB !<B!BĶĶ!Ħ2c¥!B(ssČB22RRB2B!!BB !)CĶ2 !<µBĶĦĶĦ!!Æ!B2ĦļĬ2!22B22BB¶ĖBĶ !&2R22BĿ !=åBBĶ!ĦĦB!22BB22B!B22BBB!RĦR2s!!2įĦĶ2 !?ÕRB2R!ĆR2!Bb¤22!µBRRRBRs!22C!!ğ!RBB$ !?ÅõRĶĶc!!Bb!!¤¤¤! ¤'b!R!cP!D!!ğBğĖ !AÅåR2Bc¤ !/¤¤¤AĖĖôĖD!ŁĖń !C¤µµb !8ôĖô !Ņ !Ņ !Ņ !Ņ !Ņ !k",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !Ņ !Ņ !Ņ !Ytt !@Ç !>CCCöĆd !:üøÇ!ÇĶ !+$$ħćÇ !(×ĠĠ!!3C3ĶĦĦ2Ķ!t !;ąìĖR!ŀ !'$T!!C·÷ħç!Ē¤×l!2M3!ĶĶĶ!2s!ĦB !92!dĶcB~!Ġ^İ!$ĥµrrÅÕõt×TÙcĦ!22ĕ°22ccBRBB!!Ç !82RccRBñĶ!å!RPrÆĥĆÖÆ¥b!!ė×æ«¦!tļĶĶĖ!!!Ė !.ļY !.L¦ĈN·Cª2Sd!ı!C1ħ!R!!Ėb!!ħQėČ9Ö!22!ĖĦĆĆBB!!R !)C !0¶Ė!õRR3Bĥ!æ!ĥħ!R Ė&sńħQ!BR¥ì! 2& !&Ėæė !)ļ!2 !/fR!!!ĪÆc·×j!÷!!!BR!!sdQ!!2!!2B22B2B!ĶĖR!ĕ3×ļ !'B !12÷CńNĦcÆ¶P!Æ!RĖĦĖRRQĦ !&RB!R!ĶĦĶ!!RĶĶ!!!2!ļY!ļC!2 !/,BĦ!!&¥c!j !*ĖĖ!Ė!!#!Ķ!!!Rccc B&R2!BBSCBzC2!ğ !0w!R!_BSSń!!RsĖRR22BėAė#!BR!!!BBRBcBBR!Bc!d2B!!2B2 !2R!!S7ĪĪ!!!sR¥BRcB2R#!!R¥!22! 2'RBBRcBR!BBğğ !42!ńĖĪ!!!ĖĖĖARBR!2RBBs¥Rs!RB !'22RRBR222R !&B22 !1į©Ė !+bµRBB!RRµÕÕb!!! B+RBRRBńğğ!Iį !4ğ !.bµµÕµµ !& b&A b(AbABBd !&ŁĖğğ !WA¼x!!!Dô!ĖĖĖ !ZDĖô !]ï!Dô !`ïô !Ņ !Ņ !Ņ !Ņ !Ē",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !Ņ !Ņ !© c'33Ġ=ā !GE!!ç !+3cc3ėėė##cRÍ¶ !GÜõÜÇĦ !*3!ėħ2 B'2BB¶!· !DìötpĖ2! ±&!!3!22!2 !&2RR2Ĭ(!×tt C&·· !+9Y !1c¥öc2MµµµÕ!!!B22BRsssBsRss!!B!!!2ĶĶĶæöSÇ !(9!!Y !/BRcĶçBÖB¦!C$tBBRscBBccõµµC!Ħ!22B!2R22!ĶĶöçĬĬu !'2 !/BBB2ĖBĚ»cdĭ !&ĶĶBB!!d !&Ħ!Ħ!c22BBcR2!R2!SSċYRĥB2 !1Bg!!CBc¶ÖRR!!!B!Ħ!!BR !(BBC! 2&RR¥!sc !&I]Ŀįį !/23!B!RooĊc!!B !(ctńD !*B 2'!!B!CBBB !53!!!R!CCo!ńń2B !'tń!Ħ!!! B&!B 2'!B!!R Ŀ&ğ !3Ŀ!!B!B!!S !)2!¦ń!$Ė !*B 2&Bcs2Rń !>BB22!!2BB2c÷P!Dõ!!!R!!CCR! c&Bs!BB !:Ŀ!!!Ĥ!!Ċ' !&sc·ńDDÕ !&Ė!!ĥĥĖ!ĦĦ!CtĦ!c !)D !4ğ!ńĖĊĊ!!Ė!ćć··ńDöÕ!Ħ !-B!!Ė!trr !'D!ĖĖĖ !2OĖ !(ĖĤńńBDöĥĦĦ!R !+B!AńńĦ !(DD !@×ĘĘööąĦ!BBĖ$$!!ĦĦĦ!!AA!!!¤ĔĖĖ!!D!!!ô !>bĥĥąą!BdttRĖĖ!CbbbńA !+ĖĖ!!!ô !@AABBB!ĥĖĖĖ!!ĥń !2ôôô !CAAA!!ĥ!!ńńA !ZAAAńń !Ņ !Ņ !Ņ !Ņ !Ņ !è",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !Ņ !Ņ !¦ccC#ccc C'-- !RC#ħħBBććć B'Xcİ !PCĶR¥cBRcBc!22RRRBÇ !PĶĶ1ĶBBRcĆææccsssyH×·S##ctC·jjj!!!ļ9 !4ĸ¹¹ !)dQb!ĕąöĖ2!··ć·Ėæææ!ĦÖĖ!B3Ć!ħĖįįjju¡^u !2üÇbETđđđ!!ħĶ!!!ėėĦ!ĖöÕ!!Õæööö!ĦsccBc!sċR!ĭ!- !5Ĭ!5!Ė!¬úĆÑħ !&ė!!B!!!C!!ĖĦĶĶĶ!22BRc2B!!!ĭ !92B!RĖĖĖ·Ö !*BRBss!!!Ķbbb!BBB22B!RRį22!Ĥ !522!Bc!ĥ!!!CC!ć!!2BRBÇC!!!2 !&RB !'sĶ-!BB !822!!!C2!!RR!!ė2BBB¦ssöĤĤB!ćććdB!!2Rdc!µ9!ĶĶĖěě!ô !13!2B!RR!UB!!2!!BRR¦P!öą!!scc¶æ!!B2ĶĆÅĆ!!ÀÀďď!ğğô !32!·B!!B!!BB!2!ĦĶcPDµąĦ!!ĆĦĦöÆ!ĆĆĖĦĦĦööææĦ I&!!III !1BB !'c !&Bc¥·!µĆĆĖ!!B 2&ĥĦĶĶĆĆĆ!BĆĆĦ !&II !2B3223BBRò¥ĤĤBBcç×ń·ÆĶĶs!!! 2&!!ĖĖ!!!Ķ2!!2RRBB22BRR !/ğB!BB!ïoBGĖ!cÖ×sĦ·æ!!!Ħ!!BcRRR!2!!!22 !)22BB2 !2ğăº!ô'''!!ĖÕ×sö¤æ!B2Rc!!!cRBB!2BBB22B2Bc2 ğ(!!ğ !1pğğ !)$!öÕĦBBB¥¦·DD!Bcss!cR B&!!R !*ğğ) !;µ1¤ösçÆcĆÕµöµĦ C'BRRBBBc22BĶ!!!ĖĖ99D !<¤!ĖŅöąöööĆöµĖĖÕåĥ[[A¤µ Å&µÅÅµĖĖĖ!!ÿÿôď !<åRķö¥ÖöĖĖĖ!ĦĦĦĖĆRR !Qås¥ c'B !'ŀRÛ !RÅÅ å( Õ'ªª !Ņ !Ņ !Ņ !Ņ !Ņ !=",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !Ņ !Ņ !ĩÇÇÇ !]Ç¦tĖĖĖ¦¦ !YSöĖ222ĶBBÇ!!!ÇÇ× !.ļu !CtĦĦĦööĦÆc÷÷Ç¦dĆąõ× !,ļCĤuu !AĆQQ!2Ææ··!!!ĦŅŅ!!!×× !)ļ !'u !6ĸļ !)d !&¥·tõÕ!!!Ņ !)×¦¦ !(2!Ĥ!!u !4«ĦĆ$ħÕ!!ħħĦQ!#¶÷RõĆöBB!ć !&öĦĦĦ22ddd·ÁÁĕČ!ĤĤĤļļ !1¼!!ĦĥĆ!b=CC!!#c÷ĖµÆĆ!!!Bb!3St!Ė æ&ĖŅĶĕĕĕ!!Č!ČČCCR !02!B2!!ĦĶ !&ħc÷õ¤æĖĖ!!!Ħ!!öĕõc! Q& !(CCC!CC22 !0ì!2!2Cc!!2!!!¥÷õÆĥŅĶ!2 !'b!!!2 !*ķ3BBB! 2& !02!2S2!CBBcRR¥¥õ¤ĥ!ė22 !- ė&!!Rć!!Ŀ!!!22!Ŀ !1B!BBR!!RBBBctÆ!ėėRRB !&ħħħ#3!! B'!B !&ĿĿ!ĿĿĿ !12!Bs>!R!NBĠ!·õĥ!QRĦĆĆær!!!BR2!2! B&ĶėĖ2!R !8B!Ń!P!!ł2RõĤ!Ć!ėćĆ Ħ&¶õĦc B&!! 2&cBĆcs2 !&Ė!!!Ė !02BR!ńïsĆæĖĖõö!!B !(2ææ!222RcRRBBBs¶R2s Ė& !52!b!!GBÆÆs!A!ė!Rs!RR!ĶBRRĖĦ !&22 B'ÅµA !'Ė!Ė !0<B!s!!! '&!!õss!!sĖB !(ĖĖÅbµ ¤) !+Ė !2<!ôĖ !+åBRRRÆRÆÆcBBĖ!!~ !F`!!Ė !+ Å*2R!sB!B~ !ZÅÅRR!mBB !]ÅÅm!!Ë !_ªªª !Ņ !Ņ !Ņ !Ņ !à",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !Ņ !Ņ !_II !cjR !^I!B2!R !5Ĩ !,çç¦ttt !( 3&t d(!!!Cd]B2ğ!!!ĬĬĬ !0ÌĖ$ !*ħ!ĆöĆĆĦStt·!3 !'ĖĖĆĆŅŅd¦cAĦ!ĦĖĽĽ!Rddd !1BĥćÕ!!!$$d!Ćĥ!!Q11ĵĵĕRcBQQQ2R2BBħħĆB!ħB!M !&Ľ222 !0R2!ĦĖQłĠ!!R !&Q !(2Ć1ķħħ!! B'bĖė!!!Ĥ!22!+ !3Ń¦CBĶ!!dąRs!Ć!! ė'!!ķ!!Ħ2!2 !(ķĵ!22B!2 !&BBB !/üĖ¶RdñđbBÀ!· !(BBBė!!BėĶĦR2 B)dÆcBB!BBB!!ğğğ !1åB!ËķRååĖB!Rė!BB!Bc!CĦ!B2cß¯RBBB22RĶ!BB!!ğğğ !4Ń !&>RĶ¦¦ğ!rÖ2!BB¥cBÆ¥!cBRBtt|2 !(22RB !&Ė !32c!ö!ĦBĦc!!ÏC!¥RccsssçµA2R2Đ!!ķ2BBRB2B!B!B!!ĖĖ!Ė !1ļ!µÊRRġ!BĦBGxÖr¥sĦĦĦööõ!!¥BRcRæ !'RRRBBBAĖĖ !7õBń!»R2¶2!Ė!$rsssĦ22!nĲ!BBcs!Ĭ B&!ĦĆĖĆA !)Ė !2ĦS!ńW!ÛWÛ!!Aõ$rµµÕ¦cCËĪCBB((ČĦĖĖĖööĦ22¤ !;Bğ!!!Û !(AĔ÷ĘĘ!Prń!!ńAbbb¤¤!22RB22B !,ĖĖ !.,`A!Ė !-AńńĖĖĖ !,µ¤ĦĶ2RBb !?Ė !>Åµ¤bb !Ņ !Ņ !Ņ !Ņ !Ņ !Ņ !v",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !Ņ !Ņ !«CC3 !9999 !Cc3ĶA2d !499R9!!!T !@33!QQ!!Ħ !.3ÇCçTR!!!;B!!B !?3!Q!#!!A!d !) #&ĶĦĦ¥Ė!BB)!ĿB!ě !>3QQ!!c !)S¦CC#!!!B!æRcåD !(B2 !=#Q!!ė#!C!!!Ħd·!!!Ħ !&22c!!Ė!BBBI !@ç2ćė#R!2Ħ !(c!2 R'22!2B2ö!!!ğ!B !?ĶbRB!RĦRķ!ÿÿßR!2ccR B'!B2B!ğğğ!!ğ !=$¦ÆćĶ!s!ĦĖcà!!!ĀRBBB2BBB2BRB2B !)BĿ !4ÙR !'P!B¥ĦĆÖĦ!B!!ĖĖĖ !'222!2B22c!R !(ğ !4ibĘ$!!!R!P¦Æc!!!2!2!ÇÇÇR!!2!222B 2&Ħ×ń !)Ė !2ic!!ąµQ~M!¦sCÖ¥R!!B2çĦ¥¥8!!! 2*BBĤ!!!ĖĖĖ !6s2!B!!·ÕMåbP·¥cR2!ĶHGë8!Ķ!B !*Ħ!Ę !(ĖĖ !2ic!d!C.đµ!Õ±å!Ĥ·ç¥¶BB!Q±ĶĶ22! B&ĶĶĦĶĦĦĥ!!Ė !7c!tsR!BÇĖddĦnt!Ĥń·t×cc_sĶ2Bc! Ħ&222Ķ !>s!B!R}Ć¥c!¥Æõt×!ĤńBtts!BĶĦĦĖĶĶ !&2BB!Ħ!Ė !8sBĂs!ńėcBr¥dd!Böd÷$Ĥńńhh !) Ķ' !AĤB!ī!2c26ĺ!Õ!ĦæÕ·×$!!B!Ķ !+Ķ!!!Ė !9B3!ĖĤ!s!Rt!t··t2!!Ħc!ÕĖĖbµµbµµ Ķ& !'B !;2!R!!ásRÖcÅĦĶ22s¥cĦĦĦ !* Å&ĶĶĶĦ!A !:,!!y!!°W'GG!Å!22B!ĆĖ!!ć !- Å&¤ !<į!į$ !*µBBBĦĶ!ĀðĠá !L?!ĔĖ !*bbĦĦ!!ö!ĖĖ !Zb¤!!!Ć !_µµĻöss !`hhh !Ņ !Ņ !Ņ !Ņ !@",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !Ņ !Ņ !Cddc 3&~~ !XdŅ!dRRR,ĆĖ~ !WĖ#!Ħ¥BB!æ!R !Vd!ĖĖ2!BBČÆÖR !VĖ!!!ĖæÅÅAċhh!!!Ç¦¦tt !&¦dç !?ì$$ !&×CCķķB!d×ç$u$ħçtöĖĶ!ĦtSC3öRĶçç !<ù³PÚ$.āRćńńRRçćBöĦåösCöĦĦĦ!ĆĦĆĦĶ!¥ĖĆĦĶRYYY!!YYY !3Eĥ×âÕĵö^Ï!ėĖ1RPĕ¥Ħ!ą!RBĶĶĶ !)ĆĶĶĖĶ!ĶĶĶIRĶĶĶ !4Ć!ńæöÕĖcŁàÕ31ĘDÕc!!!B2 !.Ķ !)Ľ!!2 !4cÖ!BġĦąąĕĶćĤ!böDÕ !&B2RR!B !)2!!! 2'!22 !4Cĵ!R7d!Ć!!Ĥ¦BsÕĦ!×d/KcR!!cRRRB!! 2'! 2( !9cc¥ !(ĖææÕ!ńR>c!RRc!BBBRR!ĖcB2R! į'22 !63!!ñ¤!c!2!å!ĖR¶MĀþĦt!ĶBRsc R&ÆÆĦRs× !&ĖĖį-- !4s¶!dGBddS!!Sö!!!Õ!!ÕBĦ!!ĦĆd R&!!c¦×Ĥ)!))R!Ėôô !5d!!s·RĆ'iCĕ¥2!R!···!!222ĶąĦĦĖĶĶĶBĥ !&Ŀ !9d!sĘ!3sċx$tĥ#Ņ¥Ķ!d!!!û!2 !(2 !)Ŀ !;įsö!ńĺhĖ÷ńń31ķRsB7!!H!!!222 !&2BB !Apńń !&Ad3Ħ!2ååĆ!üĬ !)B !'BBC !GRĶ2ėŅ!!Ķ !&ABccBB! B'ĦCsĤ Ė&ďĖ !@¤c!Bėėė1ėBc!!AAAbbA b&!BąôĖ !GÕsBRRR#QĦĦ !.bbb !JÅõ c&d¶BÅ !Z Å) !Ņ !Ņ !Ņ !Ņ !Ņ !B",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !Ņ !ìİ^ !<IY !BCİ2cÁ !:9Ķ !BCL2Ç !=2 !4Ĝ!!ć !*¦Çc!!Æ!Ë !/cCd¦! I&!I !5ĜĢćt !)Ç¦ĆĖB8ÇÆ!ĀĀĀ !*##cćB!Ħ¦ Ķ&Y 2& !4ĦĵBÜ=áġáħ¥ÆĆĆÖĦËËbccc !'###!b!!ĦĦ!!222!B!!!2 !4B3Cªcæĕærtt!ĖĖķd!c !'#t#!bbbćć!!B !'2!!22ğ !3RBc!æÅĖ!ąñ!µĆĆt!ķħ !&3#b!!b!ćć!!R22!B R&!ĿĿį !3Btø·!}2ĥĶĶ!ńĶĆĆµĖ!tĭi9js2!!!ćć!!!b!R!¥! ğ'!!!Ė !7ė!2s2ĦĲå¥öærÕ!t !-2s31ĶRĦc !&Ė !9ą!ëSdtCĦ6·¥öĖĶÖr !&Ħ2ħ2!!2BR!!ķs !'ĖĖ!ĖĖĖ !4c!BRgsĶĶ¥Ħ!ææÖQ!öĖr!!ĦcBĶö¥RBR2BBc!BB!ĖĖ !9C!ĦC!.ĶÆæĦû!ĵ!ĵ!!!öö!!!ĆB¥ÆBsB2B22Õ¤!¤b !;į¥BRńÇ÷¦dě!_¦cć!!!¥1!!!BĖĆĖ2!RBÕÅÅ!!¤ !>g2ńĖĊĺFF!!'öb!ķĶsĖ!ė!!2!!Ė !&× !CįÓĖ!!!Ė!!×Ė!!R21ĵ!!Q !'2!ĶĦĦĖ× !CĖ !'Ė×ö!!ķ1Ņ!ėĦķ!QB!BB !(Ħ·× !Hb!!!Ħ!ėėQQ1 !&222!2 !'Ħ× !HÕ!Ķ!!QQćėė!#c!!2B! 2&!!!RćT !GąB!ėėėB2BCc!RR2!2!B22!!2!!õR !GõsRRRccRB!BB22Bc 2&R2B !&Y !GåąBR22åÅÅ¤b!2sĆ!B22B2!!B!!Ŀ !IåÕÕÕ !'¤¤AccdcBd2BB!C!!RY!YY !PAAń!B!BB!!R !&R !UAAńB!!Cń !^A!tR !`AĔń !&Ŀ!ĿĿ !YĖĖ !iĖ ![ Ė( !Ņ !Ņ !Ņ !č",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !Ņ !eIu !a2 !aI !c2 !`I!!Ĥ !YIIIzY22 !IĠĠŀ !.tCC!!2ĦB222 !GĠSSt !,CCĖ!!22!!ğ22ğ !5Ç !4W8 !*CCC!!R!!!ĿĿ!!ğğ !1üøÇ!ÇĶ !+$$ħćÇ!!!«!!8 !'dC!!B!!BR!Ł!!Ŀ) !5ąìĖR!ŀ !'$T!!C·÷ħçc!ėB2!c¦dd!!!B!R!!2sĖ!!!ĿĖ !22!dĶcB~!Ġ^İ!$ĥµrrÅÕõ !&QB!3¦cB!!2RBBR¥B2!ĥ!!!Ė!ĖĖĖ !/2RccRBñĶ!å!RPrÆĥĆÖÆ¥tå3ħ#!2R¶¶!ĖR!!!B!!sBBĦ!ĖĖ !4L¦ĈN·Cª2Sd!ı!C12QBŅŅ0!ĵBBB2BBB!!æĦĆ !'sRbĖ !7¶Ė!õRR3Bĥ!æ!ĥ2!ķ1 !&#B!Ķ 2&!BB!!öĖ22!!b !9fR!!!ĪÆc·×j!÷!ėĦ!!ė!ėĖĦ22!222!!!RR!ĆÆĆAA !;2÷CńNĦcÆ¶P!ÆėB!ė#R#!R22¥!2BBR B&R!!Ć3 !;,BĦ!!&¥c!j !&2Rc!Ķ!BĶR÷!B2!!RBĶĦĦ!R!!!3 !;w!R!_BSSń!!RsĖ2Ķ!BĶ2R÷ń!!!BB!2cRRRBc!!¥ç !;R!!S7ĪĪ!!!sR¥2RBBRsÆń!!ĦĶ!!! B'Rcc¥B!ć !92!ńĖĪ!!!ĖĖĖARBRBcRR2 !'222B!!2 !'s2BdR !8į©Ė !+bsR2!B2BCĘĘĦ!!BB!BB! 2&s !'R !8ğ !-AbccBcBĥĥńb¤B!!!b!BBB!BcBcdR !HAA!!!AA!!!bbbA!bb!!Bd!!!RB!!R !&9 !BAAA !.bbbń!!tBĤ !() !VC·ńĤ !&Y!!2 !VńĤ !(Ħj)!^ !VĖĖ !&ĭBį2BĤ !XĖĖ!!BĿ!BĿ !^Ŀ!!Ŀ !]Ė !hĖĖ ![ Ė' !Ņ !Ņ !Ņ !Ë",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !Ņ !īdcddd¦± !XcccŅ!!BB!8 !V3c!!ėėėB!!B !JE!!ç !*cQ!ėħBBB!BB!Å !HÜõÜÇĦ !)3!ėħ22BRRBÅÅÅ !6Y !3ìötpĖ2! ±&!!!ķB2BRRB¥Å!!ć×ÇÇÇ·×tt !-IĶj !3c¥öc2MµµµÕ!3!ĦRscBBc!RRRBĦĶĶ2BĆ!ĦSSt !+2!z !1BRcĶçBÖB¦!C$!!cĖĶ2B!!d!!!C!!!2Ķ!!B22ĦSS¦çYYzz22 !3BBB2ĖBĚ»cdĭ!c!!RĶĶĶ!BP !*2!B22!BB!Ķö°ĿğğB22Ł !2Bg!!CBc¶ÖRRBB !'ct!D!!!2!2B!B!2BB!!RcB¦!IIğğğ !223!B!RooĊc !(2!2tń!Ħ!!!22 !& 2&BĦ2ĦRx)Ħ !63!!!R!CCo!ńń2B!2!B¦ń!$ !&BB2!! 2&B2R2!BĦ!2!II!!Yj !/Ŀ!!B!B!!S !'B2s×P!$Ė !&B22!! 2'c2!Rd!2!ğğğĖċĶ !6BB22!!2BRc·ń!$Ėĥ!!!R2B!!!2 !&B!c!!Ķ!2I!!R2!2 !0Ŀ!!!Ĥ!!Ċ' !&×·ń!$Ėĥ !&Ė!2¦d· B'!B !'Ė!I)!!R !2ğ!ńĖĊĊ!!Ė!ććńńD$Ėĥ!Ħ !(ĥĥĥdBbbbA2!¦!2Ķ!!ĖB!+ğ- !2OĖ !)Ĥń!DĦĖĥĦĦB !& 2'!A !&¤bńńďď2!!ğ!TT !;Ė×ĘĘöĖĥĦ!BCĖĖĖ !(ń !-ďï!TT !? ĥ&!BdtRń!!ń 1' !0R!!!ää !;bĦ!ĦĦCC!!!TTTıı !4ïäää !>bĦ!!ąĥĥĖĖ!ĶĦC !Vbb!!ĦĦĥĥĖĦĶļ !Xbb!!ĦĦ ĥ&7 !Y b& A& !Ņ !Ņ !Ņ !Ņ !Ņ !@",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !Ņ !Ņ !HC#· !ZC #&Ħ!öCCC !VCAbb!!!B !&CC==Á !PCAćķė222!! B&ŀ!s !QA! R'2c!RR22¶Ė!Bçddd !Aĸ¹¹ !)d!!ĖĶccc¶ÆSħħ÷RRÖR(BcBBÇddÇ !<üÇbETđđđ!!ħĶ!ć2ĦĖ!!ĶĆÕ!!Õ!Č(ĬĦ!2BBĦcBĦÇzYYY !6Ĭ!5!Ė!¬úĆÑħ!!ć !&Ė!!!C!!Ė Ħ&ĶB222R2cRB!BB!zYYz !32B!RĖĖĖ·Ö !)Ħ!ĦBcs!!! ö&!!! 2&B2Bğğğ!!!B !322!Bc!ĥ!!!CC !*Bt!!!2ĶQQQB !(B!B!!!ĿğĿĦĦIu !122!!!C2!!RR!!2 !&Rd!öĤĤB!##dsæĦĦĦĖĶÖĖ¶C¦!)!)ĦĶR!u !/3!2B!RR!UB!!2!!22BB·sBą!!scĆĦBæĖöööæĆæĦöĆ!ĽĦ!Ħ !52!·B!!B!!BB!2!BRR×P!µĦ!!æĆ!!Æ!ĦĖĖĖ !ABB !'c !'ĦĶcPDµĖĦ !(Ħ !&2 !&2!!!B!222Ħ !1B3223BBRò¥ĤĤBBBc¥·!µĆĶc!!! B&!!RRB!2 B&!B2I+2!B' !0ğB!BB!ïoBGĖ!cÖÖç×B·ö!!Ħ!!B!!B!! B&cBR2BB2įįğ!ĿĿ!ğĤ !0ğăº!ô'''!!ĖÕµ×sörĖ2!Bc!!!RR!R!R 2&Ħc!sB!Ę!!ĖĖĖğ!Ė !1pğğ !)$!öµÅĦ2!¥¦·DDcBB2Bc B(!B!R¤ńĖĖ!!!ĖĖ !<Ĕ×ÕĖBBccöÕrµµĦ R&Ħ B&ÅÅ ¤& !FbRR!!ĦĖ22B!bb ¤'b¤¤¤ !MbbBBBRBBbb !Z b( !Ņ !Ņ !Ņ !Ņ !Ņ !§",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !Ņ !Ņ !ÅI u& !AS3ScSSS !<u !>t3Ħ!1ķ222tt~ !2YY !CSĆRRsC2BBB22s± !/IIĿ!!ěĻ !?tĦQŅĖĦĦs R&BR8Ç× !+¦Y!!!2!!2'Ĥ !=ĆQ!!2!!RRµµĶöiæąæ× !(¦Cæ!!!Ľį2B!!!Ĥ !;d!!!ėRsæ··TTĖĶAA!RĶÇ!!tSCæ !(9ĿįïĦ !4ĸļ !)ĦQ!ħcR·tõÕ!!!A!!ķB!ĖS#öĖ!!2!!22!!I!!ď !3«ĦĆ$ħÕ!!ħħ!!ħcRÇRõĆöBB!ć!3cĖÆöĖ!!!R!BR]!2BįğĖ!!ĖĖ !0¼!!ĦĥĆ!b=CC!!Bc÷!õÆÖ!!!Bb!öĕ !(B!RBBBðįį!Ė !52!B2!!ĦĶ !'sc!ĥsĥ1!!!Ħ!!B !&BBR!BBöB!ö×!Ė !5ì!2!2Cc!!2!!!CstõÆ1 !.B22BRöR¥R2sd)R !52!2S2!CBBcRR!RtõÆĥ!!ķ2ĤĤ!!!2!RsRBB!!¥2cB¦CW2!YYY !3B!BBR!!RBBB¥sõ¤ĥ!ėķ2 !&ħ!!# !'2B22ĦBPPĿį!222 !22!Bs>!R!NBĠ!ctÆ!ėėRRB !'ćĶ2ĖcBBRRB2Bcr !'įį2 !2B!Ń!P!!ł2RõĤ·õĥ!QRĦĆB!!!RRRĦ!!!RB22RcB !&9 !&ğ !32BR!ńïsĆæĖĖ!Ć!ė!ŅAĦææ!!!BR¥BBR!2scBAĦĦ999 !92!b!!GBÆÆs!õö!!ć!!bAĶė#!222!R!¤¤AAA!bb ÿ&ĖĽ !5<B!s!!! '&!A!ė!!ć!!ć!R!ööÕÕÕ¤b !2Ė !3<!ôĖ !*õsss!ć!!BRBBB~ !3ğ !7`!!Ė !*åBRÆÆ3!!!2!!B~ !3ĖĖ !B Å&RÆs!!2mBB !YÅÅÅBB]!!Ë !]ÅÅªªª !Ņ !Ņ !Ņ !Ņ !â",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !ÃIIjz !^92B2!RR ![2!2 !_IĶ2!ğğ !ZI9Ķ!Ħğ !ZçI!BBBR) !YSÖÀ2!BĿğĿĖ !VS·Ė!Ö=Ŀğ!!Ė!Ė !SSS1Ė¶Ė!rD !I Ç' !)ççSS11!!ĖRBĦÕ!!Ė!!!ĖĖ !2Ĩ !,¦ççtĖĖ222×Ç!3SctÖÖ11!ėėŅŅB !&Ė !7ÌĖ$ !*¦c!¶ĵĵĵæĆ2223Q!!!11!ėħQ2!322!CĖ !9BĥćÕ!!!$$dÆ!åQ!!ėR2ĆÕåQ!Ħ!ĶććħQAķRS2!BBń !9R2!ĦĖQłĠ!!R!Ć!!ė!QĥĦ!÷!!!Q!2!2AħķBB!!BB¤ !:Ń¦CBĶ!!dąRs!Ć!ėQ!!!Ņĥ¥# !&Ħ¥RķRRB!!BB¤ !:üĖ¶RdñđbBÀ!· !,Ņ!ķė!ėBB!BB2!2!!¤ !=åB!ËķRååĖB!R!!ėėė !&Ħ!Bė2Ė!RB222!BB !<Ń !&>RĶ¦¦ĥ!rRė!BBBėħė!B!BR22!22!2BBĖæ¦ħ !:2c!ö!ĦBĦc!ŀ!¦¥2!BB!Bc!ė!2R2BB22BB2!Ħ22B¶t !8ļ!µÊRRġ!BĦBGĤĆr¶¥BBÖ¥ĖBcR2ĖRB222!!!B22!!!2dj !8õBń!»R2¶2!ĖÖ$sB!!ö2¶B!!22c!2!!BBBĶ22BĖ2Ħc!YY !6ĦS!ńW!ÛWÛ!!AõtsRRRcc÷2!!ŀĐRR !'22!!2!!c!22z!Yjz !1Bğ!!!Û !(AĔ!ÕÕÕrrńåŀŀ!!<cĦĶĦĦĶĶ2BR2B¥·222!R2 !1,`A!Ė !-A Ė' !&R!!AÅµĦĶĶĦĶ!!RB!ń ğ&!22 !5Ė !4ëRRRh!!!Åµ¤ĶĦĶ!!!B !(ğğğ !H»hh !)Åµ¤ĦĶB !`Åµbb !c Ė' !cĖ!!D !ÃĖ !ÆĖô !Ņ !Ņ !Ņ !Ņ !g",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !Ņ !ÿ 9&YRR !]22B!)!R !Y9BBBĶĿ!) !WtR9!ĦĦįR!!2I !Td3ĵ·=RRBĽğ!!2 !TdŅs!æµıįįB!!2 !HcCC !)ddcŅ!ĥ!!ĶĖ!!į!Ė2ğğ !CcccħAAC!!!S¦SŅŅ!ė##3B2ą!!ĖĖ!ï !Ccc!ħ!!!ħ!dÇd!ĖRħħħ2!BRB!Ħ !(ĖĖ !@3 !&ħ!ħA!ĦBBcc!2 B& !(Ė !EçĶ!!!A!BA!!!ĦR222cBBcBR B&Ė !E$¦sć !&R!!ĶsĶ22!22RB!22 !CÙR !'P!ssķ!ħ !+2B2!2B2!!Bbb !>ibĘ$!!!R!P¦RBCssĶķ!!Ħ!!22B222!!!Bb !?ic!!ąµQ~M!!sÇRĆöĦ!2 !.BBb !As2!B!!·ÕM!APė¥R!!c !,BBĦĦ××× !=ic!d!C.đµ!Õ!R!Ĥ¥cR2!!ďÏ¯!Ķ B&!Ħ!!2!!ć×T !:c!tsR!BÇĖddnÕ!!·sB!!à!!!Ā2B!ĦĦĦ !&22!2!zz !9s!B!R}Ć¥c!¥đ!÷Ĥr÷¶B!ĖĖĖ!ĶĆö Ķ&!!!ĶĶĦ!ĖĶĶzz!zzz !2sBĂs!ńėcBr¥dd¦Ć×!Ĥt×tÇÇÇR !)ĶĶ!Ķ!!!ĥĶĶĦĦRĶĦĦ !5ĤB!ī!2c26ĺsĶöd÷ńBI¥¥¥8!2 !)Ħ!2!!ĆB2 !'2z !1B3!ĖĤ!s!Rt!t·ĆĶĶ2æ·ÕµX»»¤!!B !(22Ķ!!!ğ2B2!22!Ķ !22!R!!ásRÖcÅ!Ķ!B!cBĆĦ !&µrrµĶĶĶ !)c!ğğ !7,!!y!!°W'GG!¤µcBBĦĦ<İĠ !)ÅÅÅĶĶĶ!2!!C!!!į!ğ22 !3į!į$ !+b¤¤¤!Ö!Ė !,ÅÅÅĶĶ22R !&Ė!ğ!2 !3?!ĔĖ !.¤!Ć !0ÅµrrĔ Ė&!Ė!ğ !Eû¶s !<ğ !Ehh !:Ė !cĖĖ !Ņ !Ņ !Ņ !Ņ !&",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !Ņ !ĩc¦SccS !ZccėĥR!ćĦSS !Wcćė23!ķRĶïïĠM !TC!222!cRBÿĦ2tR !StAėB2BR!Bs!c·RRç××¦¦¦!!!dd !HĆ!Q2cBcc¥!×!!R(ĶĦ!ĦĦĆCCCĦ!×çć !;ì$$ !(TCĈĈ¥ĆBĖĆC¦īXí(!!Ķ!!!BBB!Rs!ĶĦYYR!!IIY !2ù³PÚ$.ā!RuńńRR¦ėĶĶĦå!!!ĥ!!!Ķ!B 2&R !'ĶĶĽRR !5Eĥ×âÕĵö±ñÏ!ėĖ¤RPõÇ!!ą!!!ĶĶĦ!!! 2(Ķ!!!222I !7Ć!ńæöÕĖcs±Qbć¤ĘDPÇ!!DD!!ĶĦB!2 !(B!!!2B2!!!2Ŀ !3cÖ!BġĦąąĕĶ^3ĤĖÕöDP¦ !'Ħ!!s B(c!22Bįğįğ!2B !4Cĵ!R7d!Ć!!ĆĤ¦ĖĖÕö!Rd/K!!ccs!2 B'ccBB !(B !8cc¥ !&c!!RR!Õ!ńR>c!2ĖĖÖæĦĦĦĶcĆĆCBBd !&Ėğğ !53!!ñ¤!c!2B!åĖææRĘ!BctĦö!ĶRĦĆĆĆösĖBĥ·iG9!!Ė!ĖĖĖ !3s¶!dGBddS!×!!22RĆąDĤ»FĦĦ!ĦĶĶ!ĦĦĦ!RĆĦĦM2Ħ99jR !7d!!s·RĆöÛċC!!ĦĶĦĆö !(Ķ!!ĦĶĶĶB2!!Ė!!22įį !6d!sĘ!3sÛxx÷æĥ# !&Bą !&B!!!ĦĶ !'2Ħ!!!2 !9âsö!ńĺh!Ė÷rõd2 !'Ħ !&R22!2B !+22ğ !8ppńń !'A¦d!2!RRcĦcD!!Bs!sBB2RR!ĦB!BR!įğ !Cµ2ĖĦ !&cCĦĖĖBBsB!ÆssR!!ĖR!B!! Ė' !@ĦBRBc¥¦!åµÇÇĆAb¤µAµµÕĵcĖbbôôĖ !Eå!!BĶĆąB!ĖĶĠÐÁñ !)Õĕ !Kå B&!!!ĦĦĖR !WÅĦĦĦ!ĦĶRB!BR !WÅÅB!!RcsÜixx !X b* !Ņ !Ņ !Ņ !Ņ !ã",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !Ņ !ªCCððð !ZCCC!!BRÇM !XC!c!!ï!Ssc !JĜ!!ć !*¦C!!!c!!!¥ĶÛ !IĜĢćt !*¦Ć!BcBBcýý!Û !LĦĵBÜ=áġá!¦R¶sRöĆĦåÅÅÛ !MB3Cªcæĕæ!ĕçç¶¶ÖĖĦ¦×u !MRBc!æÅĖ!ąġĢ!ĖCC×CsĦ2Õućć×××· !&33Sd¦ !<Btø·!}2ĥĶĶ!µńÕµÕ¤ĖçæĖĆödöĦĦĦ2tt33 !&2Ç !@ė!2s2Ħ!ĲåæÆöÕĖt¶!Đ¢ĶĦĦ!ĆĆĆ !*ć !=ą!ëSdtCĦc6·Ö!ĖöÕĖtc¨cĦĖĶæĖ !,ĦY !:c!BRgsĶĶ¥Ħ»!æĦQcĦöÕ!C!¡cĶ !+2R!!!B !(RR !1C!ĦC!.ĶÆæĦÆ!ķćĦ!2Ķ2ö!!EzĆ !)B!¥Ė!2Bc!Y !&9ĭ !2į¥BRńÇ÷¦t÷W!nÕĦė !&¤!!!B !'BBB!¶ÆBB!!!ĿYY!9BB !3g2ńĖĊĺĺ6F!!'Æ!B !'R!î¿m!¥BcBBBÆ!R2!ctğIĿ!RB !5įÓĖ !&Ė!!×æ!!!ĦRĶB!![!då,ĦcBRRR2ĦBBctń!ğ!!!Ŀ !6Ė !(Ė×ö!!2BsRcĦRńµ!!¦!c22 B'CÜrń !&Ŀ!!ĿĿ !<b!RR22Ė22¥B3jçc!¥2cB!B!BC!!I !&I9ĭĭ9 !>B!BĶĶ!Ħ2c¥!B(ss8 B(CńńïĦ)I !&B!Ķ !>µBĶĦĶĦ!!Æ!B2Ħļļ!!!BB!Ań!!!ďĿğ!!!į!B!!Ė !=åBBĶ!ĦĦB!22BB¤!!Ħ!AA !()I!!ğ!22B !@ÕRB2R!ĆR2!Bb!bbbA !+Ħ !&įįğĖ !@ÅõRĶĶc!!Bb !0ď!II!!!ĖĖ !CÅåR2Bc¤ !2ďïïĖĖĖ !G¤µµb !Ņ !Ņ !Ņ !Ņ !Ņ !¦",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !Ņ !Ņ !Ņ !zÇ !?CC3S· !:üøÇ!ÇĶ !+$$ħćÇ !(×ĠĠ!!!CCCĶĶBR!Ç !;ąìĖR!ŀ !'$T!!C·÷ħç!Ē¤×l!2M3C!ĶĶ!!R2Ė2Ç !*jj !.2!dĶcB~!Ġ^İ!$ĥµrrÅÕõt×TÙcĦ!22ĕ°ĶĶBBB!2ĖB!!ħ !72RccRBñĶ!å!RPrÆĥĆÖÆ¥b!!ė×æ«¦!tļ2B!22!B!ĦĖ!r !)22 !.L¦ĈN·Cª2Sd!ı!C1ħ!R!!Ėb!!ħQėČ9Ö!!BB2!¥R!Rc !*j !1¶Ė!õRR3Bĥ!æ!ĥħ!R Ė&sńħQ!BR¥ì!2B!!2BBRĆĆc!R !'2 !1fR!!!ĪÆc·×j!÷!!!BR!!sdQ!ė2!!2B!2BBBsĦ2c¥d!!zzz!Y !32÷CńNĦcÆ¶P!Æ!RĖĦĖRRQĦ !&RB!Rs!BBB!dcsdP!Ľ!!!zB!ğ !0,BĦ!!&¥c!j !*ĖĖ!Ė!ėR!Ķ!!!BcsssC!ddP!Ľ+Ė! ğ&!ğ !0w!R!_BSSń!!RsĖRR22BėAėR!BR!!!c!CCCĵĵPP!!+!+!II!I !3R!!S7ĪĪ!!!sR¥BRcB2R#!!R¥!22!!dĵĵĵ!3ć !)ĖĖĽĶ !22!ńĖĪ!!!ĖĖĖARBR!2RBBs¥Rs!RB!!C! 3&!1Ė!!!9I !&Ħ !2į©Ė !+bµRBB!RRµÕÕb!!!BB ń) !'2ğ!BBB2 !3ğ !.bµµÕµµ !& b&A !+Ė!!ğ!!įį2B !^ğ!!ğïĖĖ !^ĖĖ !ZĖ!!ĖĖĖ !^ĖĖ !Ņ !Ņ !Ņ !Ņ !Ē",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !Ņ !Ņ !© c'33Ġ=ā !' 3&d !=E!!ç !+3cc3ėėė##cRÍ¶!!!333Bc!c2d !;ÜõÜÇĦ !*3!ėħ2 B'2BB¶!·3!!BRĆcĖĖ2× !9ìötpĖ2! ±&!!3!22!2 !&2RR2Ĭ(!!!B2!cĖccc !;c¥öc2MµµµÕ!!!B22BRsssBsRss!!BssRR2Ķc!RsçRR !7BRcĶçBÖB¦!C$tBBRscBBccõµµC!ĆĖ!B22!2!!Rstń!!R !6BBB2ĖBĚ»cdĭ !&ĶĶBB!!d !&Ħ!22B2BBBc2!tń !*RR !1Bg!!CBc¶ÖRR!!!B!Ħ!!BR !' B'2RBcBRń !' R&!!R !/23!B!RooĊc!!B !(ctńD!!! 2&BBB!BdR !=3!!!R!CCo!ńń2B !'tń!Ħ!!! 2&!B!B!!B !+DDD !1Ŀ!!B!B!!S !)2!¦ń!$Ė !)C!B!S2StĘ !'DD !:BB22!!2BB2c÷P!Dõ!!!R!!CCR2CC !'$!!DD !7Ŀ!!!Ĥ!!Ċ' !&sc·ńDDÕ !&Ė!!ĥĥĦC!!ĶĶĶ!2 !*ĤĤ !3ğ!ńĖĊĊ!!Ė!ćć··ńDöÕ!Ħ !*ĥ !(Ķĥ!Ę !&ĤĤ !6OĖ !(ĖĤńńBDöĥĦĦ!R!!!ĶĶ!!Ķ! ĵ(!ĔńćåĤĤ !A×ĘĘööąĦ!BBĖ$$!!!ĶĶ!Ĵ 1)!!11 Ė' !>bĥĥąą!BdttRĖĖ!SQQQA !3ĖĖĖ !<AABBB!ĥĖĖĖ!!ĥń !VAAA!!ĥ!!ńńA !ZAAAńń !Ņ !Ņ !Ņ !Ņ !Ņ !è",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !Ņ !Ņ !¦ccC#ccc C'-- !RC#ħħBBććć B'Xcİ !PCĶR¥cBRcBc!22RRRBÇ !(¦¦·· !FĶĶ1ĶBBRcĆææccsssyH¦d C&ææ2!ħ I&!IIu !2ĸ¹¹ !)dQb!ĕąöĖ2!··ć·ĖæææĖĦĆ Ħ&!¥ÆĶæ-B2!R!2īY !0üÇbETđđđ!!ħĶ!!!ėėĦ!ĖöÕ!!Õæööö!! B(R!!2Ė!2!!+BB !0Ĭ!5!Ė!¬úĆÑħ !&ė!!B!!!C!!ĖĦĶĶĶ!B c'R!s22!22B!!ğ!Ŀ !02B!RĖĖĖ·Ö !*BRBss!!!ĶbbbB 2(BRB!B!ğğ2!!!ğ !022!Bc!ĥ!!!CC!ć!!2BRBÇC!!!2 !'R B(!22!R!!ğ !522!!!C2!!RR!!ė2BBB¦ssöĤĤB!ćććBB R'!BccBń!!!Ė!!!Ė !/3!2B!RR!UB!!2!!BRR¦P!öą!!scc¶æ¦ B(R!ddCĘĖĖĖ!ĖĖĖ !12!·B!!B!!BB!2!ĦĶcPDµąĦ!!ĆRR!Ė!ĦĦ!!ĦĆĦæÕ!PPjj!jju !3BB !'c !&Bc¥·!µĆĆĖ!!B 2&ĥ!!ĦĦ!!cBsP!!įįRį-!u !0B3223BBRò¥ĤĤBBcç×ń·ÆĶĶs!!! 2& !'dcC !<ğB!BB!ïoBGĖ!cÖ×sĦ·æ!!!Ħ!!B 2& !*B !<ğăº!ô'''!!ĖÕ×sö¤æ!B2Rc!!! B&!!!BB !Apğğ !)$!öÕĦBBB¥¦·DD! B&!BB !'B !Gµ1¤ösçÆcĆÕµöµĦ C' !&ĥAĥ!!÷!!!Ė!!ĤĤô !<¤!ĖŅöąöööĆöµĖĖÕåĥ[[ A'! A&ĖĖĖ! Ė& !>åRķö¥ÖöĖĖĖ!ĦĦĦĖĆRR !Qås¥ c'B !'ŀRÛ !RÅÅ å( Õ'ªª !Ņ !Ņ !Ņ !Ņ !Ņ !=",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !Ņ !Ņ !ĩÇÇÇ !]Ç¦tĖĖĖ¦¦ !YSöĖ222ĶBBÇ!!!ÇÇ× !4RRI !<tĦĦĦööĦÆc÷÷Ç¦dĆąõ×···¦¦Ç!Çdd!RI R&!!+ !<ĆQQ!2Ææ··!!!ĦŅŅ!!ÖöööĆĆædæ!!RĽMDD !7ĸļ !)d !&¥·tõÕ!!!Ņ !&s !)c!¥ !'D !5«ĦĆ$ħÕ!!ħħĦQ!#¶÷RõĆöBB!ć !' B(c!ÆÌ!!ě !7¼!!ĦĥĆ!b=CC!!#c÷ĖµÆĆ!!!Bb!3StBs B&sBR«!!!BĻ!!D !32!B2!!ĦĶ !&ħc÷õ¤æĖĖ!!!Ħ!!öĦĦĶĦ2Bcc2Ćö !&22Ĥ!!D !1ì!2!2Cc!!2!!!¥÷õÆĥŅĶ!2 !'bĵĕĖæĦĦĦBĆöB!!Ľ+ğ!I !&Ė !/2!2S2!CBBcRR¥¥õ¤ĥ!ė22 !+2!!!ĦĆö !&29IğğĤ !4B!BBR!!RBBBctÆ!ėėRRB !&ħħħ#32B !*2!!ğĖ!!ĤĤĖ !02!Bs>!R!NBĠ!·õĥ!QRĦĆĆær!!!BR2!2B!!2!RRĦ°ĿB2Ė!ĖĖ !3B!Ń!P!!ł2RõĤ!Ć!ėćĆ Ħ&¶õĦc B&2BB2!!!R!2·°ğ !&ĖĖ !22BR!ńïsĆæĖĖõö!!B !(2ææ!222RB 2&RĖRæ!!Ė !82!b!!GBÆÆs!A!ė!Rs!RR!ĶBRRĖĦ !&B22ö!!ĖRBb !8<B!s!!! '&!!õss!!sĖB !(ĖĖc!RB22BB!¥sb !:<!ôĖ !+åBRRRÆRÆÆcBBĖ!!àb!!BBc2ÆBb !<`!!Ė !+ Å*2R!sB!B~bbb!BB!b !RÅÅRR!mBB!!! b& !UÅÅm!!Ë !_ªªª !Ņ !Ņ !Ņ !Ņ !à",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !Ņ !ŁII !`I!!YR !b9R ![I2+222!!YY !2Ĩ !,çç¦ttt !( 3&t !+×!!IĿ2!!R!!Y !0ÌĖ$ !*ħ!ĆöĆĆĦStt·!3 !'3× ·'××Ü !&ğğ!!BBB !1BĥćÕ!!!$$d!Ćĥ!!Q11ĵĵĕRcBQQQ2Ķ¶ÖĖ!!BöÜ!2Bğ !8R2!ĦĖQłĠ!!R !&Q !(2Ć1ķħħ !&ĖÖ!æĆ22Bğ !(ğ !2Ń¦CBĶ!!dąRs!Ć!! ė'!!ķ!!Ħ2!2cBB2B!!!ŀĿğ !*ğğ !/üĖ¶RdñđbBÀ!· !(BBBė!!BėĶĦR22R22ĶÖ¶!Ħd !<åB!ËķRååĖB!Rė!BB!Bc!CĦ!B2cß¯22BB!2Ħ¶!Ć¦ !'Ė !3Ń !&>RĶ¦¦ğ!rÖ2!BB¥cBÆ¥!cBRBttÏ2BB!B!æ¥c!÷!!ĖĖ!Ė !22c!ö!ĦBĦc!!ÏC!¥RccsssçµA2R2Đ!!ķB2Ć¶Ħ!!!RsAĖĖ !5ļ!µÊRRġ!BĦBGxÖr¥sĦĦĦööõ!!¥BRcRæ!!2¥2c!cRBA !)Ė !2õBń!»R2¶2!Ė!$rsssĦ22!nĲ!BBcs!ĬRR22cB¶BB !;ĦS!ńW!ÛWÛ!!Aõ$rµµÕ¦cCËĪCBB(((!!!BBRB!B !,ĖĖ !0Bğ!!!Û !(AĔ÷ĘĘ!Prń!!ńAbbbAbBB !&B!A !9,`A!Ė !-AńńĖĖĖ !,AA B&!A !?Ė !> A' !Ņ !Ņ !Ņ !Ņ !Ņ !Ņ !v",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !Ņ !Ņ !«CC3 !2 9&z !Hc3ĶA2d !1;;!!Ħzz !D33!QQ!!Ħ !/99ĭ);B!Ħ!R !B3!Q!#!!A!d !'¦¦ !&·!BB!!ĿBB !C3QQ!!c !)S3CĦĦttÇcæŀÐBĿ!!ğğğ !A#Q!!ė#!C!!!Ħd·Ħc!ĦĦööąSQ!¶° !Fç2ćė#R!2Ħ !*ĦĦĦ!!!Ħ!csĖ !)R !?ĶbRB!RĦRķ!ÿÿßR!2 !(ĖħR!RĘ !)R !<$¦ÆćĶ!s!ĦĖcà!!!ĀÖ !)ĦR !AÙR !'P!B¥ĦĆÖĦ!B!!ĖĖĖ!!!B2!!!ć!!!2BP !<ibĘ$!!!R!P¦Æc!!!2!2!ÇÇÇR!RBR c&BR2!!×D !:ic!!ąµQ~M!¦sCÖ¥R!!B2çĦ¥¥8!! B(¥2!sĦBĤ !;s2!B!!·ÕMåbP·¥cR2!ĶHGëy!!2 R(!!R !)Ė !5ic!d!C.đµ!Õ±å!Ĥ·ç¥¶BB!Q± !&RsR22RcRB!B!!!ĖĖ!Ė !4c!tsR!BÇĖddĦnt!Ĥń·t×cc_sĦ!BcB!BccBBB!!CCĖĖ !&ĖĖ !3s!B!R}Ć¥c!¥Æõt×!ĤńBtts!!!ĦĆĆC !*ńń !:sBĂs!ńėcBr¥dd!Böd÷$Ĥńńhh !, A& !?ĤB!ī!2c26ĺ!Õ!ĦæÕ·×$ !+AAA !@B3!ĖĤ!s!Rt!t··t2!!Ħc!ÕĖĖb ¤&ńA !D2!R!!ásRÖcÅĦĶ22s¥cĦĦĦ !L,!!y!!°W'GG!Å!22B!ĆĖ!!ć !Lį!į$ !*µBBBĦĶ!ĀðĠá !L?!ĔĖ !*bbĦĦ!!ö!ĖĖ !Zb¤!!!Ć !_µµĻöss !`hhh !Ņ !Ņ !Ņ !Ņ !@",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !Ņ !î~~ !_S~!!~ ![##!!!ëë !ZC¥R!Ĝ !-d### !McĦĖRRĕë !)dd#Ć!!sÇ !K3C¥!!R !)d#ĆĆ !'ĆÇ !IcQĥĥ1!Ė××!!!ddĆ!!!22!2!2ĦR !<Ę!RRR !(c !'ĆĆĖ2RudĆ !'2c2cö!!!R !:ø´R!!ðn !&u4ÇC !'B÷DĵĖ!Ć!BBB!Ķ2Ķ¥!B !=d!nð!õÀĠMćö!×ķÇC!!¥¥!ÕRĶB!B!RRR!Ħ!¥Rõ!!R!!RR !5Bc!Ø÷ĦĦ¥t!dbĴŅĦ×ķ¦!Ħı/ÆĖcB¥cR!BBRæ¥Bõ !&RR !8d!RÆ!B!!!Ï3SBbµ!÷¥B¨c!ĖĖ!ö!RR2BB!Õr !Aa$vĦ!!ą!ĤąĕĕÅµµÇ2!¡ !'æĆĦĦ22¤SS÷÷ !<B !&T×ÇĦCëC!!ćħÆ!s·Ez !(ĦĆĆÆædö!ÆÆ÷D !<ĘcBNĖĦ2!!B!!s!Ħ¥µs!!B !'ĦĦĦĶĖĖR!!!ÆÕ)))!Ė!!YR !1td!tÈĘ!!¥¶!ąd!!ĦABs !)B !&ĶĶ!!Ħ!!2ö !&RYY!9 !1ă!!F_TººR×!dæ!!Rķ!!µ!!!BB!2 !-Ķ 2&9 !7ăd«jÂ!tËF÷æĶ!!ĖĦĖ¥Ė!!B22!R B&22 !(Bį22!!B!!2 !3ăOń7t!ĖĖR!c#!c!c!RĤĤ¦BBBĶ¥BBBRR!22!!!BI!!2!ğB2 !5`Ė !)ĖĖcsÆcsdĘ!Pcc!!Ħc B&sĆs!2RC ğ&!!ğ2 !@ĦĶ!!ĦåńĖ!¦!cc¥c Æ'Ė¤Æ¶·R Ė&!!!ğï !>cĶĦ22¤¤!!Ėń¤¤¤bb A(!AAńĔ !& Ė& !<ĵ!cĆ¿Ħ¤¤ !]Ć!!cĠ !]ĵ!!!|tM !]ĵ!Yt!R~ !]ĵĵĬR!cá !^ĵëc!ª !`ªª !Ņ !Ņ !Ņ !Ņ !D",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !Ņ !ĪĠ !aĠėt !_Ġ¦Bā· !]c¦¶d!B ![c!!¦!!R !=)Y !@XQûûb !2cc!! Y&RYYR !>c!!ĕXĦb !2c!#tÇmĖ !'22 !?ėėĶ!Çd !-SSSc!!ĦĖĆ!R!2!2 !?Ç!!!RĦĦĶcdd×!!!ç3tSS111 !'ĦĦĿ22!22 !AQBcĦĶĶR!2R××¶cĦ11 !+Ć!2!!!22- !4¨$$$!!!u¥d#ć!ĖĶ!Ķ!RÕ×öÆĶĶ1 !*B!!¥!!ğĖïğğĤ !35ēÚ,ÿ$!R!·ėR!æöĖĶ!!sDĆĖĶ !-Ć¶¥c!ğĖ!!ĖĖĖ !3s«;C¸ÿ^Āöõöħ!!!ĦĖĦĶ×!Ć !+ėėėć!!BdĖĖ !8øåà¡ă0ÆĶt¿RP!t !&22 !(2!!ėħħ2RsÆæR¤ń !:cR!DdõõącµŅ!!!t!!c2Ķ !&22!3#R B&!Å¤b !<Cń!ēĕ !&d!!õ!!t¶2 !&B!B!s! B'åå !C·Ķ2!!s!ėRõ!!ħRBBÀ/ĦR2Ö!Ö¥RRRå !' Y'R !<Ö !&QĖ¥1!!÷¥Ķ¨c2Ė2!!öĖĶĦĦÇ !-R !5s!!ėÅ2!döĶĲ!BĆĖĥ!!·ħ!¡!!Ćæö2ĶĶĦĦĖ·C!YY Ŀ' !7ã!!ª·!ėRö÷ī!!AĶ!ŅÕ!!EzB !'ĦĦ!ĖöĦĦtĿ!) !<Ė!!÷ėěëGĪŅ!!!cĶĦÆÕ!!!s¥!BBB!!!RBö!!dĿĿ) !<Ė!F»Ė !&Ėc#ĥcc2ÆµöĤµB¥ö2·B!!!R!!ö!!!Ŀ!ĖĖ !:ĖĖĖ !(cBSBRR¥!ńĖĖ·RÆ2ń B&!s!¶B×!!Ė!!ĖĖ !A¤BĶĦĶĶĦ!ç!!ń¤22DĶBBBcRs !LÅB!Ħ2ĶĦBç!!!¤¤ôR !&BcBR!!Ė !HÅå!!ĶĶĦðħ !'bµµRRBRR!!Ė !KÕ¤!ĶðÜ!ħ !) b) !NÅ!!àà !_ÅXĖĖà !_ÅûR !bËË !Ņ !Ņ !Ņ !~",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !Ě% !bæ !b¢ !lv !,^^^ !D% !*v !(ó !)ttÁ!ċċ !D¥É !)ó!!% !*ttt!2!cÁ !Eãs !&$RR!!!Ń !(tt!R!22(ËË !FO!!!$P!!% !&v!!C5ĖĖ!BB22 !PðĽŀááRóRvĸ0ĶĸĖÆBB2Å!f !Ié!!ÁB!ç!!ÑR!ģ!æ$0!cRRåf!P··· !EĬÖ!!ÖæĶ!!þb!25¶ĈÖ!s¥-ĤS0·ĕĕ!Ėdd !Hs!Ħ!íX!%ĖBsRs!-ęĈĦ!Ħ3ķĕĆĶĶ××R !Dõ¯!Ć!X2ħĔń!!!T!©×ĖĖĵ!ĵ1!R!BĦ!¦II !>C!!$Ĩľt!Û2ĶQĸ!ô¢¢as!÷1Q3ö !(ĶĶ!!!Y !=B!!!PĶĦ!!Ķ2!a$ö·!tµ!Ć!3öb!!!BĶ2B!RR!2j !<ğ¶çĖ{V÷©!Sĉ!!@¶Ė!ń!!Ħ !'ħ!!!2!!!ğ2įĶ !=Ê!R!ĩ©×!ĖPķRB2B·!!!Ķė!!ćħ!ħR!2!2µ!Ŀ!ĿjIIz !8ùğÊ·Ħ!!!×ĦĦBĦs22 !*B!RR!æ22R !'į!!Ėz !0¨ !&%!s!ğÊĻěĽ!Ć!!!2!2!B×!!B2ĖsRR!BBBRRµ !(22 !2ã !&æ!Ń!! ğ&ĖĆ!s2B!!B !&2RRR2RR2!ĆĦB÷ !(222 !6¢ !+ĆĶĦ!!!B!!DĖ!ÕBBĶ¥!BB!Bc!Ħ×Ę !&įįĿğ !<%!!!2Ė!Å¤bbb?!ĖĖÕBBĖ¥cccb!!Bdą× !(IYYY !9Ń!!RĶ !'ù!!!Ù!!µµ2ĆĆĆA!AAA!B!×÷ !'BB!YYj !3% !'B!ŀð!!!p!!!³ !& ¤& !'ń!BB!÷!!!ğğğBB !5æ !'õB!¶ı !7A!!!r !(ğğB !4¢ !(c!ÖB !8AAr !+ğį !:å!ss~ !9 Ė' !BĻBBBġ !CĖ !<ËRRĖ != Ė( !>xxx !Ņ !Ņ !Ņ !Ņ !í",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !ï^ !R% !.t^!^ !Qæ !-tL!ċċ !Q¢ !)v!!tĖ!cÁ !Zó!tĖc(8Ë !Uv !'CĖcB2µ !Vó% !&R¥!2µ !XŃ!!!C!Bc !TU !&%!!vC!2Ć !UŅ R&Ń!Ró!!ĆĆÆÈ!!×× ç)ħħ !E$ń !&R!ĖR !'0ħçöö æ+ħ !Cħs!!Ģ^Đ±ġÉĩÈ¶!s1ĆĆæ Ė*!!B!T !BCĤ!!¤µç!®µ2Ħè!ą×!¶Ė!!BBBRRRB!!Ħõj !DĢÞB!æõS¥s£1¤ĤR!¥QR222!!ĖB !&įR !@R!!!RæRýt¥s!!¤`Ĉ!!Ħ3 !&22!!B !EC!!!*s!tĳăÆÆ!$ÛĥQQĵĦ s(Ė!BBB!I)RRR !=ĚE!FRSIĳSĉ!õRåĥė##ds222sccC¥BB!t!BI))YY !:ĸğsEĘBĝß!×sĤ!dSė!Ė2Ö!ĦÕc!!!R!!!tńğğğBBB!j !90!¢Ěç:ß!ĈAĄB!Pĥ!!!Ć¥22!iiøøĔArrń !&ğğğB !=ğÊÊââÕĶ!!å× !&¶2ĶĶ!!!ããRR Ė& !(ğį !=đğNğÅ!ĶRB!!Q!s !'+2!!IĽI!!!Ė !(Ė !=0ĸó!!RRĦæĦC!cĦĶ!!¥ !&IĦ !( Ė( !?0 !&ĖĦ!¤ĘħRĦ2!2r!!Ŀ!!Ķ2+ !GU !'Ė!B!!ēR!æ22R !'Ħ !Jē !(T !&õebRRµ!!!Ė!Ŀ2ĿĖ !JÙ!!!Ĕ !'`!bb¨ÙÙĖ!ĖĖďĖ !K³!!Ņ!æ!¦ !(³!`Ù !T¥!æð-!!ĉ!!!`ĉ³ !Tå¥!!Ė!!Ė !&` !PĸÙ !&å¥!R-~³!!E!!!ĉ!Ù !L0³!!U!!åĻ¶¶Bġ!!¶!!!`!³ !Pē !&ËËËG!!³ !Ņ !Ņ !Ņ !Ņ !Ņ !¢",
);
rawImages.push(
  "#c Ņc !Ņ !±^^ !`^!ċ !`c!Á !_c!cË !`Č8 !. I&R !Mc !+zzIRzI !'R !Mė2 !(¦ÐġRĽğRR!!!I !Mķsc !&Scĥ¤õġRĽ!ğ+++ğ !GEÙ!!f!1ĶĖ!!!c!!!ėÆ!ğRğ !'Ė !Fģ³!!ăc!Ė !'1ćė2!õ!ğ !&ĖĖ !J¹!!!×ĆÖ×c!!b2c !'ĖĖĖ !I¹$Ră!!¸µ¸!õ !(B!!ĖĖ !KRăPf!Rħ!$Rè !'RĶ!!Ė !LR!!ĢľĐ5È3q@Ã !&dBs¥A!!É !IR!!á¤µlĦĦ£¶æ!!ėė!Ö2¦!!!ÉÃ !KfæÞ¯õ¥s1ôæėė2RdcBąA!!Ã !Lă!Rõçs!2÷AQcRR!sBĘ¹%%% !I%!!!¥ąľöĆa###SĆ!2BB$³ÓŃŃŃ !IŃ!!ĽI¿|sÄĶĆĆĆĖRRBB$!ÙÉ !MĖ¹N2Ğsľ !&2ĖĶĖ!B!Ė!Ã !N¢ĚçsksQ!!2!¥8ļÕ!`³³ !&É !KğÊÚoo!c2BĖĜĦĦ)r !&É!!Ã !H¹!!!đÒğğ!!!c«Ħ!2ĿII!!!Ã !KÓ!!!0p!!ĆŅBR!B2B)ğRIYR !UĹ1!!įBğBIĖ!!9 !R5ù!!Cöį!ğ!ğĖ!!!į !M¹%!!!ĳp!ēæ23Ė !'22 !NÓŃ !)Ņæ!¦ĖĖ!!22įĖ !O¹ !*Ćð-!!B2įĖ !PÓ !)Ņ!!Ļ!ĖįįĖ!ĉ !Qĸ¹!ù!!!Ņ!--ġĖĖ!!` !Q0Ó!p !&Ļ¶¶æġ!fù ![ËËËG!ăp !Q¹!!¹!!fù !*ĉ !QÓ!!Ó!!ăp !*` !Ņ !Ņ !Ņ !Ņ !Ņ !ę",
);
rawImages.push(
  "#c Ņc !]YR !`Y!!R !^Y!Ŀ !¾Ñ!!!Y !]d!ÑRR!!Ŀ!!Ė !UÙ!2(âI)Ŀ !Z³¦c !^f!!ĶĖõ!ĖĿ !Yă!cĖĥ!+2I!Ŀ)!Ė !S¹!E!×!!ķĿğ!!ĿĖ !Vģ¸Ô!!!Ct××Ė!É !RRăRC!!!ħ !'É!B !QR!!5Èõ!!!RRc!bÃ!!É !OR!!ĹĦĦ!!!¥Rc!dĉ!ĉBB !Qf!¥s!!ħÖĦĖĦą`!` !RĹRÆs!ĥCcsR!B$ĉéé!B !OĹÆÓÆ¶ÔėöĆc22!22BB !PE/ÓĹĕ@!Q!!ĆĦ!! B&!2 !NģĖĹR2!ö !(4ĦĦĶĶ2 !NE!E¶Ěç!!!2 !&ĶOOO !PģÙģ³ğÊ!!ėB¥c!!!É!!O!B !N³!ù!đ!QĶĆÆ!BB`Ã!ĉ !Sp!0ö !&Ė !'`!B/ !U¶¶¶!!b !&Ù/ !QE!!QSąüąąB!ĉ!!!³ !RģÙ!Sìĭ!!!µ!` !W³!!ĶBRI !^DRB!ğ !^³ĶĖĦ)!!R !'ù !Qĸ!))!BBB !Z0)Bs+įğğ !)Ù !SRRğ !-³ !SĿğ !)Ė !XĖ !'ĖĖĖ !Z Ė' !+p !Ņ !Ņ !Ņ !Ņ !Ņ !Ņ !Đ",
);
rawImages.push(
  "#c Ņc !]YYR !_Y!Ŀ !_±!Ŀ!!R ![± !bæ !b(æĿ)!!!R !ZsN !`×!!)Ŀ) !]dĶ!!!Ŀ !]´ĵÐB) !`sñĿ!!!Ė !XĘ!!!¤ĘĘ¦Ė !WRR !&ĶrÕu !WR!éėe!2 !ZR!!sĦĥ!!!cRĦĩ !Y2!!R!RDĦ ![ĥC!c!!ĶĦ !ZėösR!öĆ !Y¶!QQÆĆĦ!Ħ !VĖ!!c !&ĦĦ !YĖ!¢Ö !)Ė !WĖĖP!!¥c!P!!ĉ ![Æ!B!¥æ !YBć!ėĖ!!!BĖ !XÕ2!å!ĖöRc !ZćSąüąąńR !Zåìĭ!!!µ` !]BRI!!!R !YÕBB!ğ !_ĿĦĦ)!!R` ![2!B !_ĖĶĿğ !_R !b)Ŀ !&Ė ![Ŀ !gĹ !aĖÆ !]Ė!!Ė!¢ !^ĖĖ !Ņ !Ņ !Ņ !Ņ !Ņ !Ņ !.",
);
// }
// Officer (Attack) {
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !Ņ !©Cct !^CcAėĆt ![CA!ėQQĵt !YCA!ħ2!!!Ėt !WC !&R!!ħİĀá !WA!ħRRĆ !&Ėá !+CCdÇÇjjj !&jj !=CAėėRRÅ!Ćĥ!jĭý !&¦¦¦dC!B!Ć!ā!!YjjjĶĶj !;ÇA!!R2c×ć !(uÇÇtĶĖæĆĦĦ!!!ĦĥĶĶ!į!Ķ22 !2ù$$ !)¥d#QĶĖæ!d$RļÕ!!!¥ĆĦöĖ!!!2 !'222 !7¥PÚ$.ā!!Ru·ė3d!!Ė!µą!!¥Õ !&Ė!!BB !&2B!222!22 !4ĥ×!ÕûØ±đñÏöö!ė¶s!!!ĖD!ĆæÕÕt!cRRBBB2ĆBRcC !'22- !2Ć!àæ!£µcÆÆÿb!Ĥ÷ėsöBR!t!Æ!!rB!BB22s¥¥¥BdPğğğĖĶğğĤÿ !1cÖ!B!ġ!2ļĖ!3ĤdÕ!ėcĦĖ!!Æ!¶!!2 R'2!cBBs Ė&!ÿĖĖĖ !2Cĵ!R!hd2Ć!!Ĥ÷!sÕ!ėB!À/!sö!¥RB2BBccc¦Ħbô !>cB!¶ !(ĆcæÕ!ćR¨c¥2¥!!cRRBB!bbńb !>3!!!ārĶc!!!rcĆöæ!!×!¡æĦ2æöĦ!Ėööö ·& !=s¶!dCG!Ķ,Rt!!!ĦsĖb!!Ez!2ĦĖĆĖĆö Ė&ĆĆĆ×ħ×YYYR!!YYR !2d!!!è×ĆÆÆ2C !&Ħæ1 !+ Ė(ĦĦcöÖ !'RY!!9 !2s!!,´ÛWxxªĥdĆ !'b!!!B22!!!B2 !'ĕ2! 2&9 !6söĘńĺh!!ĖĖõSæ!!!RRBRĤĤB2BBR!!!2 !'ć!!Bį22!!B!!2 !1pńń !)·!!!BĆĦ!cd!!c 2&R2 R&BBRsB!BI!!2!ğB2 !<¤!2Ķc¥¥cbńĖĖA 2&BRRBcRRRBĶ!BC ğ&!Ėğ2 !=c!!ĶĆĆĆCć!!! ¤&AµµÅÅÕååRs¶·R Ė'!Ėğğ !<¤B!ĆĦĦæ¶æ¦¦¦-- !,µµAńĔ !)ĖĖ !=ąB!ĦĦ!Ė Ć&!Æ !VąBB!BĆ!!B!!Æ-Ñ !Uąą B)ÆÆÆ!Ñ !V ą'åą »' !Ņ !Ņ !Ņ !Ņ !ß",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !Ņ !ĥdd !5CCdÇ R&!!YYj !?dĖĖSddd !.3#C!BRB·!!!RRĿ2 !@Ė!!!BBĖ33 !'ddÇ33Ķ!ĦBBB!!÷) !<ù$$ !+B!B¥RR3RuttĆĆÆ¶!ccc!ĶĖ!!!Ŀ!!!9 !8¥ÚÚ``³!RRR!!!B!2RRö!!!ö !&s B&R !&II!!2- !7¨ē!BĔä±áñ!!!2B!!B!ĖD !&cc!22BBB22ĦBC!ğ!!ğĤÿ !8²Êe¥µcÆĖďď¿÷ė!ĶBR!!!cc!!!22!!BĶsBdPğĖ!!!Ė !7¥!!·ºc!HĜĖ!!!Õ!ė!ĦĖ!!R!!BB! B&!BBBsĖĖ!ĖĖĖ !:ą!BġYCCö!··æÕ!ėB!į/! c&¥!!!BB¦Ħbô !@Ė!!hÆ!!!·ssĶæÕ!ćRRc¥BBccöĶĶ¤bbńb !@B!!!C!Ābrss!!öĆæ!!×c¡ææ¶æÆĖĖĖ¦ !FR!Rd!ĀĀRČĬĬ!!Ėb!!íz!ĆBÖöRĶĦĦd¦¦ !Cd!!ĵBÆÆ!!Ħ!B!BĶQ !)cÆĆĦĦ!Ħ!¦SSç !=ăĵP!nC÷ªx!ö!ĦRR2!2b !+ĶĶĦĦĖĖĶ!cçY !;Å!DôÉĪĪĖĖ!!Ħ!R2!22RĤĤB¥ !)ĶĶĦĦĶ2ÖĶ!YY !&YR !3Ĕôô !+2BBB2Bd!!cBR !,B2!222!RRYY!9 !<ĵR!B!BBBbńĖĖABBRRcRB !*Bį229 !Bąąµ b& !'¤Åą!RcR 2&!!B!BI!2!!B!!2 !LÅÅÅåcc!!2B!BCğğ!2!ğB2 !Qååĥĥ!Ć¶·R!!ğğ!!ğ2 !UĥÆAńĔ Ė'!!ğğ !Uµ !* Ė& !Ņ !Ņ !Ņ !Ņ !Ņ !Ë",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !Ņ !ĥdd !5CCdÇ R&!!YYj !?dĖĖSddd !.3#C!BRB·!!!RRĿ2 !@Ė!!!BBĖ33 !'ddÇ33Ķ!ĦBBB!!÷) !<ù$$ !&% !&B!B¥RR3RuttĆĆÆ¶!ccc!ĶĖ!!!Ŀ!!!9 !8¥ÚÚ³%³ù!Ùè!ĸ!B!2RRö!!!ö !&s B&R !&II!!2- !7¨ē!åöÜÖcöÖĸ02B!!B!ĖD !&cc!22BBB22ĦBC!ğ!!ğĤÿ !8²íĦcµåååcè¿÷ė!ĶBR!!!cc!!!22!!BĶsBdPğĖ!!!Ė !7¥!!!öå!ĆĆĖåĦ!Õ!ė!ĦĖ!!R!!BB! B&!BBBsĖĖ!ĖĖĖ !:ą!!!Ķ]ÑĶ!r¯ĈÕ!ėB!į/! c&¥!!!BB¦Ħbô !@Ė !&tõ!!÷{ĔæÕ!ćRRc¥BBccöĶĶ¤bbńb !@B!!!s¦2»Č2!B!öĆæ!!×c¡ææ¶æÆĖĖĖ¦ !FRåBµ×cc!ėĔĬ!!Ėb!!íz!ĆBÖöRĶĦĦd¦¦ !Cd!s#s¦¦#ÆĦ!B!BĶQ !)cÆĆĦĦ!Ħ!¦SSç !=ăĵPĀ;¯Ïss£Ĥ!ĦRR2!2b !+ĶĶĦĦĖĖĶBcçY !;Å!DĺĪĪĪ³³ĸ!Ħ!R2!22RĤĤB¥ !)ĶĶĦĦRRæĶ!YY !&YR !3Ĕôô !(0!!2BBB2Bd!!cBR !,ĦĖĶ222!RRYY!9 !<ĵR!B!BBBbńĖĖABBRRcRB !*Bį229 !Bąąµ b& !'¤Åą!RcR 2&!!B!BI!2!!B!!2 !LÅÅÅåcc!!2B!BCğğ!2!ğB2 !Qååĥĥ!Ć¶·R!!ğğ!!ğ2 !UĥÆAńĔ Ė'!!ğğ !Uµ !* Ė& !Ņ !Ņ !Ņ !Ņ !Ņ !Ë",
);
// }

enemyFrameOffsets.push(rawImages.length);
// SS (Main) {
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !ħÌÌÌ !^ÌÌ!!!99 !YÌÌ!c!¥!bõ9 !WÌ !&¥æĆæ·B9 !UÌ!!!cBS!cĦŅQB9 !SÌ!!csBCBs!öR-]ð !RĬ!Ć¶B2C2Ŀd!!ġªÜy9 !Qæ!cĆ2dK;!;ııĵ!ÚFF«« !,¼¼¼ !*RR !8ĒĒĒâĆÕĽĽĭ!!s×ë¶ĖĖWcĬ ¼+ĶR¥ļRR!!!RjĽ9 !<ââ!õĥĝ!!!û!R!!B! ¥'sRscĦR!!!9IRR9Ħ !@MÇS!2!!!B¥Ö¥RS !'2R2R¥2dC!Ħ!9!Ħ !0iĬĬÁġÁ!!!TTĦûVě!!!ğ+s!!B!ÖÇÇC!2 d*SsS!!!+BĦ !&į !,ì!!!ÇCÖ---!!AKsõě!Ĥ!!ğ!!!Ęt666SR B(2BBCBBB!!į+!B!B !1¤ĤĥBBĵlK#d}!õě !'BCxn!!!B !)2 !&22 !'į+į !,ì !&=Ħ!ĕĕ!!!+ąĭ!!õĽ!!·2!s !) 2+B222 !9īR2·!!B!!!;!!!ĦI !'Ð°××!!! 2- !'ĖĖ!!!Ė !*ì!æİmmĆ¦!!!¦!!Ćñ!dddRĦI !'B !02!!ïĖĖĖ!!ĖĖĖ !,Æİ!!!ÖÆ!!!åB¥Ćx!ąąąĖ!!Ķ !&Ħ !(Ħ Ć( Ħ& R&!!RRR !+Æ, !&đŅ!Õ!S!B!!ĭ !(Ķ!!!t···!!!ĦĦ ĥ'2å!ĦĦĽ!!!RR!99R !*Ġ !'ī2!ÇÇ2B!x×;ĶS¦RĿĆc!!!GGńń!!!Ħĥ!!!Ķ!ąBÕĥĥ2!!9Ľ!9ĦĦ9 !+Ė!!!ÅĈvtĖĖæ!x×µü!!Å!ĝRÜ !1Ė!Ė !(ĽĦ+9Ħ !/Ė!!tôĔÆûûGx!µČĆ !)Ķ!Ĥ !+ĖĖĖ2ĖRĖ!öC!!B!!!B !0ĖĖ!W'W!!!ĖĖ !6BCRRR t&!×B!!į+!įįBB !Fêºáá!2!!BCCC!!ĦBt !+įįį !<BÇ!c!!Ķ!!!ææĖ!!!B! B'!!BĦ!Ŀ!!ĖĖĖ !<ĭ!!!åĖ2!2 !'ĖĖ!!!ïï ď(įďĿ;Ŀ!ĖĖ!!!ĖĖ !:įCcBd222!!ĶĦ!!¶¶¥!ï !, Ė& !)ĖĖ !:CSBc!!ĶĦ !&ss !Sį222Ķ !&Ķ!× W&Ė !Rį Ķ'!}#ÜÜ××ĖĖ !TįğĦĶĶ!üīĦ!Üb !XįďĦĶĶ!!!ï ![į ď&ï !Ņ !Ņ !Ņ !Ħ",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !Ņ !ĥČČĜĜììĜĜ Ġ& !SČČČ!ĦĖĖ!!Ñđ !&R !Q)!ĦĦĦ!BBBāc÷!ÇÇÇ !Vss¦¦¦!c !'ì !9I !8)ĥĦĖĖÆöÅõRB!!ĭ«««tI Ĭ*!) !-I !9noÒççRĖĖĖr !)ĕ2SĖĖ Ć'ČµĜìĜR !(I!B !-ĜĜĜ !*Ħ!!==Ò× !( ·&S!!22 B'!¥SR!ĽRIIjR !0iĦĦĦ¼Đ=Ñ=ŀRRńgÊúī!Mç2 !&ĖĻĻĻ!!! B)R !,I!Bį !0©BĥĆĕĦ!!!ĀĆÖåúī=¦22 !'ĦĦ!!CCC S&!Ķ !,Bį !,ì!···¦ĆöĦ!Ė=ĀĀ!××tCĶ!=¦ !)å!!BBB222!CtB¦t!!++!!B !.æÆ!!!^!!ÅĆ!!2i! µ'ī!= !+B 2(BB2!!!2!!!į!įį !,ì!¦!!Úº!B¦¦BBX!i!RRRcõī!2C!lùùg!!Ħ22 Ħ'2B2Ŀ2 !+Ľ !*æÆ!!!Ú!BRssBċ÷CĀR!ĖBĆĆõī !)R!! Õ)ÅQåìąĿ !)Ľ !+Æ¦!!!ÃĨ$!åÕS!æÖ!!2!!2B!¤ !&ddsd!ąĦĦ 2'!RĖĖĦĭ!Ľ9!!!Ľ !,¦ !&¨PÅCÇćĦ!õrĽĖ22!B!2M×R!¥ÖÖ¥R2! 2)!!sR!2 !&Ľ!!!B !/c·õssRW!!!å!!c!BR!W!G!s !( 2*B !'B !'B !+ğ !'&ć÷td!!!ÜĦ!öĆĆĶĦĦSĻ!Úā-¡.!! 2+ !(įį9!!B!į !+ğ!!!²ó¦!ĪĪĖĖĽ!Ė2c R&tBRÕĖ-B!B!! C+d3!!B!!!ĦB!įį !-ğğğGĪĪĪ !)cB2ĶĆĦĥ!ÕĖĶĻıĀB!! B-dd !&+į !;ğRsBĶĦ!!ĦĦąĖĶ!Bi«!!! B+!!R2 !BS!!!22!!Ħ!Ķ!2!!R22! 2*ÿRRÿR2 !&ĖĖ !;ğ¦C!2!2 !&2BSB!!!2 ï*!ïï!ïï Ė&!!ĖĖĖ !:ĵR! 2&Ćc!!!R ï& !PğSSRRdtR¦Ėt!B !Vğğ,SBBC!·BtRï !XğğğBB!!Rï !] ğ&ï !Ņ !Ņ !Ņ !Ņ !¦",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !Ņ !Ņ !ĮİİİÑ ![¦×ħCCC ![¦Rç!sss¶ !9Iu !: T&RRĜåsõtR!!!ÌÌÌ !7Ĥ !-iČČ!İ !)TêÚÚÚüĝ}Irrê=nÑ.!sĶ ¼(!¼Ììü !*I2 !-ì!!!İ!Đnİð!!TêĖĆ!ĦĖąĝ+!!ñ!B!ĠR !*¼2!!!ü !6æÆ¦¦tĆĦĦ!!!çńÁÐ!!BRBĕĝ!ìGġŁġi2 !)cc!R2!BIII !'B !,ì!¦!!^!!ÅĆ!=ÕCs!!ĦdCĦ2ĥ!!!GGi!2! R(ĶBs!BBBR!!II!I2 !-æÆ!!Úº!Bcc!!!ĥÕyc¦ĕĕ¦ttĽ !(2SRRRBRRRĖ2B!!!ğB22!Y!!ğ !+ì!¦!!Ú!BBttRÖ!!yBĦåĖĦåõ!ąĖ!B!Bĕ2Bd22!2tBRdBBBC!įBBB!2B !,æÆ!!!ÃĨ$!ąådË!ü !'ĶĦĦ!Ķ !'33!!SSBd !,ğğįĿĿğ !,Æ¦!!!RPÅ2·×s !&B 2(ĖĖsBBC!BBBĶĶĶd!BSS2!CC !5¦ !&U·õ·ccc !&22 !&Ħĕ!öt!B2!!!BBB!!Ħ!BBS222 !:ĚË62ss!!!¥tB22 !&2R!S 2.B!B222 !4ğ !&cR_ã¦CC!!2!!dBBRRBSBB!! 2&! 2'BB2!2BBB!!! Ė& !.ğ!!!²ó¦!ĪĪĪĖĖC2ĶBddSSS!dC!22!22! 2'!ïïï !&ĖĖĖ !&Ė !.ğğğGĪĪĪ !'įC!!BBRR22!2RR !' ï(!!! ï& !*ĖĖ !9įįĖ!222cccR2 ï( !Rįÿ ï* !Ņ !Ņ !Ņ !Ņ !Ņ !§",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !Ņ !ħììĜìì !Y «&!R!R¦9 !=IY !9«« !&R!BtB2) !T«!!s!!!Ķ !) Ĝ& !6I2B !:c!ccc !)Ĝ !&ļ Ì'ČČÌÌČČ !7ii¼āM-MnnM !'B22R2B3!!Rĕ B'C c'!æĦ!ĆĆČR I' !/iRR!Úåąåõõõ!ì!¶c2RtttSBRRğB 3'c B'ĦÆ! B&!BBB22IRB !-cccÃ$$!ĦĦdT!c!Cd¦c R&ğğ!S B'!d S&cĶçĆcc2!222BBBğğğ !,2!!RPÅR××s !&ĵĦĦĶĶ !(2 !)222 !+ ğ'2 !-iÆ!22¨ªõ·ccÖ!B !'ĶĶĶ !( 2'!22!!2dSBÖ22S !(ğ !/BBBssûgBBS!!B !*ğ!!!B !(2!222!BBSSS2 !6CCC!_!_Ī!&!R !)2ğ !' 2'!! 2&BB 2' !4ÆdBBB_Ċ_Ċ_2!ń!R23B!2!ğ!!I !3 2& !4dB !&_Ċ_ !&CCdB!22Ŀ!!I !, 2)!222 !5B !&22o22B!!!B2BRBį!!I !)222 !Ağ !&333CC'!!;ĿĿįğğ!!I !*ĶĶĶ!! Ķ(! Ķ& !5ğ!!!222!Ī!ĖĖ !(II!!Ķ !,Ķ !(Ħ !:ğğğ Ī& !&Ľ9 I&!!!Ķ!Ķ!!!Ħ Ķ&!! Ķ- !'ĖĖ !:ğ!Ķ !'ĶĶ!!ĽĽï!ĶĶĶ!!Ħ Ķ(ğ Ķ& Ė'!!ĖĖĖ !8Ħ!Ķ!!ĶĦĶ!22!ğ! ğ&ďï ğ)! ğ& !BğĶ!Ķ!2BBB !Zďÿ Ħ)Ėğ !Yğď Ķ'ğ !] ğ' !Ņ !Ņ !Ņ !Ņ !Ņ !G",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !ĦČìČ !^ììĦ!ĦČ !Zìì!Ħ!!!29 !Xì!!Ħ!!!2!!9 !Vì!!ĦBRRB2B!2j !VĦ!B2Bd!2!2B !Uì!BRB22;tdSB!į! Ĝ& !QB!ttmĽ;;+įįĽĜ !&)ĬĜ ü&Ìyyì) !*III !:2Bĥ2Ľ2)!!DDĦ !(ĶĦ!ĖĖ!Ė¥¶Ėå)RIII!!I!!+ !7ì!B!ĦĶĕĦĶĶ))!!ĵ Ħ'!Ķ2Ķ!!ĖBBB!cB!+!!RR!!+ !-ìČČĜÁġÁ!!!T !)ĵĦ!ĶB22! Ķ'!BBR!Rs!2d¶C!!!++Ľ!++ !-ìB22|ÇwÇððR !2 B(!!2¥·2¶dR!B2 !&+ !12!!BUBUË!!ń!2 !*Bğ!!3 !( d&!dS2!d2 !5ìB222!c!cB¦ !+3B!į !& 2'B222BBB22!2!B !52!!!BĦBĦB¥!!!2!!22SB!+!!ĔĔ 2)BBB222R2!BB !(ĖĖ!!D !+dddS2R2R22!!R!RBSCĶ!+ !(CCCdd !)Ķ !' Ė'!!ĖĖô !*·;++;2!2!22 !&ĖĦĥ!2+!!II!!2ĵĵĵĕĕ!! Ķ'ĦĦĦĶĶ! R'!!RRR !/BRBRBB !(Ħ2+!!)Ħ !& 3'!ĦĖ Ħ'!!ĦĦĶ !'RR !-į !& o'!!!S!!!t+!!)Ķ !&2 !(ĦĶĕõõõąĦĶĕ!Ħ !=ĦR !'t+!!)Ķ !( 2'!!ĥĶ222Ħ2 !9Ė!!!'Ė!ĖGGĖ!!!¦+!!)Ķ!!2 !& 2'!!C2 !?ĖĖĖ!W'W!!!ĖK°+!!ĽĖ!!2 !&B !(2BCSSSB2!S !GĽĕB22Ŀįğ!!! 2'Ķ22B222R!2!!+ !&ĖĖĽ !<üüąS+Ŀ29I !& 2'!ĶĶĶ!!!SĶĶ!! Ė'!!ğĽ!Ė !7Ėü!!!õĝĝĆĆĖ9I !)ÿ ğ- !*ğĖ !92Ķ!ĶĶąĕ!!ĦĦ!!ğ ÿ' !O,B!!!ĶĶąõĵ!Ħ!Ė !U,22!!ĶĶ!ĶĕĶ !X,<RR2!2!!+Ė !Y,!B2!!SĖ ![<<BBdğ !_<<ğ !Ņ !Ņ !Ņ !Ņ !F",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !Ņ !¥ììì !^ììĖĖ2Ĭ ![ČĖĖ!R!!Ĭ !YČĦ!Rc22!2Ĭ !WČĦĖR22RB!!2 !WĆĖ!ccdSSSC!Č!!ļļ)) !OČ!!!ÖöåĕĶ2;]°ļļĦĖąąIļ Ĭ&Č!ČČļļI !BĦ !&ĖĖĆąąDDD3ĆĦĶĶĶĕĖĦĦĦ!ö)ööĖĖĕ I'!!!YY !,yyyQ?Q? !&ļ !'2RB¦² !2ĥ !'R!!!BIIIĶ !,y!!!Ĵ4Ĵ4?ŀTTĖ!!!Ħ2c·ÒM!û !*SRRBBĦs!ssR2S!BBB!R!!2 !+y !&4B4B4ö !(Bct^!ÚÚĥ!!B!BBt×!C3C2BBĦRdCd!! 2&!BB2B !/c!c!c !(s¶t^!Ú222 !&ĦĦõµB222CSStCB22+ ğ(įįįğ !*B !& B's !'ĆS^!ÚĖĆĆĶ !*Ħĕĥ ĕ&õĶ!¤õČ Ľ&!!!ĽĽI !*Æ B&!B!B !)×^!ÚĆĶ !( 2'ĕĆĆ Ė&!ĕ¤!!! 2&9ĽĽ22 !+C¶RRR B'S!!dB¶2!ÚÖĖ!!B !& 2' !)ö!!!Ķ3 B&!22BB !-BBB!!nĂĂBïB!BSMêĖ!!!22C !7 ğ&2BBğğğ !*į2 !&òćÕ!Bö!!dMěĖĆRcRdC!ĤĤ! 2'! 2) !+ğğğ !.C !&wĺ÷ÕµĖĤKM!ĕ!!!2S!BB!!! C'S B&!Ćc2cc!B !6R¦¦Nłł!÷ė!!!Ĥě!Ħsc¦BB22!!2 B'! C&dÇ¦2!2R !6įC!!!R!!RRsĖĖ !&öĦååĶĦ!!!Ŀ 2' B(!BSRSSB !+D !,įğğGGxxGGx !&öĦ!ĦöĦÕõĦ !+ 2'RĖBSBB2 !&ĖĖ!!!ö !8Ľå!!!Ė!ĖĖöĥČ!! 2.R!BB2! Ė& !'ą !8ğ!!B22!!RcĶSĽĖ !( ÿ,ïï !(Ė!!b !9 B&!2 !'+! ÿ'ï !5ĖĖ !:<BBRsR!2RC !Y<!ttB¥2 !]<ğĕBt¦dB+Ė !Z,, ğ&Ė !Ņ !Ņ !Ņ !Ņ !è",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !Ņ !Ņ !¤ Ĝ' ![Rü Ħ&ö««y!! Ĭ' !Dyyy??? !(Rì!ĖĖööĦ!Ķ2ÌR Ć'ļ Č(!!!ìČČ !6y!BB444?İİ$$$!!Ķ!Ħ !&2!Ħ!2 !&ĦĆĆĆöææĜììrĦ! I&j!!III !+yBB!RBBB4ĆĆ!!!ìĖĆĖĶ!!!Ķ!!¶!R 2&!ĦĦĦ2BBæsB÷RR222!ĦzR222 !+B!RR!!!ñ_!!!RRĖĆĶ22!!ĶR!!d!!B222!¶cc !*S222B!!9222 !+RR B&ñtÕss¿ !*BR!!¶!ĭd2 B&!22RccsĶ!BB! 2'! 2& !+sB !&»F3ĖĦæ !&ĶĦBsR¶R¥dĕ!! S'!BBc22BdRR!! ğ&Ŀ! ğ& !+CR!!!cĲĲs÷çąńBR!c¶RBBĦ!!õ!!!2 !'BB!222!SSS !(ğ !/įC!!!.ĦĖĦĖĖt!!¡!RBB!!dBĶ!!!R! 2&!CCCSSS2!!!2 !7R!!-^!ĶĦĦ!Č!ńĒĖĶStd!d!!!ĕĆ 2&!t 2'!! 2& !'Ė !0įC!!!ċ!!cB!,ĤtńòtB!222B!Ħ!ð !&B !'22B 2&!!!ĖĖ !3R¦¦BRBc!B!Ė¥ !)2·āŁġy 2&!BB22B2Bï222ïĖĖĖ!!!Ė !0įC!!ë!ûxûû!!A÷ń; 2'!x'GúÊ222!22Bďÿÿï!ïïï !9įğğ!ë !)AĖĖ Ŀ&į]ıF&ÖĶ !'ïï !P Ė&tc!!t!! ï' !4Ė !¦Å!!ħÖ¶2 !]bb!WWW !:ĖĖ !DW !Ņ !Ņ !Ņ !Ņ !Ņ !è",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !Ņ !èĜ ¼& ![Ĝ¼æ !&Ĝ !XĜ¼æ !_ìæ !&c!!!Ķ) !,ĜĜ!ĜĜ !FìĖ!!!RRt!RR!!ĬĬĬ) Ĝ(!öĜĶĶČČ I'!!III !9u!!!RR!Bµ !*ĵ Ķ)cÖ2Ć!!222!!jI !?RBRR2!R22!!ddd Ķ+B !& 2& !&22 !8R!cRRdSSS¥R!!ŁĀĶ !.ScB¦222B!į!222 !,yyy??? !&RR!!²ĖtBBccd!!đ7i!!+C !'222!B!S! ğ&R!B !.y!BB444?İİİ !'×Ħ!!ĦĦRdđx!!Êº!B R'BBBc!B2 !'ğ!į!!2 !*yBB!RBBđqĆĆĆ!!!Ĥ!K !)x!h6Æ!!R S& C&B2C22 !)B !,B!RR!BñtÕsssġ!C×Ĥ!K !&ĦRāı !( 2& B&CBR!2 !)ğ!ğ !*RRBBB!»F3ĖĦC!!¶Ė !)BmR !) 2*R!!22 !*2 !+sB!!!cĲĲs÷çą¥áµåĽ!!+ !)ÆÆÆ!!! B+!B2 !+ğ !+CR!!!.ĦĖĦĖĖt¥!á!!Ľ!!+BB!!!d!ÛÛÛ !CįC!!!-^!ĶĦĦ!!ttĲ+!Ľ!!į!22!!H !/ĶĶ!ĶĶ !6R!!!G!!cB!t666!!!I!!į !&dĘĘĘ!! Ķ*!Ķ!!Ķ !5įC!!¦Ć!cc!B6 !(ĶI!!ğ!!! ą& !, Ķ'! I'ĖI !/R¦!=RRcssĖ!!!Ľ!!ĦĶI!!BBR !/Ķ!!Ķ!!IĦĦĦïï!ĶI !-įC!!Ðëª7ªª!Ė!D !&Ħ !( µ&!! Ķ+!ĶĶ!ïďďď!!!Ķ!I !-įğğ !*Ėě!!B!!ĶII !+ Ķ)!! ğ& !)ďĶ !:ğ!B!BB2 !&ÿāāāĖĖï ğ+ !.ÿĶ !;Ħ!22Ķ !'ööö !;ÿ !:ğ!ĦĶĶĦ !^ğğĦĦ !(sss !WğğğĖĖ!!__77 !Zğğ!!ğğ !^ć !bb !cbA !Ņ !Ņ !Ņ !ħ",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !Ņ !¥ü ¼& ![ü¼ĆĆĆĦĦy !XüüĆĦö!!!Ė!y !VüĖĖĦ!!sB^±^Æ !UüĖĶĖRRB!^!ċ7 !X2R!Ræ¥!GĻë»ġ !STRĶ!RRB!!WÛ !& Ĝ&ļļĜĜĬ! I& !FoĂ¥!RSdġġÜsss!SSĶĶĖ!ĶĶĶIĕ!!!u !GoÂ¦càĦcC!·!!BBB22!ddSĕS!!!ĤjjII))I !3üüüÁġÁ!!RRńń!!!įį!Ķ!!c!·S !'3 !+į2R!cB !3ìÖRRÇCÖ--ġ$Ę#ń!ń!!B2ö!(=F^!!CSSB!!BS !(ğ!B!!B !3¥¥!İ¤ ĕ&Ď¿¶DÊ99!rĶ!ĥCÀ·}à! B( !'B!!!ğį2R2 !1ü !'=Ħ2dd!!ÕÚ!Åå9!2!Ħ!B!!Ħ B&2 B) !(ğğğ !1Ķ !'īR2Õĥ!B!d!!!å)c!Ħ!d¦¦¦!222! 2) !<æÖmmĆ¦!Ħ!¦!ñ+·!!2Ķ«!Ķ!GPhhĦĖĆåĆĖĖĖĆ!ĖÅ¤ !)Ė!!!RII !*«!ÆÖ}!!ÖÆ!!!åBxĽądCS!!s!ĥġ!!ĦĶĕĕCĥÕÕÕå¤ÅĖsüü!!999jR!IĽ!B !+Æö}!!!đŅ!sCS!!ąĖąĥĦ!Ķ!!Ħ!=&FĊĶ!ĥĆ Ė&Ķ!!ĆĖĶĝ! Ħ&9R!B !,à,} !&ī2!t22BCm !(«2Ħ!s !'Ħ !3Ħ!B !.Ė !&ĳĘ·tBöĽzsD !&Ħ!!cĶ!css!!Ć !0 B&!!!2 !.Ė!!ĖôĔÆûûxńĖ÷Ê2!!ĕ!Ķ!«!ĥI!!!Ć !*BBRR2!!į222R!2ğB2 !-ĖĖ!W'W!!ĖĭPċĶ!2!!!2!!2Ć!ccSsRBRccRR!ĦĦSCCB !)ğ!!ğ !6į!ĕ!!2!2ĥĶ!ÅcĶĥ_o=!!C2 B&RR!!BB!!! ğ&!!!2 !8ĭĦB!ĦĆĆĦĦÅĦ !&R!StRtSSd···çąBRR !(ĖĖ!ğ !9R!!Ķ!!Ħą!!öć·!!RRR2!RRR ÿ&·2ïï Ė(!!ĖĖĖ !7įC2!!2!!!Ħ!GÊċ! ï' ÿ& !&ÿï !EįCB2 !'2Bd !WįSR22B2·R2!!į !VįCtR!2!SS!į !XįįStS!!!į ![ į( !Ņ !Ņ !Ņ !Ņ !E",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !Ņ !D ì& !]ìì !&ì !Yìì!cĆ2ċċċ !XĜ!ĆĆā^û!cc± !<Ij !:ĜÖĆ!2!!Ýy88Ö !;I !;ĜĦ¥sBs!BRddd> !JĜĜĜ !,d!RĶĶ!!sssõ !/ÌÌÌ !)jI!!2 !-i!!!¼==Ñ=ŀ!ĜÂânÀtt!!!;;;ë)) !,ÌĖĶĶĜČjjYIRį2!2ğ !.ĦĦĦWą!r!C!Â !&KKĶ !(2!ĜĜII !&¼ÌĶ!ĶĶæÇĦĦĶ!)!!2B !-ì !&Q2ĥöĕąM|ĤĤĤ!!tė×! ¥&Ķ!!!ĕĕĜ¼¼ÌĦĆĖĶ !,BBğD !,æÆ···ŁĆĖĶ!ĖąbĀ!ìyìxÕĦÚ !)Ė!ĦæĦĦĆĶ !&cR!222RB!ğğ !-ì!¦!!!ç!!sĦ!!!Ç!!s!öĻńdāıŁMcĵĖsĖÆĦĶĶ !'2!!ĶBBB!ğ !&Ħ !+æÆ!!!Úº!!ddB2iċyööÖĦĦìK !&ÅĆĦĖö!Ķ !)¥BBĖ ğ& !'Ė !+Æ¦!!!Ú!BRssBX!!ĒĦBccĶĦì-M=_R !,BBB !,Ė !.¦ !&ÃĨ$!åÕS!!tĤ!!Ć2Ė2öĻī'Ċ!!Ķ!!!2BBcc!csĦ·d !&ĖĖĖ!ĖĖń !0¨rÅCÇćĦ!×õĭ !-C !& B&RR¥Ć¦!å!!ĖĖĖ !2ğ !&c!!¶ç·W!µìr!!¶Bcö !&S22!!!22RR2B2s2·tBK !6ğ!!!²#ė×Ī6!!ìæ!!BöÖöĖ!cB2!!!cBcRR2BB2d·!ĶĶ!!RI!!!IR !0ğğğGĪĪĪ!ĖĖ !&cĶĦBB!c!2SBĶ2BĶ¦RRBBdd2B !(B!!) !<Ė !*Öö!!Ħ!!dBBRS2dSBBB!!2!+!!!RzBB !>s2ĖB!RĦcR32!B!C!!!S !'2RRc!!!2!ĶR !=Lc22RRRBBc322 !&C!RBBB!22 !(Iğ!įğ2 !@BB!BB3B2B!2B !)ÿïï!!!ğ!!ğ !&ğ !=m!!!2c3SB!ğÿÿÿ2RR2!!!ÿ!!!ïïï !G]¦tdSBğğğ !&ÿÿÿïÿÿÿ !)ĖĖ !F ğ' !9Ė !(Ė ![ Ė( !Ņ !Ņ !Ņ !Ņ !Ņ !+",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !§Ç× !`Ç¥ć$ !>IY !@Åær !?B2 !`I!2 !A2B!===Ñ !bc !8I22ğ !A2!!ööö !5IYjj2 !EB !1 «'III!!!2B2 !ERāı-_ !+«ææĦĦĦ!! 2&ğ!!ğ !BB !/«(æ!¶ !&B222ğ!ğ2 !F=M¡M !(«æ !&Ö!!2!22ğ !D¼¼¼ûC!īěúĻ !&«iæcc¶!ÖæÖcĦ2ğğ !&ğ !0iČČ!İ !+ļRĀĀĀÆĪú!!C!I9i«æĆc!BRĆ!stÇ!ğ !6ì!!!İ!Đnİð!TTTRC ĭ&]mæR2!Ķ!!Bæ!c!Bc!ĦĆ!ĕB2I !'Ė !0æÆ¦¦tĆĦĦ !&ńń!õå¤¤¤ĭ !,cBccBcBR¦S !(ĖĖ!ĖĖĖ !,ì!¦!!^!!ÅĆ!=į!t!öĆ!!!¤ĭ!!B2 !&¥ B&!2¦SBR2B!ĖĖĖ !2æÆ!!Úº!Bcc!!7CõČ!22!s2µ!ĖC !&¶!cBBRRS!B2!2!ï !4ì!¦!!Ú!BBttRÖ!sČÆccc2Ć!!¶¶ĵ!R!ąd¶BBRSSBB2!ïÿÿ !5æÆ!!!ÃĨ$!ąådË!ÕĖ!!!Ć!!R!Ħ !*RRS!B!2 !:Æ¦!!!RPÅ2·×Ö!!Čö2ĖĆ!RR !&C!!!2RtSS!BĖ2!!ï !8¦ !&U·õ·ccs!!Ħ!c !(R2Ħ!!!ĶSĖB !&c!!ö) !>ĚË62sW!!Ħ!!!cR!!BR!d!!2BBB!BBB2!!ĦB!ļI !6ğ !&cR_ã¦C !'B!!2BB2!C!!R!!22!!!2 !)ĕI !6ğ!!!²ó¦!ĪĪ!!!t¥!c22!2CC2!Rį!B 2' !'2BS!ĦI !6ğğğGĪĪĪ!!ĖĖĖRBdB!2SC22RRį !.B !Hďd2tSCBBRR22 !+Ķ !&B2ĕScBR !Bďď!RR 2&!ïĖĖï Ķ( !&Ķ!!tB!į!R !C ď'ïïï !& ÿ'!!ĶĶĶ2!B!!į!!!R !&YY !Mÿÿÿ!!Ķ!Ķ !.2 !Pÿÿÿ!!!į !'R!!Y22 !Sï!į !)RjB !Vÿ !+2 !XĖĖ !*ğ2 !XĖĖ !'ğ!!ğ !YĖ !(ğ !ÆĖ !ZĖ !&ĖĖ !] Ė& !Ņ !Ņ !ċ",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !DçħT !_× !bµ !<9I !I ñ& !4I22z !IMMÂ !62!R !Gļđı !_FěWWġ !-üYYIIIz+22!!R !D»!c!SG !*yìÌĖrĖ222ĦIBğğ !Eû!BBB!ğ !(yy!öĶĶĦõBBB2!ğ !C y&!¥2B !)yy!BB¥c!2tğğğ2Ķ !Ayyy!2B¥RcR!!2!!!Ìy22!cR!R22 !&ğį !@y!!2BB2!çSc!S!ÌĻÌĖ!!BBĶctæÇÇ !,D !/ii¼āM-MnnM !&BB2RR!!!S!!2s×¥RRBBc2CBsĥĥB !(ĖĖĖô !.iRR!Úåąåõõõ!I!B2!!!2t!!!S2Õ!ÇC!BBcRBĥ!tdd !'ĖĖ !3cccÃ$$!ĦĦd!ÅR2!RsBd!Ħ!!+ !'¥ccCCSd!2BRĶ Ė& !52!!RPÅR××sR!csB2SSBBBR+!!SS!B!CCBBB2!22!į !7iÆ!22¨ªõ·ccc!222cd!RBBR!!!BBB!Ħ¦BB22B2B!!ï !:BBBssûgcss !)ĖĶ!Ķ !(BB!BB 2'Ħï !;CCC!_!_Ċ3W!B2!!!BBĶĶ !' 2&!!!22!ĦĖĦ) !9ÆdBBB_Ċ_Ċ_!!!2!!2 !, 2)!!ĶĶ!BĵČ) !7dB !&_Ċ_!2!!2 !92!!S¦!) !6B !&22o22!!!32CCBĶ!2!2 !/2Ķ22!2RBII !4ğ !&333CCĪ!!RS!!!22!Bğğ !'22 !(R222B!B R& !3ğ!!!222!Ī!Ė!B!RB22BBğ !)ĶĶ !)2!BĦ22!ğ!!j !&II !-ğğğ Ī&!!!Ėğ+ B&!ğ!!I !42!ğ!!I!j !&B !8I! ğ'II)!I!Ħ !& Ķ&!!ĶĶ!Ħ !)įįR!jBį !8ïĽ I&)ĦĖĶïïĖĶĦĶĶĶÿĦĦĦĖĦ Ķ'ğ !&ğ!!!R!į !:ğïĖĖĖďďğğ!!!ğğďďď! ğ& Ķ&!!ĽĖ !*į !=ğğğ !3 ğ' !/D !Tğğğ !*DD !XĖĖ !&DD !]ĖĖ !cĖ !&ôô !]Ėôôô !Ņ !Ņ !Ņ !Ņ !i",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !ĥÌÌČČ !^Ì !&Č !ZÌÌ!!c!!B !YÌ!R!c!!Bd !]c!!B !ZÌ!!2RR¦dm ![RBSS!+!+ !& Ĝ(!!ļ Č( !DČĶ!!ĶõĕĕĽĽ9jTTļ!ĶĶĶ!BĜČĦ2ĦĦĦÆĆļļjjR!!!99j !9Ħ!R !'ĕ!!!BB!ĶĶ!!BĦĶĦĖĖ!!æ¶ĦÖ!!ĦĽYYjR;įR !AĶ!2!!!Ķ!ĶĶ!ĦæĆĆĆĦĦ¶ö!!!Ħ!B2ĶĖį !0ìČČĜÁġÁ!!!R !-ğ!!!Ķ !-B!!¥S!R2!!2 !0ìB22|ÇwÇððR!!c !(CR !&3 !(sBBB!!dssSRR!ğ!22 !12!!BUBUË!!!2!!B!!!C!!2 !&2 !&BB c'ĶB2!!ğğ!2B2 !/ìB222!c!cB¦!!2 !)R!ğ!ĤĤ !'Ctd t'RS¦2 !&ğğį !02!!!BĦBĦB¥ !'22dC!!2 !'222R!! 2(BR22ğ !*ĖĖ !,dddS2R2R22 !'dd22R2ğ !&BBttdcR 2'RĶ2BBI !)Ė !-·;++;2!2!22!!B!!ąąĶB2ğ!!I!!!S!!ĶĆ! B'!2!Ķ !<BRBRBB !)Rįğ!!I!!!2 !/2 !8į !& o' !&B!!¦į!!I9Ķ !&2 !NĦR !&B¦į!!IĶĶ !& 2( !)ĶĶ !9Ė!!!'Ė!ĖGGĖ!m}}į!!9ĦĦĶ !' 2' !' Ķ' !*Ė !0ĖĖĖ!W'W!!!Ė !'9ĦĶ!2 !& 2(!!ĦĦĦĶĖĦĶ! Ė* !<DD!9)Ķ2BB22 !' 2&!Ħ!!!Ķįįğďğğ !BôÚĽĦĶ2B222!!ĖĖĶĶ !' ď&ğ !JĦ!!ĦĖĶĶ!!!9!ÿÿ ï' !N< !'Ė!Ķ !ZĿ !&2Ħ!ĶĶ2 !XğĦĦ!!!Ħ !]Ŀ!ĦĦ!!ĦĦ ![ĿĿ !'ğ !]Ŀ ğ& !Ņ !Ņ !Ņ !Ņ !§",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !ă9uuu !^I2!!!uu !½zz!2'Ĥ !XüČIIĦ!2!ĶIĤĤ !UÌĖĶ !&B2 !WÌČ !&2!!!22!!!Ĥ !Qì!Ķ !&22Ķ!ğğğ != ļ' !+ļļļ9! ü& !)222Ķ!!Ė !<ÌĆĆĆöĦļļļ!!!ļììöÆCąì!ĶĖĶ!!2B!B!Ė!ğį!!!Ė !:üRĖĖĆ!Ħ!!]RRR!ĦĦĦ2ĕĶ!ĖĦ!Ħ!RĆBR2ĕ!ğ!!!Ė!!ĖĖ !9ĆĶĶ!!!]] !32B!R2 !&ĖĖ !<ĜĆ!!!csÀ !+R¥S!BB!BBB!BĦ!SSRIĖ !3yyyQ?Q?!!TTĖĦĦĦRc]!!ĝĝĝ!!SRRĖæµt!BcBB!BtÇdBR!ï !3y!!!Ĵ4Ĵ4?ŀ !'sÐ]!Čìĕĕĕ !+d2BRRR22BB!!Ķ !3y !&4B4B4ö !&sÐ!!ÜÆĖĖ !'Ė!RRRĶBtdSSStB!2!ïÿ !8c!c!c!!!Rss!!ÜÖĦöĆĖĖ!!!R !'B R'22!Ķÿ !5B !& B's!!!s]!ÜÖ !&Ħ !- Ħ&!!ïÿÿ !6Æ B&!B!B !&B]!ÜÖ!!!2BB2!!! B'!!ĶĶĶ!ĦĶj !8C¶RRR B'Sńń!!!æ!22scRRB!!! B(!22!Ķ!Ķ!j !9BBB!!nĂĂBñ!]!Ü!2¥¶RRBtt !,2!22Ķ!2!II !5į2 !&òćÕ!BÖ !&B¥2Ķttt !' 3&SR!! 2&!!Ķ!!YY !4C !&wĺ÷ÕµĶñ!!Bc!2dĦ++ !' B&!! 2&!2 !'22jI !3R¦¦Nłł!÷ė!GĖ !&Ħĕĥĝĝ++!!!2 !+22B! 2&!!Rj !1įC!!!R!!RRs!!ĽdBB!ĶĶĕĥĝĽĖĖ2! B& !/Ķ!!įR !1įğğGGxxGGx!!ğ!ddB2!!!ĥĦI!ďďÿĶĶĶ !,22!Ķ!!99RIIR !:ğ!!C2!!Ķ !)ďďĶĦĦĶĶĶ !.į!BB !<ğ!BC222 !+ğďĶĶĶ!ĶĶĖ!2!2Ķ22!2I!2 !>ğ!BC !/ğďďĦĦĶ2Ķ!2!!2ğğ !&2 !>ğğBCCCB !.ğğďĶ!ĶĶĖįį!!ğğ !CğBBB!ğ !0ğÿÿÿğĖĖ !'ğğ !A ğ& !8ĖĖĖ !gĖ !ÁĖ!!Ė !`ĖĖ !Ņ !Ņ !Ņ !i",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !ł999 !_922BjR !_222!R ![ 2& !]99RB2ğğ !Z92!Ħ!ğ !Züü !`ü2BB222ğ!Ė !X2!2ąĶBį !WüüüĬ222!Bį!!Ė!Ė !Qüü!!ææ!dC!!I!Ė !@ ¼( !+ČČüüü!Ėææ!¥2!!d!!I !&ĖĖ !:yĖ !&ĦüyČČ!!ìììĦæBRRBsÆRR!Ħ!!!2!ï !?ì !(BĆBĶ!ČR Ė&2!!!22!ccĦt!RB!ï !4yyy??? !&RüöĶ¥ !)Ćö2 !(BSSd!t¦!t!B !7y!BB444?İİR!!!¥Ė !(cc¥B !&cc!õõåS!ĶÇRR22!ï !3yBB!RBBB4ĆĆ !'Æc !(cB!!Rcc!!!ĦĶ!õĦ!!!22!ï !4B!RR!!!ñ_!!n!À¥2!B¥ccc!c!!!ĭR B&!!ĶĶ!ąĶ22!ïï !5RR B&ñtÕssÅ!!B!ĆtSBBB !( B'!!!ĶĦ!ąĖåï !7sB !&»F3ĖĦC!÷đ¦¦Ħ!tt¦ħĦ !&dC333CB222Ħ!Õ, !8CR!!!cĲĲs÷çąārc;!!R!2 !) 2'!B22!2!!) !8įC!!!.ĦĖĦĖĖt!Ĳi!;cĶB22!}!!!ĐĖ 2&!SRR22!!ĵ)Č9 !7R!!-^!ĶĦĦ!h6!ĽIį+222!!ñııX!B22 !'RRRcSĵ!ĥII !4įC!!!ċ!!cB!Ė!+!ĖI!ğğ!!·!Ħ7!Īċ222!!CSS !)ĕĶYz !4R¦¦BRBc!B!ĖĽBBĶI!!ğ!B!B'Ī!!22BRBBĶ!SSS2SR!C!ĶĦz!!999 !-įC!!ë!ûxûû!!!Ķ!!ĶII!ñ!ct !&ï!!22!B22 !&3C!2BĶĦzI222 !.įğğ!ë !(ğĶĶ!!ĶĦI!BC!CCC!!ïï! 2&!22!!B22!2B2! B& !:ğďĦĦĶ!!ĥCRİ!XXĪ!!!ïï 2(! 2&B!22! 2& !<ğğďĶñ!!!88ĦĦ !(ïï! 2*! ğ* !?ğĥ !(Ĕ !*ïï!!222!22 !ICR İ& !-ïï!!!2 !Nĥĥĥ !/ ï(ĖĖ !EćC !=ĖĖĖ !Aç!!RĔĪ''' !Y¤ !cbńĔ !?Ė !ĆĖĖ !Ņ !Ņ !Ņ !f",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !Ņ !Ņ !C Ì& !599IjzzzR !AÌÌ !&Ì !62ĶĶ!!!R !>ÌÌ !&¶¶¶ !39!!ĦBįğğ !?ü !'R!!!9 ì'ĜĜĜ !)IBBB!ğ !Aļ !(c !&·!!BBĶĦĶĜĜĜ!!ļI!Ķ!!RI !AĦ!!!RR!¦CC !)ĦĶĶĦĶBČ)!!!B22 !Bļ!!RRcc !&C!!BB!dB2ĶĶĦö!ąSÅå 2&ğĖ !?] !'Sç!c !&=Bt2RR 2&Ķ!ÅBĦĆğğğ!!Ė !?}B!!!2B !'ĐC!!!S!22R!!Ķ!RBõüĝ!Ė!!ĖĖĖ !0yyy???!!!RR!!2 !'Ķ!cðĐC7yR2BStR!RBRcCBdSĥČ I&!!III !,y!BBTTģ±ðð !&mccS!Ķ!!ÐĦX]ĻåċB!22CS2Bdd!!!2SC 2&II !.yBB!RBñtÕss^!C×!S!!ĶĶ!!Ć!ðåĕ !&2!22CS!!2 !&2BB222R222$ !*B!RR!!»F3ĖĦö!¶Ć!+S !(cB !&2! 2' !&dB!2!ğ!222ğ22!R !*RRBBBcĲĲs÷çąñµõ!Z+ !)·!¦¦n!2 !&222!!2!222)ğğğį!2!2B !*sB!!!.ĦĖĦĖĖtæ!!!Ď!+!2!ġBC!S!N !&22 !'2!B 2& !'ğ!2 !+CR!!!-^!ĶĦĦ!¥ñ !'+B2!BsĦHļĐ!!!ĦĦ!222!2!!! 2& !(2ğĤ !*įC !&ª!!õB!!dĲ!Ľ!!!3ğĖ !+RR Ħ&ĶĶĶ!ĶĶĶĦĦ !(ğ !.R!!¦ĆĦc!!Bd!6Ľ!ĽĽI!Z !,ïï ğ)Ķ!ĶĶ!Ŀ Ė& !0įC!!!¥sRdssĪ6 !&2Ħĥĵĥ!!ńńńĔïïï !+ğ ď&Ė !&Ė !1R¦!ÁcRĖRR!ĖĽ!!2 !'C!!ĖĖ !:Ė !/įC!!ÐªW7WW !'2BB2ñ!!!ĝ) !<Ė !/įğğ !*ğĶ!!ĶĶ !'77> !<ĖĖ !9į!ĦĦĦĖĥ!sĐĥĥĥ !Vğğ Ħ&C !^ĿĿà !&ĦĦĦ !Z¤Ħ!!ĪGGG ![¤ńô !Ņ !Ņ !Ņ !Ņ !F",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !Ņ !AÌH !_ÌÌæ¥yÌ !ZüÌæ!!Ė!-×ì !WüĆæ!Ė!Ė^!ċ!Ĝ !UüĆöRRR!!!GĻë»ġ !VR!R!Ć!WÛ !WüĆ!RRRçdĆġÜsss!Č! Ì&!!!Ĝ««X !IĶR·!!ŁcC!·!!!Ì!sĦĦ«««ÖĖĖRIYRzII!!!RRR !9RâĂĢĢç!!ĀĆ!!c!·SBcsĦĶĶĦĦĆöRR¶õĦĭ!R2IRIĽĽĽR !9Ħ!!Ĥğ++!ĶĦ!o===d!!æĶĶĖĖĶ!!BĦĶą!!!B2!RBB !1üüüÁġÁ!!R!!B !)ĦĥġÀÀà !&ĶĶ !,ğğğĿ!!į!2 !/ìÖRRÇCÖ--ġ$ĖĥĤÜĭI!rRĶĦĥB!Ħ!B !5ğ!22 !0¥¥!İ¤ ĕ&Ď¿¶!!ĕåI!!!Ħ!d¦¦ !Gü !'=Ħ2dd!!Õ !&ĆIÜR!!PPW!2!¥ B'!!Ħt2B !*ğį !.Ķ !'īR2Õĥ!B!ü!Ħ!!ĆĶ!ĶĦ !)¥¥BBRsĖĖĕ·dR !+Ė !,ì!!æÖmmĆ¦!Ħ!¦!ñd¦¦dBR!B!Ħ÷Ę6Fx'tt!¥¥ssRRæõBį !& Ė&!IR !+Ć!ÆÖ}!!ÖÆ!!!åBx!ååąĦĶ!¼RĶĦ!s !'¦¦¦ccssc!!II!!)zRIRĽ !.Æö}!!!đŅ!sCS!!ą!!!2Ķ!!B!Ħĥcss!BcRRRSS···SĶ!!I!!Ķ!2I2 !-à,} !&ī2!t22BCm!!!õ!ĶĶ¼RĶĦI!!!ĕĶĦĖĆ Ħ'!ĦĶ!!!2į!2!22 !-Ė !&ĳĘ·tBöĽzs!!!Ķ !'B!ĦĥccS!ĶĶ! ĵ' !)2!!2ğ2 !/Ė!!ĖôĔÆûûxńń¼ü!Ķ!!!Ķ!Ć»RĶ!_o=3!ĶĶ!!!Ħ32 !(ğ !'2 !/ĖĖ!W'W!!Ė!ĭĕ !&BĦÅ¤Õ!B!Ć!Ķ !6ğ !;Ė !&RĖĖå!!Ć!öć÷!!BBRBB333Sĕ2!B!!ğ!!!Ė!!!2 !9įS!BĖ2ĦĖĖĖ¥!hÚċ!!!R!RB c&tĦB!!ğ Ė&!ĖĖïğ !=2B!RRRĦÖÆ !&ÿïïï ÿ'ğc!ÿÿĖ !*ĖĖ !9įSSBĦc!BRcSÖ!!!į !,ÿÿ !Gį!SB!ctd!!SS!į !Uįį<S!!!S į& !Yį<įįį !Ņ !Ņ !Ņ !Ņ !ë",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !Ņ !é±±± !ZĬĬ×ç±ĖĦĖn !WüüĖĖĶBčRBRB !-88 !IĬ!!!R!!! B& !+88!s«üü !:ĜĜĜ !*ĜĖ!RBáė×! c&!!!ÌÌ!888!!s!!ö!ü !8i!!!¼==Ñ=ŀ!Ĭ!R¦SdõÕĦÚ !&9ü«!!8 !*2!B !9ĦĦĦWą!r!C!o}m;;;!rńdāıŁMą!!sÖ !*2c !9ì !&Q2ĥöĕąM¿!!ĭĭĭ!!!2 !)dc !&Ķ!ö!R!!!I !6æÆ···ŁĆĖĶ!ĖĶbĀ!ąąąÜĽ!!-M=_}!÷ĕ !'cR!ö!BBB !6ì!¦!!!ç!!sĦ!!SÇ!ööö!åì!ěī'ĊÜ¦ĕ!!c!!R2BR !&C !6æÆ!!!Úº!!ddB!7ċX!cc2ĦĶµ !&RåSSBBsRB2!BÖ¶ĖBĶ !6Æ¦!!!Ú!BRssB7!!ĲĦ!æĖ!!ĦB!!S!!å!ç¥!¥cccÆ×Ė23RRI !4¦ !&ÃĨ$!åÕS!!tĤ !&BĶ!!B2!C!!õĥBÆcccRĶBCÇsBğ+ !9¨rÅCÇćĦ!×õÌ!!¥Ħæö¥ÇCS+22!!SĦ Ć&!!ÅĕĿğğ!Ė !4ğ !&c!!¶ç·W!µÌö!!ĆĶ2!2!!Ħ !&B!!2!ĆĆööĖ!ìì!!jR !(II !,ğ!!!²#ė×Ī6!!Č!!!ĆĶ!!BÖB!!!Ķ2BĶ !&ĦĦĖĖ!!Ħ2ü!!ĭR !&I !/ğğğGĪĪĪ!ĖĖ !&cR!!¥¶ÖĕBB!!dBB!!!2RR22ĦĦ!ĦĦĭ!!IIR!I!!B !7Ė!!s2Ćc¥ !'+IB!C !'22B2 !)B!!!zB !;Cc22cB!B!!S+!!!B!C!BB!R!!2!æ!22!!2 !(2 !9įCR!B!B!!S !&2 !&SBBBRRR¥ÆæÇ 2&ğB!!!22 !:įCR!2!!S!ğĖ!!22BB!!StStttSS¶öd+ğğ9į!ğ22į- !:į,dSCCğğ!!Ėïï2BBRRR2RBBB2B¦B !&į!!!ğį!Ħ !< į& !) ï(ďB R'ğ!+ !Y ï(!ğĖĖĖ !cĖĖĖ !&ĖĔ !] Ė& !Ņ !Ņ !Ņ !Ņ !č",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !C×u$ !_×!µ !`µ !ÇB!===Ñ ![2!RcscB !_æ~±s ![B!!ÑĶ!. !^BĶġ= !^C!=ĻīM ![B!!ī!!Ļ !+ y& !PV !,ii8ĆĆĦRì !J¼¼¼Û !'Ķ!!!««8ĖĖ !(ì !9iČČ!İ !+RI÷÷÷ĀwĖĦ¥t!ĬĬHöö!!ss!BĦĦ22 !8ì!!!İ!Đnİð!TTTRĭÕrrrÌ!ææC !&c s&!!Bö!cccļ !7æÆ¦¦tĆĦĦ !&ńń!¤ĆssĦæ!!!ĵ!2!ĖÆ!! B&R !<ì!¦!!^!!ÅĆ!=į!t!!2ĆÖ!!ÆÖ !&dR!!c B'ĶsR!!S !6æÆ!!Úº!Bcc!!7Cõìc¶Ė!RR2Ç3S2!!SR¥ÖöÖÖ¶ÖssĦ!!!R !*II !*ì!¦!!Ú!BBttRÖ!sìæ!¥!Rcs!ĥ!Ħ!R!ąs!R!BB!!!öÆcÆÕ !5æÆ!!!ÃĨ$!ąådË!ÕæRĖRRs2Ħ!!!B+!!!B!B !+ĆĆÌ !)I!2 !*Æ¦!!!RPÅ2·×Ö !&2!cs!ĦRCC !'ScĶ¥¥RRcsĶĆR!!ĦĖĬI !(22 !*¦ !&U·õ·ccs!!ì!2!!ĶĦR!!!B+!!Ķ2dt!!RR¶ssĶcBB!R!!II!!I!2 !1ĚË62sW!!S!Bc2ĶB!C!cR!!!2Ķ!!CRRRB2sÖ!RR¥!!+2!R !&2 !*ğ !&cR_ã¦C !(B!RSC2B !' B&!!CCCBcB·RRBBtI22!I!!2 !,ğ!!!²ó¦!ĪĪ !&×CtSCBBRB !(2!!cd222CStRccBB!ğ22!R2B!ğ !,ğğğGĪĪĪ!!ĖĖĖsRR !)2 !& 2&!BR22B!2!CCCd2!ğ2!ğ22 !:ïB!!RcBB!!Ķ !' 2'! B' 2&!2!!ğ!!2ğğ !:ïďB !'22ïĖĖï!!22ï! 2( !&B !(ğ !>ïď ÿ&ïï !& ï&! ï*+++ğğ !&D !XĖ !+Ė !_DDô!ĖĖĖ !UĖ!!!D!ôô !^DôĖ !^ĖĖô !Ņ !Ņ !Ņ !Ņ !p",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !ççħT !_× !bµ !ewÌĜĜ !Zyyû»ĖR!!ļ !Xy!!!¥¥!ĦB !Vyyy!RR÷ttccS !Uy!!!¥ss!BB!S!, !Sy!RRRB!S !^RR!S !&S!ğ Ļ& !Dii¼āM-MnnM! R&!BSBBB!+++)ħ×××¼ i)¼ļ !9iRR!Úåąåõõõ!Ü!RBtS !*B!ÇÇÇs R)!si¼¼ì !)II !-cccÃ$$!ĦĦdR!!!2!BB!RRRĽ !* R(!öĦ!ĖĖĖĬĬ !&I!!I !,2!!RPÅR××s!!!B !&R !)S!!!B !0dII !&BB !*iÆ!22¨ªõ·ccÖ!!c !'Ė!!!R!!RB!22Css R&ĦÖ!¶22Rt22!IR!!!į !,BBBssûgBsW !3B22B33 B&sĖæ¶ss÷!!!BB!222 !-CCC!_!_Ī3 !&2 !.22!!!BB S&scBÖ¦¦!BBB22!BBğ !+ÆdBBB_Ċ_Ċ_ !&2!2 !)ğ!!!2!222!! B&!!t !*ğ!ğğ !,dB !&_Ċ_!2!!¦BCCBĶ !&ğ !'222BBB 2&d·Bt!! ğ' !0B !&22o22 !&S!!!2!R!ğ !22B!sssI !4ğ !&333CCĪ!!++B2!RRğğ!!I !(2!22!!!Ħ!!! ğ&!!!DDD !/ğ!!!222!Ī!Ė!!!+++ğğ!!!I !)Ķ !6Ė!!Ė !,ğğğ Ī&!!!ĖĽ !)II !.ĦĦĦďĶïğ !'DD !&ĖĖ !9 I) !)ĶĶĶ!!ĦĦ!ďď!ď!ĖĖĖ!!D !&ô !;ğĖĖ !+ĖĽĖ Ķ&Ħďďď !*Ė !&Ĥô !=ğ!ĖĖĖ!!!ĖĖĖ! ğ'ďď !.Ė!!!Ė !?ğğ!!ĖĖĖ!!ğ !7ôôô !B ğ) !Ņ !Ņ !Ņ !Ņ !Ņ !ª",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !ĦÌČČ !^ii!Ķ!ļ ![i!c !&I !XÌicc!R2B !YÌĆBĦRc2B2S !XĆ!ss2!!C3!ğ !VÌBB!2!!B!Bğ!!! Ĝ&ļļČČ!üüĬĬÌÌÌII9 !&I9 !<Ħ!RRR¦dsRzTTļ!ĶĶĶĖ!ĦĆČ!RdĦssç!!RzYII+;u !9üĶ!BĶSS!R!Ķ!BB!Ķ!ĦĦĦ!Rs2BdĕBB·!!B2ĦĶR+DD !<B!!õĕĕöĖ!ğ!!!ĦĦ !& d&!!2!!BB!ĦĶ!!I !1ìČČĬÁġÁ!!!R!!2R !'Ķ!!22!! B&!!222!S!3 !&2!!!ğ !0ìB22lÇwÇððR!R22 !&3222!!!3 !(2 !&R3B!2 !82!!BUBUË !&RR2 !'B !' B'S B'!BB!!222R+ğ !0ìB222!c!cB¦ !'2!!322 !(R 2&!! 2&!R2!ĶğğĖĖĖĽĽě!ô !-2!!!BĦBĦB¥ !&222B2!B2ğ !& 3&S!2 !)2!99ğğ!ğğğô !.dddS2R2R22!!!2!22S22įğ!IĔĔB!22BRR! Ħ)Ķ !7·;++;2!2!22 !'33Ķ!+!!I !&2!!Ķö! Ħ(Ė!2ĖĖĶ I'!!III !/BRBRBB !'ĵĵ2+!!I !,ĶĖ ĕ'ąĖĆĕĕĶ2BB!!IIBBB !*į !& o' !&2!!3+!!!ĦĶ !*2Ķĕ Ħ'ö!å!!ĦĶ22B!BB222 !3ĦR !&2]K!!!) !4cĥĆ !&ğğ!B22 !.Ė!!!'Ė!ĖGGĖ!m}} !&)Ķ !(2 !( 2'!!c !(22 ğ' !,ĖĖĖ!W'W!!!Ė !'ĽĽĶ!2 !&BB 2&!2 !'2!2 !(ğğ !<ĝ Ľ&!!22!2 !&2 B&2SS 2&!t!CCB !E 2(!!ĖĖĦĖĦ!!!Ķc2 d&¦ď¦BBğ+!! Ė&) !9ĿąĦ!Ķ!22!!!Ė!!ğğğÿÿÿďïį ğ'!ğğğ!ĖĖĖ !&ďĖĖ !8C!Ħ!ĶĶĶ ![Ŀ!!Ħ!Ķ!!ĶĶ !YĿ!! Ħ( !ZĿĿ!!ĦĦĦ!ğ ![Ŀ !&ğ !^ Ŀ& !Ņ !Ņ !Ņ !Ņ !ª",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !Ņ !Ņ !£ļļļI !;uuu !@ļļĦĦĦĕI !9I!!!uu !=ĜĦĦ !&ĕI !8Ħ !'u !;ĜĦĦöööĦĦ !'Ìììì¼Ì9 !-IBě !@ĦĖĖ!Ķ!ĖĦĦ!IuusĦĦĦ2!!ĬĬ !3u !9ü!ĶĖĖĦĖ !0CC)Ĭ !(IR!BĻ Ĥ' !9ĖĆĦ!!!sRâÂMM22!!!R¥× !'Ĭ !&I2!RĶ!) !&III !+yyyQ?Q?!!TT!Ħ!!B¥sâ !)RRĖæµĕĵĵĕĶĶĜ!ì!!ĶĖåĶĦĶĽI)Ľ !-y!!!Ĵ4Ĵ4?ŀ !(ct¡!!ûûû !+öö Ė&ì!ĜAąąĶ !)22 !*y !&4B4B4ö !'sân!êÊĕĕĕ!!!Ė!RRR!2 Ė(ÖĖ!ÖÖĦ 2&!!222B !.c!c!c !'sò!!ºÆĖĶ!!ĔĔ!R !122! 2&ĖB 2& !)B !& B's!!!ss!!ºæĶĆĦĖĶ!!B !)R !'2B!BB! 2&BĶ2!ğğ !)Æ B&!B!B !&cs¡!ºæ!!!Ė !' B'!!!sRRRĖRRÆBBt !&22ğğ !+C¶RRR B'Sńń!¡!ºæ!!22RR2!!! B' !&222¶c!BBB!! ğ' !/BBB!!nĂĂBñ!R!!æ22cR¥RBB!!S !(2Btc R&3!ddB !3į2 !&òćÕ!BÖ!]!º2c¥RRBB3S!!! 3&S¦Ç·B d&!ĕd2BB !'ĖĖ !-C !&wĺ÷ÕµĶñ!!!cB!ĶtSSB !& B&!22!!!222t¦BB2!Ł Ė&!!Ė !-R¦¦Nłł!÷ė!G!!B2!BdĦRR2 !& B'!! B*2!Łïô !3įC!!!R!!RRs!ĖĤ!!B!ĵĵöĦBRĖĖR 2' Ė)!!ïïïô !+ĖĖ !+įğğGGxxGGx!!Ėd¦3!!!ĵĖĦĦ!! ï( ğ)ïï !IB3!!3!Ė !Yğ!!B33!!!Ķ !Yğ!!B !`ğğ! B& !^ğğ!!!ğ !_ğğğ !Ņ !Ņ !Ņ !Ņ !G",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !Ņ !ĀIII !_I!22R !a2IR ![I!2B2 !A Č( !*ČČČü ¼& !&yÌ¤Å2!ğğ!R!III !9ì ö'Ħììì!!!ììĦĦĶ2R!!!¼¼yyöĖ!!ĦĖĽĽ!ĭI !;TöĖ !&Ė!!!RRR Ė&!!! 2' !&B !'Ľ;!BBB !,yyy??? !&RTº !(Ħ2öBÜ !&22!!! B'¥RÆR!B2 B&!B !.y!BB444?İİR!!!Ķ¥ !&BĆBĶ!Ü!!2!R !*2BBRB!B!!!2!22 !,yBB!RBBB4ĆĆ !&¥Ė !)Ćö2!!!R!!RB 2'B!!!2t!222ğ!ğğ22 !*B!RR!!!ñ_!!n !&Æc !'cc¥B!!!22B!! 2'Ķs¦tS2!ğğğ !&ğğ !*RR B&ñtÕssÅ!ńÒ2!B¥cc!!!cB!!RR22BSB 2'S3!!B!ğ !&Ė !.sB !&»F3ĖĦC!!ń!ĆtSBBc!c!!!ĭRB2B!!! B'!BBB!BI!!ĖĖ !/CR!!!cĲĲs÷çąā!·ÀtĦ!SSB !(BBC3C! S( B'2!ĖĖ!!!Ė !-įC!!!.ĦĖĦĖĖt!!c!2!!BBtħĦ !&d3!22 !'BBB!222ïï !5R!!-^!ĶĦĦ!h!i!;22!!!Ħ !(BRB22RBBB22Ħ !:įC!!!ċ!!cB!Ė!+I9ccĶ!!!Ç!!!ĐĦB222!222ĦĶĶ2!!!ï !*Ė !/R¦¦BRBc!B!ĖĽĦ!Ķ!cRRB!ñııX !&įB!!!2!!!2!ï !8įC!!ë!ûxûû!!ğĶĦ Ķ&!!Ð!Ħ7!!ě!!9!!!Ķ2ĶĶB !/ĖĖ !-įğğ!ë !)ğğď Ķ'ĦBBC!Ī!ÿÿ!ĶĶ!22BB!!ï !IďďďĶÀ!BtĪĪ !&ÿÿ!ĶĶ !Rð!BC!CCC !'ÿĖ!ĶĶ!!ï !LħĦBCRİ!XXĪ !'įÿÿÿïï !MĦ!CRİĥĥïô !Xç!dRĔĪ''' !Y¤B!Ĕ !`Ań !Ņ !Ņ !Ņ !Ņ !ì",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !Ņ !ńIII$ !? Ì' !3¼¼ČzIII!I !AÌÌ !4¼¼¼ĜRRöĆR!!IB!B!G$ !:ÌÌ!!R!!ssÌ!ììì ¼'üüüccRĖR!R!!BBB2 !&h !9ü !(R!B¶ì!!!Æ!RRR Ķ'R2ĦRcĶ!!22ğB2 !;ļ !)BB!!·!!BĶÆR !* 2&Bğ2ğğ!2ğB !:Ħ!!!RR!!SCC!!cB2!3! B)!222!!!ğ !(B !8R!!RR!!c !(2B2!!S 2& B& !,ğ!2 !:}c!!cc!cR!!C!C2SS B(22C!!BSSR !*22 !,yyy???!!!RR !0ĐC!!2Ħ 3(2SttBB !,ğ !+y!BBTTģ±ðð !&]cc!SS·2 !'ccc! 2(B2!!!22 !*ïïĖ !*yBB!RBñtÕss^ !&S!S 2&!!!ĐCå!!2 B(22BB2!ğğ!! Ė' !-B!RR!!»F3ĖĦö!t!!+S!2B!!cðĐC7i !*22!2ĦĦĶII !4RRBBBcĲĲs÷çąñõ÷!Z+!ĦĶ!!ÐĦX]Ļåû!2B222B22ĶĦ !'IĖ !2sB!!!.ĦĖĦĖĖtæ!r!Ď!+!Ħ!!Ħ!ðåĕ !& Ķ(!RĶ2!2 !6CR!!!-^!ĶĦĦ!¥ñ!!I!!+R2ñĦBB !'ĶĶ!!! Ķ&RBB!!!ï !3įC !&ª!!õB !&)ĦI!!ğğ!BB·S¦¦n!Ħ Ķ'! Ķ' !9R!!¦ĆĦc!!Bdx!!!Ķ9IIĘĥBC!R!N !*ĶĶĶĦ!!!Ćï !5įC!!!¥sRdssĪ!!!2!!!3!!CsĦļļĐ!!R !+Ė !;R¦!ÁcRĖRR!ĖĽĶĦ!2!àĥ!R !(ïï! Ķ* !;įC!!ÐªW7WW!!ğğ!ĖĆ!!!C !(ï!!ğįį22 !'ĖĆį !8įğğ !,ğį!ñĥ!RBĐİİĔĔ !(ğğį 2'į !HįąĦCBĐĥĥĥ !- ğ' !IçĦ!R!!ĦĦĦ !Y¤!BĔôĪGGG !Z¤A !Ņ !Ņ !Ņ !Ņ !î",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !Ņ !¤ÌÌH Ì& !Y¼H!æRæĖR!ÌÌ !V¼!!Ė!ėāÑÛċċċġ !Tü!öRR¥ÀĆĦÜsss !TüĆ!RRR¥ĶĶĦĦi(( !WRRB2R!!!Ħ!!ČçČ !PüBÆ÷ç¦d!«s!ĖĦc¦cB!üüČČĜĜļ!ČìyČ9 !,$$ !7·t_MM;Bd!iB!ĶĦĥ'GB2ĶĶĶĦĦĆüöö¶!!99YIIIR!!9GG !6I--B!!!ĿĿ+R«R!Ħ!Łdd!2Ė Ć'Ħ¶ĶĶõĕ!!222IIR2!2 !/ĬĬĬÁġÁ!!ńB!īī)II!ğRµRĶĦ!à!!2R2 !&Bö!!ĶĦĶ !'2Ľ22 !/ì¥!!ÇCÖ-Īġ!ĥ°Ŀ!ĦĦI!ğ!µRĦĦBFË7yB !-B!!!ĦB 2& !/¥¥!İ¤ ĕ&îm¦!ÕõĦĦI!!!dBĦĦÜ!!!22 !- B&ğB!!2 !-ü !'=Ħ2dd!!PütS!ĦĦI!!PdĶĦ!Ö!!2R !*2! ğ'!ğ22ğ !-Ķ !'īR2Õĥ!Bñm2ĶĶĶ2Ķ!!!Ps!!SSB!!c22cĦR2BBK !6ì!!æÖmmĆ¦!Ħ!¦!!Ľ+ĕĕĕĦĶ9!!!'BMBB!dRRsc2R¶¦t] !*ğğ !-Ć!ÆÖ}!!ÖÆ!!!åBx+!ĶBd!ĶĶ9!!¶ċĠıı-!CCSRRÇ¶ !+ĖĖ !0Æö}!!!đŅ!sCS!!C!!!ą !'ì !(sscctS!¦BBI!99!))Y!ĖĘĘ !,à,} !&ī2!t22B!sü!C !/Ķ!!!Ė!BB !&22!ĶĶB!!ńń !-Ė !&ĳĘ·tBöĽz!Õ !'åÕÅÜö !,2!!Ħ !)22 !3Ė!!ĖôĔÆûûGńńĭü!t!2å ö&¥R¥S22!!!2 !+ğğ!BB !4ĖĖ!W'W!!!Ėĭ!!ĦĥĕĦö!!!R¶¥æ!Ķ !(B !Jį!!!ĶĦ! R&B¶!¥!!R !&2!B!B!2ğ Ė&ïïï !>į!B!!Ħ!!!B!2!S!!!B2!!ïÿÿB!ÿïĖ !F<!Ħ B'!BĶ!!!į ï'!!!ÿÿ !J<]ĦB!!2BSB!įį !W]<]]L<į<< !Ņ !Ņ !Ņ !Ņ !Ņ !B",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !Ņ !CÇćT !_Çė×! ±& !<II !>ÅQÕ !@I !AcC!ÖccÖ !Y))BR!!ġġđ !1ììì !(I!BB !;))!!C!!đ!!RČ !.««!BBIII!II !2ĜĜĜ !*)ĬĕĕĕĥPńńĆ-^đ !+«««iĦĦæĦ !&z!!B!!į !-i!!!¼==Ñ=ŀ!)ĥĶÂÂÂ²!!!-ĻċG²!!ìì!!««ĦĦĆĦĦ !)ĖB!!B2 !/ĦĦĦWą!r!C!n²} Ĥ&!!!G!!2īì¼ĖĆ««ĦĆĦĦ!!!22!! B&2B2!ğD !,ì !&Q2ĥöĕąM|!!ČČČĝĽ9 !&Ķĥ2Ķc!ĆĆĦ !(B!2BĶ22!ğ!!2 !.æÆ···ŁĆĖĶ!Ė!Æ|!ĦĦĦĕåõĽö!!!S!s !+22Ķ¥RC!ğ!2!2ğğ!Ħ !+ì!¦!!!ç!!sĦ!ąą!!!ĖĶĶ!Ćb!ĦĶ2!!!2!c B(R!!RC!!!ğğ!ğ!!!Ė !+æÆ!!!Úº!!ddB!ćË!}Ė!ĦĦB!B¥sS!¦Rt¶B!!!BRRcRĖĖ!B !&ĖĖĖ !.Æ¦!!!Ú!BRssBćË!·!RĦööÖcĦö!å!ĥ2ĕdRc2¥css2cc¦B2!!ĖĖ!!!ĖĖń !+¦ !&ÃĨ$!åÕSË!·¼XĖö!!ĶĦ¥ÆRÇ!!!Ħ!¦sæsR22t×ç2!!ďĖ !8¨rÅCÇćĦ!$¦ÕĶĦ!R2Rc !*ĥ!!ĦĦStSR!!22ď !5ğ !&c!!¶ç·W!ń7Ć!!RĦBcĶ2!S!!C!!Sĥ2ĶĶąõĕąďįďď !7ğ!!!²#ė×ĪĪ!!ĭõ222!BRĶBBS !'B!!Ħ Ķ&!Ħļ !;ğğğGĪĪĪ!!Ė!Ķ!22!!R!!Ķ!!B!Ķ!!Ķ !(ĶĦĶ!ļI !CĖ!ĶR22!!BcRS!!į2!!B!!!22 !)I !CĿR!R2RB !&Bį!22CS!!R!!22!!Ė!!!z !C<RRRB!B!S!į!I!!2!2S!RR!!2!!S !G<<R S&BB!!Ħ!222!2SC!RttRt!!B!R !E<ĿĿğğÿÿĖĖBB !&B2BSS22 !(Ij !MïïďBBB!B2B222!!22!!ğ !Q ï&!22BB2dB!2!!!2j!!!IR !N ï&! 2&!2 !&IRR2D !Rïï2!!2!ğ!ğ!B!I2Ĥ !U22!ğ!!!2 !Yïïğğ !&ğ!!!į !WĖĖ !'2 !]Ė !&ğ!ğ !¿ Ė+ !Ņ !Ņ !Ņ !h",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !§×ć$ !_× !bµ !¤IY !D===Ñ ![2!Rc±±Ł !9I !FM-=Ç !;2 !BB!-ĻGM !8I!2 !Eċ!!Ċ !/ììIIIz!II2!!2 !CF!Ķ!!I !*¼¼yyĆĖÅ!!Ėz!2B22 !O¼¼yĦĦ!¶2 !'Ė22!B !@¼¼¼ě !,ì¼ĦĦ!!22æsĶc 2'įğğ2ğ !.iČČ!İ !+ļRĀĀĀÆ»!¶¶B!!ĬH¼ĖĦ!! 2&!t!2Ŀ!2Ŀį!!!ğ !.ì!!!İ!Đnİð!TTTR]ìÌÌH¥!¶!C2C!!cs!22B2css2ąÖ3!Ŀį!!ĭ !1æÆ¦¦tĆĦĦ!!!ĻĻr!ĭĦĆæ !&2ĵC2ąĖÆ¶¥ccRsB2B¥23 !(įĖ !/ì!¦!!^!!ÅĆ!=+LõiåcĦR¥s¥ĆB!!!dR!Æ!BBB!BS!SCBR!!!ĖĖ!!ĖĖĖ !,æÆ!!Úº!Bcc!!!si!!¥RRæ!RR3S2B!SĦö!BBBtSRdRB2BĖĖĖ !2ì!¦!!Ú!BBttRÖ!Õ!cĖRRæscĖt !'ą!B2æææåcB!B!B !6æÆ!!!ÃĨ$!ąåds!!!2!cæscĖt!!!R !&c!!Ćæ¶QµR!Rïï !5Æ¦!!!RPÅ2·×sW!!!2!!¥RĖtB!B+!!!S!dCB¥sBæ¥ĕµï !7¦ !&U·õ·ccc!!ì!Bc2BĦtB!B+!!!Ķ2dB2BBR¥sB!¥H !=ĚË62ss!!Ss!RSS·B!!R !&2Ķ!B2 B&c¥ÆÆR¼ !6ğ !&cR_ã¦CC!!!B!dBB!!BR !'BBB!!22BB222!B !8ğ!!!²ó¦!ĪĪĪ!!!CCĶ22BR2 !'2!B!!BS322BR!B!RČ !7ğğğGĪĪĪ!!!ĖĖR2!!222 !,B2!BBS322Bt!RRČ !BďR2B!2 !+2!!!2!B!BS3drRBS¦I !Bÿğ!2!! Ķ&ĽĽïï!22!!2! B&!Ös3!!BI !CÿïĖĦĶĶĶĦğğ!!ïïï!!! 2&Bĥ!t!!2 !GğďĶĶďğ !) ï&!!!2tdõR2!!!R !&Iu !@ğğ !/ ï&2Bd!!22R!z !Xï! 2& !&9!I !W222!!ğ!!2!!2 !Uï !&ğ!!!2RR !Wïïğğ!!!ğB!!!Ĥ !WĖĖ !&ğ!!B !ZĖĖ!!I!ğ !cğ !cĖ ![Ė!ğ!ĖĖ !^ĖĖĖ !Ņ !Ņ !Ë",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !Ņ !DyÌÌĜĜ !]y!ĖR!!ļ !Zy!!ÆBĦB !Yyy!RÆSScS !9Iz !?y!!!s!!!S!, !7I!Ħz !=y!!!R!S!B !Xy!!R¥sSBB!!ğ !. y& !,I !/ii¼āİðĐ^^ð !&RR2SB!BRRR!ĜÌĻĻ¼¼!!ìyy!sRÖIIIYjjR2 !1iRR!Ú!BBąąR!ü!RR2¦B!B2ĆĶ!RSs××sĦyì!sBsRcĦ2!B!Ķ!ğBBğM !/cccÃĨ$!!ĦdR!RR2d!!!2Ć !&B!ssĶ!!öööĦ!t2¦ą+įĿ!!!ğğ !12!!RPÅ2·×Ħ !*BĶR2 !&SSS! B'!öQÆÅ !&Ŀį !2iÆ!22¨ªõ·ccW!c!BB!!!ĦĦĶB2!!BBB2R!!cccR2B!!Ė !9BBBssûgcs!!!R22 !/2!¶cRRBRscBcBü !8CCC!_!_Ċ3!!!cCC !&222ğ!!222!!2c22Bcc!¶!Ķ!üĭ!!!ĖĖĖô !-ÆdBBB_Ċ_Ċ_ !&S!!BĶ!!22ğ !&222dCCSSCCĦBdĶB!!!IĖĖ !1dB !&_Ċ_!2 !&B2!2!B2ğ !)2!22!!22!dĦdĖSSBĶR !2B !&22o22 !+B2ğ !(222B222!!!tR !'B2!R !&II !+ğ !&333CCĪ!!]+!!BRįğ!!!I !(2B2!22!B!2B!BR !&R !&Ķ !,ğ!!!222!Ī!Ė!!!++įğ!!!II !+2 B&2!R!t22ĶĶI!!z!92B !-ğğğ Ī&!!!ĖĽ !(II !12!!!B!!!ĶĶğ!I!zc22 !8ĦĽ I' !0 ï'ÿ2!c!!!Ŀ9) !>ĿĦĖĶ !*II Ħ&ïïï !(ï!!2!B!Ķ!!!ğğį- !9ĿĦĦĶĶ !&ĶĖĖï ď& !,ïïĖĆĦ!B!!ğ!DD !;ĿĦĦĦ Ķ&!!ğ !3ğįď)ĦB!DD !>Ŀğ Ħ( !8ďď !DĿğĦĦ!!ğ !9ğğ !DĿĿğğ !:ĖĖ ô' !Ņ !Ņ !Ņ !Ņ !Ņ !'",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !Ņ !DiiČČ ![iii!!Ķ!ļ !X«i !*I !V«ĦB!B!cc2B !XĦ!ĦBBc!cB2S !VÌ!!!Bccc!C3!-!! ļ( !NBB¶c!!ddBB!Buļ Ħ'!ļļĬļļļĬĬ !EĶ!B R&ĵBRRR !+ĖĖ!ĶĶĖC!ĬIIR !6ìČČĬÁġÁ!!!RĶBRĶSSSCĶ !)ĶĶ!!!BBĦC!R!C!Ķ!ĽR I& !0ìB22lÇwÇððR !'ĕĕĶ!!Ć!!ĤĤ !)ddd!!!B!!;!+!!+ !32!!BUBUËÌ!üsĦĖĦĦ!ĶĶ!2!ğ!!3 !*BBC!B!d!+!!+ !2ìB222!c!cB!!Ķ!sR !.2!!BBSRBB!BS!B !92!!!BĦBĦB !(B2!!!2!ğ !&2!!!S!åÕµĕĕ!õĕ!ĝ !'++ !0dddS2R2R2!!! 2& !'R !(2RSĕåÖöĖÖöÕĆÆb!!ĽĽ!!ĽĽRuu !,·;++;2!2!2!!!2!2!2!!B!ğ !&B!ĶĆÕĦĦ !'æ!ĦĶBĽ!!!Ľ !6BRBRB!! 2&C3CB!+!!I !+B!!!2 !;į !& o' !&2!ĵĵ2!+!!I !+ B&cR!2!R !@Ħ.!·!C!!3R+!!I !*2!!BccB2¶!RR!+!+!!!+!Ĥ !.Ė!!!'Ė!ĖGĊ!ğmKm]Kğ!IIĶ !'3!22B2!!22C!tcBĶ!+Ľ!++Ľ !1ĖĖĖ!W'W!!Ė !& I&ĶĶĦ !'BRB2CdSSCC2!!td2!!+!!!+!!Ĥ !8ĭĝ99 Ķ&ĦĦ !'B!SCCĶ! 2&Rtą22RI !Aį2ĆĆ Ħ&2BB !&2B!BBB2BBRR!cÇRR!! Ė'!!!Ė !<Ħ2BRB!ĦïïĖĖĖ2 R'22 ï+ !'ĖĖĖ !:į2!!ĖĦĖĖĦ !'ğ ï* !LįĿ2!Ħ!Ķ!Ķ ![įĿ2Ķ!Ķį !^ į& !Ņ !Ņ !Ņ !Ņ !Ņ !G",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !Ņ !æĜĜĜļ !^ĜööĦĦļ !:II u& !=ĜöĖ!!B !Au !;ĜÆ!¥RB!S !8Iz !AĜĦ!RBcB!ĕI !3ÌÌ9I !&ī'ĤĤ !<æRĖöÖĆĦ !72!!Ħ22 !>ļĦR!ĶĶĶĖĦĦ!I!!Ĝ Ì' !(ÌÌöcĕ!R!!!Bğ!!Ĥ !9Ć!ĶĶĦĦĦĶ !&uu !&ss!!¼ÌÌÌöĶ!!Ķ!!BBBğ !=ĖĆĦ!BBB!ĶBMM !'s2dÌXĆöĶĶ!c!ĶĦ!ĩğğğĖĖĽ !0yyyQ?Q?!!TT!Ħ !'Æò¡ !'R!öĶµö !,ĕļ !'2) !.y!!!Ĵ4Ĵ4?ŀ !(RRÆ¡!!!û !12cÆĶ3IIIĖ!!ď !.y !&4B4B4ö !&sR!ò¡!!ÊÊĕĤĤ!Ė !)BRRc¶¥¶tc!!ï !&ďĖ !1c!c!c !'ö!ò!!ººĶ !'R !&BBBR!B¶öBsB!!ï !3B !& B's !&sò!!º Ħ&Ķ!!B!R!ĦBRRR!BB22CCR2ï !4Æ B&!B!B !&css!!ºĦ!!2B !&B2cĖRRRcsR23CRR!ï !5C¶RRR B'Sńń!s¡!ºĦ222!!2!!!BR2cBBBdSCCBR22ĖI !7BBB!!nĂĂBñ!R¡!ºĦ!!!BcBB!!S!!BR!SS!222B2ĦĶ22jIIz !1į2 !&òćÕ!BÖ!]!ºĦ22BcS33S!!! 3&SBBB2BBĶĖ!22!ĦB!ĶIII !/C !&wĺ÷ÕµĶñ!ê!!!B !+ B&!BBBR22 !)22į222 !0R¦¦Nłł!÷ė!G!!22B!BSBBB !& B'222Ħ!!!2!!2BRğB!B !1įC!!!R!!RRs!ĖSBB!B3Ħ++!+ĖĖB !'ïĶĶ2ĦĦ!!B!!!ğ!ğ!ğBB !0įğğGGxxGGx!!+!BB!!ĵĭĽ+Ė!! ÿ(!ÿÿ!22!2!!!ğ !'ğğ !<ĖSS33!3!!Ľ !.ÿÿÿ2!Ķ!ğ !GB!!22 !3ÿÿÿïĖĖI !'Ė !=ğ!!22 !;ïĽII !Ağ!222 !=ğ!Ė !@ğğ !&ğ !8ğ!IĖ !C ğ& !:ïï !Ņ !Ņ !Ņ !Ņ !l",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !ŁIIYYRR !^2!2I!R !^B2 !^I !&ğ !ZII2R2Ķ ![I!!!Ķ2 !ZÌÌå!!22!įğ !WyĖĖ!åB2!ğ!ĖĖ !UÌĦ!¶R!2!ğ!Ė !TÌÌÌ !(Ć !(Ė !OÌÌĶĖĖöÖ!Ć!t !*Ė !< Č( !*ČČČ¼ĖĖĦ!!c¥¶¶!!R!IĖ !@ì ö'Ħììì!!!ììöö !'BBRÆ!!CB!!Ė !@TöĖĖĦĦ!ĖBBBRRYĖĖ !&BBB2sBBR!222!ğ !4yyy??? !&RTF !4 R'ĶRtStB2ïï !4y!BB444?İİR !'2BR22Ć !*cĶB!!2BcC2B22ï !5yBB!RBBB4ĆĆ !&Ķ¥B2 !&Ķ!Ü !&c!!RBRBBC2B!!Ė !6B!RR!!!ñ_!!n!!¥¥Ė!!!BBBĶBB!Ŀ!!BBB!RBdS2B!2Ėğ !6RR B&ñtÕssÅ!!B !&B !&Ė!ü!RcBBBS!S2BB22ïğ !7sB !&»F3ĖĦC!ńS2c !)ĆÖSĭRB !&S!B22!¤ü !8CR!!!cĲĲs÷çąā!K!!÷sR!!Ė2Æ¥ĥ!BB33C!BB2!ĖåB!ü !7įC!!!.ĦĖĦĖĖt!!·ttĦS!2!!cCdS2tC2B2!!2!Ė!!!B!ļ !8R!!-^!ĶĦĦ!h!cK2!!tBR !'B!2B2!!2ĖĖ!!SB2B!III !4įC!!!ċ!!cB!Ė!r!R22!t !)Ė2!!2!!R2!!!3CB3!!!zI!!III !/R¦¦BRBc!B!ĖĽ!2R!Ķ!tħC !&RB222B!!!2!!!2!!2 !&RI22 !/įC!!ë!ûxûû!!ğ!ğ2cRB2Ħc !&ÿï 2&!!B!2!BB3B222!B!B222 !/įğğ!ë !)ĖĖğğįįĿðmĐ!!!>!ïï !'B 2' !(9 2& != Ė&÷Ħ!Ħıġ !'ïï !&222!RB!2Bğ!2ğ !Cć!BBB7Gú !(ïï!!!222!!22!!2ğ!ğ!2 !?ç!!CdtĪĚ !+ïïï !&2 !&ğ!!!ğğ !?¤BCR!!CCC !-ïïï2!!!ïĖ!D !DAńĔńĔ Ī& !/ ï&!!ĖôĖ !ĆĖ !ÆĖĖ !Ņ !Ņ !Ņ !ĉ",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !Ŀ I&RR !^2229!R !YIIRĶ22į!!R !T«üĜI!!ĖR!į !WĬ¥æĦõ222!į !T««yyÆ!R!22B!ğ !Qìì¼¼BB!!!ĆR2ĶĦĶĿ !GÌÌ ü& !&ì!!Æ!BRRRcB22B !'ĖĖ !BÌ!! Ė&ÌÌüü!!BĶÆRBBR2s2dCB!I!Ė!!Ė !@ü !+ĖĶcB2!!22RB2Ėd22!2!Ė !&ĖĖ !=ļ!!!R!R!!¶¶¶·2B2!tSS!Sdt2BB2!ï !CR!!RR !&R !&C2dS!R2tccRB!2!ï !9yyy???!!!RR!]B!!!R2!c !'S!R!!BB! 2&Ķï !9y!BBTTģ±ðð !&2BB222!dCC!!!BB!! 2&!!Ķïÿ !9yBB!RBñtÕss^!!!dtBRRB !&C !*ĶĶĶĖÿ !;B!RR!!»F3ĖĦö!t!+!SSdtė2 !&= !*Ħ!II !:RRBBBcĲĲs÷çąnõ÷ !&ĶĶ!2R!-=B!222!!!Ħ2!!!I)) !7sB!!!.ĦĖĦĖĖt!!r!+!!!ĶĦ!!!Ļīċ2 !'2R222!BB!) !6CR!!!-^!ĶĦĦ!¥ñ!!!+ !&ĶāĐı!G !+22BĦBB!RY!!III !/įC !&ª!!õB !&9I!+!!!āåĦ]Ļåûû!! Ķ& 2&!!BB!ĶYY!!!R !0R!!¦ĆĦc!!BGx!ĶĶ9I++đą!Ħëĕ!!! Ķ'!ĶĶ!!R !'BB2!!Ľ !/įC!!!¥sRdss!Ė!ĶĶ!!IĘĥ!BcC !'ĦĶ!!ĶĶ!ĶĶĶ!!BIB!ğ22!!Y !0R¦!ÁcRĖRR!!Ė!!2!ñĥ!BdC,¦¦FFÿ!!ĶĶ!!ĶĶĶ !'įğ!!BB2 !0įC!!ÐªW7WW!!!ğďĖñĥ!!C!sR!ĊĖĖ!ğğ!!ĶĶ !@įğğ !-ÀåĦC·m<ĐĦĊ !(ğğğ!ĶĶĶ!ĶĶ !'įğ !A¤!BR!!ąąĥ !,ğğğ!Ķ!Ķ !)22 !@¤AĔôúGG' !/ğďďğÿï Ė&!ğ22 !_Ė!!2 !`Ėğğ !aĖĖ !Ņ !Ņ !Ņ !Ņ !Ê",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !Ņ !AÌHÌÌ !]ÌÌæ¥Ė!Ì !YüÌæ!!Ė!--ì !WüĆæ!Ė!Ė^!ċ!Ĝ !UüĆöRRR!!!GĻë»ġ !VR!R!Ć!WÛ !WüĆ!RRRçdĆġÜsss!Č !UĶR·!!ŁcC!·!!!ÌÌÌĜ ü& !&üü !CRâĢĢĢ·!!ĀĆ!!c!·SBcRR2!!!Ć ¼&Ć!II !EĤ++R!ĶĦ!o===d!BR 2& c&Ķ¥tĦ!jjjRR!!RII !.ĬĬĬÁġÁ !,ğ!!ĦĥġÀÀà!!!2 !& 2'!ĕ!!ĦĦĦ9ĽIRĽ!M !-ì¥!!ÇCÖ---$öĥĤÜ)I!¼RĶĦĥB!Ħ!B!!CB 2(¥!S!!22!!R!I !1¥¥!İ¤ ĕ&Ď¿¶!!õĦIğ!!Ħ!d¦¦!!!3 !/ĿB22Ķ2!22 !-ü !'=Ħ2dd!!Õ!!!ąĦIµR!!PPW!2!2 !+SBB!!ğ2ğ2!Ķ !/Ķ !'īR2Õĥ!B!ü!Ħ!ĦĦI!ĶĦ !(BBSddd S&!!!+!!2!ğĿį22Ĥ !+ì!!æÖmmĆ¦!Ħ!¦!ñdRR!B!!B!Ħ÷Ę6Fx'Ħå õ&ąĵRRÅĦ+!!!ğ !&įį !,Ć!ÆÖ}!!ÖÆ!!!åBx!ĶĖ!Ħ!Ħ¼RĶĦ!s!!!ąĦ ö'ÖQQcK!!Ľ)!ĽIĽĽĽ !.Æö}!!!đŅ!sCS!!ą!!!2Ķ!ĶB!Ħĥcss!ĦĆ Ħ'!Ħ¥!Čĭ!+Ķ)RĖ222!Ė !+à,} !&ī2!t22BCm!!!õ!!!¼RĶĦI !&Ħ Ķ'æ2Ķ!Ħĥĭ!!!ğ2 !1Ė !&ĳĘ·tBöĽzs!!!C !'B!ĦĥccS!Ķ !&Ķ!BĆĦĶ!!!22! 2& !/Ė!!ĖôĔÆûûGńń¼ü !'Ķ!Ć»RĶ!_o=!!ĶĦĦĦĶ !&2!!!B2!2!!2 !0ĖĖ!W'W!!!Ėĭ!!ĦR2BĦÅ¤Õ!B!Ć!Ķ!222RRR2 !*ğğ!ğ22ğ !:į!!!S!Ėå!!Ć!öć÷!!2RB2 !'ĦRB!C !(ğğ !>B!åĦĖĖĖ¥!hÚċ!!!dÆ B&¶sĶæBB!;IIĖĖĖ!!!Ė !:į!!åB!RRRĦÖÆ !&ďď, Ð&}Ð¥¥¥,įĖïï!!!ĖĖĖ !<<SBĦc!BRcSÖ!!!į !+}}Ā !HįSB!ctd!!SS!į !Vį<S!!!S į& !Yį<įįį !Ņ !Ņ !Ņ !Ņ !ë",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !Ņ !æ«««±±± !Z««M^'!cc± !Wìì!!ĶBč!ĆĆ !Wì!!¶¶ !QĜĜĜ !*ì!!R!ñė×! ¥& !Ii!!!¼==Ñ=ŀ!!R··d!õÕĦÚ !&9 !IĦĦĦWą!r!C!T};;;}!rńdāıŁMąü !+Hyyy !9ì !&Q2ĥöĕąM¿!!ĭĭĭ!!!2 !'BĜĜ !&HHH!Ć!Rü !8æÆ···ŁĆĖĶ!ĖąbĀ!ąąąÜĽ!!-M=_}ddd9«HH !'2c!ü !6ì!¦!!!ç!!sĦ!!!i!ööö!åì!Gī'ĊÜĕ¤!õĆ !-Ĭ !5æÆ!!!Úº!!ddB2i!y!cc2æĶµĖ!!!R!!ĕĶB !&Ķ!2!!22 !6Æ¦!!!Ú!BRssBX!!ĒB!æö!æ !&S!!!ĖĆ!BB!!2s!sĶ22dR !4¦ !&ÃĨ$!åÕS!!tĤĆ!!!ssĦRB2!CĖ !(BBBöÖ¶!!!Ķ !:¨rÅCÇćĦ!×õÌ!!¥R!ö!2Æ!+22!R! R(c·c!!d!!Y !&zzz !,ğ !&c!!¶ç·W!µ!ö!!ĆĆĆ !*c !& R&Æ2Ö2d!;9 !'Ć !/ğ!!!²#ė×ĪĪ!!!ĭ!!ĆĶ!!2!2Ö!!Ķ2Bd¥ R(C!S¦2;!!!9!!9!Ħ !/ğğğGĪĪĪ!!Ė!!å!cR!!c¥BÖ !&dB!BsRBSStR!!!+!!į2czY !<Ė!!s2ĆccB!¶Ö!S!B!C!SStSBB2BB !'I!ğ !?Ėc22cBBB !)2 !(22B!!RĶ!!I!įIĶ!BBB !;CR!B!B!BSS]+I222! 2&BB !&c!!ğğ!Ķ!!!B!Ł !:įCR!2!!S!ğĖI!2 B)!! ï' !'22BĿ!!ô !;į,dSCCğğ!!ïïï!22!!!ïïï !'Ė !&ğğğ!ğ !? į& !) ï( !+Ė !kğ !YĖ!!!Ė!!!Ė !ZĖĖĖ!ĖĖĖ !Ņ !Ņ !Ņ !Ņ !Ď",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ħ×u$ !_×!µ !`µ !ÇB!===Ñ ![2!RcccB !_sssB !_BBB !]B!!āıŁ_ !^B!Ė !_C!===M ![B!!īīīĻ !+iiČ !QV !-iiĦĦÆì !K¼¼¼Û !'Ķ !(iĦĦ!!!Ėü !:iČČ!İ !+ļRĀĀĀÆĪ!!!B!ĬĬÌÌ!iĦ!!!BĦ!2ü !8ì!!!İ!Đnİð!TTTR]ìÌÌČ]mĖ!c !&RĆHĦ!!B!¶!ĦĆ !9æÆ¦¦tĆĦĦ !&ńń!ĭĦĆĆÆÌČ!!!C!!ĖÖ!!!BBĦs!R!Ķ!Ĭ !+Yu !+ì!¦!!^!!ÅĆ!=į!t!¤Ćsssæ¥!ĖB2!dR!ĦBBRc!cæ!R2 !8æÆ!!Úº!Bcc!!7Cõì!2ĆöÖ!!ææC!!!S!BRRRBÖR!R!R!!9 !4ì!¦!!Ú!BBttRÖ!sìæcRĖĦRR!!!ĵ!2!ą!R!R!BR!R!R!RSB !)Y !,æÆ!!!ÃĨ$!ąåds!Õæ!Ķæ!R!RÆÖ!!!B!!R2RBBBd·çRRRSB!Ĭ !3Æ¦!!!RPÅ2·×sW!!!RĦRRRsR2Ç3S;!!SscB!BCB!!R!S!!Ħm9 !2¦ !&U·õ·ccc!!ì!!!cRB2!C !'Ķ2!!BBCB!!RSSBB!B!;YYY!Y!!Ĥ !0ĚË62ss!!Ķ!R!!2 !'B+!22ĶttCdBB2!ĶRRBBĦ!!!B!!YĶĶ !,ğ !&cR_ã¦CC!!d!Bc22!!C!RR!!!2BB2B!22!!222!ğ;Ŀ)!!BĶĶ!!Ŀ !,ğ!!!²ó¦!ĪĪĪ!!!s!R!2SC2B2 !&22!22!2 !+)2!ĶĶ!!!+ !.ğğğGĪĪĪ!!!ĖĖs·!!SCBBB22 !' 2&R2 !*922!2!222 !;ï!ddRR2BBB !' 2' !(ïğğ!įįğ!!2BBĿ !<ďď B&2!!ïïĖĖ !' ï)!ĖĖ !'ğğğŁĖ !> ï) !& ï' !sDDô!ĖĖĖ !YD!ôô !ZĖ!!DôĖ !^ĖĖô !Ņ !Ņ !Ņ !Ņ !Ó",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !ççħT !_× !bµ !ewÌĜĜ !]û»RR!!ļ !Yyy!!æ!ĦB !,««« !Ly! ¥&ccS !*iiĦĦĦ« !Hyyy!!æætt!S!, !'ii!B!R!sü !Fy !&RR÷BB !(«!i!BBB!2c!!ü !Dy!RRR¥ss!!!S!ğ!««!i!BBBRRs!!!2Č !7ii¼āİðĐ^^ð !'RRB!S!!!ğğ)«!!!ÆccBR22B!2RBd !6iRR!Ú!BBąąR! R&!B!S!!!+RR!¶ B'2B2B¥ĶcB!C!I !6cccÃĨ$!!ĦdRÜ!RBtSSBBBRĽ!!B!ccc!B2BBCd!!!CBBBz!!!II9 !/2!!RPÅ2·×Ħ !&2!BB!RR !'S d'RCCBBCBCcB+ !&I!!; !-iÆ!22¨ªõ·ccW!!!B !&2ĦĶĶR!!2B!22!BS!B!!cCB!į)ĶĖRI!2^Tjj !-BBBssûgcs!!!c !'Ķ!Ķ!ğ !&B22!B!B!2 !&2I!!R)2!Ŀ !1CCC!_!_Ċ3 !&2 !)2!!!B22 !& 2&!!c!ğ!22!!!+T!!Ķ!R !*ÆdBBB_Ċ_Ċ_ !&2!2 !/222!222!222R!!22ğBBT!!ě22 !+dB !&_Ċ_!2!!dBCCBĶ!!!Bğ !+22 !)IĶğğIğ-!!!B2 !,B !&22o22 !&3!!!2!2Bğ !.222!!Ķ!!29!!T !&ğğğ !+ğ !&333CCĪ !&B222RĿğ!!I!!!B!!22 !/ğ !&Ĕ !/ğ!!!222!Ī!Ė!KK++ĿĿğ!!II !&Ħ!!ĶĶ !,ĶĦ !'Ĕ !1ğğğ Ī&!!!ĖĽ !(II !( 2&!!! Ķ'ĦĶĶĦ!!!ĔĔĔ !=ğĽĽ)III !.2Ķ! Ħ'!ĦĦ!ğĽĽ !Ağ!ĶĦĶĶ !'ĖĖĖ !'Ħï ğ+!ğğ Ė( !<ğğ Ķ(ĦĖ!!ğ ÿ'ğ !5ĖĖĖ !;ğďďÿĦĦĶğ !_ğğğ !Ņ !Ņ !Ņ !Ņ !Ņ !ª",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !ĦÌČČ !^ii!Ķ!ļ ![i!c !&I !XÌicc!R2B !YÌĆBĦRc2B2S !XĆ!ss2!!C3!ğ !VÌBB!2!!B!Bğ!!! Ĝ&ļļ ¼*üüI!!II !&IIz !9Ħ!RRR¦dsRzTTļ!ĶĶĶĆ!RRR !&RR2ÕIz!!YI!I !;Ķ!BĶSS!RĶĶ!BB!ĶĶ !.ĶĆ!ĕĖ2!Ķ2I222 !8R!B!!õĕĕåĦ !'Ķ!ĶĶ!!22! Ħ&¦tĦ!!!B2!!!B22 !-ìČČĬÁġÁ!!!R!!2R !'Ķ !'Ķ !'B!2 s&!!!c3!!B2Ķ2ğįįğ !+ìB22lÇwÇððR!ü22 !'C22ğ!!3 !(2 B'!!!B !'BRB !02!!BUBUË !&RR2!!!C!Rğ !&2 !&S2BB R&!!s32! ğ' !.ìB222!c!cB¦ !'2 !&2!!!ĤĤ !) S(!B2t22R !42!!!BĦBĦB¥ !&222BC!Rğ!I!!!222R·! 2(d!B!2R !&ĖĖĖ !.dddS2R2R22!!!2!22S22!!I!!!BBttdRR B(cR!RR!ïĖĖĖ!!!ĖĖĖ !*·;++;2!2!22 !'33Ķ!Rğ!ĶĶ!!!S!!ĶĖ!!!ĖåµĦµåå!!Ķj!!III !3BRBRBB !'ĵĵ2Rğ!I !/2d·!·dd!ĖĦĦII!!Bu !-į !& o' !&2!!3Rğ!IĖ !'2 !) 2&!2BĦ!!!B!!B-!u !5ĦR !&2dsğ!IĦ !)222 !&2Ķ!2!2 !&2 !4Ė!!!'Ė!ĖGGĖ!m}}Ŀğ!IĦĶ !,2 !&2!!2 !'2įB !3ĖĖĖ!W'W!!!Ė !&I)ĖĶ!2 !&BBB22 !'22!2!!!BB2!įBį !<ĝĽĽĽĖĶ!! 2& !'222!ĶĶĶ!!!Ė!!B22ğ!!į !=ĿąĦ!!!222!!!ĖĖĦĦĦ!!!ĖĦĦ!ĶĶĶ !&ğğĭĖĖ!!ĤĤô !:C!Ħ!!Ķ2!2!Ė!!ğğğÿÿĦ!!! Ħ&!ïĖĖĽĖį!! Ė& !;Ŀ!!Ħ!!ĦĦĶĶ !* ğ+!ğğğ !DĿ!!Ħ!Ķ!ĦĦ !ZĿ!!ĦĶ !_ĿĿ!!ĦĦ!ğ !] Ŀ&ğ !Ņ !Ņ !Ņ !Ņ !ê",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !Ņ !Ņ !£ļļļI !]ļļĦĦĦĕI !ZĜĦĦ !&ĕI !XĜĦĦöööĦĦ !'Ìììì¼Ì9 Č& !2III !7ĦĖĖ!Ķ!ĖĦĦ!IuusĦĦĦ2!!RBBBĬĬČÌIÌIÌĬI§ R&I !9ü!ĶĖĖĦĖ !0S C&!B¥!!!¥d!!TTT !;ĖĆĦ!!!sRâÂMM !,BB!!CCC!Ç !&ċ!!!T +& !+yyyQ?Q?!!TT!Ħ!!B¥sâ !)RRR¥×!Ħ!BBB!BB!B!d!!2 !&T !-y!!!Ĵ4Ĵ4?ŀ !(ct¡!!ûûû !'ĖæµĕĕĦĦĕĕĵBBąą!B!!!ĻĻ !/y !&4B4B4ö !'sân!êÊĕĕĕĤĤ!Ė!RRR!!ąåSS!õ¤Ćd!!222!!Ĕ!!T !0c!c!c !'sò!!ºÆĖĶ !'c 2&!!!2õ!!öĦĦ!!!B2 !&ĔĔ !,B !& B's!!!ss!!ºæĶĆĦĖĶ!!B !'SBB !&B !&Ķ!22ğğ!!!Ĕ !+Æ B&!B!B !&cs¡!ºæ!!!Ė !' 2(!222!S!ccĦ!!!ğğĖĖ !/C¶RRR B'Sńń!¡!ºæ!!22RR2!!! B'ĶSCCC!ĕ!!!ą !)ĖĖ !/BBB!!nĂĂBñ!R!!æ22cR¥RBB!!S !'2!!22 !&BdĦB!!Ė !&ĖĖĖ !*į2 !&òćÕ!BÖ!]!º2c¥RRBB3S!!!C333C!2B22!SÇBCBBĶ!I !*Ė !*C !&wĺ÷ÕµĶñ!!!cB!ĶtSSB !&2B222B 2'!!2 !:R¦¦Nłł!÷ė!G!!B2!BdĦRR22!!!B222 !+3B!!2!ï !3įC!!!R!!RRs!ĖĤ!!B!ĵĵöĦBBĖĖR 2'!2!2!!!ĦB!BR!ï !5įğğGGxxGGx!!Ėd¦3!!!ĵĖöĦ!!ïïÿB222!2!2 !)ï !EB3!!!ĵ !)ïÿ2ĖĖ!22B!!BR2 !Eğ!!B3 !&Ķ !)ïğğ Ė&RR2!!ï !Eğ!!B333 !. ğ& ï' !Gğğ! B& !^ğğ!!!ğ !_ğğğ !Ņ !Ņ !Ņ !Ņ !G",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !Ņ !ÀII !`I!!9 !b2R !]I!!2B9R !? Č( !*ČČČü !-BB !&R !=ì ö'Ħììì!!!ììĦĦĶ2 ¼& !&IIBĦ2B!!9!!III !8TöĖ !&Ė!!!RRR Ė&!! ¥&ĜìĬĬ!!22Ėğįį!9R !/yyy??? !&RTº !(Ħ2öBÜ !'2!!öÆ!!!c¶Ė!!ĖBRI!!į!!BBB !+y!BB444?İİR!!!Ķ¥ !&BĆBĶ!Ü!222R!!RRÆBBR !'Ėğğ!!!į9 !-yBB!RBBB4ĆĆ !&¥Ė !)Ćö2!BBR!!RBR2¶C!ĆĖĕ!++!II!!! 2& !*B!RR!!!ñ_!!n !&Æc !'cc¥B! 2'!BBs!Ņ!!ĆÖĕ!!!ğğ!!!ğğ !,RR B&ñtÕssÅ!ńÒ2!B¥cc!!!cB!! 2'C!B!B!¥!!!ĖĽIII !(ğğ !*sB !&»F3ĖĦC!!ń!ĆtSBBc!c!!!ĭ22BBB!C!BRRsR!cR!Ķ !'Ė !.CR!!!cĲĲs÷çąā!·çtĦ!SSB !(BBCCC2!!BBct!ÆRCB2!!ĖĖĖ!Ė !-įC!!!.ĦĖĦĖĖt!!c!2!!BBtħĦ !&]S222!2CCBR!¥tS22ïïï !4R!!-^!ĶĦĦ!h!iğc22!!!Ħ!!!32!!BB!!B22!!ą!2!B !7įC!!!ċ!!cB!Ė!+!ğccĶ!!!Ç!3!ĀĽB!!B !&3BĦs!B2ï !*Ė !/R¦¦BRBc!B!ĖĽIIğğcRB2!ñĠĠX! 2&R2B!BBcSB !:įC!!ë!ûxûû!!ğĖĖ9IğğįįÐ!ĦH!!ċ !'2BBSSB!2ï !9įğğ!ë !)ğğÿĶ99IIĦBB22Ě!ïïï!!!2ĦBB!2 !.ĖĖ !<ÿÿÿğ°!BtĪĚ !'ïïĖĖR222!ï !L÷!BC!CCC !(ğğ ï' !LħĦBCRİ!XXĪ !XĦ!CRİĥĥïô !Xç!dRĔĪ''' !Y¤B!Ĕ !`Ań !Ņ !Ņ !Ņ !Ņ !Ĭ",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !Ņ !ÿ I&Y !aB2YR !A Ì( !5I!BR!!29R !>ÌÌ !(Ì !2üI!B!Ė2įįį!R !<Ì!!!R!!¶¶¶!ìììüČ !+«ĖÕąĦ!Bğ !@ļ !(R!!!ì!!!cĶüüČüüÌÌ)X!!ĖĶ!į !BĆ!!RR!!c!!!·!!BĶc!ĖĶĖ!!öą!B !'į !@ļ !)C !&cB2 !&ĖĦö!BöB!!sB+ !)Ė !:]!RR!Bc¥!CC!!2B2!dt!Ħ!!Ħ!Ħ!RsB3Ľ!!))!!!R !9R!B!!BB!!B!!C!C2SS!B!!B22BBB!!!B!!I229!)!R !-yyy???!!!RR!!}!!BSStB !&ĐC !&sB !(RB3!RIĶ !3y!BBTTģ±ðð !'cc!2RB !(BBB2!!RR c'!32RĖ!!!į!!2 !-yBB!RBñtÕss^ !&S!S!Ķ !'ĐCą !' B)!!2Ķ!!!į!į!į !-B!RR!!»F3ĖĦö!t!!+S!!ĶĶ!cðĐC7i!!2!tSSB22!!2ĥ!ĦBĶ2 !2RRBBBcĲĲs÷çąnõ÷!Z+!Ķ!!!ÐĦX]ĻåěB!B!BBSCCSS3d !)Ė !/sB!!!.ĦĖĦĖĖt!!r!Ď!++Ķ!!Ħ!ðåĕ !&2 R&sssccB2B!2!ĖĖ!Ė !.CR!!!-^!ĶĦĦ!¥ñ!!9I!!+įñĦBB !-ĶĶĶ!ĶĶ!!2!ï !&Ė !-įC !&ª!!õB !&)ĶĶII!I!BB·S¦¦n!!!Ķ! Ķ(!ĶĶĦïï !(ĖĖ !-R!!¦ĆĦc!!Bxx!Ŀ!ĦĖĶIñĥBC!R!N Ķ(ĦĦ Ķ'ğğğ !6įC!!!¥sRdssĖ!!ĽĶ!2!Ķ!!CsĦļļĐ Ķ' !& ğ& !;R¦!ÁcRĖRR!ĖĽ!!22!āĥ!R !' Ķ&!Ħğğğ !>įC!!ÐªW7WW!!ğĶ!ĦĖ2!!C !( ğ( !Bįğğ !+įĶ!!ñĥ!RBĐİİĔĔ !Uįį!ąĦCBĐĥĥĥ !YÐĦ!R!!ĦĦĦ !Y¤!BĔôĪGGG !Z¤A !Ņ !Ņ !Ņ !Ņ !í",
);
// }
// SS (Death) {
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !¤üüü !_ÌĖĖ!Č !]Ì!!!ĖĶČ !ZÌ!c!!!ĖĶ9 ![Bc!!!Ėõ9 !WÌ!!S !'Ķõ9 !XcõÇsB!ıāñð !UÌ!!!2å!Rı7hhċ !TĬ!Ć¶B2CdáhRBīû^ !/ììì !CĶ!cĦ2dB2!2çë¶ĖĖáČ !& ì)!BcĬII !(jj !8ÂsR !'2āġĢ!R!!RììČì !+Ħ!ĕBIII!!jĦĦ !9ÂBB3!!}!B!!B¥Ö¥SBBĦ !0B!BRjĦ !<Â¡nM+!BB!!ÖÇÇC!RR !.ĶC!!BĦ9!!!B !@Bd!ñt8^6+S! B+2!2B!222B2!BB !;Ņ !&¥ĖĥBRF!!I!!S· B&22!!RĦtC!ğğğ2ğ2!22 !0iÌÌÁġ~!=|!#Ņ!!!rRĦ!!$ńğ!I22! C&Ķ2BBCs!!B!!!ğ!ğ2ğğ !/ì!!!ÇCöİĕ¥ď!BĤûĝĽd!ĦBń!!ğ!222 B&dCCdBC2BB !(ğ !3RRĴĴĥddĥÆ+ąĭ!!ĦRBĖ!$$Ę$! 2)!BcBR!!B!!!Ė !'Ė !.ì!!!RSĖ !&ĆĆ!;!!!ě!ĥĦ!Ė!Ė !& B'R22ïcB!ïĖĖ! Ė' !2R!¶!!ąą!!ĆĢ!2ĵĵsC!!BR !(ĦĆĦĆĶĆĆï!ïïï !7ì !'BR2æ22ÆSĕ!2SSĖR!ĖĦ!!Rğ!!!BR2!!!2II99!!! I& !2Æææmmbd!!!¦!ĕSĭ Ħ&GCĥ!BPń !'2!BB2!Ħ!R!RRY22!!zz !/Ææćm!!ćæ!R!å!SFðK!ĥBĖR!ĖĦ !+2!2!BB!!))!B2B2Ħ!R !.Ġ°K!!!Ħs!¦CSSF×µü!!Ħ!G !-2!2!2Ķ!Ķ2BB2Ħ2!2 !2Ė !&Ė!C¥¥sĺĖ«ĭS2!ĥ!!C!!!đđěě !&222ĦR!Ķ!!!į2ğ22B !5ÅĈ4¥cc¥!!!2!!C!!!sĥĖ$!!Ħ !)2R2!!!Ķ !'ğğğ !1ĖĖĖtĩęËhhG !&2!B¦B!'!!!S!ĵ !*2!!22!!!į!ğ !@ğ!!2 !'C!Ė(SS!ïĦĦ !'Ķ !&Ķ!!ĖĖ !Ixĥ !&=!ďĶĖĖĶĦĦĶĦĶ !&Ė!!Ė !@ğ!!B!2!Łñ!!!M=!!!ğğğĦĶĶĶ!!2!!Ė !&Ė !@ğB !&'xCĥGĶ!ÿ !'ğğğĶĶĶ22ÿ !(ĖĖ !?ÿÿ!ĶĶĶ!x¼Ķ!ÿ !+įįįïï !Jÿÿ!!ĶĶĶ!ÿ ![ ÿ( !Ņ !Ņ !Ņ !Ņ !@",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !Ņ !DÌÌĬÌyČ9 !YÌÌ!¥æĆæ·B9 !WÌ!!!Ħ!cñ}åÊ^^ !TÌ!ccc!s=ĶĶë¶ĖĖá !RÌRRĶĶ··dĶĶĆû!R !Sļ¶cc!!Å!BĶĶĵ!B¥Ö¥ !*ìì¼¼¼ļ !B§ ²&òcBĦđ!s×!ÖÇÇC«!!ìì¼¼¼ĖĖĖRR!RR !'jj !?²}ĥą!BdĘt^^^cĬ¼ĖĖ !&R!!R!))R!!jIĦĦ !.iČČĬ !'TTĵ1wwÊ!!!SĆB!!xn!!!B! R)!¥R !&IRjĦ !0ìÆ!Qĺİŀŀŀ!!!#ąÀ!Ėċ!!ġ!!!sġġĦ!!RSRR !'B!2dC !*B !-æ!!yĦĦĖĶ!=lïĀ!Č!!ÕĔ!!!BCöÕÕÐġ!!2dd R'2sS!2BB !3ì!!!2!RĖ!!BæÆĕĢ]!RRüDå!B!!BB!!!SB2!dddBBBC!2!!!ğ!įB!Bį !,æÖ¦¦å×!!!d2!ĆÆĕ!RĖĖ2 !'ĥĦĦB'!R2BR22!CCCR2!Bğğ!!!į+į !.t!!×Æ!!!ą!¥!ĆxČĖ!!ĆêBB!s·ddtB !'BB R&!BB !6Ö!!+ĶŅĶ!!S2cæ7ČĆ!!B!!Ħ!!!'xxG!ĶĶ! 2*ÿ22ÿ Ė'!!!Ė !,t++!Ħ2!Ç×2ÆĖ»×]c!RĦB!Ķ !)ĶĶĶĦĶ Ė&ĶĶĶ!ïï !(ĖĖĖ !-+!!!Ĩv¦Ö!!!s !)2!ĶBC !&ĶĶĶ!Ķ Ħ'ĆĆĆ))RR !5Ė!!!eĔsæĖæ!x!µČĆ !&S!!s!Ł!!!Ķ!!!Ħĵĵ!!!Bĥ!KĭĽRRR!RRjj !.ĖĖ!÷ĖRÆÆGx!!ČĆĶ !&Ā!B!Ĥ !)ĦĥĶĖĵĥĥõĦĥĭĶ!))Iz99ĦĦR !/ĖĖ W&!ĖĖĭĖ!!!ĖR!Ħ2!ïáï !*Ħ!ĖĦĦĶR2ĥ!!!ĶĦ!!Ħ!!9 !>ĦCĦ2C!¶¶ê!!2 !+R!!!2!2B2!į2 !Adą!B!!RĖö!222!!!BB !(3Ķ!222ğ !@B22õġÕµ!!Ö¶!!!22!RdCC!!!Ė !'ğğğ!!Ŀ!B !9įtRB!Ķ!ÜĘĘĪW!ss!ï!2BB2B! B&ĖĶ!B!DDDĖD!+įį !9įS!Ķ!!ÅúĪŁü¡¡¡!! ï&ďğĿ C&B!B!!ĤĤô!ôĖ!!D !:įS·2R!R!'>ġĦ!ï !* Ŀ&dd!ğğĖĖ !&ĖĖô !;įğ¦dR!d!W'Bï !/ğğğ !Hğ2dt2t=Bï !Zďğ!!!'ï !^ďďďï !Ņ !Ņ !Ņ !Ņ !§",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !Ņ !ĭĜá^^ !]Ĭyë¶ĖĖá !ZĬ!MÖ!RÖ¥ !8RR !CácBÖ¥¥C !7R) !BĬácdÖÇÇCĪ !0IIYR!!R) !=ę!ff!!á!ĆRtĶĐ6 !+ ì&¼I!!2IRIĽ!B !<O!!¥!Ç!!cG-n·Ė !(ììì!!!æR !'ĝ!B !>5!ă¢Ç!!cW!c !)ìì!!!ĖĖĖ !&2!!R2įB !=Ö!!Çccc'ĦĆ!!!zz!!ìB!ĖĖĖ!!R¥R++ĿįğĿ!!ğğ !<¢!Çc··ĻĶăą_å!!åììBĦ! R'!!2ĭ!!!9!Ŀ !:iČČČ!!Çc!ÕB!`¥Ķf!!âŃpBB !)BsS!Ľ!!į!ĖĖ!!Ė !5ČÆQ6VŀÇc!!×ćĳöæOăS_cæ!!2 !'RR2C!2!99ĖĖ!!ĖĖ !77yĦĖÍc!·ĨćÖv!¥!5²æ¥¥ùB3 !&R!B·!2!B!ÿ !;ì!æĆ!Ėc!°įÓ?Ó!s!!ÓãĆ!!BCBs!RRBBC!RBB!ÿ !<Ç¦µcc!ÀÀ !'¡%æĉĺ¨ĩ¥ùBc!!sBBCdR! ÿ& !?ÇÆ!!õĶBR¹!ČċSÚ·àµ!!cS!B S&Rďÿÿ !C2cĖĿ!!RīÓČŃ;+ĕÅ!!2Ĺd2!!ĦĦĦ!ÿ !E+¥s2Îï2½!!ŃŅ¨!]s!!ĶĆåąÅ¤ąĥĥąjj !C+!xĨvÖĮ!aC¼Ņç!ĝ!]«h2!BĦĦ!ĦĖĦ!å!)R !AĖ!!ĹĔæĖæ¨e!#!cĲ !&2 !(ĶĦĖĖÅK!) !AĖĖ!Wīí9ã¤Ð!!B!Ì%!!3 !+¦tĭĭBzz !AĖĖĖ0ç!aĭù¥!!!ĉ2!B!Ħ !'BR!!!;2ĦĶz !AĸÙ!³¨¨å!!!6c!Ķ!BBĦ!22 !&ĕ!;ĽĶĶ2!IIzIR !<0³!!¤!22ù6ĵ!S!!!RBd2!2!Ħ !(RĶğ2!ĖR !A0v/?2ĥ]S!B!!t]!RB!22Ħ!!!22!!Ľ!!Rğ !@ę!!¥!c2ĽBB!!ÿÿ!Ŀ,LttB !(ğĦ!B+ğ !AO!!Éĩ!S!!ÿÿÿ !(ĿĿSdd2ĽĶĿ92Rğ !Ep!!S6B !.ĿĿ ğ&Ėÿ!ğ !Fē!cĕ!úúI !4Ŀ !'Ė !BRĆĆ!¶öÊ !9Ė !ERĆĖÖ !5Ė!!!Ė !D<mĖāĆ¶!ññ !3ĖĖĖ !G¦¦>² !_ į&xxx !Ņ !Ņ !ã",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !ĵ--^^ !^~B!ĖĖá ![üĖħÖ!!¥ !ZĬ!Ñ!·ĶĶC !ZĖ!RĠ!CCĪ !YĬ!2!d=ĪĪ !.)R !KĬĖ!2!!R !/)B !LĖR22d!ï !*IIIR !&R !Iü!ĦB·RR !(ììY2!RIR !LČ!!BSĖ!ï !&Čì!· !'Ľ !<5 !.5!!Ķ!RS2R!!!z)¼ö!Ė !*2 !:ĳ !+¹!%ĳ!5¢Ń!ĕ !&)µµ!RĖ !&2!ğ+RBI !A5ęÓ!Ń¹%Ö¥!!S!!!ząö!!Ė!R!BBBğD!Ŀğ !?¹!!Ć!Éé!ÓŃÊc!Ħĕ+Ė!öö !&RBõ !&Ĥ!Ė !@Ó!!OOÃ¢ĸČČĲæ!ămĉĒöå !&R222ĆğğDĖĖ!ĖïĖ !;v!!v!!!¹ČĚQ66å¥ÖĈÖ!!Ė !&ĖtBB;ĽĽċ !Aó!!ó!!!Ó!7y:!×ĥ?!R6å!!RRs!!dC!+ğį !Déé!!ì!ær[²¥×!× !'22!×ĕĦĶĖĖ !Fö!!!Ç¦µ !&U!!c!!RR22!!S!Ŀ !C5 !&ó¢ !&Ç!B!g·!¶!!BssRR¦BRį !Dĳ !+Ĳ2ĿRÚ!!!VV!¦S33S!RòùÙ !M?¥Î½ÕĂ!!ąå!åÅąĥRRï?p³ !I5!!+!x!Kē !'åöĖĦĦÅĆz !Lĳ!Éĩĩv7®s!Õ!d !&ĖĦ!ą!Ù !Ivv!!Öĳ¶ÖéUö !,SS!³ !Ióó!!ĳ!ÃĳO!¥!2ü+¦ !&·!!Ć) !E5 !'v !&5!!ę!BC !(Õĕĥ;KR !Dĳ !'ó!!vÉĳ!¢!ĩ!!ĝ+2 !&ĖC))!R !LRsÉ!ĳ!!!2!ü? !&¦!!BI!RR !JÃOÃ !(BdOÐ!!ĖBsBĖĶ9!!R !VÐ!!+ĖĖB!įTTT !NmĶ!!Ķ !&ÐÐĽ!B==T !SĶĕĶĶz!!!I!^= !UmĦ!ĵĶ !'^ !)ä !RĶ!Ė!!!ğ !(ää !Qmx !)ä!!!ää !UċêÊ !'äää !Zñ !^ċÖĖ!Ė^ !^ċĆÖRċ !_ċċx !Ņ !ě",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !ŀ)§§ !Tññ !*I~!!R !R-¥Ö^ !-T§§ !OÑB!Ė¥Y !/R !NæĦ!ÆÇBY !(ċ !'T§ !NÆ#×!ĦBY !&ğ!ċċ !RěÇ!!!ĶĦB !&zR!!ě !Rĺĺà- !'Č9ĦĖRB!ĻĔĔ !QmąąĶ!!ČĦ!Ķ!Ħ2B!I!ä !PüĖ!!!Yö!!!2!!!ğğĖ !SSĶĦbR!!2BB!ğĖĖ !Tĕ!Õ!!!õB!ğğ !Nff!ff!Ém!/Òö!2!BĖĖĽ!Ė !K5!cÆÉÆăÉ!ĩ`öE!!!¦!ą!BI !Lĳ!Ö`c`5Ķ¥RBsö!!ĆĥdtB2ï !Nĳ!`!¥æĩ!Ö !'Ė!!2ï!!!é !OÓù7Ösö !+é!!¢ !KÉ!!5Č!æ¶Bss!!ct!2!ĩ¢ !NÃ!!ĳp¦µ6?öO¶R!222¡? !SùåÇÕ¹sö/sc22!!ĉĉĉéé !Mf!ÃÃ2!!6fĩĦSB!!RB``¢¢ !Mă!ăÉ¥!ºĲăēĦĦ!2!?? !T]ıOĢö55RB!!! ù&é!¹ !I%!!%!fĩă!öęĆĆ !'Rppp¢!Ó !IŃ!!ĆfÆæĖ!ę!!¶d !&? !Pfé`ÆBÃÖ!!!c!!B2!ï !Qă¢!`?v? !&Ķ!!Ķ !Uv!!ó!Ĺ!!Ć!õĆĦĶ !Tó!!!ü!s!!æ!ĕ!Ħ !YĦ!!!2!t++R !Vü!R!R!st!99 !WË!d¦B!¦!!22!R !T^Át!R]s !)R !S¶ĻĪ'!!]ď22ĖĖII!R !Q^!!!ąï!!!ďĖ!!Ķğ !TÖ!Ć !'IB!B=TTT !Qċ!Ö!7!!!I!!^= !Vċċx !(^ !'ä !XI!^ !&ää !Z^ !&ä ![ğ!!!ää !^äää !Ņ !Ó",
);
rawImages.push(
  "#c Ņc !Ņ !āÉ !bĖÙ !Ńv !Ãññ !`-¥ĶďR2 ![ÑBzčiĥĦù !ZæY !&ĥõ !c§ !Yħ !*§ !XðÊ !*§ !WRSëĔ !^ü!!!ĝċĔĔ ![Ėĕ!K!ĽĽċĔ !Y·CąĽĦ+++!ĔĔ !Uü!Õą!Ħ !(Ė !V¦`OĶ!BĽII !X`Ă!ę!õ!BĶĶIĖ !Væ!ęö2!ĦĦĦ !XĩcĖ !&ĥ!B!ï !Vöcsö!öRC!!2 !XÖ !&Öõ!!Ò !Vġ!sö !(2 !Wæ!ÖĶÃ!`ct!!Ħ !U±µc!Æ!ÃĹ!2B !XÇB!¥Bæp`Ģ2â!ĩ !TÛ2!2ÆęfĩVw!ĖĦ !V¥!!!ÖĦĦĦ !ZGBcĉ`!RB !]B!ĉĆÖå!!RB !WĳB!!!s¦!!©!? !WĦŃ!s!!ĶĶ ![%!ööĦĶ!!B !X/ģ!!c !_Ec!t !&º !Zt!õ!B !aBĦ2 ![mõçÀ!R !`ĽRĖĖğğR !Zå!Ė !_mË!!++!!!R !Y¶!!Ľ! T& !YÂ^^^T !]I^ !)ä !X^ !)t !at !`ää!p !Y ä' !ep !Ņ !g",
);
// }
// SS (Attack) {
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !Ņ !§ÌÌÌ !]ÌÌÌs!!ĜÌ9 !/ĜĜ !HÌÌ!!c2!sö!µ9Y !,¼ææ¼¼ !*zz !;Ì!!c×tC÷!!!Ć}]ć !(¼¼¼!!ĶR¥Ijj !&jĦĦz !9Ĭ!Ć¶!õõR!d!!ŁªÜy9!!¼¼¼ !'ĦRB!!!jzzjĶ !<æ!cöĆĆĦÅącııĵ!ÚFFļ¼ !(c!¥2!!!2!ĶğĶ222 !;òòÒ !'å!s×ë¶ĖĖë !'cc!!s2!22!2!IB!22ğ !9ò!!!òò·B!3!!!û!R!!Æ!!!c!BB!!!S!ğ!!!ğğįğğ !/i¼)ÁġÁ!!!TT !(=}SàĶB!!B¥Ö¥CÆcc B&¥CS22!ğğ2 !3i!¶ĥtCÅŀŀİÏ!b!wĻ !&+Ķ!!×÷ÜHÇC2CccBBCC!!222!!!ğ !'Ė !,ì¥!¥!ð¤ĦĦĦĶQÏħbðåÚĻń!!Ķ !(^^B2CCSC2RdR2!!!III !&Ė !/¥!!¶=ĦBdd2!+ąĭ!!åĽ!!c!!!t··!!!B22!2B!c2ÿ2!I!!ïIIIĖ !4īR3Õĥ !&;RRRĕI!µ!!'GGG!!2! B&2ÿïï! ï'!ïïï !.ì!!æİmmĆ¦!Ė!¦!Bñ!öÖöörĝ!Ķ!!êººº!! 2'!z !:öööİ!!!ÖÆ!!!å!¥x!!c2cs !&ñ!ææĖ!!ĶĶĶ Ė&Ijjzzz !4ĶĶĠ !&đŅ!Æ!CB!!ĭ !&Ħ2ĝ!Ħ!!ĖĖ!!ĶĦĦĦĶĦĦĕĕÕÕĖĦ!RRR!!Rzz !,Āİ !'īBs¦¦!!x×; !+R!¶¶¥ÕĦĦåĕĶ!!ĶĦ!·ĕąĦI)IRRIĦ!z !,Ė !&bĨ¦2ĶĖĆx×µü !(Ðħ·B!ss!!!ą!3!!ĥĖĦĦõ33Ķ!BĦ !&Ħ !.Ė!!Ė¡ĄÆÛûěx!µČĆ!!2!dĶ¼B!' ¡&!!!B!!ĥĖ!!c3 !&ĆĦ!ĽĖĶ !0ĖĖ!W'W!!!ĖĖ!!!ĦĆĦĆõą!ċÚ°ĖĖĖ!¦!RC!!!22 !&2!!cc)+2!Ķ !?BsR·RĕĶ'àĀġ!!Bt2!!Ķ2!!Ćĵ!22ğğğB!Ŀ22 !:ĭCc¥BĆÖĖą!Ħ!BiHG!2!ĦRBBSSRBBCB!2!!!ğ!!BB !:į!C!c!!!dąĶ!!!B+ï!2B!BBcBSd!RĶ22!!ĖĖĖ!ğğğ !:į2d!¥!!!d2RC!!Ė!ïï ÿ'BBR·ĦcB!ĖĖ!!!ĖĖ !=įĶd!¥Ķ!ÅĶC!B+ !+ ÿ&ğïïï !)ĖĖ !<įğS!çą!·õB+Ė !Xįd!!çRc+Ė !ZğïSĖ!SĖ !^ğğïğ !Ņ !Ņ !Ņ !Ņ !¦",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !Ņ !¨ÌÌ !] Ì&!!ĜÌ9 !.ĜĜĜ !HÌÌ!!cs!sö!µ9Y !,öĖBIjjI !'Ij !<Ì!!c×tB÷!!!Ć}]ć9!!!¼¼¼ÌìRÇC!Ħ!BIj!II !=Ĭ!Ć¶ĆµµĖÕ2¥¥MªLÀFļ¼¼22RR2cĕĥ!!2!!!R!B !=æ~áı~~çĆĆææ!»ë¶ĖĖë¥2ssRccCCCĶ!ğ2B2!B!!2 !;=!CC!!Ā~~ÇāÑmû!R!!Bs!BBCC !)2ğ!2!B !1i¼)ÁġÁ!!!TT×HGGCCC!!°ćs×!B¥Ö¥CBB!C!!!B22!!ğğ !&2ğ !/i!¶ĥtCÖŀŀİÏ!b°+¤'G!t¥×sd×đcĖĖC2CCC!22!Ħ2!B !'ğ2ğ !/ì¥!¥!ð¤ĕĦĦĶQÏİąĭ!Å¤ĊÚ¥s!s!!¥¥R^! 2&!!B!ĦB2!!!Ė!!ğ!Ė !0¥!!¶=ĦBdd2!!ñ;c¶¶RRxµ!Ħö3B!R! 2*!R2ğ!ĖĖ! Ė& !5īR3Õĥ!!!(!BĖ Ö&ĻÚú !&d! 2*c2ï!Ė !5ì!!æİmmĆ¦!Ė!¦!Br!Ć2ss¥!ĖĦ!R!2R!! 2)!ïï9ĭ !6öööİ!!!ÖÆ!!!å!¥!Ľ!!ĦSĶ¥R!!Bn¡¡n! Ė*IĜą;R !5ĶĶĠ !&đŅ!Æ!CBx×+!2!!SC!!ĦµĖĖĖ!ĖĦ! Ħ&ĕĕĕ!ĖĽ!RRR !2Āİ !'īBs¦¦!d×µĝ!!¦ąÅÅ!BĆ'àĀġ!Ħąą!!ĵĥĶĶĦĖÇ!Ľ!9!RR!RRR !-Ė !&bĨ¦2ĶĖĆ6µĽå!¥Qt¶¶cÆĆĆiHG !(ĶĖĖĖĦ2ĕ!!Ľ!999R999R !-Ė!!Ė¡ĄÆÛûěx!!õ!ĦėöQs¶d !&BR!BBC!ĥĆ Ķ&c3ĶĶ!!ĦĦ!!ĦĦ!9 !.ĖĖ!W'W!!!ĖĖ !&Q!!B!Õ!B¥!ĦĖ!!d!!!B !'2 !(Ħ!!!Ħ !=B¥ÖcBBÆĦBC!BR!B!ĵĥ2BR!!!Ćĥ!2!2RBB!BB !;Ė!B !*çÅBR!Ė!BSS!2S¦sRBCc!!ğğįį!į!B !;L2BBc !&öAðĕ!ĖğĦĦ!2SC22C!!cĆRR !(įįį !;L]22sR!2!öČSĖğ! ğ'įįįcÇ!Åc!! Ė' !ALLLms¥S !0ïïLÇ!ïï !'ĖĖ !CLm!S,ğğ !/ïï !+ĖĖ !Cğğ !Ņ !Ņ !Ņ !Ņ !Ņ !D",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !Ņ !¥ Ì'Ĝ !ZÌÌ!!s!!!9Ĝ9Y !,ĜĜĜ !HÌ!!sc!!sóµö}Ð9 !*ÌöĖBIzjI !'II !<Ì!!cdtB÷!µ!Ć,ÀFļ!!!¼¼¼ÌBRsC!Ė2BIR!II!B !;Ĭ!Ć¶ĆµġĖÕ2!¥W!ĖĖëĜ¼¼22RR2c!ĥ!!ğ!!!z !?æ~áı~~Wó!O3O!!R!!!¥cccRccCCC!!!2B!!2!2 !<=!CC!!Ā¤ó!õ!½!¥Ö¥·tB2RBCC!!!Ķ!!ğ2!!2!22 !0i¼)ÁġÁ!!!TT×HGGCC!çĐĕ!åĶ¬öĖC!2tB!C!B!222 !)B2ğ !/i!¶ĥtCÅŀŀİÏ!b°+¤'GC!ëĆÁĶĖ!ZĦ^!!!CC!2!BĶB!B!!ğ!ğ22ğ !/ì¥!¥!ð¤ĦĦĦĶQÏİąĭ!Å¡tÖĖÑõÑ!!!Z!!!2BBB2!2BĶB2!!!Ė!ğğ!Ė !0¥!!¶=ĦBdd2!!ñ;c¶¹é¶c»t»!×*k! 2+!22!!ĖĖ! Ė& !5īR3Õĥ!!!(!BĖÖÖ!ĶcË2R{cd!! 2)!B2ïğĖ !5ì!!æİmmĆ¦!Ė!¦!Br!Ć2ss¹Ķ×!¦sñMn !,ïï9ĭ !6öööİ!!!ÖÆ!!!å!¥!Ľ!!ĦSĶĦ¤t!B!öå!!ĶĦĦ Ė'IĜą2j !5ĶĶĠ !&đŅ!Æ!CBx×+!2!!Sxdĵùµ !&ĶĶĶĖĦąąĕĕĕ!Ė!!zzz !2Āİ !'īBs¦¦!d×µĝ!!¦ąÅÅé!Ćû=ıı!ĶõĦ!ĥĦĖööĦĖÇB!ĶĶĶzR!Rjj !-Ė !&bĨ¦2ĶĖĆ6µĽå!¥Qt¶¶c×Ć!7ª¼!ĶC!ĥĦĦĶ!2Ħ2ĕĦĦ!ĶĶĦIR)Ķ!j !-Ė!!Ė¡ĄÆÛûěx!!õ!ĦėöQs¶Ħĩ!¥s!Ė !&ĦĦ!!!ĶĶc3ĶĶĦ!!Ķ!!ĶĶĶ !/ĖĖ!W'W!!!ĖĖ !&Q!!B!Ķ!B23S!!2B !+2!!!2!!Ħ !AB¥ÖcBBÆĦ¶æB!!!2!ĵBB22!!!Ćĥ!2!222Ķ!22Ķ !:Ė!B !*¶× !'2SS R(BC2!Bğ22B!2!22 !:L2BBs !&ö!ĕ !& 2&SSSBB!!RĶB!!ğįį!222ğ !;L]2!sss2!ö2!!ğïïÿďğğįį,St!ÕR22 Ė'ğ22 !> L&2¥S !0ğğLÇ2ïï !'Ėïğ !B<m!S,ğğ !/ïï !+ĖĖ !Cğğ !Ņ !Ņ !Ņ !Ņ !Ņ !D",
);
// }
enemyFrameOffsets.push(rawImages.length);

// Mutant (Main + Death) {
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !Ņ !Ņ !ªËË»Ë»» Ë& !UËË»ĶĶ!!ă!Ó!!Ót3t !Q»ĶĶ!222ó]!BÓÓBB!£S### !N22ãóēó!!Ľ!B}]ŁAă#SS#$$T$$ !*uu !=»!ĶÓ¹ĦĦ]]ĬČB];;;xČvvv¹¹¹v¹¹Tu$$uu!uöĦ !@¹Ķ¨Ħ;;ĦvĦü!!ĶĶĦ!ĶĶ!!!Ķ!!v!!!ö!uö !5RTuħÇÇ!!!»!2!Ķ!!¹!óv!v¨!Ķ!!Ķ!222!2!2 !)Ĥ !7õrsĖö¦¦¦ĒÓĶ2 !&ĶfĶ!ó!Ķ!!ã2ó!!!2ó!!2ó!sRRĤ!!!B !5æĦøĦĦĶĦÆb!ó!!!Ķłłł> !'¨B!óóó!vă!óB!!BB!!RRĤ !6¥´R2cĶĖRăĦ!²>²ÖRRcń! 2&! B&óēBóB! Ĥ&ĖĖńńĖ !5BĖRR!Ķ!!ĖBcģÆćCQÕB!! ó'ń Ĥ&ń!<]<< Ė&!!ĖĖ !7ĖøæĶĖ2!RĦĦEÆb!¦$dC$ v'$$$ĸ$$Ė;!ü! u&!!RR !6cBńBBRÆR×fĦ!ĘĪRćBss !)ĶvvvĶ¨Ķ;¨ü!ööö$RĘĘR !4r÷öRsåÅbú¹!!!Ĉ!vĦ !*Ó!!!2Ķv!!!Ķ¨ !&RD!!D !3ĖĖôAÅÅ!!!Ñ22!!a!!Ħ !&ã!!!¹!!ã!22Ķ!ã2ē!RRR!!R !A¨!Ĉ2ÓB!!!B2 ã&!2!ãããó2!ãĶ! B&Ĥ!R !>ó!!22ÓB]<<ĤĤB R&BB 2'ó!B! Ĥ'ĖB !?Ĕ!!Óãc]!!ĬDDĦĦ !' B(R22 Ė'!ôB !?ó2¹2Ħì+ìEĆĦf!ĦrAĐrQQQ ô( !)ôô !>ĔóÓvf¨ !(f!ĖRË¤ÅÅÅ !NĔĴóăãã¹2¹!ã2!Õ¤¤ !TĔĔĴĴÁÁÁĔĴÁĔ !Ņ !Ņ !Ņ !Ņ !Ņ !=",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !Ņ !Ņ !©¦Tç !0# !På¤c !/#!¦ !QCu !-#!¥R !RbuD!!!DDD!!#Ħ¥!µ !MDËË!!ćrb¦ËD¨¨¨RÑĐAåå !0u !>D¨ĶĶ2!Ĥ¦RRñBã!!xčz D' !-$Ħ !3uć×3ù·×ħ×!!vó!!cs¦Råå!fvĶĶĶ!¨ v'Ë»ËD !($ !7ĖsôæöĆö!»!f2!Ć!Rõ$D !+222 !'u$$$T !:öĨ!!Ħ!ħĒĒ2!2ĪUĖ!!!x! 2&!!óã!!2ãóã!!RRR!T!Rń !5Rs¶RBĆBĦRs! Ķ&RCB!!!ĶĶĶ!!ó22óÂ_!!!B !&BBRń !5d2RĤB!BcĖB2Ķ2!a!ĊR!!ó !&Ķ!ĶĶĶĕ!cRRR2ĤBBBĤ!ńD$ !4s¦R!Æ¥cĶ!Rc!!!Ĉ!!vĦ!!ã 2&!!¨ĥ!!sEĖĖĶDĤĤĤ!ĤDö !6sĖ!ĦBBRsBC!!!a2!!v!B! ã&!!ÂÖ!sF!¨¨Ħ!ĘĘĘ$Dö !8ć·dCddCC¹2Ķ!Ĉ!ã!!ĦĦBmB!åĕïsĺÊV2ó !)Ė!!RB !7ssńńńcc2Ķ!22!!ăă!!Ħ;UB¥RÌR ã& !'RR !9 ô(!!!Ą!!!2ĶĶĶvUĦfĶvĶ!!æRRc2!!!Bãã !&RR!sB !>Ą!2!2 !&¨!¨!!2ĦÇcc×222B2BBBĤBBBńĤ !Aă!!! 2&!2ã22!!!××!2BB2!22L!ĤĤĤĖĖĤĤĤ !>Ąă!! ã'!!ããăBĄ ô,Ú Ė&!!ĖĖĖ !?ĄÁă B'ăBBBĄĄ !V Ą, !Ņ !Ņ !Ņ !Ņ !Ņ !¡",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !Ņ !¨¦×ç !`å!c !bC !Ä2!u !bbu !aćb·ç !`s¶¦R !^b··s !]cRRĤĤĤ !+# !RĆ!d÷$DĖ !)#!# !/$u !8¦ !)»»ĚvÕĦõĦ !)#!!¥ !Buć×3¦ö·ćÇ!!Ë»!!@!çBC!Ë »&u#¥!¥å !.$ !7Ė!Ĩ!ĦÖĶ!»!2!!!ĶvtR !&ăł¿¶6º6»ËË»»» !>B!R@B2RĖçĢĶĶ!!Ĩ!Ķfvv!!!b!ì!2!!!Ķ!2!!Ë $&!$!2 !5CRBRRĖĆBĶR !&22ÓÓóóó22R!!Ró2!2!Ķó!!!s222u!2 !6ss¥!!RBc!ĺ !&ĶĶ¹É!ffĶĶ÷RRc!ó!ó22 !'BBB!sBBĤ !5CĖ!Æ¥c!2!2! 2& !&222!ccr222!óó222!!BBBĤ!BB !6s!!ĦBBBc!!! Ã&2Ķ!2óăă!tt!22ēv222óóó!!!ĤDĤ !9ććdCddCē!2 R&ó2!ă222Ķ22 !&ē22!222ĤĤĤ!ôĖĤĤ !9sńńńcĴēó !'ó2!2ĶĶ !+ôô222 Ė&!!ĖĖĖ !3 ô(!!!ĄĖô B'ĔĔĄĄô 2'Ė ô'!!ôôô !H ô' !' ô' !Ņ !Ņ !Ņ !Ņ !Ņ !ğ",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !Ņ !Ī×ç !0# !P¦!c !.##st !Oå!C !,##ss !P»»Ī¹»!»!»»»ËddcŅ!!õõ !/4 !?» !'»2» !&¶BB÷õõ !0$ !?» !(2! 2&ó!sR·Ë »(Ë !)$!2 !3uħ¦d¦S¦Çd !&ãă222!!!ÃóēBççç¨!!2 !&ĶËu $& !8CRBRRĖĆB!Ë!2!! ē(sB !)2!!2 !'RRRBu2BR !4ss¥!!RBcË!!! Ķ(!!! Ķ'BÓ!!!2!2!2!!BBB!!cR !6CĖ!Æ¥c!!!2!!! Ķ&Ħ!! Ķ'!B Ó'ó2!Ó Ĥ&0 Ĥ& !5s··ĦBBBÓÓ!!2 !&22ĶĦ!!222!! B'!ÓÓB !&TT !9ssB!BB !.222 !& 2&]]]RR2!TTTĔĔTTT !3 Ĥ'·CCCBBÓÓ!2!22!222 !( L&!ĬĬLLL!ĔĔĔ!!ĔĔĔ !8Ĥ !'22B!!!22!!! 2'! Ĭ'!!ĜĬĬ !Bńńń!!22!22 !. Ķ'!!Ķ !(TT !6 Ė(!!!Ĕ!!!2!!2 !2Ķ!!ĶĶ!TTTääTTT !=Ĕ!!222!!!Ħ !* Ķ(ô!ĶĶĖäää!!äää !>ĔvU Ħ'!ĦUU ô' Ĕ(!ĔĔĔ !HÁÁ Ĕ)ÁÁ !Ņ !Ņ !Ņ !Ņ !Ņ !Ņ !£",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !Ņ !Ņ !ê »,ª !U»» !-ćd¦ !Q»!! 2,Ì~ÆRć·· !/44 !A2!óÓÓÓããÓÓój¯ĊĺĊ66ËË»»»ËË444!!4!!4 !=»!2ĶĶfBBB22BB !' Ķ'!2!Ķ!BBB4ucBBB !?Ķ!!!fv Ħ&vffĶĶ!2 !+BB!B!!BBB !3TTuħÇÇ!!!» !*¹!!¹ !)2!!2 !'ĤĤńń! Ĥ& !5Ħt÷÷¦¦¦ !,¹ !)ã!!22!2Ó22Ã != B'ÆĶĦ !-¹ !) Ã(cÃÃ2 !&Ĥ !7B Ĥ'rcĶ22 !. 2&R s(!ss2 !&ĖĖĖ !<Ķs!Ķ!! 2&!!ÓÓ !&Óã!! U&EUEE¨ !&RRR !5Ĥ !'÷22 !&Ķ!!ÓÓÓ!2ÃÃ!!¹¨ĖE Ķ& !F÷Ć2R!2 !&Ã !&222 Ã&2 !)22Ó !>D÷·Ć¤¤b !&2!2Ķ !&2! 2&! 2(ÃÃÃB !<ĖĖôA¤¤!!!Á!22!Ã!2!!2!! 2'B Ã(R22 !Gó!!Ã !&22!R 2'! 2( B&DDDĖĖĨDDD !=Ĕóã22!!B2!B! B'! B(!BB ô&!!ĴĦĦô !?22!!!ĦĦĶ Ħ&ĀİÕµbbbĔĔĔôôô !)ĔĔ !?Ĕ!2BB2!22!!!BiËö!ÕÕÕ !OĔĔĔ!2B2!BBB!!bµb !U Ĕ' ô' !Ņ !Ņ !Ņ !Ņ !Ņ !=",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !Ņ !Ņ !Ņ !F »+x !W»!!Ó ó(ē »& !R»!!!¹ ¨(v !&Ë »'! »& !F» !' Ķ( !-»2!!!uTTT!!TTT !3 u(!!!»!! 2) !6ĖĖĖuuĖĖĖ !9¦¦¦!!! Ķ'!!222! 2&!2!!222ã!!!ĤPPPĦĦ !<222!2 !( Ķ'! Ķ&!!22!!ã!222 D&ńńsss !8Õ222 !4ã Ķ'¨¨ĶĶĶ!öööDDööö !6ööĦBBB !:Ķ !*ĦĦ !8öååBB!!2 !( 2( !3RRRBBRRR !5ĥB!ĆĆĦĶ !(2 !(2 Ó& !(2ã!!2!BBB!!BBB !4öĆĦĶĶBB!_!ă!!! Ķ(ÃÃ!BBB! 2'!!22! Ĥ&!!!ĤĤ !4ĥ!ĶR!!c2bÁ !2vĶ ã'!ããã !&ĤĤĤ !5ôA¤µbµ¤A¤!!Ė Ó+ !(y> !+ Ė( !Ań !' B)!!!ļRµrr Ĥ( !(Ė !Ań!BBB!!!Ĥ! R&å!!!BB·· !MńĤĦĦĤĤĤ!Ĥôôô!bbbµ!!BB· !,Ė !Bćĥ !+ô !&µµ!!Õ !-Ė !Ab !3µµ !OAń !Ņ !Ņ !Ņ !Ņ !Ĩ",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !Ņ !Ņ !Ĩ Ë' !' Ë' !G u(!!!ËËË !' Ë' !'D »'!!»»» !AöSSS!!! Ķ(! Ķ'ă !*»»!!!T$$$!!$$$ !6ĥĥµBBB¡!Ķ !(Ķ !'Uóó !)2!!2BRR!u R& !5ö¥¥!BBBÖ!! 2)ó!22!!bb! 2(Ó22Ó!BBsĤDBBń !5ĥR!ĦĦĦRB!2 Ó(ã22!!2ģBBr Ó(!ÓÓ! Ĥ&!ĤĤĤ !5ööæ!2ĦĶĆ!ł!B 2(!ãã!!r!!B 2, !*D !4ĥ!R2!RcĦ2Ėó! 2'!!22óóB!!R 2+R !&Ė !8Ħ!Ėè!2ĶR¤ħBB !& B&!!!·R]! B+ô Ė&!Ė !:£R2s2!Ĕ!!BBçB!Õö! B&×Íærĥĥ ô( !=ôbµå¤!ÅbÅ!!ôô!!2!bĦĥĦ ô(åĆR!S !.Ė !:µ !)ôôńĦ·BtB !)å!R !Rt!ąrńĤR !)å!ĕ !/Ėô !Bõ!ĖDDD !+å !TćÕÕö !`öÖåĖ !^bćÕ¤ !_ćô !aô !ÄĖ !`ç !b¤Ań !Ņ !Ņ !Ņ !Ņ !§",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !Ņ !Ņ !ê », !V»» !,»» !S»! 2*ó222!»uu »(Ë»»R$$$!!$$$ !?2 !(ã !'óēĵĕ !(Ó !( R' !=»!!ãã!ããã !(BŅ!Bo 2'!ã2!RRR$D !6 u(!!!» !'ãBBRRó2ã!!!BB2Ć Ó'22Ó! B&ĤBBB !7öödddÓÓ2 !(Ķ!BBRĭăĦ¥!ÀĖ 2'!!R !(ĤĤ !7bÕąBBB¤ĥÃ !)Ķ!!ĶĜ!BÇķzöµĥĥ!!!B!! Ĥ&!!!Ĥ !5öR!BĦĦBBæĥ !,2 !(dĶR!ĥBB !?öåĖ!ÆBBĆ22Ć !)2!ĶĶ !'B!çsR! 2& !=ąĶĖD B&RRBã!BB!ĆĆ!!22 !'22Rėsd Ķ& !>ĶĶÖ!!BBB !)ĥĥĦ!!! 2&! Ķ&ć !)DDD !:RaĆ!BBA¦ÇBB!å2Ħ!!!Ĥ !3D!!!Ė !82ĖTscB!!Ĥ !&t!ĖtńĤ !) 2,Ė ô&!D !5ôbµõpµbA¤ !(õöåĖSS !/ ô& !(ôDD !>Ą !'Dåccx Ė&Ĥ[¿ ô' !-ô !@ĄĄĄ!!b÷Ç¤ÁĤ!!!Ė»üħ¦d !0ô !DćôĤ!!!ĤĤĤ!!ÅæĦ!d !Rô !-Åc !Q¦t !0Åcą !OåĔń !0Å !Ņ !Ņ !Ņ !Ņ !Ņ !6",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !Ņ !ī»»ËË !^»!!Ķ!ËË !Z»!2!!Ķ!łÇ !X»!!ó!!!ł!!ć !V»!!!vă22cŀc !]2!ÁÅČ!b !U»!!!2ó!!c#Ėb!»»»4ËËË!ËË4 !M2ó2Ķā#Ė©»» !)Ë!ÓBT !@RTuħÇÇ!!»!!2!v!243dēē ã&Bó Ó&!Ħ!uRuuuT !;õrsĖö¦¦ĲĒ!Ķ!!ĖĦ!!!2 !2Ĥ2!B !<æĦøĦĦĆĦÆĒ!Ķ!¹ąÕÕÕ !R¥´R2AĶĖR!².¡¶ĆĆ !0B!ĦD !@BĖRR!ć!!ĖóÆćCĥÕB !&¨¨¨!v ¹'f!ĦĦ!ĔĤô!!T4T !8ĖøæĶB2!R¨Æb!¦$dC!!¹!!2v Ķ(2v¹ĦDĸĨTuTĦ !9cBńBB¥ÆR×!êÇBćBss!Ė !&Ķ !-Ķ !=r÷öRsåÅĊ·B!ãç2!!!ĶĶ!Ó !/2!BB !'B !5ĖĖôAÅÅ !&2ó2µ2Ķ!!!Ķ!¹22 !,Ó!!BBB!BcB !?Ķ!!!÷!2!!222Ó !-Ó!2 Ĥ'ôĤB !?¨!!2Å2 !(2ããÓ 2)ĶBB! Ė'!Ėôô !=Á!!!Ķ!Ķ ô&Ą 2&BóÓÓÓÁÁÁ2!ĔĔ !GÁv!!!2TTTËÇr Ĕ'ĴĴĴ!!!ÁĔ !NĦ!!!ócöSS !UÁ!B !)Öĕĕ !VĔôô Ĕ'bb !Ņ !Ņ !Ņ !Ņ !Ņ !?",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !Ņ !M¦SSS ![»»¦Ė!!ĕ !V¦Tç»»!!!ÖÖÖ !Wå¤c !&F!bb !WË!Cģ!!2!Ċ !XËĶ!!bģó!ÁÁ !W»Ķ2!!ćrbĢË !94e !4uć×3ù·×ħ× !&Ķ2!Ĥ¦RRñ !84 !8Ėsôæö¤ö!»!!!cs¦Råå !.»»ËËË !'4 !:öĨ !&ħĒĒ2!Ć!Rõ$D!» Ë&!! »&!2!!! 4&e !:Rs¶RB#BĦRs!2ĪUĖ!!!x2 !&»» !.RĴ !9d2RĤB!BcĖB2 Ķ&RCB !&Ķ!Ķ !-RRR!!RRR2 !5s¦R!Æ¥cĶ!Rc!!a!ĊR!!ó!Ķ !-ÓÓÓ 2&!Ĵ22 !7sĖ!ĦBBssBC!!Ĉ!Ķ!ĶĶvĶ !*22!Ķ!!! Ĥ&!!ĤĤ !8ć·dCdCCC¹2!a!!v!!Ó2 !)2!!ãēBBB !'Ė!D !9ssńńccc2Ķ!Ĉ2 !&B !(22 !'2!! Ė'!Ėôô !4 ô( !&fĶ!!2!2 !'22!22!ÓÓÓóR!2ńń !KÃÓÓÓ!!! ó&ÓÓÓBBB2!2!!!u !DĄ !'ÉBBB!!2ŅŅŅĦBBB! 2& !'R!!uR !@ĶÓ2!!!222!!ĶssRB!!!222 !(Ĥ!Ru !BĔBÓ!!Ķf Ą&Ĕ!!!222ĔĄôô!!!Ĥ !JB2!2!TË»»×!cÆĄĄĄ !&ôôĤ !)Ĥ !BĔ!Ó2Ķ !(Ñ!Ħ !+ĖĖĖ !&Ĥ !DĔBÓ2Óv!2ãRûBB !.Ė !'Ė !CĔBóBóÓÓ!tB!A !/ Ė' !EĔ2!! B&AA !YĄ Ĕ( !Ņ !Ņ !Ņ !Ņ !Ņ !@",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !Ņ !F¦×ç !`å!c !bC !(#¦ !5e§ !J#¥c× !W2!u !'cĶ !4e !Gbu!!#æ!!µ !Yćb·çæ!¤µ !2ee!2Ĕ !Fs¶¦Õcħ !,»»» e&!Ĵ !Hb··s !,»»» !(22!22 !DcRRĤĤĤ!!A !'»» !(222!2!2Ĕ !:¦ !+Ć!d÷$DWA !&»» !'ó22!2ĤĤĔ!Ĕ !6uć×3¦ö·ćÇ!!!T»»ĪĶÕĦõĦ!!»»Ë» !'2!!ÓÓ!Ĕ !=Ė!Ĩ!ĦÖĶ!»Tf!!0!çBC!B» !,ã!22Ķ!!!ĖĖ !8B!R@B2RĖçĢr2!!!¨ĶtR!ã!Ĳ.Ă !'2Ó2B !&ĖĖ!!ĖĖĖ !5CRBRRĖĆBĶRB!!!Ĩ!!ĶĶĶ !*22Ó2!!BBĄĖ !<ss¥!!RBc!ĺĚ!!22!¨ Ħ&2 !&22!Ó2!B!ĄĄ !?CĖ!Æ¥c!2!2Ķ!!ĶĶ!É !)2ÓÓÓ2!B!Ą !As!!ĦBBBc!!!2Ķ!!Ķ!ÉRRó!!!Ó!22!B!fË !BććdCddC!!2Ķ!22!!ãBBB!÷ķ22!BB!Ħã!Ë !Csńńńcóã!!!Ķ!2!¨UUbÐ5µ!!B!!!BBã!Ë != ô(!!!ĄĤ!ã2!!Ķ!!ĶĶĶ!ü¡c!B!Ħ!B2!!ã!Ë !GĤ!ã!!2 !'RBB!cBBcB!22!BããR !GĤĤóóĶĶĶ!22Ċ!B !*ĶB2!!!R !HĤ! ó&ãããB!räää !&2B!B0!!R!!!uu !CĤĤ R'ĤAAĖ!!!äää!2!22 !*2 !E ô' !,ä!!!Ĥ !&R!u2Ĕ !Uä!Ĕ !(R !YäĖ !)2Ĕ !YĖĖ !'Ĕ !]Ė !iĖ ![Ė!!!ĖĖ !^ĖĖĖ !Ņ !Ņ !Ņ !Ì",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !Ņ !Ąeeu !E×ç !`¦!c !3»» !&e!!!R !Cå!C !*¦¦#!!!»»»!!ueeeĴ22Ĥ !QR!»»!!22!UĴ22!ĤĤ !E»Ī¹ »)·2¥g» !&Ķ!ããDĤĤ !F»» !&22!!!222 !'22ãă2 !?uħ¦d¦S¦Çd!»!!222!!!22óăc°!2ă22Óã2!22 !?CRBRRĖĆB!!!2ãăă2!ãăăB!!d!Ó!Óã222!!2!!! Ė' !7ss¥!!RBcË!!!B!!ăã!ĦĦĶĶĊ|·B!B22!!!2!!ĖĖ !=CĖ!Æ¥c!!!2!!ĦĦĦ!222!!óăB !(2!ĄĄô !?s··ĦBBBÓ!!!Ħ 2& !&22 !'222!f !CssB!BB!!!ã! 2&!222 !&222!!ff!Ë !? Ĥ'·CCCB2ãBR222!2 !&22!2!!!Ħãã!!ËË !BĤ !&óB2 !& 2( !&2!!2!¨ã!ã!Ë !BńńńĶĶ !1 Ķ&!2ã!ã¨ó!R !; Ė(!!!Ĥ¨Ė !22!!!2R2ó!ñ!R !&R !?ÁĴU !'ô !,22!BĦ!!ń!!!R!!R!R !@Á ô'! ô)ĄĄĄ!!2!2!B!T!!!RR !TĄĄĄô!2 !&DT !&T !UĄ !(Ĕ!!!T !WĄô!Ĕ!2!TTT !ZĖĖĖĔ !bĖ !&ää !]Ėäää !Ņ !Ņ !Ņ !Ņ !Ņ !)",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !Ņ !Ņ !Ī ») !Y»» 2)ËË !V»!2 !& Ó'ËË»» Ë, !J Ķ'¹!!¹¹ĶĶ!2 Ķ(!!ĶĶËËRR!!!RR !>» !)Ķ¹¹ĶĶ !-Ķ!!!ó$DRRRĘDR !4TTuħÇÇ!!» !+Ķ !(ã !+2!Ė!Ħ!ĘĘsĤ !7Ħt÷÷¦¦ !& 2( !0ã !+R !8 B'ÆĶ !&ĶĶĶ!!!2! 2'! 2(!2!!!sB !;B Ĥ'rc!2 !'ĶĶ! Ó'ãã! ã'ēR!2 !&B!R !?Ķ !,¹¹!!2!22 R'!!ó!ññĤĤĤ !'Ė !4Ĥ !'÷2 !/222!!Ħ Ė&ĦĖ!ãT !'ńńôĖ !:÷Ć2 !-Ó2!!!22B 2(!2 !AD÷·Ć¤¤ģÃ !'22!Ó!!2!2!!! 2)B !& Ė& !7ĖĖôA¤¤!!ôs2!!!2ÓÓÓ 2'!!2! 2&!22!ĶĖĖĖ !Dô !&Ķ222!2! 2& !) ô& !Mvv¨¨vvôôô111 ô' !LÁ2 !+ËË×ġRÆ !RÁ222 !+ą !UÁÁ!22 Ó(sĬsA !UÁÁÁ B(tAA !Y Ĕ) !Ņ !Ņ !Ņ !Ņ !Ġ",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !Ņ !Ņ !ÅRuuu !_Ę!!!uu !V»»T$$R!ö !XË» !)R!ĤĤĤ !AËËË !. »& !'RR$sB !CËË!!!ËËË!!!»»Ë»»» !&ă !&BBBĤĤĤ !AË Ķ*»»» !- 2&ĤĤĤ!!Ė !@ËĶ!! 2' !'2 !*fă!ă2D!!!Ė!ĖĖĖ !<ËĶ!!! Ķ'222!2óó !(2!!ă2!!!ĖĖ !8 u(!!!Ķ !+ĶĶĶ!Ķffă22!22!ă !&ôĖ !@¦¦¦ !'2 !02Ãóó222!ô !B222!2 !&2 !-óăăcBB ô& !BÕ222 !&2!!2 !)ÓÓB2!!!ĶUË !CööĦBBB !&ĶĶĶ!222 Ó&!R !(ăăËË !@öååBB!!2ó2 !&ĶĶ!!R!!RR!!222 !&ó!Ë !?ĥB!ĆĆĦĶ!!!2 !(ó!RR222 !*BóóRTT !;öĆĦĶĶBB!_!óó222 !)Ķ !(222!!22!BBRuuuR !6ĥ!ĶR!!c2bĔĔ!óóó22! 2&!¤ !*2 !&ĤĤ!!ĤĤ !6ôA¤µbµ¤A¤!!!ĔĔĔĖóóă !&2cåUĦĶ !(22 !&Ĥ !HĖĔĄ !&ĆCCÁĔfUUĦĶ !Oćĥ!!!ĄĄĄĆ!!!×!ÁÁÁĔĄUĦĶĤ !Kb !)ńńåå2× !'ÁĔĄ Ė& !IAń !)¤!!2ç !-Ė!!!Ė !N¤BB¤ !`bb !/ĖĖĖ !Ņ !Ņ !Ņ !Ņ !j",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !ÃTTuR !^T !&RR !]222 !^Tń2B !]TT!DĤ!Ĕ !Y»R!222!Ĕ !Y»!hń2B!!!ĖĖ !VD2!2ĸĤĔĔ!Ė !I»»» !,»»¨ã2ãB !)ĖĖ !B»»»!!!»» !(»»!!!¨ !(Ė !DË»» !'222Ë »&Ë22 !&ãB2DDĖ !: u(!!!ËË !&22 !(2Nł !&22ããB!!!ô !@öSSS!!Ķ!!2!!22 !&>Ė!łĶĶĶ!ãBB!2!ô !?ĥĥµBBB¡!!!2!!!ã!ã!!!ĶBB !&Ķvf!2!ô !?ö¥¥!BBBÖ!!2!!ãã2ã2óãã!°°¶22!!!Ķ2!ô !@ĥR!ĦĦĦRB!2!!ã22!2!!22Ī!8!ã! 2&UUË !?ööæ!2ĦĶĆ!_!óó2! 2(!ăYÆsĵãã !(Ë !>ĥ!R2!RcĦ2!ó 2+!!22sBBĵ2ãã!ã!!!§TTT !:Ħ!Ėè!2ĶR¤·B 2& !(2!!·!B!2B2ã2ããã!B!!§!uuu !8£R2s2!Ĕ !&Ç!!Õö!2 !&Ö!Æ222B 2&Ĕ!BB!RĦĦĦ !4ôbµå¤!ÅbÅ!!ôô !&bĦĥĦĦ222!·cć!!2!!222!ĤĤ2!!RRR !9µ !)ôô0Ħ·BtB!ĠÕôôôµô!!!222!2!!!ĔĔ!ĔĔĔ !Ct!ąrńĤń!!ħ !&ôôô!!!2 !Mõ!ĖDDD!ą !+ôô!!!ĖĖĖ !KćÕÕö!ì!A !+ôôô!!!ĖĖĖ !IöÖåĖ!ö· !ZbćÕ¤ !8Ė !Gćô !aô !<ĖĖ !JµµÕ !YĖ !`ç !b¤Ań !Ņ !Ņ !Ņ !Ņ !¦",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !Ņ !Ņ !ª »' !]»22!!!»» !Y»!Ķ!!2!!>¦¦ ![2!2!Ė!R !0ee§§ !D»!!2ó!!!2!ö !/R§ĴB!!uu !GóÁÁÁåöö33»» !&Ë»»Ë4Ħ!ĔĔ !D»!!2!!vËDDËĊ!R!â! »&Ķ22!!Ĵ !&2Ĥ !C2!óBăã !&Æ!!!2 !&2!!ã !'ĔĔ !IB!BÓÓ¦¥s3!22!!Ķãã!2 !> u(!!!»!!!óB !'22!Çė2 !(v¨vE!!ĖĖĖ !=öödddÓÓ2ó!ĶĶ!!B! 2&!!ÓÓÓ222!!2!hĖ!!!ĖĖ !:bÅąBBB¤ĥÃ!!Ķ !' 2+ÓÓÓ2!Ó!!ªRR !<öR2BĦĦBBæĥ!22!!ĆĆ222 !& 2(ã!!!ãB!Tee!§§T !5öåĖ!ÆBBĆ22Ć2 !&ĥĥĦ !& 2+ã2ó2ãDĦĦĦ§ĦĦB !5ąĶĖD B&RRB22!å2Ħ!!!Ĥ22!!22! 2+!BBBĔ !9ĶĶÖ!!öBB !'t!ĖtńĤ !) 2&! 2'!ĔBB!!B2 !7RaĆ!!B·¦×!!!õöåĖSS !' ô'! 2(!!ĔĔ!B!Ĕ !62ĖTscö!ô¨Ķ!Ķ!!!Dåccx ô& !'ôôô !'ĖĖ!!!Ĕ !5ôbµõpµbA¤!Á!Ķ !&b÷Ç¤Á !. ô'!!ĖĖĔ !AĄ!ĶĶĦ!ćĶBe !8Ė !BĄv!Ħ!Ķ!!!e !8ĖĖ !AÁQ×!ĶĶĶ!¤¦ç !XåĔÉvvvfĆĆÆCC !X Á'!ÆÆ!!C !]å¤¤ĥĥĥ !Ņ !Ņ !Ņ !Ņ !z",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !Ņ !é »&ËË ![»!!!2.Ģ¦ !Y»!2ă2!Ė!R× !ZăBóóĖĥRR !W»!2f!B!1!!b ![Ħôµ!3b !W»!!!ÓB!å3 !'ËËË!!!»»TT !L2!!!u3!V T&Ó!!»»»!2ĦĦTuu!!!uu !A»22!!¹ĆĶ#ħó !(Ķ !&Ķ¹!ĦĦĤuRuĦ!R !8RTuħÇÇ!!!Ķ !&¹ĖĶ22!Ħ!!¨ !0ĤB !;õrsĖö¦¦ĲĒĶ !'ĖĖĖ!!vf2 !.Ĥ!DĤĤ !;æĦøĦĦĆĦÆĒ¡Ó!!ÅÅÕĕĦ !,2!!B !&Ĥ !>¥´R2AĶĖRºĕ.¡ĆĦĖ!B!!!Ķ!2 !&ĶĶB!B !(Ė !:BĖRR!ć!!ĖRÆćCĥąs!!!óăăóēģģ ă&!!Ħ$!!!ĖĖ!RuR !8ĖøæĶB2!RĖÆb!¦$×·2B !&ĦĶĶĦĦĦvvĦ!!!D$uRRĨĆD !7cBńBB¥ÆR×ģSÇcćB !& Ħ'ĶĖ¹¹¹!Ó!Ħ !)BB !7r÷öRsåÅĊ·B!!ç!Ķ !&2B !&B !GĖĖôAÅÅ!!ó!2Ħ!¤Ė !&2 !4B!!!BB !>Ĕ!!B!çB !'22BBBR!!ÓÓÓ!¹ !&ĤĤĤ!ĖĤĤĤ !ARåB2 !'2BBB2! B&ÓÓBB! Ė'!ĖĖĖ !>Ĕ!!Ķ!!!Ħ U& ô( Ĕ&ĴB!ĔĔ !NvĶòò_Ë !,ĔĔ !JĔ!B!!!āđ11Ė. !WĔ!Ķ!!ĸhtÇRR !XôĶĶ!!óç!!b !YĔĄôĔĔĔbb !Ņ !Ņ !Ņ !Ņ !ģ",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !Ņ !§¦Tç !`å¤c !'SSS !YC !&S !^u!»¦!!!ĕ !Zbuó!ÖÖÖ !Y2!ćrb!Ċúú !*»»» !@uć×3ù·×ħ×!!»ËËc!Ĥ¦RRñ!Ñ !(»»!!2Ë !AĖsôæö¤ö!» !&s¦Råå!2!!»»Ë»» !(Ë !AöĨ !&ħĒĒĶĶĆ!Rõ$D!ÃË»!2Ķ !IRs¶RB#BĦRs22ĪUĖ!!!x¹Ķ !/T !>d2RĤB!BcĖB2 Ķ&RCB!!!2 !)22!!!ó !?s¦R!Æ¥cĶ!Rc!!a!úR!!ó2Ķ2 !'2!ēãĶ!!!R !>sĖ!ĦBBssBC !(ĶĶv!!Ķ2!ãããó!!B2ó !Bć·dCdCCC¹!!Ę!!Ħ!!Ó!ĂĂòĶ¹¹¹v!Uvó!!B !Assńńccc2!!Ķ!!¹ĶĶBÓssR!Ķ !(v!vĤ != ô( !&Ĵ!!2 !'2 !0v!xD !(RR !<Ą!4!!Ķ!2ăó !*ă !-Ruu!!eĨ !>Ķ!Ó2!!Ķ!22!2ÅöcÆĶ! Ó(!!ÓÓ !&RR !@ĔĶBÓ!!!f!!fU!s!Ħē !)Ó !+2R !?Ĕ!!2 !&UĶ!RcBB!!RRR B&Ó!BĶ!ĤĤ!!!2 !@ĔBÓã22f!!!tB!ÚĔ !&222!BB!Ĵ !'ĤĤ4 !@ĔBBÓ!!!ãã!SêÑ!Ĕ Ą(Ĕ222 !*Ć !AĔ!BÓÓã!!¹ĴÁ !,ĄĄĄ Ė' !FĔĔ B&ĴÁ !6ĖĖĖń !D Ĕ& !Ņ !Ņ !Ņ !Ņ !Ņ !¥",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !Ņ !E¦×ç !`å!c !bC !Ä2!u !bbu!!# !^ćb·çæ××× ![s¶¦Õ!!!tSc !Wb··s!!!µ !XcRRĤĤĤ !-»»Ë !D¦ !+Ć!d÷$DWµµ !& »&!!!Ë !>uć×3¦ö·ćÇ !&»»ĪĶÕĦõĦ!!!»!Rħ !(ãã !@Ė!Ĩ!ĦÖĶ!»TT!!0!çBC!B»»!26w !&2!!!D !>B!R@B2RĖçĢrf!!ĸ¨ĶtR!ã!!.B>N!222 !/eu !4CRBRRĖĆBĶRB!2!Ķ!!ĶĶĶ!22!BRc!Ķ!!ģ2!!!R !=ss¥!!RBc!ĺĚ2Ķ!2!¨!!!vĶĶBB !&ĶĶ5Ķvv !*e !7CĖ!Æ¥c!2!2!2!ĶĶĶ¨vv!!2Ī!B !)2!vxDR !(2 !5s!!ĦBBBc!!!Ķ!!22!2!!2!ēB!· 2(!!!Ķ!!ee!e!2Ĕ !6ććdCddC2 !'ĶĶĶ!!2!ē!dd! Ó(ã2 !(R !<sńńńcãã !)Ķ!!ē!ĶBB! 2(B!22B!22!222 !4 ô(!!!ĄĤ!ã2! 2(ē!Ķ !& B(!ããã2!22!Ĥ2Ĕ !?ĤĤÁ2 ã(ô! 2&! 2(!BBB!!ĔĔ!!Ĕ !CÁ Ĥ(! ô.Ą!!!Ĥ!!!DĖ !YĄĴĴ!!!Dô!ĖĖĖ !ZDĖô !]Ė!Dô !`Ėô !Ņ !Ņ !Ņ !Ņ !Ņ !/",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !Ņ !ĩ×ç !*### !T¦!c !'»»·¶ĆŅ !Tå!C!!Ë»»!2sÀ !V»Ī¹»»!!!2!BdB !T» !'Ķ22ÓãAĚA !S»!! 2'ÓÓ2!!! »+ !@uħ¦d¦S¦Çd !(Óãăã22¨¨ËË!! 2'!ã»»Ë !'eeu !6CRBRRĖĆB!»!!2ÓRB!!¨¨ãã!!22 !'2B22!Reee !&R !5ss¥!!RBcË!!2!2ĦĦĦ!ãã!! ã& Ó(2ÓÓÓ!Ĵ2!R!2Ĥ !7CĖ!Æ¥c !'ÓB !& 2(BBB 2&B!222!!Ĥ2!ĴĤ !8s··ĦBBBÓ22Ó2Ħ 2& !&222! 2(!222!!!Ĥ !<ssB!B¦!!!RBB 2&B222!2!!! 2&!222 !> Ĥ'·CC!BãÓ!! 2'! 2&!!B!222!2!2!2 !BĤ !'c22 !-2!2!!!2!!!ĴĴ!!!DD !>ńńĤĶ!Ķ !-22!!!ĶĶôĶĶ!Ĥ!!!DD!! Ė& !4 Ė(!!!Ĥ !/ĶĶ!!!ĄĄ!ĄĄôĖĖ!D!!!ô !BĤĦĶ !(Ķ !'ääô !*Ė!!!ô !DĤĦ Ķ(!ĖĖôôô !.ôôô !FĤĄĄ Ħ'ĤĤ ![ Ĥ' !Ņ !Ņ !Ņ !Ņ !Ņ !Ņ !C",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !Ņ !Ņ !«»»»ËËË !Z»» !(Ë !W»» !+Ë× !T» !)ÓÓÓ!!s!ËË »'Ë!» !M222ãBBBÓÓêË!!222!ãĶ»!RRR!!RRR !@» !&ĶĶĶ¹vvv¹¨ĶĶĶÓ!!Ó!¹!!ÓĘ$!$$DDDu !>» !* Ķ' !'ÓÓBăĶ!!!RB!!R !9TTuħÇÇ!!» !4BBB!22 !(s!Ĥ !:Ħt÷÷¦¦ !822Ó!!sB!!!B !: B'ÆĶ !5 2&!!22UĤĤ!Ĥô!Ĥ!ô !5B Ĥ'rc!2! 21ă!!2!!RÓÓÓĨxĖĖ!ĖĖô !=Ķ!!! Ķ( !(ĶĶĶfĶf U&!¨¨¹ñuuuR!uuR !4Ĥ !'÷2 !+Ķ !1¹!!Ķ !'u !<÷Ć22 !.Ó !6ĤĤĤ !7D÷·Ć¤¤ !+2 !'2!!!2 Ó&!ó!!2!ĤĤĤ !9ĖĖôA¤¤!!Á !)2!!!Ó!Ó!222 !)22 !GÁ 2(!!ÓóB!! Ó&!BBB!ăBóóó !&ĖĖ !AÁ!!!ÓóóóB! B)!222R2!22Ĕ Ė&!!ĖĖĖ !?ó!!¹vĦ!22ĶBB,¤õĔ Ą(ôĄĄ !IĔ ó&!ĦĖĶ!ĶĶąR !UĔĔ!!BBB2!!!ĬBA !VĔĔĔ !&ĄĄAA !ZĔĔĄĄ !Ņ !Ņ !Ņ !Ņ !Ĥ",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !Ņ !Ņ !ī Ë& !]ËË!!!óTT !YË!!!óó!!!ËË !0Ru !FË!!ĶĶfv !4$$!uu !CËĶĶĶ!!!ĶfffĶĶ»»» !1u !AËĶ!! 2& !+eË !)TR!!Ĥ!!u !?ËĶ!!2 Ķ&22!! 2&ă!óËË !&TĖ!B!D!ĤĦTT !4 u(!!!Ķ!!!Ķ !&ĶĶ22 Ķ&f!2ó!Ë!ËËf¹fööĦ!!ĖĖ!u !9¦¦¦ !-ĶĶ !'fffĶĶ»!Ã!!2RR!!!ssBĤ !9222!2 !2óĶ !'R22!BBBĤ!ĤĤĤ !9Õ222 !,2 !(22 !'Ã2!!ăĤĤĤ !<ööĦBBB !+2Ķ!!!222ó 2(R!ăă2 !>öååBB!!2ó2!! 2&! 2&óóó2! ó' 2& !'Ė !9ĥB!ĆĆĦĶ !'ĶĶ! ó(222!! B'2!!!Ķ4ĖĖĖ !&Ė !4öĆĦĶĶBB!_!ă2!!!Ķf! B&2!!2 !,2Ą !&ĖĖĖ !5ĥ!ĶR!!c2bĔ!ă2!!!2!ĦĶĶ!!22 !*Ķôôô !<ôA¤µbµ¤A¤!!Ą!ă2 !'Ķ!Ķ ô-Ą !KĄ!ăă2ó !^ĄĄõÃ2!22!!ħħ !XAńĄ2!!!ĆCC ![ĄĄĄĆ!!!ćç !]ńńąą!B !_ b& !Ņ !Ņ !Ņ !Ņ !|",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !Ņ !Ņ !Âuu !aĦĦuR !^T!BĤ!R !B Ë( !' »'Ë »&!!!»»fBĦ$$!!TTu !3 u(!!!ËË! Ķ' »&Ë22 !*»T» !(B!R !;öSSS!!Ķ!!222 !)22 !,22!BB2!!!B !7ĥĥµBBB¡!!2!ĶĶĶ!222!!ó!!2ă 2'f!2!!222!!!B22 !5ö¥¥!BBBÖ !/vóóó !(22!óó Ĕ&!!ĤĔĔ !5ĥR!ĦĦĦRB!2! 2&!ó !&ó222! ó* !(Ė !8ööæ!2ĦĶĆ!_! ó&ăē!óó!!!Ķ!!! 2,!!ĖĖ!Ė !7ĥ!R2!RcĦ2!ó 2&!!BB!óó!Õ¤ !-ĄĖĖ !;Ħ!Ėè!2ĶRÕ·B2 !&2!!B2!ÕĖĶ¤! 2&!222Ą !)Ė !9£R2s2ĖĔ!! 2&!Õö!2B!22B!Ķ!!!2 !Aôbµå¤!ÅbÅ!!ôô!!Ç!bĦĥĦĦô!BBB!!ĶĶĶ!!!ô !+ĖĖ !8µ !)ôô0Ħ·BtB!×bæ!!ĄĄ!!!Ķ!ô !Nt!ąrńĤń!!!bA!! Ą&ô !Oõ!ĖDDD!!¦R× !YćÕÕö !`öÖåĖµ !]bćÕ¤!¦ !]ćô !&R!µ !Yô !&åµµ !½Ė !`ç !b¤Ań !Ņ !Ņ !Ņ !Ņ !D",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !Ņ !Ņ !ĭ»»Ë !9RR$ !C»»!!ĶË !,»!»»»ËRee§R§4TR !A»» !(Ë!!»»Ë »&!Ë2!!Ó !'Ħ!!B !@»!!!2!!!Ķ!Ë»!2Ķ !)2ã2!BB!!!BĔĤ !?» !&ó !+ 2(ÓÓÓ2!DĔ !J2!22!2!!oăăă Ó' 2'!!ĔĔ!BĔ !@»!!22!vóó2!!Ģær!! 2* !)Ĕ !C2!óóē22ãă_!B!Ķ! 2' !&B != u(!!!»!!!ó!B !'¦2!c!2 !(222!Ĥ!!Ė !=öödd¦ÓÓ2ó!!ĶĶ!!B!2!÷·!! 2+Ĥ!!Ė!ĖĖ!ĖĖ !7bÅąBB!¤ĥÃ!!!Ķ !'2!bAB! 2( !,Ė !8öR2BĦĦBBæĥ!!22!ĆĆ222 !'ĶĶ!!!Ķ !'Ė !<öåĖ!ÆBBĆ22Ć22!!!ĥĥĦ !(Ħ Ķ' !'Ė !=ąĶĖD B&RRB22!å2Ħ!!!ĤBBc !& Ķ' !BĶĶÖ!!öBB!d!!!t!ĖtńĤ!ććć!22 !*Ė !@RaĆ!!B·¦s!!2õöåĖSS !'Ą!22 !F2ĖTscö!ô¨Ķ !'Dåccĸ ô&!ĄĄ! 2&!ô !>ôbµõpµbA¤!Á!ĶĶĶ!!b÷ÇÇ !* Ą&ôô !JĄĄ!ĶĦ!ćĶBBÅçç !WĄĔĦ!ôĄĄĄĖĖĖ· !W¦× !' Õ& !WåĔń !Ņ !Ņ !Ņ !Ņ !è",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !Ņ !Ņ !F»ËË »&××× !W»!!! 2&õõõ !V»!!!ăÓÓ!!S!!c !W2 !&ÓÓÕĆĆĆ !T»!!!Ó!¹¹ĴĴ!!»Ë» Ë*»» !M¨U!!ËËË»2Ķ !& Ķ'!2»»Ruu !&$$ !=»2!!Ķ!!Ķ !)2ĶĶĶ !'2!2ă!ĦĦTR!RRP !5RTuħÇÇ!!!Ķ2 !@R$!D !6õrsĖö¦¦ĲĒĶ22!!2 !)ó !/BBB!!!B !8æĦøĦĦĆĦÆĒ¡ÓããĲĲĲ¡Ó2!!!2 !.ĤĤĤ!!B!Ĥ !8¥´R2AĶĖRºĕÅĕöB!!Pā !+2!Ķ!Ó !)ĤĤ !8BĖRR!ć!!ĖRÆćC1ås¤ķķā2!ó 2'ÓģãÓBń !&ĖĖ !;ĖøæĶB2!RĖÆb!¦$×ç!!Só!BóóăăăRĶRRB!!DD!R!ĖĘĘ !7cBńBB¥ÆR×ģSÇcćB!·ö!BĦĦ!!!ĶĶ !*ĤĤ !&ńń !6r÷öRsåÅb·B!¹ç!Ķ!!!ÆR!Å !KĖĖôAÅÅ !&2Ħ!!f!!!U!R !)2 !NĔĦ¹!Ęó!UEĶ6!!RBĦ!22!2!!!2Ĥ! Ė' !CĴÓ!ĶfUÓ!!2ÇÇĊBBB22ĄôĄ22ôĖĖ !IĴÓ2!!!22!!!Á ô'!!!ôô !MĴÓã2!ÓÓÓ!Ĵ !YĴĴÓ !&Ĵ !] Ĵ' !Ņ !Ņ !Ņ !Ņ !Ņ !£",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !Ņ !¨¦Tç !`å¤c !bC !cu!!SS !:R !DbuS!ĕ !94D !B2!ćrRR!!· !64 !CËc!Ĥ¦RRR·Ć !,»»Ë!R44eRR !8uć×3ù·×ħ×!!»!!s¦Råå!Ć !( »'!2!Ë !)RĤ !7Ėsôæö¤öR»!ĶĆ!Rõ$D!!!»»Ë»» !,RR!!!R2D !8öĨ !&÷ĒĒ2ĪUĖ!!!x!c!2Ķ !.222!!2ĤĦ !7Rs¶RB#BĦRsĶĶ!RCB!!!& !-Ķ!!!ĤĤĤ!!Ĥ!Ė !6d2RĤB!BcĖB2!!PĊR!!łsN!ă2 !'222!!ó !&ĖĖ !9s¦R!Æ¥cĶ!Rc !'ĶE !&fă 2'!!ó2ó!!!ĖĖ!!ĖĖń !7sĖ!ĦBBssBC!!Ę!Ħ!!B!!2ē2ē!! ó&Bó!!ĖĖ !?ć·dCdCCC¹!!Ķ!¹U!Ī&Ī!UU!óÓĦĦ!!!ĔĔĔ !Bssńńccc2!!!ĶÓ!2!ÓóÓÓăĶ !&ĦĦô !A ô( !&Ķ !'¨!Ķ !/44 !HĄĄ!Óã2!!!22ÓB!BBĶ2 !*T !IĔBBÓã2 !'222 !-e !IĔĔBBÓãÓÓB2!!!B!!BB !'2!R !JĔĔB!!!ĔĄ !&Ķ22!BBB!B!2!R !KĔĴĴĴ!!ĄĄĄôĄ!222 !&2!!!R!!RR !QĄôĄĄ22RB !'R4 !WĄ22ĶĤĤ !&c !XôôĴ !(Ĥ !ZĖĖĖD !hĖ ![ô Ė' !Ņ !Ņ !Ņ !Ņ !Í",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !Ņ !F¦×ç !`å!c !bC !=u§ !GC !^2!u!!C !8u2 !FbuR !`ćb!RÇÇ !4uu!!Ĕ !FsÖR!c$ !,»»»§uuu!Ĥ !Hb··!c !+»»»222 !&2!2 !EcRRĤEĺĊĊÉ !'»» !)222!!!Ĕ !:¦ !+Ć!dh !*»»!!22!ã !&ĔĔĔ!Ĕ !6uć×3¦ö·ćÇ !(ĪĶ¹!22!ãăË»»!222!!2!ÓÓ!Ĕ !=Ė!Ĩ!ĦÖĶ !&»»Ķv !'BĦã!22 !'Ó!22Ħ!!!ĖĖ !8B!R@B2RĖçtÇ»!!!2 !&ã!BBēăăÓÓ!!Ó2B !&ĖĖ!!ĖĖĖ !5CRBRRĖĆBĶRB!!22Ķ!!!ãB Ħ'!¹¨ÓÓ2!!BBĄĖ !<ss¥!!RBc!ĺĚ!!ĶĶ!!2 !-¨¨!B!ĄĄ !?CĖ!Æ¥c!2!2 !&22ãăB!BB !'22!vfĄ !As!!ĦBBBc !&22!ãB !'BBB!ã!!2!!Ë !BććdCddC2ă22!!ãB!222 !'Ħ!Ó!!2!!Ë !Csńńńcã2ăăãăB!2 !)2BB2 ã&!!D != ô(!!!Ą0!2!B!!!Ķ!!!2 !( B&¨!ã!D !FĖ!!2!!!22 !& 2)!!2!ãB!!R !Fô!!222 !, 2(ăB2!!!R !Fôô !) ô'äää!22!2B!B0!!R!!!uu !Bôô U&ô !*äää!2!22 !*2 !D Á& !.ä!!!Ĥ !&R!u2Ĕ !Uä!Ĕ !(R !YäĖ !)2Ĕ !YĖĖ !'Ĕ !]Ė !iĖ ![Ė!!!ĖĖ !^ĖĖĖ !Ņ !Ņ !Ņ !Ì",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !Ņ !¯× !a× !a»ĪĪ» ![×»»22!ó» !4eeR !D»Ī!2ããó!Ñ !52!R !B»!!2 !6eeeR2!T !B»!!2!ã!2ĤĤ !+ Ë'e22!!22 !D22ÓÓ!2Ķ»!! »&!ËËË!ã!!!2!2B!ĔĔĔ !7uħ¦d¦S¦Çd!»!!Ó 2&!óËË 2&Ë !'ãããĤ2!Ĕ !<CRBRRĖĆB !(22!22 ã(ăĶĶĶ!¨ !&ĔĔ !=ss¥!!RBc»!2Ó!22 !+B!2!!ĶĶ¨¨ !( Ė& !8CĖ!Æ¥c!!ó!!!2!!! 2)!Ħ!222!ĶĶv!!!ĖĖ !<s··ĦBBB2!Ó! 2&!! 2(!Bãã!!22!2ĸĖĖ !?ssB!B¦!B!RB!!!22! 2' !&ããã!!ã!ee !< Ĥ'·CC!ã!R!2 !1B!!ăó¨¨Ħ!R !@Ĥ !&222 !0BB!BB !'Ĵ!RR !?ńńĤ!!Ķ !/ 2&!!!2!!!0DD!!R!§§R !4 Ė(!!!ĤĖ!Ķ !/ôôô222!!ããDĶĤ!!!R !AĤ !*Ķ !'ô!!!ôô!!RBR!!!DT!!ĔĔ !@ĄfU Ķ'!Ķ ô& !(ôôô2!Ĥ2!ĶĦ !&D !@Á!fff!!!Ą !/ôôĖ!!!2!!DD !BÁÁ !&Ą !3ôĖĄ!DD !FÁÁĄĄ !7Ĥ!!!ôô !]Ėôôô !Ņ !Ņ !Ņ !Ņ !Ņ !Í",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !Ņ !Ņ !H»»»Ë !]»» !&ËË !Y» !(óóT !W» !'2ó !Y» !&22ó!!!Ĕ !Y22!ó !&44ËËË4ËËË !M»!!!ĶĶ!ffvvv¹¹!Ķ!BóóÓËËË4 !OĶ!!Ķ!Ķ!ĶĶ !'BÓÓ!!4uuuR !;TTuħÇÇ!!» !+2Ķ!Ķ !*BBóBB !&RuuR !9Ħt÷÷¦¦ !,Ķ !'2ó !+ĤĤĤ!!Ĥ!DRT !6 B'ÆĶ !022! v&ffvvvfhx$$!$Ħ!!!u !4B Ĥ'rc2!2 !+2!ĶĶĶ!!ĶĶ!!Ķ!Ķ!!!Ė!!Ė !@Ķ!!Ķ! 2* !(Ķ !,sB!sB!!ń !5Ĥ !'÷2 !&ĶĶĶ !(2 !1ĤĤ!Ĥ!!D !;÷Ć2 !,ÓÓÓ !&ó2 !&2!2!2 !'ĤĤĤ!Ĥ !6D÷·Ć¤¤!2 !&2!ÓÓ !&2 !& 2&!ó!2!ó$!!ĖĖĖ!!Ė !4ĖĖôA¤¤!!!Ó 2&!Ó!!BB!Ó!22! ó(!óóóĔĔĖĖ!!!ĖĖ !=Á! Ó'!!B!BBBÓÓÓĦ !& Ĕ( !GĴ!BBBcccBB!!! B& Ĕ& !NĴf!! Ħ(f Ĕ' !SÑĔff !&ĔÑ !ZÑÑ Ĕ& !Ņ !Ņ !Ņ !Ņ !Ņ !¥",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !Ņ !Ņ !ë »& !^»!222»Ë !6$ u& !A»!!!óóăóħ !4$!Ĥ!!!u !?»!22ó !7$R!!$Ĥ !A»!!ĶĶffv!!A !/ËË$!!RRB!ĤĤ !FĶvvË »& !)»»Ķ!!!$ńńĤ!!!Ĥ !=Ë !*ĶĶĶ !&T»!!»»Ë !&RR!D!!Ė !?ËĶ!! 2& !(222v!»» !)ńBBĤ !9 u(!!!Ķ!!2 Ķ&222!2!!Ķ!Ķ !*2!4ĤĤ!!Ė!ĖĖĖ !9¦¦¦!!!Ķ !&ĶĶĶ!Ķ !,Ķ2!!ó!D!!Ė !>222!2 !622!2ó22!DĖ !>Õ222 !,2!!!Ķ!!ă!222!!!ó2!!ĤĤ !=ööĦBBB !(2!!2Ķ!!222óB2 ó(222Ĥ!DuR !:öååBB!!2 !(22!222!óó!!ó222BBB2!Ĥ!!Ĥ!!uuR !7ĥB!ĆĆĦĶ !&22!! ó'ă222! 2&!!ĤĤĤ !(ĤĤ !7öĆĦĶĶBB!_ó!2ĶĶ!!v B& 2&!2 !'DDD !&Ĥ !:ĥ!ĶR!!c2bĔă!!!Ķ!!Uôô !( ô& !&Ĥ !>ôA¤µbµ¤A¤!!!ó2!2!!!T! ô( !& ô& Ė(D !CĔ!ó2Ķ!óó!T !9Ė !AĔ!!2 !&Bħ !5Ĥ !EĔÁóó!!B!Cħ !4ĖĖĖ !EĔv!B !`ÁĔôôö!Cç !_ĥĥĥc !_ A& !Ņ !Ņ !Ņ !Ņ !=",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !ĄTu§ !_T!!!R !cR !ZT§RB!Ĕ ![T!ĶĔĤĤ !Y»ËR !NËË !0»!!!RB!!!ĖĖ !EËË!ăËË !-T2!!$ĔĤĤ!Ė !EËË!ăă!ă!ËË !)»»vó2!!$ !(Ė !AË!!ĶUU!!ă!!Ë»»!!»»!!Ķv!!!2!!Ė !&Ė !?ËĶĶĶ!!!UUfĶĶĶ!2»» !)ó!!!Ė !: u(!!!ËË !&222!!Ķ !-2!ó!2!Ė !@öSSS!!Ķ!!2!ĶĶ2!! 2& !'22!ó!2 !AĥĥµBBBó!!2!Ķ !&22 !' 2&!!ó!2!!Ą !>ö¥¥!BBBõ !'Ķ2!!Ķ! ó&!ă!!óóó!2!!Ą !?ĥR!ĦĦĦRö!2 !&Ķ!Ķ!Ķv222!!óó!!!2!ĄĄ !?ööæ!2ĦĶĆ!ó!ó2 !'22 !&ă 2(!fËË !?ĥ!R2!RcĦ2Õó2!22 !&óó 2& !'2ĶóóóË !>Ħ!Ėè!2ĶRÕ·B!ăăă22!ó!!Ķ !(22Ķ22!!óËuu !>£R2s2ĖĔĦ 2&ēē2!!2 !'22!!22!22!óĤ!u!!uuR !4ôbµå¤!ÅbÅ!!Ĕô !&b_v!!!Ķôô !)22!2B!!!uR !<µ !)ôôÕĦ·Bó2!!å$!ôô !)2!2!!!Ĥ !Gt!ąrńĴÅÅ !'ôô !(2Ĕ!ĤĤ!!ĤĤ !Dõ!ĖDDD !+ôô !SćÕÕöµĖAń !)ôôô !QöÖå¦Ķ !.ôô Ė( !HbćÕĶĶĦ¦ ![ćô×ĶĦ!å !5Ė !Gô!µĦ!å !`åå !8ĖĖ !DĖ !`ç !b¤Ań !Ņ !Ņ !Ņ !Ņ !C",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !Ņ !Ņ !_ R' !cR !ZRR !(R !V»»R !_»!2x !Z »&!2!ã$ !U »&!!!22Ķó2!!!ĖĖĖ !O»2!!!222ãó 2& !'ĖĖĖ !B »,!Ķ2ă2!Óã2!ă !&Ė !G» !)22 !&vóãB222 !&Ė !G»!! 2'!Ķ!222!! 2& !'Ą !> u(!!!»!!2 Ķ'!!!ã!!!ó22 !'ĄĄ !Cöödd¦ÓÓ2!2 !&2!!!ããó2!!!22ĄĄ !DbÅąBB!¤ĥÃă! 2&!2 !&B2!22!Ķee !CöR2BĦĦBBæĥ!ēăăăÃÃ !-222e!Te !>öåĖ!ÆBBĆ22Ć !'ĥĥó!¨ !'ĶĶĶ!!!2u2!TRRR !:ąĶĖD B&RRB!!!å2Ħ !*Ķ!ĶfĶĶ!ĶU22B!!!RRRI !7ĶĶÖ!!öBB!d!!!t!Ėtńñ!!Ħö !&óĶfUf !,+ !8RaĆ!!BÚ¦s!!2õöåĖSS_åĥĥ!!Ķ!!!ó!!ē !,I !62ĖTscö!Ñ¨Ķ !'Dåcc!!!CĶ!222!!ó !.+ !4ôbµõpµbA¤!ÁĄ!!Ķ!!b÷ÇÇĦ!C! Ą&!222ă !LĄôĶĦ!ćĶBÅ!bńń !& Ą&!Ķ!!Ĥ!!!Ė !FĔĦ!ôĄĄ!!· !,ĄĄôô Ė&!Ė !E¦×!!!ç!ĖÕ !6Ė !DåĔń !=ĖĖ !G¤ĖÕ !aÕ !Ņ !Ņ !Ņ !Ņ !?",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !Ņ !é »&ËË ![»!!!2.Ģ¦ !Y»!2ă2!Ė!R× !ZăBóóĖĥRR !W»!2f!B!1!!b ![Ħôµ!3b !W»!!!ÓB!å3 !'Ë»»Ë»»»!!»» !K2!!!u3!V T&Ó22 !&»»!ăTTRRR!!!RuR !=»22!!¹ĆĶ#ħēBBB!!ÓÓó222!22Ħ!!!D$uRRĨĆD !5RTuħÇÇ!!!Ķ !&¹ĖĶ2 !.2!Ó!Ħ !)BB !7õrsĖö¦¦ĲĒĶ !'ĖĖĆ!!ĦĦ !MæĦøĦĦĆĦÆĒ¡Ó!!ÅÅÕĕ!Ħ !3B!!!BB !9¥´R2AĶĖRºĕ.¡ĆĦĖ!!2! B&!óÓÓÓ!¹ !&ĤĤĤ!!ĤĤĤ !7BĖRR!ć!!ĖRÆćCĥąs!!ĶĦvv f&¨¨¨ĶÓBBń !&Ė!!!Ė !8ĖøæĶB2!RĖÆb!¦$×· !(2 !(¹vvDD!!!uDĖĖ !8cBńBB¥ÆR×ģSÇcćB !(Ķ2Ķ !'2!ÓÓĦĤD!DĦ!R !8r÷öRsåÅĊ·B!!ç!Ķ !9ĤB !9ĖĖôAÅÅ!!ó!2Ħ!¤Ė !'2 !2Ĥ!DĤĤ !@Ĕ!!B!çB !(Ró2ó 2(Ķ!!Bń!!!Ĥ !FRåB2 !&22Bó! ó(ăóBń!!!Ė!!!Ė !@Ĕ!!Ķ!!!Ħ U&ôô Ĕ+!! Ė&!ĖĖĖ !HvĶòò_Ë !,ĔĔ !JĔ!B!!!āđ11Ė. !WĔ!Ķ!!ĸhtÇRR !XôĶĶ!!óç!!b !YĔĄôĔĔĔbb !Ņ !Ņ !Ņ !Ņ !ģ",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !Ņ !§¦Tç !`å¤c !'SSS !YC !&S !^u!»¦!!!ĕ !Zbuó!ÖÖÖ !Y2!ćrb!Ċúú !Kuć×3ù·×ħ×!!»ËËc!Ĥ¦RRñ!Ñ !MĖsôæö¤ö!» !&s¦Råå!2 !OöĨ !&ħĒĒĶĶĆ!Rõ$D!Ã !NRs¶RB#BĦRs22ĪUĖ!!!xÉËË» !' »& !Ad2RĤB!BcĖB2 Ķ&RCB!ó!!!2ËËË»»!!!2Ë !@s¦R!Æ¥cĶ!Rc!!a!úR!!!ó !'Ķ !(Ó4 !@sĖ!ĦBBssBC !(ĶĶ !'ĶĶ !'2!!BR !@ć·dCdCCC¹!!Ę!!Ħ !&òòò !'2!ÓÓ!!!R !(RR !8ssńńccc2!!Ķ!!¹ĶĶ!ĦssR !&2Ó!BBBR !(RR !6 ô( !&Ĵ!!2 !'2 !)22!!ă2!!Ĕ!Du!!4Ĩ !?Ą!4!!Ķ!2ăó !*2!!Ó!RB2R !&Ru !BĶ!Ó2!!Ķ!22!2ÅöcÆ2!ÓÓ!B!ĦBĔ!D!Ĥ!!cc !@ĔĶBÓ!!!f!!fU!s!ĦÓÓ!BR2äB!!!ĤĤ!!ĤĤĤ !AĔ!!2 !&UĶ!RcBB!BB!!Ą!ää !-D !?ĔBÓã22f!!!tB!tB!22Ą !&ĖĖ !+Ħ !@ĔBBÓ!!!ãã!St!!2ĄĄ !)Ė !*Ė !AĔ!BÓÓã!!¹ĴĔĔĔĄ !,Ė!!ĖĖ!!Ėń !BĔĔ B&ĴÁ !2ĖĖ!!ĖĖ !F Ĕ& !Ņ !Ņ !Ņ !Ņ !Ņ !¥",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !Ņ !E¦×ç !`å!c !bC !Ä2!u !bbu!!# !^ćb·çæ××× ![s¶¦Õ!!!tSc !Wb··s!!!µ !XcRRĤĤĤ !-»» !E¦ !+Ć!d÷$DWµµ !(»»!!» !?uć×3¦ö·ćÇ !&»»ĪĶÕĦõĦ!!!»!Rħ»» !'Ë !@Ė!Ĩ!ĦÖĶ!»TT!!0!çBC!B»»!26w !(2!Ë !>B!R@B2RĖçĢrf!!ĸ¨ĶtR!ã!!.B>N !&2!!!ă !*eu !4CRBRRĖĆBĶRB!2!Ķ!!ĶĶĶ!22!BRc!!!2ã!!ãĦe !=ss¥!!RBc!ĺĚ2Ķ!2!¨!!!vĶĶBB !&2!B2ã!B !)e !7CĖ!Æ¥c!2!2!2!ĶĶĶ¨vv!!2Ī!B!22!ã2ăBB!ĴeR !'B !6s!!ĦBBBc!!!Ķ!!22!2!!2!ēB!·!!ãB!2!!Ĵ!!!RR!§!!Ĥ !6ććdCddC2 !'ĶĶĶ!!2!ē!dd!ăăR2!!2Ĵ!TB!!4eĔBĔ !9sńńńcãã !)Ķ!!ē!ĶBB!22 !&Ĥ!T!!!T!B!Ĕ !5 ô(!!!ĄĤ!ã2! 2(ē!Ķ !,D!Ĕ!Ĕ!!BĔ !BĤĤÁ2 ã(ô! 2& !(ô!!!Ĕ!!ĔĔ !FÁ Ĥ(! ô-!ôD !(DĖ !Yô !'Dô!ĖĖĖ !ZDĖô !]Ė!Dô !`Ėô !Ņ !Ņ !Ņ !Ņ !Ņ !/",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !Ņ !ĩ×ç !*### !T¦!c !'»»·¶ĆŅ !Tå!C!!Ë»»!2sÀ !'»»» !N»Ī¹»»!!!2!BdB!!»»!!!Ëe !K» !'Ķ22ÓãAĚA»»!!2 !N»!! 2'ÓÓ2!!!Ë!!!2Ķ!!Ó!e !>uħ¦d¦S¦Çd !(Óãăã22¨¨ËË!!!2ă!22R!ĴR !>CRBRRĖĆB!»!!2ÓRB!!¨¨ãã!!!22ã2ēÓÓ!Ĵ !@ss¥!!RBcË!!2!2ĦĦĦ!ãã!! ã&ÓB2B!!Ĵ!!!R! R& !9CĖ!Æ¥c !'ÓB !& 2(BBR!!ĶRR !'R!!DDRR !7s··ĦBBBÓ22Ó2Ħ 2& !&222 !'22 !)D !&R !7ssB!B¦!!!RBB 2&B222!2!!22!222 !(D!!Ĥ !7 Ĥ'·CC!BãÓ!! 2'! 2&!!B22 !&T!!!DD !@Ĥ !'c22 !1 Ķ'DD !'Ĥ !>ńńĤĶ!Ķ !-222!ĶĶ !'Ķ!4!ĤĤĤ !9 Ė(!!!Ĥ !/ĶĶĶ!Ķ!! Ķ&Ąô!Ķ !FĤĦĶ !(Ķ !'Ķ!!ôô Ą&!!ĄĄ Ė' !BĤĦ Ķ(!ĖĖôôôĄäĄ !1ĖĖĖ !@ĤĄĄ Ħ'ĤĤ ![ Ĥ' !Ņ !Ņ !Ņ !Ņ !Ņ !Ņ !C",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !Ņ !Ņ !«»»»ËËË !Z»» !(Ë !W»» !+Ë× !T» !)ÓÓÓ!!s! Ë& »'ª !M222ãBBBÓÓêË!!ĶĶ !'2»u$$u!!$$u !>» !&ĶĶĶ¹vvv¹¨ĶĶĶ !(2!!2ĤRR! R& !>» !* Ķ' !' 2&!!22Ó!BB!!!BB !5TTuħÇÇ!!» !5 Ó&!óÓÓB!ĤĤĤ!!ĤĤĤ !6Ħt÷÷¦¦ !5ó !&2!!B !? B'ÆĶ !6BBRRă!B22 !&ĖĖ !7B Ĥ'rc!2! 21ă!22!!!22!! Ė&!!ĖĖĖ !;Ķ!!! Ķ( !(ĶĶĶf!ĶĖĖĶĖĖĶ2ĴRR!RRu !7Ĥ !'÷2 !+Ķ !1BB!D!!R!D!u !;÷Ć22 !.Ó!2 !-Ħ!!Ę$ !<D÷·Ć¤¤ !+2 !(222!!BB2B !'R!D !9ĖĖôA¤¤!!Á !)2!!!Ó!Ó !.ńĤ!BBĤ !BÁ 2(!!ÓóB!!ÓÓÓ !(22Ķ!!!ôô!ĤĤô !@Á!!!ÓóóóB! B(ñ 2& !&ĖĖĖ!!ĖĖĖ !Bó!!¹vĦ!22ĶBB,¤õĖ Ą* !JĔ ó&!ĦĖĶ!ĶĶąR !UĔĔ!!BBB2!!!ĬBA !VĔĔĔ !&ĄĄAA !ZĔĔĄĄ !Ņ !Ņ !Ņ !Ņ !Ĥ",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !Ņ !Ņ !ī Ë& !]ËË!!!óTT !YË!!!óó!!!ËË !VË!!ĶĶfv !ZËĶĶĶ!!!ĶfffĶĶ»»» Ë& !+$$T!$TR !=ËĶ!! 2& !+ăă!!Ë»»»ËË!RuRRBRR !>ËĶ!!2 Ķ&22!! 2'!!ă!!22!!!$Ę!BBĤ!BB !4 u(!!!Ķ!!!Ķ !&ĶĶ22 Ķ'!ff !&2 !&Ħ!!D!ĤĤ !:¦¦¦ !-ĶĶ !)ĶĶĶ!!ĶÃÃsRńĤ !?222!2 !2Ķ !'Ķ!!!Ĥń!!Ĥ!DD !:Õ222 !,2 !(2!!2!!ó!!RRD !&Ĥ !:ööĦBBB !+2Ķ!!!222óB!!22!!!BBĤ!!Ė!!ĤĤ !7öååBB!!2ó2!! 2&! 2&óóó2!óó!!!Ó2ĦĤ!!Ė!ĖĖ!!Ė !6ĥB!ĆĆĦĶ !'ĶĶ! ó(222 !&ó!!Ró!$D !'ĖĖ!Ė !4öĆĦĶĶBB!_!ă2!!!Ķf! B&2!!2 !&óv!!BB!Ė !<ĥ!ĶR!!c2bĔ!ă2!!!2!ĦĶĶ!!22!!B!!!ó!B!!ô !<ôA¤µbµ¤A¤!!Ą!ă2 !'Ķ!Ķ ô'! B'!!ô !IĄ!ăă2ó !,ôôô!!!ôô !KĄĄõÃ2!22!!ħħ !(ôôô !OAńĄ2!!!ĆCC ![ĄĄĄĆ!!!ćç !]ńńąą!B !_ b& !Ņ !Ņ !Ņ !Ņ !|",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !Ņ !Ņ !ÁTTuR !cR !_B!!!R !B Ë( !' »' Ë& !&TTBĤĤ !&TTT !3 u(!!!ËË! Ķ' »&Ë22 !&ĶĶĶ Ë& !*R!!B !8öSSS!!Ķ!!222 !)222ó2!!Ķ!Ķñ!B !)BBĤ !6ĥĥµBBB¡!!2!ĶĶĶ!222!!ó !'22!ó!!ńĤĤ !(ĤĤ !6ö¥¥!BBBÖ !/vóó!2 !(x4 !@ĥR!ĦĦĦRB!2! 2&!ó !&ó22ă!ó!!!f2!ĶD !'Ė !8ööæ!2ĦĶĆ!_! ó&ăē!óó!!!Ķ!!2!ó!2!!ó2!D!!ĖĖ!Ė !7ĥ!R2!RcĦ2!ó 2&!!BB!óó!Õ¤!Ķ2!ó!2ó22!ôĖĖ !;Ħ!Ėè!2ĶRÕ·B2 !&2!!B2!ÕĖĶ¤ !&óó22!ô !)Ė !9£R2s2ĖĔ!! 2&!Õö!2B!22B2! 2& !Aôbµå¤!ÅbÅ!!ôô!!Ç!bĦĥĦĦô!BBB!2 !&2!ô !+ĖĖ !8µ !)ôô0Ħ·BtB!×bæ!!ôô 2&!ô !Nt!ąrńĤń!!!bA!! ô' !Oõ!ĖDDD!!¦R× !YćÕÕö !`öÖåĖµ !]bćÕ¤!¦ !]ćô !&R!µ !Yô !&åµµ !½Ė !`ç !b¤Ań !Ņ !Ņ !Ņ !Ņ !D",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !Ņ !Ņ !ăeeR !I»»Ë !4R!!TRR !E»»!!ĶË !1eeTĴB!!!R !B»» !(Ë!!»» Ë'!!»»R !&ĔĔ !D»!!!2!!!Ķ!Ë»!2ĶĶĶ!Ķ»D!2xĴB !G» !&ó !.Ķ2!!2!ÓĸĔĔ !J2!22!2!!oă !)¨ !&4 !)R !>»!!22!vóó2!!Ģær !'Ķ!!ÓÓ !K2!óóē22ãă_!B!!2 !&2!!!2B2 !< u(!!!»!!!ó!B !'¦2!cóÓ22 !&22!2 !Aöödd¦ÓÓ2ó!!ĶĶ!!B!2!÷·!BÓÓ22!Ó2BR !'Ė !;bÅąBB!¤ĥÃ!!!Ķ !'2!bABBcBÓÓãRB2 !'Ė!Ė !9öR2BĦĦBBæĥ!!22!ĆĆ222 !(BRcR2 !'ĖĖ!!!Ė !7öåĖ!ÆBBĆ22Ć22!!!ĥĥĦ !, Ķ'!ôô !(ĖĖ !5ąĶĖD B&RRB22!å2Ħ!!!ĤBBc!ĶĶĶ!!!ĄĄĄô !@ĶĶÖ!!öBB!d!!!t!ĖtńĤ!ććć !&ĄĄĄ !ERaĆ!!B·¦s!!2õöåĖSS !'ĄĄĄ !G2ĖTscö!ô¨Ķ !'Dåccĸ ô& !HôbµõpµbA¤!Á!ĶĶĶ!!b÷ÇÇ !XĄĄ!ĶĦ!ćĶBBÅçç !WĄĔĦ!ôĄĄĄĖĖĖ· !W¦× !' Õ& !WåĔń !Ņ !Ņ !Ņ !Ņ !è",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !Ņ !î»»»ËË !Z»»»!!2ĒÒt ![ă22óBBö# !W»22!óēBħö!!# !WĶ!!BôôôAŅŅŅ !U»!!!Bô !-ËË»ËËT !*uu !C2ē!u !& ²&T»»ĶĶ!!ó!Tu$$uu!uöĦ !@»!!ÓĦ!!²uuTĬ!;Čv !&2 !)ö!uö !E¹!Ħ!Ĭ!Ħ!Ħü!ĦĶ !0Ĥ !>TuuÇÇoă!!v !+Ķ !'Ķ !'sRRĤ!!!B !:T!ĦĦ÷¥ĦŅł¡!!ÕbÕĕµ!!Ķ2ă2!!22Ķv!B!!BB!!RRĤ !?rĶc2Ħó!ÆćCQÕń!!B!óăģóēāóB! Ĥ&ĖĖńńĖ !ABĶ!BĖÆb!¦$!!ó!BBB!B!!ńĤ< Ė&!!ĖĖ !A2ĦR!!¥!ćsRõ!RRńĤĤĤ!!ôĖĖĖĊRRR !FBĶĦ!!!Ç!ödCT2!D!TTĤ!DRRR !&RR !@BBB÷BBc×!ĶĶ2PsP!!!2 !&ĤRĸ !FĔńĤĤöĦC÷×!!!ç!!ĤT !'ĶĶDTĤRD !FĖĖĖńbR!Ħ !-ĔT !&T !PĦ!!µĔ!!!Ķ!2 !'Ķ !(Ė !Hvv!!!Ĕ!__ĔĤ !*Ķ !(Ė !FĔ!!ĦĖ!_ĖÚÚĖĖ !-DĖĖ!!ĖĖ !Eó!¹2Ć!²uËç#AAĖĔ !)ô !KĔóÓv¹;ìU!ĖæBÅ!Ėôô!!!ôô !MĔ!óÓ!!!Ó6×¤ !'ôôô !PĴĔ!Ó¹!¹óĔ ![ĴĴÁÁÁĔ !Ņ !Ņ !Ņ !Ņ !ġ",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !Ņ !î»»»ËË !Z»»»!!2ĒÒt ![ă22óBBö# !W»22!óēBħö!!# !WĶ!!BôôôAŅŅŅ !U»!!!Bô !-ËË»ËËT !*uu !C2ē!u !& ²&T»»ĶĶ!!ó!Tu$$uu!uöĦ !@»!!ÓĦ!!²uuTĬ!;Čv !&2 !)ö!uö !E¹!Ħ!Ĭ!Ħ!Ħü!ĦĶ !0Ĥ !>TuuÇÇoă!!v !+Ķ !'Ķ !'sRRĤ!!!B !:T!ĦĦ÷¥ĦŅł¡!!ÕbÕĕµ!!Ķ2ă2!!22Ķv!B!!BB!!RRĤ !?rĶc2Ħó!ÆćCQÕń!!B!óăģóēāóB! Ĥ&ĖĖńńĖ !ABĶ!BĖÆb!¦$!!ó!BBB!B!!ńĤ< Ė&!!ĖĖ !A2ĦR!!¥!ćsRõ!RRńĤĤĤ!!ôĖĖĖĊRRR !FBĶĦ!!!Ç!ödCT2!D!TTĤ!DRRR !&RR !@BBB÷BBc×!ĶĶ2PsP!!!2 !&ĤRĸ !FĔńĤĤöĦC÷×!!!ç!!ĤT !'ĶĶDTĤRD !FĖĖĖńbR!Ħ !-ĔT !&T !PĦ!!µĔ!!!Ķ!2 !'Ķ !(Ė !Hvv!!!Ĕ!__ĔĤ !*Ķ !(Ė !FĔ!!ĦĖ!_ĖÚÚĖĖ !-DĖĖ!!ĖĖ !Eó!¹2Ć!²uËç#AAĖĔ !)ô !KĔóÓv¹;ìU!ĖæBÅ!Ėôô!!!ôô !MĔ!óÓ!!!Ó6×¤ !'ôôô !PĴĔ!Ó¹!¹óĔ ![ĴĴÁÁÁĔ !Ņ !Ņ !Ņ !Ņ !ġ",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !Ņ !Ft3t !_»BB¶ !^»!R¶ !^»!2Ī×b !X{ !(óB !6TR !Cî!!»2ăó!ô !1RRuu$Ė!R !FĶvBB !.»ËËRDĘö !I» !&ô !,»»2!ó !Nĩ2ē!u{!!! ²&»» !&v!!!RĤsR !E»!?ÓĦ!!su¾TĬ;Č+ !+sB!Ĥ !Hĩ¹iĦ!æyĀ8U!Ħ !(ó!D!!ĤĖĖń!Ė !<TuuÇÇÇćă!?E/Hy¥!!İ!!Ķ !'Ķvó!ĤĤĖ!!ĖĖ !<uB!Ĥ¥BöÖrNÓæ!Ġ[į[ĕµóĶ2ă22!22óB!DĖ !ECĆĦcĖĦą`ó¤ÆćCQÕńó¨!óóăēóB!!ô !EDR2¥ĦĶ!!!8sÆb!¦$!!ó!BBB!B!ôô !IĖRR!!ó`Ý!ć!Rõ!RRńĤĤĤ!!ô !IĖ2ĖĶĦ!!!EĀÇö!dtT2!D!TTĤ !JĤĥBBĆRcd!ģ!8iìsi!!!2 !&ĤuD !DôĤ!DĆĶÖ÷÷t2Bó(Á¥!Ĥİ !'ĶĶDTĤ R&! R& !=Ėôô¤µbń!BBy!<!ĀÎ: !&ĔT !&T!D!!R !&R !FæB!µĔ!Į!Ķ!2 !'Ķ !OĦĦİ!(Ĕ!__ĔĤ !*Ķ !MĔ!iĦĖŀ_ĖÚÚĖĖ !WBĀ¹2Ć !(ääĖĔ !,Ė!!!Ė !DĔBÓĦBČ !*Ėôô !&ĤĖĖĖ!ĖĖĖ !D{!Ĕ!B]BT !, ô&Ė !Kî!!BĦ;Ć !_ĔBÓ¹µËT !]ĔBóĖ>µ !^ĔĔÕ¤¤ !Ņ !Ņ !Ņ !Ņ !¥",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !¬t3t !^»·Ħöõ !_R¶ !a××× !_2 !a»!!B !]{ !a{î» !&ô!!!{ !Vî !,î !)RR$RR !F{!!!Z!!2óB!!!k !)»RDĘP!!RR !Dî!!kĎ !&Ħ!!!þk !&Ë»2 !*R !Fþ!»!!!B!u{!þ!²²ËĶ !Sę!ęvĦļ!su¾TĬ;Ķ !'sD !MOę?ĶHRyæyĀ8ĦĶ !&D!!Ĥ !&Ė !>RTuħÇÇ!k!»!O!ĩB!!¥ģv` !'Ķ!ĤĤ!!ĖĖĖ !@õrsĖö¦;¦ĒÓ²NlÐď|ß_ !'222Exx$Ė !DæĦRĦĦĶĦÆi!ĆĶ!æc¥!Ãóń2!!óóăēóĔ !F¥ĶR2Ć!ĖK!B!!CĵÕB!!!ãóóBBBôĔ !FBĖRR !&ĖÆė!!!¦$ !&RRńĤĤĤ !IĖĦæĶc!!RÆb·!!·ĖCR!TĤ2 T&R !GcBĖBBRÆR×ÚĪììì¼iìBi!TĔ !'uuD !Cr÷öRsåÅbúi!!Ł!ÖR<!Ĥİ !'ĶĶD2Ĥ R&! R& !:ĖĖôAÅÅ!!!ÑOU!!ģ¶Ā!Î: !,T!D!!R !&R !@k!!ęē!ëēð!!!Į!Ķ !)Ķ !Kþ!!İã!İ!(ĔĔ__ĔĤ!!Ĕ !'Ķ !MĔ!ĩĦĖŀĖĖ_ÚkĖ !TZ!!BĀ¹2!!{{!Î!äĖĖĔ !,Ė!!!Ė !AĎ !&Ó!!!î!¾ !'Ėôô !&ĤĖĖĖ!ĖĖĖ !D{Ĕ!B!<!!!Î !* ô&Ė !G{!!!î!BĦ!Ču !Wî !)Ħ !`ĔB!!Ħ !`BĦ !aÕÅÕ !_Ĕö2Ħ !`ÕĶBć !`µbb !Ņ !Ņ !Ņ !¡",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !įt3· !`BÖR !_·!!B !_R !bĚć×× !Zk !bþ!k!2 !`þ!!!B !_» !a{!ĶvĦ!!!k!!{ !Sk!!î !)þ!!î!!RR$RR !Lþ!!Z!2óB!k!!k!!»RDĘP!!RR !Jk!kĎ!!8Ħ!þ!kþ!»2 !*R !Iþ!þ!!ĉ`!!uu2!² !WħęOęvĦļ!BTĬ !&sD !QÚOę?ĹHRyĀ8E!!D!!Ĥ !&Ė !GTħÇuu!!O!ĦB!!vİ!!ĶUĤĤ!!ĖĖĖ !GçŅ¶ö1b!Ó²²ðKK[!!!22Ķxx$Ė !J¶sĆ2ĶR!iĆCµĖ!!Ã!!!óăóē !L¥ĶRĖ!!!ß!bÖĖB!!!āãĶ!B!B !KĖRR!!ú!!Bæc¥!C!!!RRńĤĤô !KĖĦæR!²²ÆBCĵÕBsR!!22TTTR !' R& !BÖöcĶ2æÆBC!¦$CyBiTĔ!!!Ĕ!uDRRR !&R !A¤ŅÖsķėR2ĥ!9¼ì!Ĥİ!!ĖĶĶD!ĤR !JĖAÅôôsRCìĖ!!ð: !&Ħ!ĦT!!D !Mk!Í¹ĖĖð!2Į !'Ħ!ĶT !*Ė !Fþ¬İãŃİ!öĔ_Ĕ !(ĦĶ !(ĖĖ !Fk!þĦiãĶ!îĖÚk!!ńB !+Ė !HþZ!BĀ¹2ļ!!{ÎäĖĖ!B !)Ė !JĎ!!!Ó!,!!B !&ôô!B!!ĤĖĖ !L{ĦBB]ô!!Î !(ĔôôôĖ !MkîBĦ!Ču ![þ!Ĕ!Ħ !_k!B!!Ħ !]þ!!BĦ !ÄÕÅÕ !_Ĕ¶2Ħ !`cĦĦ !`Bcc !`µbb !Ņ !Ņ !Ğ",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ķt3·ć !^·BÖsb !^æRBb !^ç¥ !aĚćĪ× !`vó !]k!Ë2óBô ![þ!!!B !f$RRR !V{»Ķ!Ħ!!$P!!!RR !Tî !/R !SZ!2óBĦk !Xk!kĎ!!8ĦBþsD !Vþ!þ!!ĉ`!!²E !(Ė !SħęOęvĦ;!!D!!!Ė !P{!*{½OęĦĹ8Ķ!UĤ !Tîħ¿ö?!ĶBĦİ!2!h$$$ !QÇIöÏÓ²ïðl !W*!!+)RXĆCµB!!!óă!BĔ !Oľ!Ö![!ï!bÖ!!āãĶ!B!î¾{ !PI!ú!ĦæcĦ!!RRńĤĤ!Rî!!RRR !J¶ğĦ²!!CĵÕ!!22TTTÎ{!RR!!!R !JcĦæ!Ħĥ¦$iTĔ!!ĶĔ!!R !OÅÖsėĆBC9¼İ!!Ė !&u !P*AÅôĆ2ĥĖ!!!$!Ķ!!!Ĥ !(Ė !Iľ!!kÆRCĖð !)DD !'Ė !Mþ¬·2OĦĔ!!!ĦĦT!!D!!!Ė !Mk*þĦiãĶk!ń!!!Ķ2 !&Ė !NþR!BĀ¹2ĠäDB!!ĦĶ !TĎ!!!Ó!!!ô !*Ė !Q{ĦBB]!!!ôB !'Ė !RîĴĦ!Č !&ô!B!!ô !VĦ !(Ĕôôô !Tk!B!!Ħ !]þ!ĔB!ĦT !ÃÕÅÕ !_ĔæÆĦ !`å¥ĦÇ !`Õccć !`bbb !Ņ !Ņ !Ė",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Łt3· !_·BÖs !_æRBb !_¥ !bćĚ× !`v !a»!2 !ÄēÃöRR !^y!P!!R !Z»!!P !&R !YģU} !`U!sD !^»ĶæU !_ĩÑ`Ķ!D !]Ķ§!!UĤ!!!Ė !W»Ķ!!!Ķhx$$ !WħÓï!!!22 !ZIXC!!!óññńń !W+ïb!!ó !'R !XæĶñ0 !]I!C2$xń$ !Zğ!ĥĖv!$B$$D !WcĆCvĶ!!!BńĤĖ !VÖĆĥ!!ñ!!Ĥ !YAÆC!!TńĤ !Zk¬2!!Ė !&Ė !Wþþi!!vT !^Ā!!!ĶD !]Ĵ!2!!!D¾ ![Á!óĦĦ !_ēB!!y !^ĆU!B!Ė !]B!!ĦĖ !^ĔóvĦĀ !`ó!!Î !_ÕÅÕ !_ĔæÆĦ !`å¥Ħ !aÕcć !abb !Ņ !Ņ !ċ",
);
// }
// Mutant (Attack) {
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !Ņ !I¦ #' !]Fæ¥!¶s !ZË»ĶĚ6¶!B !7uu !BË !&26ćÕ !6uöĦ !AËĶĶă!2óÁĔ !3$$uuö !GăóĔ !/»»$Tu$!!!Ĥ !CËĶ !&Ĕ !.»»!2É !&R !&B !@Ķ !&Ĕ !*²TT»» !'v !&Ĥ!RRĤ !?Ë!22ă!TT!!!²²²RČvf !+sPń!DńńĖ !?Ķ!ĶÓvĦ!]²uTĬ;;xĦ !'2!!!ó!Ĥ!!DôĖĖ !?Ë!!!¹!¹ĦČČĦvĦ!ĶĶĶ !&2ó!ĶóBĤ!DĖô !:uTuħÇÇ !(Ķ !(óv!2!2ó222!văăB!DĖô !=BöĆöĖS¦ĢNÓ2 !*ó!!2B! ó&ēB]!ôô !AæĦøĦĦĦæąó2!!!bbbµ !' B&ń!ôÚô !D¥äR2ĆĶ!ĦÓ¡.ĕÖRRcń!!!ń Ĥ&Ėô !FBĖcR !&ccÆćCQÕB!!óóó!!!DĖ !IĖ¸æĶc2!ĦĆÆb!¦$dCD!!v$$$ĖTTT !DĤ!cBńBBcÆ·!!ĘĺRćBss!!!ó!Ķ v&ĶË !BĤ!scsRĕå&·!!!Ę!ĦĦ !)B¨Ķ!Ķ!¨Ķ²D² !?ĖĖôAÅÅ!!!vĦĦ!PĶ!Ħ !&B !)ĶĶ!;¨üuu !EÁ!¹¹¹Ĉã!B !'ĶĶ !*ĶĶ¨!öRu!!RR !CĶăBB]<<ĤĤ!RR!ē2 !(2!!!ĘĤRRĘĘR !AĶ!ĶB]!!ÚĖD !'ē222 !(RR!!D!!D !?Á!!!vEĬČÚ!! ô(!ēēē22!!ă!BB!!!R !E2ăĦĔ !+ôôôĦēē2ē2ĤĤĤ!!Ĥ!R !AÁ22Ķf!T !.ĔôôÁ !*B !DĶ!!vvT !1ôô Ė(ôB !BÁ!!ĲĢÂĕ#· !8ôô !BÑ2Fc¥¥ !^ÁÁĪF2æR !^ÁÁÕ¤¤ !Ņ !Ņ !Ņ !Ņ !>",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !Ņ !Ĉuu !_$$öĦ !* #(ttt »& !E$$$TR !. s'öB!H22! »' !;»»$T$!!!B !.Ņ õ'¶!BÝóó2!22ă2»» !6»»»!2É !&R!ń!!B !0ÕÕ6!!!óăóóB!!!»» !-Ë!! »&!!!2!!!s!!!Ĥ!RRĤ !2ÁĔĔvv!!BĦĶ2!!!»»T !(»»!4» !.sPń!DńĔĖ !5ÁÁĔvU!ăó22!!!vTË»»»Ë !,2 !(Ĥ!!ĖôĖ !:ÁÁvvvóó22!Ķvó22!Ķ22 !)2ó!ĶĶóBĤ!ĖĖ !9uTuħÇÇÁ!!!v!Ķ2!Äf!!2!Ķ!!!ã!222!văăăB!ĖĖ !<ĖrsĖö¦Ģ>õ!ÃÔaÔõ<a!!22!!!Bă ó&ēBB]ôô !?æĦøĦĦĦææ¡RÒcoÃºĵaĲ>ó!!¹! B&ńôôôÚ !B¥äR2ĆĶ!Ħ!!ÒóēõãĒRcń!!óńĤĤĤôĖ !EBĖcR!!!B!æ5æ!'ÃfE3!!óēB!!!D !HĖ¸æĶc2!!¥ĳ¥!ŁēŃģsCD!ĦĦ$$$ĖTTT !DcBńBBcÆcB!!ºvü)EVss !'Ķ v&ĶË !AĤP÷öRsåÅ·tê!ºĆctÒ3³Ĥ!!B!!B¨Ķ!Ķ!¨Ķ»²D !>ĖĖôAÅÅ!!ĔĔóĦOĈļ!çĒ !&ĦB !(ĶĶ!!+¨Duu !FBx!Ķ1ĨéD!Ĥ!BĦĶ !,ĶB!öRu!RR !@Ĕ!!Ķ2BB]Ć_!Ĥ!BR!ē2 !(22!!!ĘĤuĘĘ$R !BĶvv!}ÚĖD !'ē222 !)RR !'D !?Ĕóă!ĶĶ;;!! ô(!ēēē22!Ķ!!!BB!ĤsR !BĔ!2!!Ķ!T !) ô&ēēă2Ķ2ĤĤĤ !&R !BĔ!2!2óvËË !+ôôĔóģ!!!DĖ!ĤB !DÁó2!!ĶĶ!»ËË !+ĔôôĖĖô!ĖĖôB !DĔóóv22Ķ!!! #'Ç !/ôô !DĔĔóóóă2!!¥¶¥¥¥ĦÇ !T Ĕ&óóó2RcåååÅ !XĔĔĔÕ¤¤ !Ņ !Ņ !Ņ !Ņ !8",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !Ņ !I¦ #' !]Fæ¥!¶s !ZË»ĶĚ6¶!B !7uu !BË !&26ćÕ !6uöĦ !AËĶĶă!2óÁĔ !3$$uuö !GăóĔ !/»»$Tu$!!!Ĥ !CËĶ !&Ĕ !.»»!2É !&R !&B !@Ķ !&Ĕ !*²TT»» !'v !&Ĥ!RRĤ !?Ë!22ă!TT!!!²²²RČvf !+sPń!DńńĖ !?Ķ!ĶÓvĦ!]²uTĬ;;xĦ !'2!!!ó!Ĥ!!DôĖĖ !?Ë!!!¹!¹ĦČČĦvĦ!ĶĶĶ !&2ó!ĶóBĤ!DĖô !:uTuħÇÇ !(Ķ !(óv!2!2ó222!văăB!DĖô !=BöĆöĖS¦ĢNÓ2 !*ó!!2B! ó&ēB]!ôô !AæĦøĦĦĦæąó2!!!bbbµ !' B&ń!ôÚô !D¥äR2ĆĶ!ĦÓ¡.ĕÖRRcń!!!ń Ĥ&Ėô !FBĖcR !&ccÆćCQÕB!!óóó!!!DĖ !IĖ¸æĶc2!ĦĆÆb!¦$dCD!!v$$$ĖTTT !DĤ!cBńBBcÆ·!!ĘĺRćBss!!!ó!Ķ v&ĶË !BĤ!scsRĕå&·!!!Ę!ĦĦ !)B¨Ķ!Ķ!¨Ķ²D² !?ĖĖôAÅÅ!!!vĦĦ!PĶ!Ħ !&B !)ĶĶ!;¨üuu !EÁ!¹¹¹Ĉã!B !'ĶĶ !*ĶĶ¨!öRu!!RR !CĶăBB]<<ĤĤ!RR!ē2 !(2!!!ĘĤRRĘĘR !AĶ!ĶB]!!ÚĖD !'ē222 !(RR!!D!!D !?Á!!!vEĬČÚ!! ô(!ēēē22!!ă!BB!!!R !E2ăĦĔ !+ôôôĦēē2ē2ĤĤĤ!!Ĥ!R !AÁ22Ķf!T !.ĔôôÁ !*B !DĶ!!vvT !1ôô Ė(ôB !BÁ!!ĲĢÂĕ#· !8ôô !BÑ2Fc¥¥ !^ÁÁĪF2æR !^ÁÁÕ¤¤ !Ņ !Ņ !Ņ !Ņ !>",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !Ņ !ð »& #(Ç !/uu !E»»» !'¥¶¥¥¥ĦÇ !,uuöĦ !C»»!ă22ăăă¶2RcåååÅ !($$$uöö !C»»!22!óó!!ĔÕÕ¤¤ !'»$Tu$ !&P !C»!!2!ó!!ĔĔĔ !)»»»2É !'R !&B !?»!!2óó!ĔĔ !'²TT»» !'v !'Ĥ!RRĤ !@22ó]]]!!!²²²RČvf !+ssPń!DńńĖ !>»!ĶÓvìČ!²uTĬ;;xĦ !'2!!!ó!!Ĥ!!ĖôĖĖ !B¹!¹fČČĦvĦ!ĶĶĶ !&2ó!ĶóBĤĤ!ĖĖ !9uTuħÇÇ!!!T22!!ĶÄ!vv!óv!2!2ó222!văăB!DĖĖ !<ĖrsĖö¦¦çõ!ÃÔaÔõ<a!!!ó!!2B! ó&ēB]!!ô !?æĦøĦĦĦææ¡RÒcoÃºĵabµ !' B&ń!ôÚôô !A¥äR2ĆĶ!Ħ!!ÒóēõãĒRcń!!!ńĤĤĤôĖô !DBĖcR!!!B!æ5æ!'ÃfE§!!óóó!!!Ė !HĖ¸æĶc2!!¥ĳ¥!ŁēŃģŅCD!!!$$$TTT !EcBńBBcÆc·!!ºvü)EVss!!!BĶvfvvĶDDË !@ĤP÷öRsåÅ·tv!ºĆctÒ3³!!!v!!¨Ķ!ĶĶ¨¨¨ĶDD !>ĖĖôAÅÅ!»fv!ĦOĈļ!çĒ!!!UēBU !'ĶĶĶ!vvuu !B»!!ĶĶ!hóóQ$éD!!ē !.22!ö$Ru !=»»!!!2ãBă!!BB]<<ĤĤ!!ē!2 !.ĘĤu$$$R !6»»22!22ÓB!BBB!ôÚÚÚĖD!!!ēē222 !)sRR !'D !3»»»!!!ó2ÓÓBBB!!ôô !' ô'!ēēē 2&Ķ!Ķ!BB!ĤsR !) #*·»»»!!!22Ó!óBcB ô& !.ôôôĦ ē&2ē2ĤĤĤ!!Ĥ!R !(Ņ! c&¥!! 2'ãÓóBBBĔôô !5Ĕ ô&ē!Ĥ!Ė !&B !*Ņ ą&2æR ó'BBĔĔôô !=ôôĖĖ! Ė&ôB !.Õ¤¤ Ĕ) !Kôô !Ņ !Ņ !Ņ !Ņ !Ċ",
);
// }
enemyFrameOffsets.push(rawImages.length);
// Dog (Main + Death) {
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !Ņ !Ņ !Ņ !º ġ&ŁŁ. !)āġć !BÑćć !&ġġġ!!ġġġ Ħ&ĆĆĥı..Łıġġ!!Bć !AsĐĐćć$ñĖĖ!ġġĦĦĦĶĶĖĖĖ!ĖĶåądtSStS !CGssddąX!ĖĬĬöĖĖĖĦĦ!X!ĖBĖ!ĦµĦRRĺě !DGGğRB·ĖÍdd½RRR!8!ĦX!ĬRR!8ĕĖĊ!!C !GCÕĝĥ!µąHH(8B8,ĦX·d(XL !KG!RC!r!sd!!!BĦ,ļ!RĦ8^!!Cĺ !V,8!B!!!8±¦ĺ !&R !Eġ!Ėĥ!÷!Ćą !&ļİ !',Ķbāā !Kĥ·[tR÷d!!!ĦBļ!!ĠBÿõr !)B !BÑÑIĖĦÕBÏÕÕÿĠĠŀ<Ħ,BĦĦïææ!sBB !FÑ!sąądĦsc]]BBB!(B!ŀ<2!!!s¦¦¦_ġM !CssĬbbńbCCC'GBBBŀŀ2!Bc!s¶t Ė& !EGGb !&ĪĪĪ!!''G B&dCdS3Ě ĺ&2ĵ !R G&ĪĪĪĺĺ !'7Ĭ !Ņ !ÇĖ !ÄĦ !cĥ !ab!Ħ !Åb !aĦ !ąb !Ņ !Ĉ",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !Ņ !ðRRT !bĖć !^$$Ę!ĦT ![T!Ėą!Ħ!ħ !YT!!ĥŀąc!! ħ( !QÑÑ!!ĥĐ(öĦĖ!!! Ħ&ħħđđđ !KÑ8X!õrĦBRĦ !&B!BBĦð8!dN !)ć !B8!!!ĦĘ!Cácğŀ!ĦĦ!ĠĦ!X!¦B !K¤¤b!Đå!ÏĦ!!!Ġ!ŀŀ(!B!!(ĚĚ !(ć !DÑÑÕ2İ!!ë<ööĖĐĖ(!!2BCĦT !KÑ8X!H!!!Đö !&8!Ħ!Ė22 !+±B !B8!b]!B2 !)BĦİĐĦĖBBďÑÑđ!!!N !D¤¤!']sB !(8!İ!!İĦŀďÖ !O''c¶¶RXX!BĦ !&Lĕæ!c!B!!N!!C !H'''h·dXĐİ !&ĆÖĶc·cCNN!!( !MĔRtX!!!¥!!¥c·Õ!B!!!Û !OĶĶR!!!Ė¥Ç9jļ¦¦!!!Ě !S«!X(ĖÛą !'ĚĚ !UX!!ÇáÁ2!ĚĚĚ!!!L| !QĖĦĐĦËËË< !(ıæ !P2öĐİ!İĐĐĦËõħħħćÑæ !P2¿İ !(İĦĆ!ĆĆĐ!!R¥ !Nß!R !)İİĆİİRss(j !P(¶R!!!RRR!İRsctG !QXÑSc¶ssBBcssBB'Ě !PT!!!Ě'' B&'BBB' !RĠBÑú!!! '&!''' !RT2C !b2 !aB2ú !3Ė !N( !3Ħ!ĥ !KĔļĔ !4ĥ !MĔ !4¤!A !aĦ !bĦ !Å¤ !Ņ !Ņ!!!",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !¯RR$ !bĥ$ !_$$Ħ !_TĖÕ!ĥ$ !_Đ, !^TĖą!Ħ !]TĖPĐ !`ą·!!!ðĵ$ !VÑÑT!!İ!!ļ!Ėĵ$$$ !RÑy½!Ė !&İX,Ėĥĵ!$$$ !O»AÏ|!BX8!!ĐĆĦĦĖąĥĵ!$ !OÑ !,İĐĦĦĦĖĥĵđı !My½½ń,,, !(İİĐĦĦĶ·Sı !LAńń !&B !+ĦĦČBS>Ññı !&ç !G7 B& !(8BB!ĥ!BÕ !(ç !I7WBBc!!!88BĐĐĐĦĶõĦ !R7WBXXXBBĦ!!!Đ!ö!çBd!!çB !M9dB!!Ħİ !&¤Ķ2ąB!!!B !P2BĐİ!!X !&×dd2 !Qń!328!!!±!!2ç222 !&BB !Pc!!!åç!×ĚĊ!!Ċ!!B !U2ĖÛçĜ!!ĊĊ !&C !S2!!!ċ !joC !T222 !*o!!R !M$ !)R!!! o' !WBB!!!m !)R| !Ry88!!~ !(úú|c !QĦĦĦ!(d !(ú!Ñ !QĵĖĦĐĐĆĦĥü!!!úú!Ñ!c !PĶĐİ!!İĦĆĥüúú!!ç!cY¬B !Mąð !'İ!Ħ!$ħççİ !QğĦ !)İĦą!Ć!İ!¥W !OGİ !*İĦąİİ!c !Rc !+İĐ!!cB7 !Q2 !)BB!!!cB7!!ĥĖ !NGc!X B&cxcccB7 !'Ħ !NR!ŀ c&7!WWW7 !&Ħĥ !O3R¦ 7& !,Ħ !P2 !s¤!Ħ !M>ĕB !sĦ !Pt !3¤ !Nd&Ī !1Ħ !M>6 !a6!&Ė !2¤ !LR !eĖ !ÄĖ !`ĖĖ !Û",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !ĮRTT !aĖÕ$ !^T×Ïŀ!$ ![TõĐ!!ĥ ![Tõr !aĦ~!!(ðą ć&ççÑÑć!!!ÑÑÑ !HÑÑÑÕ·X!!ĐX Đ&Ħİİ!!Đć!Ñ!!¶Ñ !GXXX !(Đ !&B !'ĐÑ!!¶Ös!!çç !Cbb!!ÕL!R!R!!!XĐ !&c!!!¶ĦsS !&ç !Db·!!R!RĖ!XyB«y8!!B!!¶!GS !&B !FÕ· !&R¥dCC32cX!æ¥¥Ĭ'!ĺĺ!!BBB !Dđ !)jB2!!32!!8ĜĜĦ !*dñ !BÑ!·õĖ!R!!!222!!!B!İĐĐĐç !)Ï !BÑcļÕtRR !*ĵĶð !'İçħ!!!ĐðB¦ !AXļbbĔ77!RR !'Ķð !)İCçÑÑ!c¦ !Bbb !'777Ĕ!!!ĵĦ !+Ïİ!BcdHH !LĔ2!ĖĐ !' B(ccdļ !OĔĕĐ!!!BBs¦¦¦cccB7Û !TBRBRSīīī!!77!!!İ !S22!ĵd!!77!!!¦ !RR!!RBS3İ33 $'!< !PA2!!))22Ĭ !(<<Ĭ8 !Qc·!<!!<<L]!!< !&Ė !P2!< !'ĶĦ<<!ĪĪ !Q>22 !' Ī&!!Ī !T2C! Ī& !&ĪĪ!!!ĥ !QSRĪ !qĖĥ !M²BB !1Ħ !RĊ !1ĥ !NĊR2 !1Ħ !NR!!ú !1¤Ħ !OĊ !bĖ !3Ħ !b¤Ħ !LĖĖ !ÙĦ !b¤ !Ņ !Ņ !e",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !Ņ !Ņ !Ņ !þ Ñ)!!!ÑÑ !E Ñ& !)ħħħćÑÑ !)ÑÑÑRRç !DX!!!Ñć Ñ&RÑr!Đ !*cc¥yc· !EbXX !(X!!.rX!!!c ¥&YY9nS!B !EbbXíĐ!BXB!Ė!!!X!c!ļļ9YRńńûĜ( !H·!XB!!2!!ĶđĠĠ2!!!22!Ĕ!!CR!B !GĔ !(ĘĺĦC¥BBļH2 ![Ķ!BB!!3dB2 !NT !'Ķ!ĨF!3S!!ĖĵĖĖĶ !Nß|!!!İĦ2!Ĩě !'Ķĵ!Ķ !LÑÑĆ!Đ8BB!!222Åĕ!!,İöåÕçć !IÑ!!XXX]RR]2223!Ħ!<!!,,,]!ć!ĖŀC !EXX!bb '&Ĥ!!RsB !&222B]],, !F»bbb !)ĔĔĔGBBBRRccc33322 !U''333CSSBĺĺĬ2 !WĺĺĺĪĚĚĚ!!!((!ç !^ĥ !ÅĦĖ !aĦĥĖ !`¤Ćĥ!c !`Ħ !a¤ĦĥĦ !Ã¤Ħ !bĦĦ !b¤ !a¤ !Ņ !Ņ !f",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !±RR !ÅDR !bD !`Ė!Ħ$ !ÃĤĖ<$ !_Ė !cRĥ !aĖĦ<$ !ÂńĶĥ! Ñ& !&ÑÑÑ !TĆĦĵ !& Ñ&BBBÑÑÑ !T B&!!!¥XXX¥¥cđđç !OĶĶ822RB¥¥ļ2CCļļ8ļ !OÑ !&(!28ļļ23ńńAAAB8B !OĖĠ<ŀRļB2C3ń !Tħ!2!!ĦBĶttdRïññđ!!!AĦ !NX!2Ķ!ĦĦ ¯&ĦĦĦĆÑ!!!dB !L2!!!2!!!BB!! R'ā!ć !N3BH2 !(Bs R(āŀ!C !M2BH!!! R&!!99CCCR!ÿ !N3S2H!R !'C,!ĺĺĺCR!ÿ !Kħ!!!St¬9!!!CC!ļń!!!ĺCR !Iġġġ !(2B999ļHiįı !&Û!R !AÑÑ!!!ġġĦööĦĵ!!!Ķ!2Bį !&SS !&BCC !ARRÑÑġĦöĖ!!ĐĶ !'ÿďd,,!!88 !'Hļ !Ah(XyöĖ !(ĵ !(ĦĥĥĠĀ!Ĕ !&B !DbdCX !&22ĀĖĥ!!ÿ!!ĥ!!ĥĥĠ...!ç !Fń!!!22B222ŀĶïï !*ĥ!ąą.!C !GĐ222 B&2İ8 !(9 !&dB!B !FÑÏ!iBB !(İY9!!99ń77CĥĥC !GÑ!X½!!! B),!99!ń!!!ĺCC!!B !DÑRXd!CBB!999!CC!Lńńń !' ĺ& !E»Hds!į!!9į!!9ĺĺĺĚ !RAńĦ!h!!!9Rńń !XĔńĘ!9!R !^ń9!!BĔ !7ĥ !GPR !7Ħ !Kńsô !_ĖĖô !6ĦĥĖ !`¤Ħ !dĦ !`Ħ !b¤ąĦ !ÄĦ¤ !a¤ !Ņ !È",
);
rawImages.push(
  "#c Ņc !ïRR !cR !a__ !aĦĦo !_Ė!!Ħ !aĦĕŁ !_ú !dĖČġ !_ąļ, !bĶĶ !_7<Ė !ÄĦ!Ķ !bĖā !aXĖñññ!!ññÑ !UāĖ!ŀ!ĦĦĦññĦĦ!ÑÑ !VĖ !&ĦĦ !'ÑÑ !]X8 !&ÑÑ !N$Ė !+BRcyX8c!!Ñ !NX !*Bļ3!Abc8Xc!Ñ !MdX !'BBļc!A!!AAb!c !O¦«X8BB!ļcCĿŁŁ !&W!c !NĶSRB88XcS2CC3ŁŁ!!!Ĝ !P2S¦RdCCBBĬĬļC3Ł!!!Y !OĶ2!!ąÿğĦ !&ĬļCŁ!B !SĖĐ!!Ķ!ńń!!!Ĭ)$ !Nń !+ĵĶT!ńńń !&R !WĶ !'ńń !YĶĶ!!!TT!!!B !RĦĐ !,T!ń !Sĥ!!!2,ĵ!!T !WĶĦ!!RĆĆŀŀT !T$!!!ĕĐ!!ĜĦĦæÅŀ||ÿĔ!!C !Lā!22ĕĶX!!Đ!!!Ħąç !Qā!ÏĕąĶ!BX !&¥!æ¤ !OāāĖĖ! ð&!!R!RXd¥BBB !MāĖĖ !)ĠBHX(RļdÇcc !&R !GāĖ !*R!Ġ!<B!2ļĜddd !JTĖBB !(R!!!ŀĬ23ĶĶńĚĚĚ !Hćñ¿BX8c!!!RR!2B((R32ĶĴ !KÑĐ!XX !)B(8(R23!ĴĴ !L»sRttĦİĆ!!XBĬB22332ń !-Ė !BÑĖĖ!!B!BBX<ĬRC33ńńĴ !O»xxĔ!Cļ !&d3ńńń !XÕB2LIsń !YĔR$82 !_Ĕ!C !9ĥ !HĔ!89s !_Rt!Ħô !4Ė !Jńń!B !asô !5ĥĦ !IĖĖô !ÚĦĦ !ÄĦ !c¤ !a¤ !ć",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !OR !aR_R !ÄĖ.R !`ĦĦ. !_Ė!õĦ !bĕŁ !_ĪBĦ!!!đđđ!!!đđ !VĶ!ıđĆĆĆđıđĆĆđđđŁ !QĦĶ!æĆ!!!ĆæĆ!!ĆĆĆÖŁ !Q2Ö !+y R&Ö !PY !,yCccc!Rç !N$!zR !'RRyCń'''c !RĶzXRRRyHjCń !'Bcç !P2R(HH<<Ŀ!$$$!!'G !TRĦŀÖÖĆĿ!!!$$!ç !RĶ!Đŀ!!!ĖĆĿLLĿ!$BCc !OĵĥĖĖĖĦ!22ĖĖ!¤ÖĿ !&ç !Mĵ!Ėŀ!!Ė!Bļ!Ćåç!Ħ!B !OĵĖà !'2!s(!Ć¤2!ń!!C !I Ñ&àĐ!ŀ(R2RBXts2RRB!!!R !HÑÑ !)Ķ!(B((3Ķt¬ !'C!!B !AÑÑÑ!Ñ !' B&!İ!(!B22Ķ!tcRG !F»R!ÑXXXBBB !&BBL!!2!ĶĦ,ĵĶ7 !HhRRBBİ!! B'!2!LB3!Ħ,ĵĶ7 !Jh(C!ļ!!!ļ2BBB(ļļ2!ŀ,ĵ'7 !&ĥ !EćÑ!R!ÕBcYn2ĜĜļ!!23,ĵĥ' !KÑŀRŀ!CĘ!9ąÛ(BB!22,įĥĶ7 !L»hhhĔRĥ!ĿdĦC<<<,,ĦĶ77 !*Ħ !IĔtBĶµBB ''GG !-Ė !IĔj2¶Ħ !4Ħ !L)Cc !5ĥ !JńP!BĔ !3¤ !KĘ!RA !_ńĖĔ !6Ħ !cĥĦ !`Ħ !Å¤Ħ !ÅĦ¤ !a¤ !Ņ !Ņ !f",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !Ņ !Ņ !Ņ !¹ ġ( !NÑć !&ġġġ!!!ġġĦĖĆĆææ Á'Ñđāġ !EsĐćć$ñĖĖ!ġġġĦĖĦĦĶĶ22!ĶĶĶ!!d !GGsddąX!ĖĬĬööĖĦĶ!!Xss¥ccc2B!tS !FGğRB·XÍdd!!RR!8!ĦĬ!ĬRRXcBRRļć !HtĦ!!µąXX((8B8,ĦĬdd(AWWĊĊ!Bć !EG!!ńr!sdBB!!BĦ,ļ!BĵĬ^ !*ć !Q,8!B!!!8 !(CB !Eġ!!$÷!Ćą !'ļİ !', !(RCBć !EõBtR÷d !&ĦBļ!!İ3įõ_Ñā.!ĥ!!C !CÑIĖĦÕ¿ÏÕąĠĠŀŀ<Ħ,BĦĦÏæÖbĶĆ!ġM!R !CÑsąądĦsc]]BBB!(B!ĐİĦĶĦĶ!Ķ !&Ė!!B !BĬbbńbCCC'GGBBŀŀ2RBBRcB2BB!2ĵ!!R !B»b !&ĪĪĪ!!!'G B&s¦·x»»»ªĺ7Ĭĥ !R G&'ĺĪ !+Ė !ÃĦ !dĥ !`b !cĦ !bb!Ė !ÄĦ !cĥ !ab!Ħ !aĦ !cb !Äb !Ņ !Ņ !f",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !ļāġ !QRRT !-āBB !SĖć !+āBBCŁ !P$Ę!ĦR !+BCµö !*ç !F$!ą!Ħ$ħ !*Cµ !PT!ĖŀąB!Cħħć !&Bõ!!s !+ç !CÑ!!Ŀ!ö !(ćć!!!Ć!B !*çB !CÑX!ĥWĖRĦİ !'Ħćć(!Bs' !OĦĘ!¦āëğ !&BĦ !&ĆŁ !*B !C»b!Đå!ÏĦ!!ððĖĦ!B!Ħ !QÑÕ2İ!!ë<Ć!!ŀ!ĦĦĐĐ !.C !CÑX!H!!!ĐĆ!!!(!B!!!2 !,B!B !Cb]!R222!!222BĐİ22!!c' !L»!']ccBB 2& !(2sY !P''BccR8!!BĦ!!!B8) !S'''G·¬i!İ!2B !&ġ !)B !MĔBCB822 !'Iġ !UĖĶSc !'2!!B !Uń!B2!!!tR!!2)Ł !'C !SļĬÛC2!2 !'>>!R !Q(İİ!õąĶ22)ŁŁŁ !&B !NĦĖİ!!İĐĦąĶBRII9Ĭ !Q2ĥĐ !'ĐĦąń!22BR !QďĖ!!! 2&Đ!÷ Ĕ'ĪR!C !NİRRR !'Ć !YHBBRRB!2İ !X2ĠIB R&B2Ćħćć!!.Ġ !Qcń'CCSRcc<ĀĠĦććĕĕ !P2C!!ĪĪĪ'' B&<ŀŀ !Q2R !*'BccBBB !Q2CR !*''' G&I !NR3!Ī !`2B !2ĥ !OB2Ė !1ĦĖ !NĺĪ !4ĥ !LĖ!Ė !aĖ !3Ħ!Ħ !aĥ !Ä¤Ħ !cĦ !aĦ !c¤ !Ä¤ !ć",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !¬RR$ !bĥ$ !0Ñá !N$$Ħ !/ŁÑ22 !OĖ!ĥ$ !,ŁĖ!2R !MT!ąĐ !/Ć!sG !NĖĐ!Ħ !,Ł!!B !)ç !FTĖP!!!ĵ !,Ė!2' !Ną·!!!àķ$ !*Ć!B !LñT!!İ!!Ħ!Ėĵ$$$ !(2 !LÑz!Ė !&İXĐĖĥĵ!$$$ŁĖ!!B !Lą¿!BX8!!Đ!ĦĦĖąĥĵ!)Ć!2 !*Bç !B»Đ8 !*İĐĦĦĦĖĥ!!!2 !)ç !Fdń,,, !(İİĐĦĦğ !P»ń !&B !)8!Đö!2c' !)B !G7 B& !'8Bİ!!!2 !R7WBBc!!!8B !Z7YBXXXB!Đ!!!R2 !+C !Kń9RBB!Đ!!!sBc !*B!B !L32!Ħ!!!2ĆĬS) !Uń!32B!!2!!!ċ !+R !O3B8 !a2B!222 !,B !V2 !.B !UB3ń !ZB !&2 !a2!2 !_B23 !^X82S22> !XĵĶĦĦĦĬě22 !XĵĶĦĐİİİĦĦĶĬ> !(C!C !LĥĖĆĐ!!!ĦİĥĶR !WĦİ !'ĦĐĶĶĬ !UAİ !)ĦďĦR> !'R !OB !*ĦĥĶĬ !UB !*Ħ!ĦR$!!!ŁĖ !OWB!XBB !&Ġĥ!2$>Ł) !QB!ŀcĦ !&Ė!Ķ!2Ĭ)RR !PdR¦7¥R !&ðåĴĴńńĔ !Q2!!!7R¥R!!!Đćć !Y77hR!!!Đŀā!!|| !PB !(R¥¥RRĖĖÑÑ !SB !'777hR ¥( !Pt !, 7'jj !P22 !0Ė!ĥ !M>B!Ī !_R22Ė !0ĥ !OĪ!Ī !1ĦĖĦ !NĪ !cĖ !2ĥ !aĦĦĦ !MĖĖ !2¤ !cĦ !c¤ !a¤!",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !ìRTT !,Ñāı !SĖÕ$ !*ÑR !T$ąĐą$ !+R !RTõĐ!!ĥ !*ĖĖ7 !PTõr !&ħ !(R !TĦ~!!!ðĦ ć&!!h!Ėı !OÑÕ·X!!Đ8ĐĐĐĦ!ććć!!Ė !NÑX !(İ!!!İĐ!!Đ!!!ı !*ç !GÕL !*X!Đ !R»bd!!RR !&yXĐĐ!!!RR9 !+ć !Eąd!!!RRRy2R«y8!RRC!$ !Mđ !)½SC332c!Ėæěĵ !MÑ!dĥĖ !'22!!32X!!ð !-ç !CļąC R& !&2!!!B888Ķ !+B !Dbbń777!R!2!!!ĵĶðİİİðÏ !)BCB !B» !(77Ĕ !&ĶĆ !(ÑÑ !WĵĦİ !*Ñ !&B!B !LĔ2ĶĖĦ !,Ñ !SĔĥĦİ !-Ñ !&CÑ !PBR!!BBcccB!!ÑÑðÏÏ !Oİ!!2cccstttBcccBB !PAR!!R!RSCĬĬěH88Rss¶¶¶ !PR)Y)ĬĬ!!33CA''')Y) !PB!!! <& !Wı!cS!<< !&<!!$ !T22!<!!!ĪĪ!!<!!$$!!Ė !NS2t! Ī&!!ĪĪ! <&$!< !OB!Ě !* Ī&!<< !O2CB !/ĪĪĬ8 !PB !3ĥ !M2BĊ !_R!RĖ !`RĊ !2ĥ!Ħ !MĊĖ !3Ė !aĆ !NĖĖ !4ĥĦ !Ã¤Ħ !ÅĦ !c¤ !Ą¤ !Ņ !e",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !Ņ !Ņ !Ņ !ýÑÑ Á& !)ÑÑ !BÑÑÑ !*ħħħćÑÑ! Ķ' ±)RR !BX!!Ñć Ñ&ħķ22!Đ!!!222BB!!!¥¥Æ¼c· !BbX !(X2333!X!!!c¶¶ ¥'YY9nS !DbXíĐ!BBBb]]]!!X!c!ļļ9jYYYńńńĚÛ( !D·!XB!!r!!ą¤ĀĠĠ2!!!2R!ńńń!!ç!B !EĔ !&Ë!!!dccRBBļH2CĦĶ !'BçC !JÁĘ!!ĶtSRBB!!!BB2 !(B !FT !'ĥĘĜĬĜB3S!!Ė!ĖĦĶ !'BBR !Eß| !&Ħ!22!ûB !&ĶĵĶĶććć!!!C !EÑĆ!Đ8BB !&2!¤ĕ!!,İöåÕ,,!ćć !FÑ!8XX]RR]!22!C!Ħ!<!!İİİĶĶŀŀĦĆ!Ėŀ !C8Bbb '&ńĔ!B2sB!!!Ė222RRRB<<ğğ !C»¤b !*ĔĔĴGBBB2 c&!!!2RR2d !R''3 S&d 7'ļ92 !T ĺ'Ī !)(( !ĂĦ !dĖĖ !`ĥ !aĦĦĥĥ !aĦ !`¤Ħ!Ħ !Ã¤Ħ !cĦ !a¤ !c¤ !Ņ !Ņ!!",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !NRR !ÅDR !`Ė!$$ !ÃĤĖ<$ !_ĖRĥ !. Ñ( !NĖ!<$ !( Ñ&BBcXX !OńĦĥ! Ñ( B(!ddX !OĶ!! B'cB88XYYYńń· !OĶĦ!822R!ļļBdCńńń!ç!ç !OĶĵ!(!28BRCńń !'Ė !NÑĶ!Ķ<ŀRļB23Ï Ñ(İÏİ !M2ĶļðĦBĶddàÏ !& R' !MħĶ!ĠRĖöö¯¯BBB R+ !LCX!2! R'22BBBR777ĜjR !R 2'B2((9!!!B!9 !Kķ!BB2!2!22BB2(CAń !SCH!!2B22!!!Cń !'C !Lħ!!!tHR2 !'9ń !'ç!!ĥ !F ġ&!!!2Ķt99!!!ļ9ń !)R !BāÑ!!ġġĦöööĦĶ !&R!2CC2B !)B!Ė !A(!ÑġĦöĖ !&Ħ !(ĶĥěC2 !,Ħ !@bXyöĖ !'Đ!ĵ !&į!ļC2 !*B!!Ħ !Ad2X !&222!Ķĥ!!ÿ !&2Ĕ !,¤ !Ań3!!22B2!!ĠĦĶ!ÿ!!!M2 !+C !FĐ222BBRRR,Ħď !'ŀĠ !+Ėĥ !AÑÑÏBiBB !(,9 !&ĥ!!. !KBBXi!!!BBY B&į99(!2ĵ !-Ħ !AX8d32BB!9į 9'!!3 !&ĺ !)ĥ !CAds!ŀ!!9į9 ń*2!3 !,ĥĦ !BńĦ!h!!!9P !-ĺ !*Ħ !EĔRĘ!9!RĖ !)ġĶ !RĔR9!!B !-ĺ !,Ħ¤ !EńP!sô !,3 !-Ħ !Hsô !_ĖĖô !,2!ĥ !,Ħ !T777 !n¤ !a¤ !Ņ !Ņ !ċ",
);
rawImages.push(
  "#c Ņc !Ņ !MRR !cR !a__ !aĦĦo !_Ė!Ħõ !`ú !dĖġ !0ÑÑÑ !Ną !/ÑÑÑ !QĶĶĶ !)ñÑÑÑ !UĶ !)ñ !(X½½ !OĦ!Ķ !&ññ!Ħ!¶½½½bńńí !PĖ ñ&ĦĦĦ!¶)!ńń !SĦX!!ĦĦ!!!B !&Ł>N !OāĖ!ŀĦĦ !'ļ)!LNS2Ĝ !RĖ !(BB!! Ĝ& !ZļB!!!ńńń!ç !M$Ė !*BcC!ńń!!!R !WB8C!ń !UX !'BBXB !+B !N¦XX8BBļ8!C!ń !VĶ¦!B88¦dC!ń !*B !P··dd!ĵ!ń !,Ė !Qąąåİ !-C !SĐ,!ĵT !`Ķ !dĶ !aĶ !,R !QĖĐ !&ĶT !Zĥ!!!Ķ !X$ !&Ħ!!ĦĶ!Ķ ![Đ!!!ĦĐğ !,ĥ !NĶą !'ĦĦÏ !T$!ĵĥĥĶX !'Ķ!ġ !(Ė !JāāÿÏààà!BX!!!2 !Sā!ĖĖ !&Ġ!BXXR !SāĖĖ !'R!ĠĠB<(!!B !+Ħ !EāĖ !(R!!2BŀĬB!!!G !MTĖBB !&R!2B2ĬĬBC2 !+ĥ !CÑÑñ¿BX8c!!!2B2ĬĬBBC!!2 !L»!!XX !'R2Ĭ(BdCC !PÑsRttĦİĆ!R(ĬBCC!ńńń!!!G !K»ĖĖ!!B!BB(<BCńńń !1Ė !CxxĔ!Cļ !&Cń !3Ħ !IÕB2!zń !*2!ġ !*ĥ !FĔR$!2 !,ń!!Ħġ. !)Ħ !H8!BB !+jBBB !(Ħ !HĔ!C8C !,ńIB3 !QRCRô !,ń'ĺĺ !(Ħ !Hńń!B !asô !6¤ !IĖĖô !8Ħ !Æ¤ !Ą¤ !ć",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !´R !aR_R !ÄĖ.R !`ĦĦ. !- Ñ& !OĖ!ĕĦ !) Ñ& !&ç !PĶĕ!!!đđđÑ!!!R½½RR !Pĕ!2!đđĆĆĆ!!y½jńńRRB !OĦ!!đĆĆ !(ĥń!!77· !PĦÖĆ !*A!ŁŁŁ !QH !+R!ŁŁCCCç!ç !N3XX !(RH2))ĬĬĬB !Q3RXR!!!RH23!ńń<!B !SB(RRXH!!!ń!!ĪńC!B !RB((B223 ![ĠĐĐ!!3!ń !)B !M$!ĵĶĦĖ!R!3!ń !WĵĶĦŀ!!!< !XħąĖðĐĖ!!ĖĆ !-Cç !G Ñ&ðĐĐX !'Ķ !NÑ!!!ÑÑ !)ĐXX !&Ŀ !*ĥ !EŁÑÑ !'B !(X !1B !ARĆ¶XXXBBB!BBBc,L!X!!!ń !Lh!ĆBBİ!! B'!2!LB !-ĦĖ !Dh(C!ļ!!!ļ22BB(ļļC!!) !MÑÑ!RCÕc¦Yn22Ĝļ!!2!!!ń !*Ħ!!B !A»Rŀ!RĘ!ļĥ!ļļB!22M<B!ñ !+ĥ !Dhh!!ĥ!åæļ <&,,!!!BBđ !OĔ!C!ĖBR '(ĥ!!!BB !)¤ !HĔRCáĶ !)'ĥ·B !TļļR !,777 !*Ħĥ !GńP!BĔ !6Ħ!Ħ !HRA !8Ħ !GĖĖĔ !-> !,¤!Ħ !U> !,Ħ !S' !cĪĪĪ !,¤ !Æ¤ !Ņ !Ņ !Ĉ",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !Ņ !Ņ !Ņ !¼ ġ' !OÑćć !&ġġġ!ġġđĖĖĦĶ2ı !*ÑÑ !DsĐĐćć$ñĖĖ!ġ!ĖĆĦĦĖĆææÑ Á) !FGssddąX!2ĬĬöĦ!X !(2 R'2 !GGGğRB·!ĆddyyRĐ8!8 X& 8'XÇ¥ !ItĦ8ĝ!µĦ!(8B8,Ħ!!Rd b'!C !GG!!ĖB!!sd!!BĦ,ļ!BR3 !'çûH !S,8!B !*Bd !Hġ!!RĦ!!Ćą!!!ļİ!!!Ėĵ !'B,Ġ !IõBİ¯R÷B!!ĦBļ!!Ħ!Ėą ć&ĦÅą !EÑÑIĖĦÕ!cÕÕĠðĐİ!BL ,' İ'!Ć !DÑ!sąądĦs!]]BsXX!! 2( B'¶¶ !DssĬbbńbCCC'!! <&!BBGGG W&Y33 !DGGb !&ĪĪĪ!GG B''' !*HH !Q '' !Ïĥ!Ė !bĥ !ÃĦĖ !cĦ !ÃĦĥ !cĦ !aĦ !a¤ !cĦ¤ !ń¤ !Ņ !Ĉ",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !ñRRT !bĖć !_$Ę!ĦR !1ññ !K$!ą!Ħ$ !0ñ !LT!ĖŀąB!$ !0R8 !IÑ!!Ŀ!öĶ !/ññRĬB!T !FÑX!ĥWĖBĶİ!ć !*ññR8(Bt !GÑX!ĦĦĘ!·āëğBćć!!!ñññR8(BAA !H»bbĥĐå!ÏĦ !'ććñ!R8ĬBCA !&| !GÑĖ2İ!!ë<ĆĦ!!Ħ!8XĬBdCń !&Ñ2 !EÑÑX!H!!!ĐĆ!Đ!!BĦ!!RCńń!!!Ñ¯2B !E»X!]!R222!!!Đ!!B!!3R!!!Ñá2Bc½ !Fbb']ccBB22BBĦ!!ĦĆÏ|ÑÑÑ22c½G !J''BcB2!!ļB!Ġŀŀ222BBBRG !N''BB!ļB!Ġ!! B&22BG !QY!!BĦĠ!!B!!!BBBG !SIi!İ!!B!BB½GGG !'Ė !LT!R3B8!2!!(I !)ĖT !PB2c !'ĵĔ !TD !&3 !&B21 !VĶ !(2B!3 !YĶĦĵĦH(2I, !XĶĦĥàĐŀŀļ!H.. !TĶ!ĦĵĦ!!ĶĶĠĥĦH!. !SĴĶĵĶĐ!R22!ŀĶ!H !UğĶðcB !(Ĕ!ļ !)ĥ !LĦðB2 !+R !'ĥ !Oc!SRBB !&ħĔĔ !V·ĺGG2R!Ħğŀħħħ !S2BR!!!7!!!ĦĦĠ,ŀ !'Ė !LRSSĪ !&7 R&BĖ !T2B !( 7&G !(Ħ !NB2Ė !,R2 !'ĥ !MĺĪ !-77 !(Ħ !KĖ!Ė !3Ħ !NĖ !vĦĦ !Ã¤ !ÆĦ !c¤ !Ņ !b¤ !Ç",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !°RR$ !bĥ$ !_$$Ħ !aĖ!ĥ$ !]T!ąĐ !`ĖĐ!Ħ !3đŁ !ITĖP!!!ĵ$ !0đR !Ką·!!!àĵ$$ !0ÖÑ !FñT!!İ!!Ħ!Ėĵ!$$ !+đRĬ !GÑz!Ė !&İXĐĖĥĵĵ$$ !'đđRĬð!R !DÑ!ą¿!BX8!!Đ!ĦĦĖĖĥĵ$ŁđđđR8Öð!Rc !D»!Đ8 !*İĐĦĦĦĶĵ)R88Öð!RRcY !E»½bń,,, !(İİĦĦ!!Öðð!!Rcc' !Gń !'B !)BĦàÏ !&Rc'Y !K7 B& !'X !(RRc' !N7WBBc!!8X!Ħİ!!RRcc' !Q788yXB!Ħİ !&c'' !SCtCB!Ħİ !&c) !UńBsCBİ !&¶Ĭ !WĦĦR28!!!XČ2 !WBBB!B!!X !,T !OĦĦĦ !&ŀŀB3ń !U$ĦĦĦ!Ħ!B ![ Ķ& !&(2 !+Ė !L$ !&Ħİ2!!B3ń !(Ė !Rĵ!!!2(2 !_R2B!ń !U$!!!ĵĶByBB23 !YĵĶĦĦĦļļ !ZĵĶĦ!İİĆĦĶ !Xĵ!!Đİ!!,İĦĥ !XĶðB! B&]Ħ$ !)ĥ !MńĶð!!B !&Ħ] !,ĥ !LĠ !n. !UhR!Ħ2 !)ļ. !'ĦĖ !NhRB!R2!!B)RRļ.. !TB!!3S2!!!Ĕ!Rļļ. !Vĺ!B!Ħ!!ĔĔR!ļ !&Ħ !OBB!!!2!Ŀ.!!!RR !RıĶR'!ĺ3B!Ħĵ.>Ĕ !&Ħ !OCB3!!!ĺ'B!ĦĕĥŁĔĔ!!!ĥ !OC !('BB!ĦĦŁ !'Ħ !L>Rcĺ !(''B !T>B!Ī !+' !)Ħ !LR22Ė !,2S3 !QĪ!Ī !-7ĺĺ!!!¤!¤ !LĪ !cĖ !4Ħ !°ĖĖ !v¤ !Ç",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !ïRTT !aĖÕ$ !_$ąĐą$ !]TõĐ!!ĥR !ZTõr !6ÑÑ !JĦ~!!!ð×ććć !-Ñ !JÑÕ·X!!Đ8Đ!!!ćć !-R !FÑÑX !(İX Đ&Ħćć !'ÑÑ!sc !F»RBBÕL !&Đ !)ć!!ÑÑ!RRdC$ !FhACB!RR !'8XBĦĐĐÑÑ!!RHhĪ8 !IąC!!!RRR!!B!Đİ !&RRHA !KđB !)RXĦĐ !'RHHAŁŁ !IÑ!CĥĖ !'½·cX !&RHAA!!t!ĔRç !DÑR8ĥC R&!½ĶĦCB !&¦CT!ŁtĬT !G»hAAń777!RĶĶĶ !(ċ!!ŁYĬ !Q7jĶ!!ĵ !&y!!!Y !TĔĶĶĵĶĦXXX!CR!!!ĔĔ !Q$!ĵĶĦĐİİİĦ!Ė!ĔĔ !'B !NĥöĆĐ !&İą!Ĕ !&Ė !O$!Ćİİ!B !&İĥ !(T !Oĥİ !aİ2 !1ĥ!!B !Lĥ !(BBcB!Đđ !&ĦĖ !Q2!Bs!RS!BBĦđđ !RA!R!RÇ)Y)ĕ B&!!đ!Ħ!!!ç !LW!R !'S977RB !UWB!!!<<!!$!'7RR!¤!!C !PR!< !.ĥ !P>!d!ĪĪ !&$!!'' !R>ąd!Ě !&<!!$ !*B !MB!Ě!!!ĪĪĪ<!!$ !&ĦĖ !N2CB !)Ī< !XB !*Ī<< !&Ħĥ !N2BĊ !_R!RĖ !+ĪĪ !&¤ !ORĊ !3Ħ !NĊĖ !4ĥ !aĦ!Ħ !KĖĖ !5Ħ !Ä¤ !cĦ !c¤ !ń¤ !Ç",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !Ņ !Ņ !Ņ !ÂÑćÑ !Xđāāđ!ÑÑX<X !KÑÑÑ !)$$.Ķ!ĆöÑ!!<Ĭ< !KX!!Ñć Ñ&$!,ą!Ć!2RR¥GbG!ŁŁ !HbX!!ñ÷¶sy!,åĆ2!2RRRC.ŁŁŁ3dç !HbXí!R·¦~!ąĦ!!s!Ė9jļļ)))ļ!B !I·!!!Ėą¤ßĖ22!!y½R!s ń&]ĦBç!ç !FĔ!x!!dccRBBļYC!Ė !(Ċ8C!çB !IbåĶtSRBB!!!RR !+BBB !FT!!!ĖÅĜB3S!!ą!ĖĖ !(_İ!BB !Gß| !'ĜB!!!<ÿğ<!! T&8BRC!C !EÑĆ!Đ8BBą!Ħĕ!<Ķ!öµÏĤ ,&İ!!!C !EÑ!8XX]RR]RļB2!2!!!ĖÑÅĊĊĊ!Ħ!RR !F8Bbb '&ĔRY!22RXR!ĖĖćġ!ĊĬ !H»¤b !)ĔĔ7222]BsRX<Ĭ !(ń !Q '&GGh<Ĭ<!!ĥĖ ![GbG!!Ħ !bĦĥ!!$ !`Ė !`¤Ħ !dĖĥ !_Ħĥ !bĦĥ !`¤!!Ħ !`ĦĦ !cĦ !`¤ !cĦ¤ !Ä¤ !Ņ !Ņ!!!",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !ıRR !ÅDR !`Ė!$$ !ÃĤĖ<$ !*ÑÁÑ !SĖRĥ !*Á!22 !TĖ!<$ !&ÁÁBsRB !TńĦĥ!!!ÁÁB¥i(hh !'ć !OĶ!!ÑÑB¥i(AAÑÑÑ !TĶĦ!BB2(!!!Ñ !XĶĵ828!!ĀÁĶĶ !)ć !MÑ!Ć!!(BĀàĦ!!BRR !Rñ!Ė!Ķ<ŀ,Ħ!!BcBhh !Qħ !'ĦBÖ!BcBhh !WBĐĖöÆcBHh !)ć !NX!B!!BB !/B !L2 !(BĖc!Ġħ !V2y!!!B!!Ė2 !-B !K132X!B !'22 !)BC !N328 !_ń!CBļ !'8S !Yt¦Y!!!dC !Vġġĵ!Ķ2B8Rdĵ!2 !(ħC !GāÑ!!ġġĦöĶ !'ĖąĖĵ!đđ !'R !G(!ÑġĦöĖ!ĦĕĶ!Ħİ!!B!!YRđđ!!C !HbXyöĖ!!!ĐĦĕßď !&3Ė!)YRđħ !JdCX !&2Ġð8 !'įį!<<)R !Kń!!!22B2!cİ88!!Ħ!!įĬĬ<CCR !KĐ222BBR!!İ!YY!ĦĦ!įįĬĬR !IÑÑÏBiBB !(İ!!WWWĦĦ!į !KBBXz!!!BB Y'ńń!!!WWĦĦįÿ !IX8d!CBB!9į!!ńń !)WWĦ!ÿ !HAds!į!!9į9ńń !-8 !&Ħ !FńĦ!h!!!9P !3ĥ !HĔRĘ!9!RĖ !/Ħ9j !KĔR9!!B !^ńP!sô !3Ė !Msô !1bĥ!!Ħb !IĖĖô !4Ėĥ !`Ħ !cĥ!b !_bĦĦ !abb !Ņ !Ņ !&",
);
rawImages.push(
  "#c Ņc !įRR !cR !a__R !`ĦĦ> !-Ñā !QĖ!ĦõN !+Ñ !Tú !dĖõ !*Ñ!B( !Są !*ÑÑ!B8b !SĶĶĶ !'Ñ!!B8b !UĶ !&ÑÑ!BX8b !UG2Ćā !&R8bb!!ŁŁ !Z2R !_c!ļ3!!!Ł!)!!!ç !NġĖ!!đđĆ!!ĵ!ŁŁ)) !RġĦ!!2Ć!!!İĖŁļ)!ńń !QĦĖ!!Ć!Ć !&ļ3!ń !(ç !KāĖ !*2!3!ń !Ty !+B!ń !)B !LH!X !(B(2 !*ç !N2BX !&B8B3ń !*B !NCt«XBRB!2ń !,B !L322CR8(8R3 !+B !O222CdBĦİĵT !VA!2!22ĥĦŀĦİĶ !+C !Q2CĐĖ!!ĶT !+B !MĶ !&X!!ĦĥĶT !UńĦ!!!BB!Ė!İĶ !)B !Yĥ !*R !NńĶ!B!2!!!Ķ!ĶT !U$ĦĖĖ !(ĶĶ !VńBRR!à!!Ėļ!!Ķ !VĦĦĦĶ !&Đ!Ķ !*C !M$!ĶõĕX !&Ġÿ !VĥĥąĦĦBy!!!ĖĖßāā !QāāĠðĐĐĐĦ!8 !&ĖĖ!ā!!C !Lā!ĖĖ !&ŀĦc88 !&ĖĖā !MāĖĖ !'R!<ĦccRRR!!!Ėā !KāĖ !(R!B!<Ħ!jcBRR !MTĖBB !&R!2!ĬĬB2!)IjBR!Ėÿ !Gćñ¿BX8c!!!2B2(BB23 !&IhsRĖÏ !EÑĐ!XX !'R2Ĭ(2CC=,ĿĿ!!!$GBRĖÿ !D»sRttĦİĆ!R(ĬB23ńńĺĺ''Ŀ,!!$GBRĖ !DÑĖĖ!!B!BB(<BC1ń !('ĵĿ!!$I!R !D»xxĔ!Cļ !&Cń !+''Ŀ,!!BB !JÕB2!zń !.'ĵ,!zI !HĔR$!2 !2'ĵ, !M8!BB !1'H !KĔ!C8C !3Ė !MRCRô !4ĥ !Jńń!B !3ĥ !Nsô !4Ė !KĖĖô !6Ħ !`Ćĥ !cĦ !aĦ !a¤ !cĦ !c¤ !Ä¤!",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !±R !.ÑÑ !RR_R !,Ñ !¹Ė.R !)ÑÑ!c¶ !SĦĦ. !'ÑÑ!!cR' !RĖ!ĕĦ !*¶R' !UĶĕ !'c!!Ė !,ç !Kĕ!2āāÑÑđĆ!!ĆĖT !T7!ĆĖĖ!!Ć ![2 !6Bç !LHyR !)Y!. !T9tt2 !'cXBĦļ. !'ç !OBtc!!!cļB22!ļ !)B !NXt¥!!ĆĐðĦ!2 !)B !LR!!!89X !&Ķ !VĔ !'B !&ÏĦBń !'BCB !LĔ !&Ħ !'ĥ !Wô!Ė!Đ !&XĦÕ !(B!C !Nö!ĥ !'ĐĐĐđđđ!!!CR !Pďðy !)ĆĆ!đđ!!!R !LÑÑÏĆ!!yBBB !'ĆĆĆđ !MÑÑ !'Đ!XX!ÇÇc B&!Ćď !KÑ !(B!Đ!!Xīļd¦¦¦BBBĦ| !FÑŁÑÑ !'BB!!Bİ!!!2Hĺĺĺd¦B!B| !ERĆ¶XXXBBB !&BB!!!2 !&ĺĺd¦BB !Eh!ĆBBİ!! B'ĜĜĦ!!2Ķ$ !&ĺHdB !Fh(C!ļ!!!ļ22B!BB23!Ķ!$ !(d !FÑ!RCÕB¦Yn2ĬĜB!C3RĦĶ!!$$!!!HH !EÑRŀ!RĘ!ļĥ!ļBB!<ĿĿďįĿĿ!!!$ !I»hh!!ĥļåæļ <& '(!ĿĿ!!$ !KĔ!CBĖBR '& !(''!Ŀ!!Ė !KĔR!áĶ !/''Ŀ!!!Ė !KCļR !1'Ŀ !MńP!BĔ !1' !ORA !_ĖĖĔ !4ĥĖ !ÄĦ!ĥ !aĥ !aĦ!Ħ !ÄĦĦ !`¤ !cĦ !c¤ !a¤ !Ņ!!",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !Ņ !Ņ !Ņ !ZġġġŁ ![ġġġĦĦĦĖıı !KÑć !&ġġġ!ġñññĖĖĖRccdCC. !JsĐćć$ñĖĖ!ġ!! Ħ'æÖöõĕĥĵ !JGsddąX!ĖĬĬöĦ !(cB2ĶĦĖı>ŁŁ !GGğRB·ĖÍdd½RR!8!8Xļļ B& !&ç !ItĦĝĥ!µąH(8B8,ĦBR9 j&8)CBç !FG!!Ė!r!sd!!BĦ,ļ !' Ĕ&ńĪBBç !Q,8!B !,C !Gġ!!R!÷!Ćą!!!ļİ !)ħN!!!RBB !GõB[tR÷d!!ĦBļ !'õħ<!N$Ł!CB !DÑIĖĦÕBÏÕÕÿĠŀ<ŀB<!İĠďİ<!!!<!!R !DÑ!ąądĦsc]]BBB((,2,22RR!CĶĜ2S!!C !CssbbńbCCC'!!!<<2RRBBCCC2ĪńĚĚ !FGG !&ĪĪĪ!GGGBBB!!SS222Ě !W '&3ĦĦĶ!Ě !]ĺĺĺĪĚ !(Ė !ĆĖ !aĥ !dĥ !`Ħ !bĦĥ !cĦ !`¤ !cĦĦ !ÄĦ¤ !ń¤ !Ņ !È",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !įRRT !bĖć !_$Ę!ĦR !]$!ą!Ħ$ ![T!ĖŀąB!$ !YÑ!!Ŀ!öĶ!!ħć !VÑX!ĥWĖBĶİ!!Bćć !SÑX!!ĦĘ!·āëğ !&ććıđđ !N»bb!Đå!ÏĦ!!ĦĦ!!Ħ!Ĝļļñ !OÑÕ2İ!!ë<ĆĐĐ!!BĦ!BRÍ ñ' !HÑÑX!H!!!ĐĆ!!!Đ!!B!!3! 8&!ñ!!!ç !C»X!]!R222!!2B!!!ĐĐ2!! B&RR!āç !Ebb']ccBB222!X !&àÏõ A&!!āc !I''BccR!!ļ!!İB!!!ðÑ!!!GGc!B !J'''zR!Bİİ!! B&! Ñ'!!BB !M88İ!!!Rccc! B&!!!'C !MBdR8ļ!!ĖĜļ9 c'BBĆā!B !LĦB¦Rcļ!ļBCR j'cc !QĦĦ32B8BĦĵ ą'õļĆ !TĶ!Ħİİ Ā&ĐĐĠĠ2!½!C !NĶĵ!İİĦĦ!!22!!2BBh!R !MĔĶĦĶĐĦ !&2!!2B2GG !QÏąĐ !&B2!2B2GG !SĦİ !(2B2GG !Tđ!Ħ2Bs¥¥cBGG !)Ė !MđĆB¥hWG 7& !V.!c×7 !]_ĕBÇ !4ĥ !KĺSSĪĊ !5ĥ !J2B !aB2Ė !4Ħ !LĺĪ !6Ė !JĖ!Ė !aĖ !6ĦĥĦ !ÅĦ !aĦ !a¤ !ÆĦ¤ !Ą¤ !Ņ !e",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !LRR$ !bĥ$ !_$$Ħ !aĖ!ĥ$ !]T!ąĐ !`ĖĐ!Ħ !]TĖP!!!ĵ$ ![ą·!!!à !ZT!!İ!!Ħ!ą$ !WÑ!Ė !&İXĐĵ$$ !TÑX¿!BX8!!Đ!Ķĵ!$$ !SĐ8 !*ĦĖąĥĵ$ !R½bń,,, !&ĐĦĦĦĶ !R»ń !'B !&İİ!ĦR$ġ !S7 B& !'Ħ!ÕRBġ !S7BBBc !&İĦ!!)BŁġġ !Q7!B!c88XXBĐïR))IBŁ !Qj9YHsB!!Đ !() !'ç !LĔRRd3R!Đ !&Rń !UBBBR3Đ!!!Ėï!!ń!)!!ħć !NĦĦĦ!RX!R!ĦĖï!!ńń!Ł !P B&!R!B!!ĦĖñññġŁ!!!B !MôĦĦĦĖà !' Ħ&!!)!B !N$Ķ!Ķĵ!!Ħ s(¶!) !RĶĦĕĖ!!!(IzIIIö!!!CC !OĶĶĶ !'RĖ!!!zIńďď!B !L$!!ĵĦĐ!R(C !'ńń !VRsjd!Ė!!!ń!!đ !RĵĶ!!Ö¯¿¿ďď!ń!!đ!Ķ¬!C !NĶĦĠö22!!öĆÏ$āāĶ!h !QĦĐĦ2!!222!!ÿ!!2R!!R !Nĵ !'2! R&!!2R' !Pĵ!Đ!!!2!R!! 2&R' !QĶĶ!!!2!R!222RWW' !Rİð!!2!!!2!2B' !ZRR2!2B' !VWR!Ç!!B2BB' !XBRûÇhGG7' !+Ė !O2!< !3ĥ !OSĺ !0ĥ !OCB !3Ė !M.ĕSĺ !1Ħ !O2 !5Ħ !MC !4ĥ !L>Rcĺ !2Ħ !L>B!Ī !_R22Ė !4ĦĦ !JĪ!Ī !4¤ !MĪ !cĖ !6¤ !aĦ !KĖĖ !Ú¤ !d",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !îRTT !aĖÕ$ !_$ąĐą$ !]TõĐ!!ĥR !ZTõr !&× ć& !WĦ~!!!Đ İ'ććć !RÑÕ·X!!Đļ Ħ'İİ!ññ !OÑX !(İ !'88Đ!!ñ !OBBÕL !,Đ !& ñ' !I»ACB!RR !(X!!!Ħ R(!ñ !JąC!!!RRR¥íÝBĐ!Bs B'!8 !JđB !(RjĶĶ2y!ĦöĬļ)Y'B!!!ġġ !EÑ!CĥĖ !&j!!Ķ!!!88ĠĐ!!!'dz!Ħ!ç !E8ĥC R&!!ĶĶ!ĶĦ8ĠĠĆĆ¿Ï!!ńïā!!B !D»AAń777!RĶĶĶĵ!!İ!!!22!āññ2!BGB !K77ĶĶĵĶĆĐ!!!2BBĶĶ!2!cG !OĶ!ĶĦİ!!!2B! 2&!¦'!$Cç !Mĵ!Ħ !(2!BcthĪ!$ !PĶĆİ !)BB3ĺ!$$!< !Nń !(2B2BB3ļ$$!<<!RB !MĦİ!!BB¶BcB3ļ!!<<!ĪĬ !O,B!!!c)Y)3ļ!<<!!Ī !QW!B !(2!<!!!Ī !&B !Nx!c!9<<<!< Ī& !Uc!!< !&Ī !ZĦ¦!!!ĪĪ !YıĶR!ĪĪĪ !.C !NC!Sĺ !/ĥ !´Bdc !1Ė !QB !0Ħ !P2BĊ !_R!RĖ !2ĥ !NRĊ !aĊĖ !1Ħ !cĥĦ !MĖĖ !4Ħ !`¤Ħ !ÅĦ¤ !ń¤ !Ņ !e",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !Ņ !Ņ !Ņ !ýÑÑÑá !NÑÑÑ !*ħħħÑÑRRRBáááđđ !IX!!ÑćÑÑñR__CCð !(B!!Ć!đđ !GbX !'Ë!!ĶĿğs!!ĖĖĖ!!BBRĶBBııç !EbXíĐ!B!!!2!ĦĦ!ccyyj½½½(¦ S&Bç !E·!XB!Á!!ĶS2!R!!!2R!Ķ!·888!!B !FĔ !'÷Č((R!!ļH23Ķ!!ĖĖĖĔĔĪRC !P3BB!!3R2!Ĥńńń!!!Ĭ!B !ET !+ĕS !&ĖĶ!D$$$!!!İ !Gß| !&Ħ !&ĕ!!Ėĥ!Ħ!2Ŀğğġ>> !GÑĆ!Đ8BB !&zBĶŀŀĦďďß|Ö!dd!!!RB !CÑ!8XX]RR]R!!!YR!!ŀ!!!cc !&RR !F8Bbb '&ĔĔ !&BBB222RRBĪĪĪúü !E»¤b !*ĔĔĔ'G B'''' !(C !S '' !Ņ !kĥ !dĥ !`Ħ !cĖ !aĦ!Ħ !aĥĦ !Ã¤Ħ !bĦ !c¤ !Ą¤ !Ņ !e",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !³RR !ÅDR !`Ė!$$ !ÃĤİ !a$ĥ !aĖ!< !`ğ!ĬÑÑñññ !ZĶ!!BX!!!ññ!!ññ !S$ĶĦ!z!22R!!ññ!!ñđ !RĖĦğĥ!(!28Xi888B!đ !OT !'<ŀRļB23RRBļ2!đ !QĶĦĠöĖæðŀĶ!33CR(ļ !RĦĶ! B&Ėŀĥńńń1CBļ !PX!!! B&!öðÑÑŁŁńCB!ħç !LRdB!RBB!! B'!!Ł!CT !MĔ!R88!!!B!! B&ĖĖ!Ŀń !OĔ!·dĜ!!! B*ĶĶŁď !OĔ!Rd9 !)777!!Ķ!C !KġġġT!!RR9ļ!!!9j>>>h !&B !DāÑ!!ġġĦööĖ !&RC!!ļ!!888ĢCjY !F(!ÑġĦöĖ!!ą !+, Ġ&ĥĥ !HbXyöĖ !'Ė !)^ ĥ' !&R !FdCX !&2Đą Ė&į!!ĕ !(CĔ !Hń!!!22B2Bİďďąĥļ !& C'ĺ!!!B !GĐ222 B&!!,,!ļCCC ĺ' !IÑÑÏBiBB !'BB!,!īļĺ !)Ė !FBBXz!!!BBYBB!!!ļ23ń !,C !DX8d!CBB!9į 9'C3ń !PAds!į!!9į9 !&ńńń !,ĥ !GńĦ!h!!!9P ń& !1ĥ !FĔRĘ!9!RĖ ![ĔR9!!B !4Ħ !JńP!sô !5ĖĦ !Jsô !_ĖĖô !6Ħ !cĥ !bĦĦ !`¤ !cĦ !c¤ !ń¤ !Ņ!!",
);
rawImages.push(
  "#c Ņc !Ņ !ĭRRR !c² !`__Ħo !_ĦĦ!õŁ !]Ė!Ħõ!Ė !^ú!!Ė2ġ !^ĚĶ!!Ķ !_72Ė !aĦ!Ķ !bĖ !aĦX Ñ' !ZĖ!Đ !'ÑÑ !W$ !,Ñ !Wy !,Ñ !T$!Cy!!BB !( Ñ& !RB!!!2! B,ñ !PB2Cy!! 2,!!ñ !O2!RCyĖ !& 2(BBBđ !QR2XĖcccRRR Y&22!đ !Lń !&3!!Ć )'!,ńńG!2!ç !QB!Ėÿĥ!R!!ļ.!!S!2Bç !OR2X!!Ġĥ !&ļŁŁĺS!B !LĔ !&3!!Ė!ŀï Ŀ&Ööġ!SC !RB!!BĦö Ö&¶!BļH !NĔBBBR2!!öĖ! B&ö!!!Ė!B !L$ööĦ !) R( !QńssBBĖ !&R!I G&' !P$öööå !&RBI!!!$$>ń!RB !K$!!ĵĥĖ!XXX((!!!$ !QāÿÏÏàðĐ B'2!!$ !PāāĖĖ !'ðĠĠ!23 !'<Ī !KāĖĖ !'RRR !( ,&Ī !KāĖ !(R!!!2( !'ĺĺĺ !KTĖBB !&R!222ļB23!!ĺ !KÑÑñ¿BX8c!!!2B222B23!!ń !L»!!XX !'R2Ĭ(((23!!ń !,C !BÑsRttĦİĆ!R(ĬBCCC3!ńń !N»ĖĖ!!B!BB(<BC ń' !-ĥ !ExxĔ!Cļ !&Cń ![ÕB2!zń !ZĔR$!2 !a8!BB !4Ħ!ĥ !GĔ!C8C !6Ė !JRCRô !6Ħ !Hńń!B !6ĥ !Ksô !5Ħ!Ħ !HĖĖô !7Ħ !Ä¤Ħ !c¤ !ń¤ !Ç",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !įR²R !cR !`Ė.!_ !^Ė!ĦāĦı !^ĊĪ2ą2đ !_'B!!! ñ) !WĖÖ!ñ Ħ)ñ !V8!ĆĦ !)ĦÑññ !Rħ!X!!!BB !(ĦĦñ !RCB !' B*!ññ !Qty!!B!BRc¦¦zzzsBBñ !QCyyĆBBS9ļļRńń'W2Bñç !MR !&yĆĆĕğĥ !(G2BBç !KA !*ĦĶ!!!$$$ááB!B !NĖ !+ß¯ßßß!!!¬t !MĖ!!!Ħð!!!ĶĀ!! 2'!Ė!B !NĥðĐ !&ĖĶ!cRRRss !QĥðX!!!ĦĖ!!B!GGG'')!!B !IÑÑÑÏð!ĐXX !&RBz!!!ħħ !GÑ!!!ÑÑ !)İ!XRRRBz!!!ħ22!!!C !DŁÑÑ !'B !&İBHHHI!Ėħħ23 !HRĆ¶XXXBBB!BBB!!ĐĦ!2!Ė!CC3!, !Gh!ĆBBİ!! B*!!3!! Ŀ''ĥ !Gh(C!ļ!!!ļ22B888B2!ĿĿ '' !HÑÑ!RCÕc¦Yn22ļ!!!2!!'' !M»Rŀ!RĘ!ļĥ!ļļ!!!2!3ń !Phh!!ĥ!åæļ<<<2211ń !SĔ!C!ĖBR'''11 !.Ħĥ !IĔRCáĶ !`ļļR !4Ħ!Ėĥ !HńP!BĔ !`RA !5Ħĥ !IĖĖĔ !5¤ !cĦ!Ħ !ÄĦĦ !`¤ !cĦ¤ !ń¤ !Ņ !È",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !Ņ !FÑć !&ġġġ !)ù !QsĐćć$ñĖĖ!ġ đ'!p!!ù !NGsddąX!ĖĬĬĆļ!!!đđù!p !OGğR!tĖÍdd½B8 ļ&:đđ !RdÕĝĥąą!æ!B!Ħ!ļ88đđ !NG!Rd!r!·!Tr!!B!ĦĦ!8ļ đ' !WĦB!Ħ!B ļ'đ !Hġ!Ėą!÷!Õ!Ĕ÷!Đ!B !&t B&!!ı !Ią·[t··!¥!ðX !)ttt!B !HÑIĖ!ĖBÏÕÕÿððÞĈ!!ĐĐĐðÏÿĔĔt!B!!!ç !BÑ!ąądąsc]]Bíí¥!4Đ !&ĖĖı!Ĕ,!S>$ !CssbbńbCCC'®!ÕacBk!s!!!ĖæāāĖĖ!!R !CGG !&ĪĪĪ!ă!·è¥Ė¶!Ės !& Ė&ĕĬ !JÉ !(¶¶Æs !WÃ !'ķ¤µsP!!Ķ ×(!RSń!B !J¨E!!1!!q !&Ĭ8 Ĭ&×¦Ī !MãcT !1ĪĪ!Ñ !KE!ã !1ń!!Ñ!!B !Ic!!33 !)ļ !&ń!!Ñ !Mã!T!¶ !'X8!!!ńń !'c !G¨ !(ĵÅ!Ė!Ħ!İİİï¿ ć&Ñ!c¬ !Gã !*Ė!ąİĐ Ħ' Đ&!cR !PĖ!ąĐĦ !,cR' !QąĐ!!! B*cR'!Ė !OÏ!!!BB !'BBsR' !PĔ!!Đ!B !'BsWW'' !Rß!c !&BBsW' !XļcsssRW' !ZĐ! '& !-ĥ !MđĆ!¶W !`s !4Ė !K.!c¦' !2Ħ !K_ĕBÇ !_ĺSSĪĊ !5Ħ !J2B !5Ħĥ !KB2Ė !6Ħ !JĺĪ !6Ħ !JĖ!Ė !5¤ !LĖ !7Ħ !c¤ !Ņ !b¤ !Ç",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !ķÑÑ !`Ñss$ !^Ñs(( !bCń !]Ñs(Cń !dÙ !-ç !<Ñć !&ġġġ !+ÁĶæ !&³ !HsĐćć$ñĖĖ!ġđđđ!!!ÙÁ!!!Đń !0B !<GsddąXĖĖæĶ!!!đđ!³ !-Ù !+ç !<GğR!t!!i ļ'!đ!!!2Æs !(³ !*B !@dÕ!i!4ĦB!!ļļđ!!¶)' !NG!ĥdÍdd!Ħ!!Ħ!!ļ!2!!Ù !0ç !A·ĥąąÅ!Tr!B!ĦĀ !&³!ù !0B !=ġ!!r!·T !&Ħ!B !&ĵ$ùĦ !/C !EĦĔ÷!B!Ā!2 !&p³ !KÑIĖ!÷!ÕĔ0¥!Đè!!2 !&ĵ$!!ù !,B!B !;Ñ!ąą[t··Ç]ŀu!sĸ2 !+p !,B !=ssbb»Ĕİİ<W®Ņ®Æ!Ğ!!¶ĬĶ!!$ !JGG !&ĪĪjĖĵ!cĆc!!¶Ĭ!!Ķĵ !0R !Dã!!!Ņ!¶J!öĦĦ !4C !D¨Ĕ!#1ÄX!Ħİ!Ħ !1C !B5!!!ã!!ŅRu!8!!İ !Sĳ !'Ĕ!!ĕBB!Ħ!!!Ķ !TÙ!!Ĕ!!C !&İĦ!!> !(ı> !FU!!!³ !(B !/ı !Hē!!5f!!!ĔR!!8!Ħ !-S !JRs !(CB !'RĬ>!!!ı !Lă³¨ !(B !)Ĭ>!!!9 !Mã !+Ħ!!!R!!!>9!!Ī !RĦ!!!ĐĦÕ!!Ĭ>Ĭ !H¨ !,Ĕ!!Ħ !&ĐĐÕR !&RĪ !Eã !-Rąİ !(ĐÕ!!!RĔ !)ĥ !KĦ !*ĐąĬRĔ !(ĥ !LĔ,!! 2& !&RĔ !Ux !(2!!ĐĔ !WB!ĶB!!!2!!ć !+Ė !MxB!!B !'Đ ā'!!!Ħ!Ħ !MB!ĖcBB!2!!ĖĦĦĦ!ı !RWc!ĖchB2BBB222!Ėı!Ħĥ !OBc!!.h c(2 !(Ħ !N7B!Ė!! 7(RR !U7BB!_ !(77R7!¤Ħ !Q7 !-7 !Vh!!R !`2 !/Ħ !SB2 !/¤ !RĺĪĖ !_Ė!Ė !aĖ !p¤ !Ç",
);
rawImages.push(
  "#c Ņc !Ņ !¼ÑÑ !`Ñ!!Ł !^Ñ!RR !`Rc¦' !]ÑRcCĪ !)ç !Kāāā !+C !TāBcc !,Ī !(é !JTTBB!' !(ÑRB !*¢ !HTTõ|öÖÖġġ !1é!!!ç !Fõð !(ġġ !/R !HTĖĦX!!ĦĦÖĬĬ!ġ!!R!B !,B !CRR!Rd$XĦ!BBĐ!Ĭ!ġ !0B !E¦×Rb!!B!!c,B(Ĭġ!B !*OéĹC !D¨Bµ !'¶c!!<!B8B !&vÙ !)B !CBÃ!Ėą!yRĆRRR!!!Ķ8B!!>ó³ !&¢ !EĖ2!ńR··!ĖĖĆ!!Ĭ!Ħ!!ļ !(Ùù!é!RB !C`ĖĖĔĔĔdX!ĖÖĆ<!!ĦĶ!C !'³p !NńB!!!ĖĆ<B!!!ěĬ!ù!!v!!R !M$c !&Ć<!!Ķ!!Īp!!ó !Mf!!!Ďc !'BĦ !*é !&C !D¨!!ă!!æs!c!!!Č !.O !Gã!!!¨!ö!Ď!X!( !'ĵ$ !&¢!!1 !Jã!ē!s!,(!!Ħ !,é !Kf!!¨Ė!*ĎĐŀ !.¢ !Kă!!s!A00!Ė ![pp!CB!!Ġ !]ń!B8!Ķ !&3 !)ŁĿď !NńC !(3!!.. !WB!!!B !&22.!!Ł!!Y !OńB!!!Ħ !&222 !&) !R2!İŀĦĥ!!Ĝ!!.!!!R !TĦĦŀĦĥ!!Ĝ22.!) !VĶĦ !^B!!!ĶŀĦ!R!Ĝ2 !UA!2!!!Ħ!!!R!!!) !`Ĝļ!ń !Sh!2!!Ķ!R !'ń ![ÕĔĔR !&Ė!ĥ !Q2!2!!ŀ!ć!Ė!ń !V22!!!ĖĐŀćąń !W2!!2!!!ĖĐŀć !&Ė !Tc!2 !&ĖĠā!!ĥ!Ħ !R2!s!222!!ĶĦñ !UW2!! B&RR!Ķ!!ĦĥĦ !U h(2!!ġ !Ud !*2B!!b !U2 !)222!!Ħ !TC!. !,Ħ !UC !(hBBG !UĺRcF !(GG!!!¤ !·2 !bĪ !cĪ !cĖ !,¤ !¸ĖĖ !p",
);
rawImages.push(
  "#c Ņc !Ņ !Ăé !ÄéR !_TT !'Ù !Y$ÇÇÕ !aÅ !&ĉ ![B!!!ñđZ !_ĞB ![$ÏJ!!8!RĎ ![Ħ!Õ !ZÑć$!ÇSĠ!!RČ2 !V»Đą,Ååą!B!B !Yn!!Ħ!]C)!!B !V»!Å!!ĆĖ!RC !ZĶ!¶!!R!R !YÅ !+Ħ !ZĦ !'B !WÑĶ!!!c !aĶRYĖ !È1B !¿)ĥ !&p !VÞ!!!2 !asĦą !&ĥ !WR!!æ !(ŀġ !VR!!2Ė !^*!!Ķ !)2 !Y2 !(22 !W2!Ķ!BC!!Õ23 !V»!22!Ħ !'2 ![Ħĥ!!·3 !XR !(|Ïĕ !]İ !gI !^Ħ!!H< !^ĐR !b|!C !YhR !cR !)Ī !X2BR!!!c ![WĦB¥¥cY< ![2!27Bį !]WĦĦŁ77ĪĪ ![2!!> !_W!!Ķ> !_G!2Bo !_' !d2!R !_ĪĖ !bĪ!> !bĪ !aĪ !bĖ !ĆĖ!",
);
// }
// Dog (Attack) {
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !Ņ !Ņ !¥Ñ !bsñ !aGĦñ !aszćññġ !1 ā& !JR!ļ!Ėġ !&đđđ !(ā Ė&Ñā !GzĖB×ĖĖĬġđđćļĆĆÑđıāāā!R!!!R2ā !&ÑÑ !BtBÍÍdöļ!!Đ!!!ĆæĖRRcc¶¶¶B2!Ñ!ÑÑR¶ !?TĖĥB!!ĥÕ½B !& Ħ'ææĦ)))!B!Bcđccc !?Ñ!!t!ĤĥĦ·Å!8!!!yX !(RR!)CdBRttt)!ç !:ÑÑġ½Õą!!ĘĦ·!cr!!XXBsÌX!RR!!!R!ĬĬCCĬĬĪń' !;ssĬą!d¿ĦRĖĖ÷ !'ĦĦĶ!sÝjjI!!!sń!ĬĬ!ń!!$!ç !9GGbbdą!Ï!s!Ĕ·÷ĦĦ!B !)R !/B !>ń~RBïöÿ¥õ!!BĦ!!Ħ!3!!!ïďď!ö$<<<ĥħ !CĪddBĶBððĠ!ĐB!!ĐàÏÏÿÿ!Ħ!!!ĥ!!!^^ħÑÏB !@ĪĪ'ÅGss!ŀRŀĐĐ !*CĠĿ<ĥĶ!!Ķ<!R !FGGhR!! R&ssBcddĶ !'ĪĪ!!¶cCB !G7 R&tt S&2!!!33Sĺ!!ĺ' !L7CCC! ĺ&Ě !'BĚ !''Y!B !I ĺ& !'Ě2BBBĚ !^ Ě& !*Ė !cR !Äĥ !ÅĦĖ !cĦ !`Ħ !cĥĦ !Ã¤ !cĦ !bĦ !c¤ !Ą¤ !Ņ !È",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !Ņ !ĤÑ !aÑBħħ !_BRĦ!ñ !^ÍzBĐ!ġ ![T!ĖtËĖĖġ!!!đđ·Ñ !QġT!ĖPń×ýÍ!!!ć!æ°yđ !NÑÑIõõs!×!ç!ì¦đ!Ć((ŀdāā!!āāāÑÑÑāā !Bss!!tÕ×·dôÇc°!!!ŀŀ(!!!āā!!Ė!!!ĖĖÑ !)ÑÑ !8G!!Ħ¿Ħ!Ėå¸PĘ!!!¥Æüŀ!(( !&ss¶sscc Ñ)R¶ !9Gą]2·4Åu!ĸP¬8!ĜĜR(ěBB(((B2B!IIYR¶ c&¶¶c!ç !9b!cÕ¤TĦĦ!4rr!Ħ !(BRR8(ļIBR!))YRRY))) !<'!]µÅĴ!!ĴB!!BĦ!Ħ!!!2! 3&!!!R!!!)) ń&'B !;'!ĶÏ·0ôĦÕ÷Ħ!B !&2!3!!BB!2!! ń' !&TBç !;'µĜÏĠõÕ÷!BĦ !+B222 !/C !>µh!ÑÑ!Ć!B!!B22!3!!!Ķ !'$$$ħħħ !DÇhR!ĠBĦ!!BC3İİ!!B !*ĥĥ^^^ħħÑ| !@Å!7hRŀİĐŀŀğ!ÖÜğR2İİĠĠĠďďĿ<MĶ!!M<!RR !C7R!!!Ħö¯!<2ïï ĵ'!333ĺĺĪ!!!¶c!B !C7¥R !'(!SS 3(2ĺĺ!!!Īĺ' !H7ttt¥Æ!L!ĺ B)Ī !*'Y!B !Eĺĺĺ77s(!! Ě) !Whb7 !4Ė !ąĥ !cĖ !aĦ !ąĦ!Ħ !Ã¤ĥ !cĦ !ĄĦ !c¤ !aĦ !ą¤ !ć",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !Ņ !åñħ !`T8!ġ!Ù ![T!BĠĦġ³!ĉ !WT$ńńĦ½!!ĉ!` !V$!s!×!ç½ĬJ! đ' !Pġñ!!Õ×·dĔç·!đĜĆĆĦĦáÁ· !MGR!ÕĦdÕĥÕ¢ńC!!!B!!ĦĶ° !NGąŀ4åBrĘĘ!ļ!Bc !'Üāđ! ā) !E]B¤ÕrĘ!!Ę!8,ļcccB!°2Bā Ė'ĦĦá !*ÑÑ !:'ĮÕ$ !)ļ!ļ((yÆüļCtsss¶scRR Ñ*R¶ !9ĉ!Z]Ġ$ !(B !'(¥!ī!(2B!IIYY¶¥ c&¥¥c!ç !8`!'!ĵĖ !)B !(R!ļdjYYRR!!)9 Y&99) !;Ù!'!,,!!!ĥ !,3!!Ķ !&RR !& ń''B !9³!!'ĵ!,,ĥ !&2 !'3!2!2 !'Ĕ ń& !'TBç !<'ĺ!!M !)333!22!Ķ !2C !?ĺ !'C333!!222!!2 !'T$$ħħħ !Fĺě!<<! R'BB222 !&ĖĖĖĥĥ!^^ħħħÑ| !BA!!!ĥĖĠŀŀ,,!!! Ġ&ďĿĿĿ<MMĶ!<,,!RR !BM!ĦĦĥļĚĦĖĖĠĠď ĵ&!!!33ĺĺĺĪCC!¶c!B !Aĺ3!,Ġÿā ĺ'CCC333CCĺĺ !&Īĺ7 !FĺSĶĖĖöáā!!!ĪĪĪĺĺĺĪĪ !+'Y!B !CĺRRĦ!ĖĦġ ![72!!!ĶČ !6Ė !GWR!s8¤ !^ªyR¤ !`b7 !8ĥ !cĖ !aĦ !ąĦ!Ħ !Ã¤ĥ !cĦ !ĄĦ !c¤ !aĦ !ą¤ !ć",
);
// }
enemyFrameOffsets.push(rawImages.length);
// Hans {
rawImages.push(
  "#c Ņc !Ņ !{ļĜļI!ħ!!ħ!)9u99 !QìĬĦB!ğħĻ!ħĻuĕ^ċ!!99 !QĦ3ĦĜĻĶČěĦ!ÂûĶĶĶ!!9 !MČĦ2ĖĵĦĦĖĦĦĶĶ!ûĥĥĵ!Ķ!!9 !KČ!Ķ3RĶ2!2 !'ĕĶ !QČ!Ķ2!!!222BB22!!Ê©wfv!!!9 !JĶ!B! 2+!VµĆĆĆĶUUUf} !GČĶ!!!BB32BB22BBþåĶąąą Ć&ĶĶTTT !J2BCCC S&õB2!!!ąąĥĥĆĮ!J:m !BČĶ!!!B!]ĦĶ 2(! Ć&ĦĶ!!CJJĞµÅĆ m& !B2!!!KKĶ !)RRBĦĖĆCc!!ąĖĖÕÅĆĆĮTuu !>2!2!Ľ!!; +&ğ!RttRssscĮJöÖRR·Ė!J!B!!u !<2!!!ĕĶĽ !(R¦tc! S&!!!ÕcÖÖrRJ!!ľľ*ľ !&ç !6Áā!2!Ħ !+Ĭ2!ccc22!!ľRRcccÖ!B:22ľ2} !8dñBÅ !&ĥĶĽ !(RZ22!!cc2!*××÷··¶!!2ľľ!ľ !9Æ!!!2!!!Ħ!ĶĽ !)ľľ22!ĶĶJĞ!Ķ2ssd !&*!* !9bÜBć !&2ĥ!ĶĽ!DDD !&Ĝóľò2!JĞĮ!!ĶsB!!*ľ!!ì!üü !2$RRRKÜG !'Ķĥ !(D !(3óóóěěóó2!!!ľ!ö*ľüüR!B !,ÁÁġÁR!Ę!!!KC2 !'Ķĥ!!!ĦĦ!!Ħ!!2 !+óó*!!ľsľět!CB !'łłł¤¤rĚĊwĆ-[!Ę !-Ķ!!!ąĦĦ!Ė !& 2,ăċ!!!Ĥ!!À!B!ç !(ĦáññāđĖĖĖ+ !&B2 !,3BB!!!D!Ĥ !.ĤĤĤ!+B!!!B !(ńā!ÇöĦĦBBBĵ[ÁÁĭą3 !0ĵ !9ĵ3 !*C!ç.2 Ħ&3ąĖöĊ2ĵ !/ĦĶĦĤ^ĭ; 2- !)3ĵ!Bć !)µb!!ĥĥĵĵ!2BöCĶB !0ą !6+!23 !)$!!Ėô2R2·C3!B!!'23 !1$Ĥ^!+ !++ !)22CB !)CåÎ!¦!B!ĵS2Ħæą!B !+2 !&ĶĦ!!ĭ! ++ !+2 !'CCC!!!R3 !'R!BB!3 !4Ĥ;!!!DD !'ĽĽĽ!!ĽĽĽ!!RCBć !)s¥s !&Ė!!B!2!dd 2&!!!2B!!!2B !'trċĭt·ĽĽ+!ğĖĽ !&Ā!R !)ĥ¦ľĆ¤!Ħ!3ĕB2Bd!!ĥĥ C&+!!2ĦĦ !(ČĭĽÜ¼!!Ü¼Ķ+!+R)MĦĦğğ!!ÊĻĻ!!!ģ!!R5ąĖĶåĥĵ!!ss !' ĥ& !)2!B!ČC!Ķ !(2ĭĭĭ!!ċ!}ç)!Ê!Ħ !)×b!!S C&!!!Ł!!ĖĖĦĶĶĶ!!!ąĦ!!!3ĤČC Ķ+!ĥ!!!ĵ!ĵÛxĵXĆBĆ!!22C!C¤û!RB¥¥B¥B!d!2ĕ22ĶĦĦĦĽ!!3BB!3R!Ķ! ĵ+!ĶĶĶ!Ķ!ĶĶĶCą¥æ !'4F!æ·SC2ĖĖc¥CBŁ2ĕĦ!! B&!!!2 !&Bĝ! Ķ+Są2ĵĵ!Ė!ĦĦ!!ĖĦ!c !'BgVVF6RRRûx6C2Ķ !12Ĥą!ĵ Ķ*!Ķ !(ĶĶĖ !'B!ęęęçç÷ÂÒĒsûû!!!6!ĶĶ !32Ė Ķ*! Ķ&!!!222!!B!BĦ !)WW'W !(Ħ !0ĤBB!!!2 !0R!222!RSc !/ Ė'Ľ!!Ķ !2B!B 2*!2 !'2BBB!!!BS !5ĥ !(22!!!BB!!B!2S3 2*!B222!!!333 !'2 !1ćąĥĶ !'2 !'B !* 2* !* 2'!2 !3b!±ñ !&2!!C !&Ĥ!Ĥ!!!ĕ2 3*! 3&!2+ !(2!2 !1·áBÅ!!!2!!C2+!ĤĤ!!!Ĥ!C! 2+ĶB !&3!!!2!Sĵ3ĵS !1Õ!2ć!!2!!C2+ !' Ľ&;!ĕ^ 2*!222!2!2ð-ğĐ!ĵ!ĵ !2ªcd22!2C2+! Ľ& !'ĽS]ě !*+222!;ĖğbĔ!!.__. !3GĪ!!!S2+ĽĝĦĦĦĕĝ !(Ľ---ÀĀ--ÀĀ<UUM !GĕBĵĵĵ!ĵĦ+!!UUUĦĶ!×tĦ!ÿ¿2!Ğ !-Ėĥ !2< !&Ħ!+!Ķ! Ķ& !&EĶĶĶkZĦĶĦ!ĦĞ!ĞĞB !@C2 !(Ķ !&2!!!E !&Ķ!ZZ!!!BĞBB!!!Ė !)Ėĥ !4Ŀ322!Ħ !(2!32ĽĖĖĖ!!ĖĆ2þ!!B!B!Ħ!ĤĖ !@3!B!!!2!223322!!ĥ!ĖµRc!!BBBĤĦĦĔôĖ !+ĥ !6Ŀ!3!2!!!+33222 !&R!¦2!!B!B!!ĔĔ !-ĥ!!Ħ !5Ŀ!2!!Ľ2!2B22ğğğ!C!Rc!!ĞBBĤĤĖ !.Ħ!!Ħ !7Ŀ32Ė!]Ľ2ğğğ!!!RR !&ĞBĤĤĖĖ !0ĦĦ!Ħ !7B!!ğĖğğ !(ü!!2ĞĞńĤĖĖ !1Ħ!!Ħ !8ğğ !.ü2!BBĖĖ !3¤ĦĦ!¤ !Fììôô !w¤ !c¤¤ !d",
);
rawImages.push(
  "#c Ņc !¼Tu !K)9u999 !.,,,!!} !HĬu!^ċ!!!99mmmT!! ,&ąąą!!ľ !=ìĬ!ļļ!!ħ)ĬĬ2!2!!fUUU%ĖĆĮ:,,ąąąÕæææ!!*} !>RĶ!ļĬĻĕĶĶĦċfľUĆĖĖĆĕąĕ!ĆąÕæææĖR¥¥!!î !<ČĦ2!Ķ3Ħ Ķ'!UĆĖĆĕąąĕĶ2S!ąæĖR¥¥¥·ddJ!R !;Č!Ķ3!ĶBĶĶ !&ºĖąąĕĶ2 S&ĕ!d¥¥·dddccs!!Bľ !9Č!Ķ2 !,ĖåĶ22SCĕĕĕąd!cddccss22!Ğ!!Ħ !:Ķ!B!!2! 2(å2BĖĖõĕ d&!!2ss22! Ğ&B!!B !8ČĶ!!!B !(222!2æ!¦¦d !'JĞ!ĞĞĞľBBBĔô!!ô !;2B!!2!22B22CB!!¦ !(RR!!ĞBBB ô&!!ôô !9Ķ!2!2!!2!22333!·S¥!!!RRcc22!J!ôôô !@Č!2!2!!Ľ]ĦS322BBüc¦Rcc22 !&ììĔ !F2 !'KĶB22ğğ!ü22 !& ì& !LõĶĽ!;+ğğ !& ì(IĬ !*ĬĬ !?Áā !&ĕ !&RRu !)Ĭ9ą! Ĭ*m!II !;dñBÅ !&ĶĶĽ!!!D!u !'ĬSĕ !+mü!!!I !CĕĶĽ !'u!!!ĬSĕ !JąxBć !&2!ĕĶĽ !'uu !6I !(ç !4x' !)ĕ!!!ĦĦ!åĦuC^C 2,!CC !>d !1Ħ3ą !& 3, !'+!IĬIĬĬ !1$RRRKdB !-ąĦ!R!!2! 2-!22!!!+!!!ĖCĜ !+ÁÁġÁR !'KC2 !,3BB !32 !'+d!cBt!ç!łłł¤¤rĚĊwĆ-[ !9^ċ^ !,Ľ+ !)+3!!B !'ĦáññāđĖĖĖġ-ÁÁĽB2 !0ĶĦ !/Ķ !3ńā!ÇöĦĦBBBĵ!ööĶą3 !1ą !/2!2 !)2 !*C!ç.2 Ħ&3ąB!Ċ2ĵ !2Ĥ^ċ^ 2+ !&+ !(+!BB !(µb!!ĥĵĵĵ!2BöCĶB !+2 !&Ķ !7+!; !)$!!Ėô2R2¦C3!B!!'23 !1$Ĥ^ċM !-+ !+CB !'CåÎ!¦!B!ĵS2Ħæą!Bdd S&+!!2B !&Ħ!!2ě!Ā-!!Ā-!+Ľ+ !)ĽĽÀ!!!CCC!!!R3 !'R!BB!3! ĥ(!!!2ĦĦ !(M++rń++rń+Ľ! Ľ*ğğ!R !*s¥s !&Ė!!B!2 !8·Ęĭĭ·ĘĽ !& ğ(!!B !)ĥ¦ľĆ¤!Ħ!3ĕB2Bd!! Ė(!!!ąĦ!!!2B!Ĥê!Ľ¼7!!¼7Ķ +&IuII !&Wêī!!!ģ!!R5ąĖ!åĥĵ!!ss!!!22 B&Ľ!!3BB!2!!!Č]ĭĶ !(^ĭĭĭ!!ċĦÀħ!!ļĦĶĶ !(×b!! C'!!!Ł !23BČ]ĭ !+Ķ!!!Ħ!ĵx7ļ9ĦBĶ!!22C!C¤û!RB¥¥B¥B!d!2ĕ !/3RĤĶĽ Ķ+!ĵ!!!ĵ!ĶĶĶCą!Ć!2!!!4F!æ·SC2ĖĖc¥CBŁ2ĕĦ !0ńĝ2! ĵ*nê3ĶĶ!Ķ!ĶĶ!!!S!2 !'BgVVF6RRRûx6W;Ķ !-2!ĤB2!ĥ3Ħ !+Ķ !(ĶĶĦ !'2!ęęęçç÷ÂÒĒsûû !'ĶĶ !3Bĵ Ķ*!!ĵĵĵ!Ķ!222!!!22Ħ !)WW'WĖ !'ĝ !@Ķ !&2!222 !4 Ė&!!!Ķ !,cń!!2 !& 2*!B !' 2&!!!2S !5ĥ !.DD!2!2!3 !+ 3&!2!333 !8ÜąĦ !1B !& 3* !(3! 2' !7±ā !)S !'ĤĤ!D!ĕB 2*! 2&!!+!!2 !'B !1dñBÅ !(S2+!!!Ĥ!ĖĤôC!+ !*ċ^ !&2!22!!SĥSĕS !:S2+!!ĤĤ!Ė!Ė!į!Č; 2* !'2!!à-ğį2ĵBĵ !1ąxBć !'2+ !'Ė !',SĽ+ !)Ĥ222!+!ğbĔ!!,ı_. !3h' !&S !&ĖĖĖ !)ğğĖğÀġğğÀġĖğğğĖĖĖ !At2+!ĭĽ999 !-¤ń!!¤ń !1ą !;ü2Ħĥĥĥ99,,mmm }& !H]!Ķ !&+üdąĕĦĦĶĥĹąąĆĆĆ Ķ& }' !D2B!!Ķ!!Ħ!Ħ Ķ&6åĦĶą!! å&ÕöĶĞľ m& !'uu !9R2!!Ķ!!!Ħ !&Ķõ!22ĆÅÅ æ'ĥĆ!* Ć& m&TĦ !'ĖĦ !3,222!Ħ!!! 2&!!!2Ć s*æc!µrÕÕÕrrrĆ!!ľu !:2!2 !&222!2!2!R !*s2!dc Ć(s!B2!!!Ħ !6,!2 !' 2't2!t· !*ĞJ!·¶¶ c&ĞBľľ !&ĥ !6,3!ĵ!2B!!!22cdd!Ć ·*!ľccÇd ·&!!2 !=Ŀ!!!2!333!!òsccc Ć*!*222s c&B !)Ħ !8B!Ė<ĕBàĠ33!ó222 s'ccc! Ğ' 2&!!Ĝ!ô!!Ħ !9<,!!,ğ¤AĿàı!ľēľ ē'222!Ĕ !& Ğ&!!Ę !'Ħ !A¤AĿôğô ğ'ìììĔ! Ĕ*!!sô!!!¤!¤ !Xôôô !'¤!!",
);
rawImages.push(
  "#c Ņc !Ņ !ßļIĬĬ !* ,& !OìĬuSõd2ļĬ !',ąą!!,,, !OMÂõS!2ļR!I,ą !),, !HČČĦ2Ĥ !&333!Ĭ!ĕ !&ąą c&T !FČ!Ķ!3!Ĥ!B!BB2!2!Ħ!!tątdÅÅ!!!m !FĶ!B!!!Ĥ!+!!2!C+c2t!Çc2ttÅ!!!mmm !AČĶ !)C !'2!CB!R!!cR!Ç!!22!!mTu !B2!Ľ!!2 !)ctR!2!!2c !'22!:!u !=Ķ!!!2ĥ!!Ľ+Ľ !'ĽÒ2!2 !'2ĮJ !&22 !>Č !'ĶĶĽ+ !&+!!!SĞ2!ââ!!!Ğ!ĞĞ!!óóó !B2!Ķĕĕ!!+++ !&2ĻēēĦ!óóó ě&óăĵĵĵĤċ9!¦ç !;2!!!ĶĦČ!!!D!! +'ĕĶ3ĥĥĥ ĵ&ĥ Ķ&!!!ļÛx!! ļ& !3ā- !)Ľ!!!DD !&ĭĖdĥ!ĶĶ Ħ&!!ĖĶĶ!ĕ!ĶĶĶļ9ÆĦÆÆ !2ñĖ !)ĶĕĽ!!ĦĦD!D!ĥ!!ĶĦ Ķ(Cĕ!!!D!ĥĦĦĦĶĕ¥æ!¥ !1d!2b !(ĶĶ!!!õąö$öDĖRĥĶ !'ĶĶ!ĦR22!Ħ !&ĶÖ!!¥ !3xBć !)Ķ !&3RĖĵ!Ķ! Ķ)!!B2 !&Ķ!ĶĶĶ !'Ķ !.$RRĵ°ÜG !32CĶ 2*! 2&!!!222 !/ÁÁġÁR !(CB !22! 2+!2 !&2C222B !&Ķ!łłł¤¤rĚĊwĆ-[ÁĲĲĝĥ !52 !,C333!B!BBBCR !*ĦáññāđĖĖĖ¥AÕêdĥ2 !,2!!!ĶĦ2! 2+ !*333!!Ħ¥S !&ńā!ÇöĦĦBBBĵ!ööú!3 !1ąCąd 2*! 2&!C!222!!!Sõt !&C!ç.2 Ħ&3ąB!Ħ2ĵR !'2!!!CR!!Ħ!K!! 3*Ħ 2&!!;!!!ĥRBĕtĵ !(µb!!ĥĵĵĵ!2BĖHĶSBRdddS+!!2 !&ĶD2ĶK 2*+ !&B!!ðı3dBBĵ !&$!!Ėô2R2¦C3!B!!ĥ2!SCĶĶĥĥ!!!ĦĖĖ!B!Ħ]ĥĭ; 2) !&Ĥ!!ĶbńĿį C& !'CåÎ!¦!B!ĵS2ĦæĦ!!ĥĥĵĵ !/]ĥĭ +)!+++!!D!)!!!Ðð==!CCC!!!R3 !'R!BB!3!!ĦĖĆĆĆ!!!ĥĵ!!!2Ħ!!];!ĘD!!ĘD!!!ĽĽğ©õõüü !&Ė !)s¥s !&Ė!!B!2!ĖĦ2BBBĽ!!!3R!2 !(ĽG!DĽGěĽĽĽ!!I··R!!ĬB!Ė !(ĥ¦ľĆ¤!Ħ!3ĕB2Bd!!!2 !.3B!!Ľ!ĶĶċċ Ķ'++ !&2·R!!B !'ģ!!R5ąĖ!åĥĵ!!ss!!ĕ !/3RB!Ľ+Ľ Ķ+Ľ!!!++3!!!B!!ĥ !(×b!! C'!!!Ł!Ķ !+2!!R!!Ĥ!Ķ!Ħ !+Ħ!++!!2+C!!C!!!22C!C¤û!RB¥¥B¥B!d!2 !.B!2B!Ľ!Ľ !22!!C!!!Ħ!!!4F!æ·SC2ĖĖcýWx6;ĕĶ !+CR !'Ķ;Ķ 2- !+C!!Ħ !&BgVVF6RRRû !7Ĥ !6+!BB!R!¤!ęęęçç÷ÂÒĒsûû$ń!!!ĝĶĶ !+cB!B2!!2 !/$$$ !3WW'WĖ!ń!!!ĝ !22 !& 2,f=BBBDĽ!!++ !2 Ė&ÜąąĶ !(B !)B !.UUĞ!!þ½ľM !;±āĶ !'BC !'Ĥ !)UUU--UUĶö!Bþą×2!ĖĖ !8ñBÅŁ !&BC2+!!!Ĥ !&LULEöÕĞJ:Ķörr!!ą×ľľ!u!Ė÷ !5ç!!Ç!!!2BC2+!!ĤĤ!!Ĥ*LĆå¤µõlJör1rĆc!!Ç!!!** !9¶õ !'C2+!D !'İÕ¤åĆ!ææ!ľrĆcc¶·!!*ľ !<¤īĜhĻĶ!B!+!D !'İåĖ!æææRÆ!*ccR·Çs!Ħ!***ľľ !?S2!!ċě ĭ&åtææRÆÆs!!!·÷×s2Ķ !)ô !>Ķ!!!ĝ2Ħ ĥ&!rÆÆs!S·ÇJĞs2ĶĶöĆ:!Ħľľľ !;]!22!!Ħ+ČBąĕĦĦĶĶ!RSS·Çs2ĶĶ!!ĶĆĆcc2JB!!!ô!!!Ħ !:2!ĵ!Ķ!Ħ Ķ'tccs2ĶĶĶ!!:ĞĮss2üìì ô& !*ç !3B22 !&Ķ !'ĶĶsdĆöĶ !&22J!ĞĞì !C,!2 !( 2&!!ľscc!!222!!ēĻĔĔ !.b !82!B2!!Ķ!222!22!Ò 2&! ē& !6B !4,2!!3!!! 2&BB!!ľóóēē !'ğ !1ĥ !8,<!!!2 !&2!!û²ûn !'ğğğ !5B !7d!!2!333!33!!BěnM!ğğ !6Ė!C !7ĿĿĖ<ĕBàĠ3àĠ!û!!ěôğ !7Ħĥĥĥ !;,ğ¤AĿ¤AĿĿğğğ !:ĦĦĦ !_Ħ!ĦĦ !`Ħ¤¤ !Â¤¤!!",
);
rawImages.push(
  "#c Ņc !¼Tu !K)9u999 !.,,,!!} !HĬu!^ċ!!!99mmmT!! ,&ąąą!!ľ !=ìĬ!ļļ!!ħ)ĬĬ2!2!!fUUU%ĖĆĮ:,,ąąąÕæææ!!*} !>RĶ!ļĬĻĕĶĶĦċfľUĆĖĖĆĕąĕ!ĆąÕæææĖR¥¥!!î !<ČĦ2!Ķ3Ħ Ķ'!UĆĖĆĕąąĕĶ2S!ąæĖR¥¥¥·ddJ!R !;Č!Ķ3!ĶBĶĶ !&ºĖąąĕĶ2 S&ĕ!d¥¥·dddccs!!Bľ !9Č!Ķ2 !,ĖåĶ22SCĕĕĕąd!cddccss22!Ğ!!Ħ !:Ķ!B!!2! 2(å2BĖĖõĕ d&!!2ss22! Ğ&B!!B !8ČĶ!!!B !(222!2æ!¦¦d !'JĞ!ĞĞĞľBBBĔô!!ô !;2B!!2!22B22CB!!¦ !(RR!!ĞBBB ô&!!ôô !9Ķ!2!2!!2!22333!·S¥!!!RRcc22!J!ôôô !@Č!2!2!!Ľ]ĦS322BBüc¦Rcc22 !&ììĔ !F2 !'KĶB22ğğ!ü22 !& ì& !LõĶĽ!;+ğğ !& ì(!!ç$!!ç$ !CÁā !&ĕ !&RRu !)IIRIÌGIIÌGRIIIRIuI !9dñBÅ !&ĶĶĽ!!!D!u !'ļĕ+Ľ !)DĶĶĶ!!ċĦçħ!!ļĜČü !:ĕĶĽ !'u!!!9!]ĭ Ķ*!ĕĶĶ!Ħ!ĵx7ļ9ĦBĶ !2ąxBć !&2!ĕĶĽ !'uu!ĥ!Ľ! Ķ)^ÚC!!!ĵ!ĶĶĶSą!Ć!2 !3x' !)ĕ!!!ĦĦ!åĦu!SĦĶ !*Ķĵĵĵ!Ķ!ĶĶ!!!S!2 !3d !1Ħ3ą !& ĵ*!Ķ !(ĶĶĦĕ !&2 !.$RRRKdB !-ąĦ!R!!Ķ!ĵ !+2 !&Ķ!2223!!22Ħ !)ÁÁġÁR !'KC2 !,3BB !( Ķ* !(2!222 !)łłł¤¤rĚĊwĆ-[ !EB !' 2&!!!2S !'ĦáññāđĖĖĖġ-ÁÁĽB2 !0ĶĦ!Ħ3 2*! 3&!2!3332 !*ńā!ÇöĦĦBBBĵ!ööĶą3 !1ąCĵB !03!222!2 !*C!ç.2 Ħ&3ąB!Ċ2ĵ !2KĶ! 3*ûn222!!+!!22 !&B !(µb!!ĥĵĵĵ!2BöCĶB !+2 !&Ķ!2+ 2+ !'2!22!!SĥSĕSç!!$!!Ėô2R2¦C3!B!!'23 !1$]Č; 2*!222!2!!à-ğį2ĵBĵ !'CåÎ!¦!B!ĵS2Ħæą!Bdd S&+!!2B !&Ħ!¡Č +*Ĥ !&+!ğbĔ!!,,đ.!CCC!!!R3 !'R!BB!3! ĥ(!!!2ĦĦ !(¡!!·Ę!!·Ę!+++!ĖĖ !2s¥s !&Ė!!B!2 !8ÕP!!ÕP! Ľ& I( !&R !'ĥ¦ľĆ¤!Ħ!3ĕB2Bd!! Ė(!!!ąĦ!!!2B!ĤěĽĽ÷$ĽĽ÷$Ľ+!ĶĶ Ħ&ąąII!B !&ģ!!R5ąĖ!åĥĵ!!ss!!!22 B&Ľ!!3BB!2 !&ĶM!iĻ!!iĻ!Ľ+2;222 !&ąI !*×b!! C'!!!Ł !23B!ĭ^û Ħ+!!Ľ;;2KC !)22C!C¤û!RB¥¥B¥B!d!2ĕ !/3RĤ!!! ĵ,DĦ!!!+!!C!C !(4F!æ·SC2ĖĖc¥CBŁ2ĕĦ !0ń!Č^ê !,ě!!Ľ!!!B !&C !'BgVVF6RRRûx6W;Ķ !-2!ĤB2!!Ķ! Ķ,!!ĵ !)+ !'ęęęçç÷ÂÒĒsûû !'ĶĶ !?C!Ķ !(B!B !,WW'WĖ !'ĝ !4ü²Ú !,2Ħ !(+ !4 Ė&!!!Ķ !,cń!!2!2 !/ĥ !)+!+ !7ĥ !.DD!2!!! 2( !(2 !'ĽĭĽĽĽğ !4ÜąĦ !1B!3 !) 2'M!2!!!Ľğįğğğ !6±ā !)S !'ĤĤ!D!ě333 !HdñBÅ !(S2+!!!Ĥ!ĖĤô2ĦB!! 3(!!!33!!!ğ !BS2+!!ĤĤ!Ė!Ė!į!ĶK !)33!22!+Ľ !:ąxBć !'2+ !'Ė !'ĿĶĭKK !)û;2!Ľğ !<h' !&S !&ĖĖĖ !)ĿįĽĝ Ŀ*Ľ!ğğ !Bt2+!ĭĽ999 !+ğĿ !*ğğ !Gü2Ħĥĥĥ99,,mmm }& !H]!Ķ !&+üdąĕĦĦĶĥĹąąĆĆĆ Ķ& }' !2Ė !32B!!Ķ!!Ħ!Ħ Ķ&6åĦĶą!! å&ÕöĶĞľ m& !'uu !9R2!!Ķ!!!Ħ !&Ķõ!22ĆÅÅ æ'ĥĆ!* Ć& m&TĦ !:,222!Ħ!!! 2&!!!2Ć s*æc!µrÕÕÕrrrĆ!!ľu !:2!2 !&222!2!2!R !*s2!dc Ć(s!B2 !&ĥ !5,!2 !' 2't2!t· !*ĞJ!·¶¶ c&ĞBľľ !'ĥ !5,3!ĵ!2B!!!22cdd!Ć ·*!ľccÇd ·&!!2 !(Ħ !6Ŀ!!!2!333!!òsccc Ć*!*222s c&B !)Ħ !8B!Ė<ĕBàĠ33!ó222 s'ccc! Ğ' 2&!!Ĝ!ô !&Ħ¤ !6<,!!,ğ¤AĿàı!ľēľ ē'222!Ĕ !& Ğ&!!Ę !'Ħ !A¤AĿôğô ğ'ìììĔ! Ĕ*!!sô !_ôôô !'¤¤!",
);
rawImages.push(
  "#c Ņc !£))) !^ČČ!!!)9 !YČČ!dĥĥ!!!9 !SìĬ!!Č !'2!2!!9 !TRČ!!!_Ł>.Ł!ĕĕĕĬĬ !OČ!2!!!__! s&^² !&Ĭ !MČ!!3!!_!***!*ľľ*²ËËīĦ !LČ!Ķ!!!_!*ą!Ķ!ĶÅĆĶ!ç!æë !MĶ !'są¬H!!Å¬H!!içcc !6 ü& !3ČĶ!!!BĘ!!d!!2!d!!2!!i !-ĬĬĬ!Ĭ9ĬĬ!!9!R!R !62B!!*þs<Lľ!k<LĶľ* !-R!!!R !&Ĭ9ąRĖRĖ !3Ķ!2!2!*ą!ö*ľľľ!*ĶÅĆĶ!RR !'ĬĬRü !AČ!2!2!!ą¬Hc!ľĬĬľ!Å¬H!!GG!!ĬĬĬ !3CB !52!!!d!!2 !(d!!2!!!ĬĬ !-2!!!C !>õ/<Lľľ!<<*ľc<Lľô!Ĭ !* C&!!!CC!!!C !6Áā !&ąþľľÅĆ!*ľÅĆ!ľ!!ĬS !&222 !(3!!!2!!!BĕS !1dñBÅ !'7!Å¬H!!Å¬H!!ôĬSĕ!222!33! 2&!!222!!2!!!ĕ !:ĕċd!!2!d!!2ôĬSĕ!2!333!!!2 !&2!!!22Sĕ!SB !1ąxBć !&2!ĕ/<Lľ!k<Lľ!!!2C33!!222 !)+ !'SSĵ3 !3x' !)ĕģĜ!ĦĦĮÝĦuC^3! 2&!!!Ľ+ !(2ÐĀ!įBBSM !2B !23ą !&2 !+222!2!!c!ğ!ğğÀ !/ħħTRmdB !-ąĦ!R!!2!2 !3AA !&B !*ÁÁġÁRrCõ!!KC2 !,3BB !.22!Ľ+++!ğĖğ !(B!!łłł¤¤rĚĊwĆ--|t !7^ċ^ !&22 !&Ľ!!Ė !.ö!!ããññÁÑą2ĶåĎ-áĽB2 !0ĶĦ !'22 !)ĖĖ !-Ė!!ö!!ń!!ħ½ĆÕ!ttąQêą3 !1ą!!!22 !*ğ !6C!ÇËRĦąĖĖC!ö2ĵ !2Ĥ^ċM !(àĀġ !.çC !+µĖC!!ĥĥ!!2CĶB !+2 !&Ķ !(ÀĀ!!BCń !6$!!ö?!RSæÆ!!B'23 !1$Ĥ^ċM!c!-ğAń !0R!!R !&ĥSąþĵ¦!!!ĥS2ą!Bdd S&+!!2B !&Ħ!!2ě!iCĔ !7c333!2!BĶ !'RR!3! ĥ(!!!2ĦĦ !(M++ğń !3B !'222!Ķ!cÇs !&ĖĖ!2 !Mĥ!!C!!!CĕdĮĆ¤!!!CĕBd!! Ė(!!!ąĦ!!!2!!ĤĤĽDI$T !:ģ!!sĩ!Ėĥ¥Æ !(22 B&Ľ!!3BB!2 !&ĝMě!ĥĖITT !/B!!!S !(×R!!CddBd!Ł !23c !)ĥ!ĖĖII !/Ħ!!222C!CÅáĦd¥¥cBsB!2ĕ !/3RĤ !&ĶĶXX!GG+õI !.Ħ!!2!!DBBĆ,s¶ĦĆĦ¥×>2ĕĦ !0B!!ĝnċ !&Ķ!!Ľ}õļ !/B22TD66ĪĚB!BÖě»6;Ķ !-2!ĤB2 !-Ķ!!Ľ}3Ĝ !*C!¤!ęĉĉçç÷ÂÒĒsûûh !&ĶĶ !1Ĥ !&ĶĶĶ !+SĜ !3WW'WĖ !'ĝ !;Ķ!!!Ķ!!!BBS !8 Ė&ĝ!!Ķ !)ġĘöĶĖ!!2 !4B)!!!Ĝ)I !7ĥ !(>ĩ*sssčĠö2 !*2 !,B))I !8ĥĥ !(>čÏkľ!½ÏkkB !)2 !,++BK!SB !6Ħná !&>!d!ö!!d!ö!!D !&22 !'2 !/R !3dñBÅ !(kľk2!sľk2 !&2 !)2 !*+ !@Nč*!22Ķľľ22µþ!DÁÚ!! 2' !.K !6ąxBć!!!čÏkľľĶĬĬľľµÏkľ!ccě2 !*+Ľ!+ !>x7!!!d!ö !)d!ö !&- !*+Ľ !)+ !>ľľk2!*<<*!sľk2!!!Bğġġ!ġġ++Ľ!!+!!!ĽĽĽ !=Ħ!22ľ½þ**!½ö22ľİSS!!ńńğGGĽĽ!++!!ĽĖğğ!Ľ !7]!Ķ!!!Gîľ½Ïkľ!½ÏkĶľ!ĶB- !'ğğ!!! Ľ&ğ!!!ğğğ- !>d!ö!!d!ö!!!Łı!ô !( ğ) !?BĶ!!!čösľk2!sľk2!ě !<Ė !4]2B22!ľ:ľ22ľ!ľ22ľĦ++!ğ !RµíľĶľ!!!ľĞĦ!ĝ !:ĖĖĥ !5,C22+!W2!ľľ**Ħ!!ěB!ğ !9ĥĦ !6Ŀ32!!Sâò22!Ğ!!ě !TĿ !&S3óĞĞ!ńń!B!Ė !:ĦĦ !8d!Ėğ!BBĻĻĻ!!K!+ !:ĥ !:ğĖ!!ğğğ!!!Ľ!!+Ė !;Ħ !@ ğ&ĖĖĖ !;Ć¤¤ !`¤!!!",
);
rawImages.push(
  "#c Ņc !¢ù))) !^ČĶ!!!)9 !YČČ!Ķĥĥ!!!9 !SìĬ!!Č!!!Ķ!2!2!!9 !TRČ!!!ĳĶē.Ł!ĕĕĕĬĬ !OČ!2!!!__ĦĖ!ss^² !&Ĭ !MČ!!3!!_ç*Ķå!*ľľ¦ēËËīĦ !LČ!Ķ!!!ĳ÷¬ąĖ!ĦĶll¶!ç!æë !MĶ !'ÆÏ¬ĖCÖlÖÖ¶!içcc !6 ü& !3ČĶ!!!BĘ!¥ö5!}!öB!!å!i !-ĬĬĬ!Ĭ9ĬĬ!!9!R!R !62B!!z½!<!!Ħ!!¶ýľ* !-R!!!R !&Ĭ9ąRĖRĖ !3Ķ!2!!o·KKĶļĦĶ!Ć2Ć[¯Ķ!RR !'ĬĬRē99 !?Č!2ĳģē2Ć!LL,mĆm}ööĆQ+SþĎù!ĬĬĬ !(9 !,CB !5EUUR¥sļļì2c2ìssc÷¥R³¢UĬ! 9&!ĶĶĶ!!2!!!C !>]Êč)ĶBì2ļ!Ķ¶ččåp!Ĭ!99!ĶĶĶ !*CC!!!C !6ÁN !&Čþ[Ķ!B!Ķc!Ė¯ľ!!ĬS9! Ķ'!!!2!!3!!!2!!!BĕS !1dñ¦Ć !'÷æ¥¶Rì!ÆsÖ2!ôĬSĬ Ķ& !&22 !&222!!2!!!ĕ !;ÆBãR}RjBæ!ôĬSĬĶĶĶ !*33!2!!!22Sĕ!SB !1ąxĥc !'LL©<2Ĭ2kÝÝÕ!9)ĶĶ !&222!33 !&+ !'SSĵ3 !3xĚ!!2ğ2!!Ò£B22öþîĦu!!Ķ!!222!!!Ľ;+++!!!2ÐĀ!įBBSM !2B !(ğ2!]!!BB!!!ą !&22!!!222!!222!2!!c!ğ!ğğÀ !/ħħTRmdB!!!2!!22!Ã2aĵ!!Ķ!!!2!!222!33Ķ+ !)AA !&B !*ÁÁġÁRrCõ!!KC2 !&ğ !&2!3R!Ķ!!ĶL22!333++2!+++!ğĖğ !(B!!łłł¤¤rĚĊwĆ--|t !*2 !'2 !&Ķ!3ĵ)<<<+++22!Ľ!!!Ė !.ö!!ããññÁÑąĖĖåĎĐáĽB2 !&2į!!!2 !'Ħg !'222 !&ĽĖĖ !-Ė!!ö!!ń!!ħ½ĆĕBtttQęê3 !(į!!å3!B!!ą!<V !,ğ !6C!ÇËRĦąĖĖĖC!öĵ!!! 2&Å!!!R !&Ĥ^ċ^22 !&oâġ !.çC !+r_C!Ķĕĥĥ!!2ĶB !+2!!!2Ķ !(oâ!!sbń !6$B!Ė÷!RB¬įz!!B23 !.2!!$Ĥ^ċM!s@-!`ń !0R!!R !&ątąĎĵ¦Cl!KĥS2!Bdd S&+!!2B!!2!Ħ!!2ě!©CĔğ !6c333!!Ķ2Ħ!!!Ć!!RR3! ĥ(!!!2ĦĦ !(M++ğń !3B !'222!!2c×s!!Ħ!!ĖĖ2 !/2 !?ĥ!!C!!!dõdĮĆ¤Ķý!ĝCĕB!! Ė(!!!ąĦ!!!2!!ĤĤĽDI$T !:ģĦ!Rĩ!Ėĕï½ï !'22!!!I¾!!3BBĶĶ !&ĝMě!ćĖITT !/B!!!S !(÷²!! d&Bd !&Ķ!!I !+3@!!) !&ć!×ĖII !/Ħ!!222C!CÅ¤Ħd¥¥¥cBsB2ĕĶ!!I !(Ħ!ĶĶR!!Ĵ!!ĶĶww!©G+õI !.Ħ!!2!!DBBĆ,ssĦĆĆĦćÒNĕĦ!!I !(ĵĶĦ!!ń!!Ķgċ !&Ķ!!Ľ}õļ !/B22TD66ĪĚBBBÖěě6;Ķ!!!I!ĶĶĶ !5Ķ!!Ľ}3Ĝ !*C!¤!ęĉĉçç÷ÂÒĒsûûh !&ĶĶ!IĶĶ !0ĵ!ĽĽĽ !+SĜ !3WW'WĖ !'ĝ!!!Č !)C !&B !*Ľ!!!Ķ!!!BBS !8 Ė&ĝ!!Ķ9LĜü!!!}ĘÕ3!ńsd !4B)!!!Ĝ)I !7ĥĶ!!ĦBüìĲ*s·sčĠö2 !*+ !,B))I !8ĥĥ !&mĦöĆÀ¿ľ!½ÏÏ÷B !)+ !,++BK!SB !6Ħn. !&µ!Ć!ĆlöĐ#ÖĦ!D!!3!++ !'2 !/R !3dñ¦Ć !'ccĦ2Ć!ĆåRč!!ĭD+ !)2 !*+ !@GčÍ!ĕŀ¤ĕå¦cµþ!^Úĕ!! 2' !.K !6ąxĥc!!!čÏ;õ!x~=!!!Ïkľ!ċċ!2 !*+Ľ!+ !>xĪ!!Bd!ĥçSs!!ĆĦ!!ö!!ccě !*+Ľ !)+ !=Ķľľ×öĕ~ëëáĦæSk2!!!-ğġġ!Ăġ++Ľ!!+!!!ĽĽĽ !;2ğď!2!õ±ë·cČ!õ!2ľ!!!B!ńńğgGĽĽ!++!!ĽĖğğ!Ľ !7]!Ķ!!!G[ö!Ût!!Æĕ!2K!İSS !'ğğ!!! Ľ&ğ!!!ğğğ- !92!!öõttssS½ç÷ö!!ĶB- !) ğ) !?BĶ!!²!tssýĭssčĶsRdŁı!ô !8Ė !4]2B2ģösĝąč2ľ!ľ2ĝąĖB+!ğ !OóBsãíľĶľ!ĥ!ľĞĦõwÉ !9ĖĖĥ !5,CBĦã!W2!ľľ**Ħ!!ěBÃğ !9ĥĦ !6òĦv!!Sâò22!Ğ!!ě !Rùp³ !&S3óĞĞ!ńń!B!Ė !:ĦĦ !5p!!d!Ėğ!BBĻĻĻ!!K!+ !:ĥ !:ğĖ!!ğğğ!!!Ľ!!+Ė !;Ħ !@ ğ&ĖĖĖ !;Ć¤¤ !`¤!!!",
);
rawImages.push(
  "#c Ņc !ãČ )& !Tù !'ČČČdĥĥ!!99 !RpùĬ!ČČ!2B!!2!2!!9 !RĹóÙ!2B2>Łã.Ł!ĕĕĕĬĬ !OìB!Ćē2>>!*!{s^> !&Ĭ !LČČ!!ºcæó×s*ÏĆĶ!!s²ēËīĦ !KČ!Ķ!B!!!æĶ#ą !(d|!æë !LĶ !&ã¥!µRĀĆĖ2S##čiçcc !6 ü& !2ČĶ!!!CBĘ!!Ķµö!!ĿĖå!Ķ!i !79!R!R !62!!!½BçĆõĆ!Ć¤¦R!* !.ĬĬĬ!Ĭ9ĬĬĬ9ąRĖRĖ !2Ķ!!!Yĥ!!sĽĖR~åå]ÇRó2Ķ!RR !*R!!!R !<Č !'Ħ!!ľ*!×»Ñ±ªĦ!Lľ*!GG!!!ĬĬŃŃRē9J !-CB !7Ią!öþRĦ!Ħ !&ö* !'ĬŃ99 !'ĵJ !'C !>ĽĪ*ą!ĦáÛÛÑB!HĶ!ô!ĬŃ9 Ķ'!Ķ !&2!!C!!!C !5Á_ !'ĽąĀöÅĬÇR»ąöv2!!ĬSĶĶ! Ķ&!!Ķ !'C!2!!!BĕS !0dñ¦Ć !(Ā!ąÇBĦ·Ç!ą!ľôĬSĜ!ĶĶ !,3!!2!!2!!!ĕ !;µdsR¶cŃ{×µdĬSĜ!Ķ !/22!22Sĕ!SB !0ąxĥc !'ìµ×sáĕ!!!2ĕ×Ķ!ĥ!Ķ !(2!!2!!!2 !(SSĵ3 !2hĊ !&ìæ×}Ñ!ĤÖýLľåõ!ó!Ķ !'22!!2!3!!!+!ðĀ!įBBSM !1B !&ďìĖ¥} !&¶Įîö!ąĕ !(22!22ĽL3!+!!!2BCğ!ğğÀ !/ħTRmtB2!!!c} !'´Ħ2!ĶĶ!°ã!222!!2!3!!;;2!;Ľ+Ań !&B !*~āÑ!RCõ!!KS22Ń}} !)ĶB2!Ħ!!¨Ĝ!!!2233+Ķ+ !(Ė !(B!!!łłb¤rĺÊê^-[À$!!BSĳ%ď!2 !,Ķ!!Sm22233+;22!+++!Ėğ !,ò!!ăãññÁÑąĖĖåĎĐá!Bf2 !0Ħ!! 3&!!2!!!Ľ!!ĖĖ !,Ė!!ö!!!33cħYĥĥSttÆęê3!!ď!2 !*22Ė<M;!!!;; !'ĽĖ !2ö33223ÇËS2ąĦĦĦSöĵ22!!!2 !(2!!!^ċM;;; !(ġğ !-çC !*B2r_2!2ĶĶĶ!ĶĶB!!ď !.Ĥ2 !*oâń !522$B!Ė÷!!!XĎXĶ223!2 !(CR !&ĵD+ěM!!oâ-!Ó` !0R !&c!!!ĆsĦĎĶtCĆ!ĆĥB!Btt¦LL24!2BBR!2!!!Mě!!úbĔğ !6c !)2ĥ!!!Ć!!R3! ĥ'!!!2ĦĦĆ3 !'M++ğń !3B!!!R!C222!!!c·s!!Ħ!!Ė2 !02 !>ĥ!!C !&cöBĮĶ¤Ķc!cCĦ!!ĖĖĆĆĆĶĴ!ąĦĦ!!!3!!ĤĤĽDI$T !;ĴĦ!RĩĶ!ĵĐÞĐ2 !&Ķ!YY !&BB !(ĽĽMě!ćĖITT !/B!!!S !'Ħ!÷²!!CRRR2¥ !&Y !'øą!BĵĶ!!ĴĭMě!!Ħć!ÇĖII !/Ħ!!22 !'Å¤Ė3¥¶¶R¥B2ĕ !*ö!!B!!RĤĶ2!ĶĶĶºwĶ©GMõIĜ !-Ħ!!!2!2BBcĆ,csĦææçÂNĕĦ!Y!!Ķ!!!Ħ !&Ķ!!!Vċ !)ĶěÂõBĜ !.ĹB22D66ĪĚBBBÖěě62Ķ!!Ķ!!Ķ !+2ń!ĵ! Ľ& !'ĶěÂ3!ļ !)C!¤!!ĉĉĉç÷¡âòsûûh!!Ľ!ĶĶĶ!!Ķ !'ąC!!!2 !*ĽĽ !(KSĦ !3xGGWĖ !&ĦĦĥĦĶY !(¹!!ĦĦ¦ !4BSļ !7ĖĖĖĝ!ĥĶ!!!Ķ!!!ĕĪ!!×cń!d !4B3!!!Ĝ)I !5ĥ !*G«sĦ!ĦľD!2 !5K))I !7ĥ!!ĶĶY!!!«*1!öĦö2!ķń !++ !*+!BK!SB !5Ħn.!!!Ķ!Ĳ1[ķ!22Ħįķč5D!3 !'+ !-+ !'R !2dñ¦Ć !'d!!õćĖĶ!Ė!k)!ĭgċg+++ !MG!ľ9tåąÁą!!ö2!^Úĕ !+2!!Ľ !(K !5ąxĥc!!!ČçKįįĶBĖĦĖą2ÇKttóċ! 2*!Mě !(+ !8x÷ģģ'rrąąÕåÁÑĶÑÁĦµµÖÖæÎħ.. !(+ě!!+ !>UEUĪ&2÷Ç·dË»2»Ë2tÇc¥¥¥Ņĕĕ!!Ăġ++Ľ!!+!!!ĽĽ !=Ħ!!Hĥ1R!RBRd!ąĭĥą{{BńńğğgGĽĽ!++!!ĽĖğ!ĽĽ !6]!Ķ !&Gd!ķÕddËdąĖ{!!İSS !'ğğ!!!ĽĽĽĖğ!! ğ&- !72 !'ľ!dRRtRd!įľ!ĶB- !) ğ( !?BĶ2!!!ąĿčbč!õ!bR!!ěŁı!ô !8Ė !3]2B223!ľĝkķs¥·!!11!++!ğ !RWíľ)ľ!!1!!ĦĦĝ !:ĖĖĥ !4,C22B+!W2!ľíR*ĦĦ!ěB!ğ !9ĥĦ !5Ŀ32!!3!âò22RĞ!!ě!!Ė !PĿ!ą!BSS3óĞ!!ńń!Bğ !;ĦĦ !7<d!ğğ!BBĻBĻ!!Kğ !;ĥ !:ğĖ!! ğ&`ğĖĖĖ !=Ħ !aĆ¤¤ !`¤!!!",
);
rawImages.push(
  "#c Ņc !Ņ !}ļĜļI!)9u99 !WĬĦB!åČĕ^ċ!!99 !Tì!Ħ3Ė!RÂûĶĶĶ!!9 !R¼sdĖĵĶĶ¡ûĥĥĵ!Ķ!!9 !PČ!3+RĶ!!!ĕĶ !VČ!Ķ !*Ê©wfv!!!9 !OĶc!!222B!VµĆĆĆĶUUUf} !LČĶ!!B!B3RBþåd!!!2ĮĆĆĞĞTu !P2BCCõBąąĥcĞý!J!BB!u !HČĶ!!B!!]ĦĶ2!ĆĶ!!ĮJ¦J!Bjľ*ľu !GĶ !)KKĶ!!ĖĆC!öĆ!Bjć2ľ2* !J22!Ľ!!ù;!Rssc!ÕÕ!!·ľľ!ľ !H222!ĶõĶ!!ö!¦tSS!!ć·!!s!*!*!!üüĬRļ !+ç !6S±!!!2!!Ľ!ã!8222!!ľąB!!*ľ!!ľü!Rmĝ!ļz !>BB !'ĥ!!!ù!8cR!J*×!!ľ!ö*ľ!!R !'Ķz !@22!!`!Ľ!öù!ĜĬ*ľľ!*!!ľsľ!ÚR !&3!2Ķ !=BB !'éĶ!!s!ùD !&Ĝó !'Ú!!CC!!!S!!j!!!üü !4$uuħÜB !'ĥ!Ľp!µ!D!!ĦĝnûÚÚÚûCCC !&2 !'üüR!B !.ÁÁġÁ!!Ĥ!!nC !(²!!pĦĦ!!!ěnûĥCCC 2(!!!2!!!It!CB !+łO¤rĚĊwĆ^[!ĤĤĤn!ÃÃ!!ĦÚ !&ąĦ!Ħ2!!C!22 !*2!!!į!!À!B!ç !(łf4áññāđĖĖĖÑÑ!!Ĥ!!s !(D#!Ķ!Ħ!!!22 !(22 !&ğį!+B!!!B !(łńāāÇdĦĦSBBĵÆ!ÁČĭ!ÉU !)Ą32Ħĥ!Ĥ2 !& 2&!!ĽK2B !(ĵ3 !*C!ħĦõĦSĦĦĦ!2!Æīĥ !*ĉ!!!BĶ !(22!!! 2&!Bğ !(3ĵ!Bć !)Ö¥!!ĥĥĵĵ!R!söĶS!!ē !&s!3!!!Ķ^ĭ; 2,BI !(+!23 !,ĆB2RSjC3!c{!!!B!!U !&ö !+B 2+!!ğ !)22CB !)Cĕs!¦ĥĦ!ĵS!¾ľæ !-2 !&Ĥ^!į2 į'ğğñğĶ9 !*2 !)C!!!R3 !'R!ĆþB!!BB!³ă!!!×!d !'ĭ!į!!!Ę!!!P!ÿÿ 9&ĽĽĽ!!RCBć !)s¥s !&ĖYcBB!!CCBsB!!Ė!21 !&Ĥ;!!!ttå !&Ė!! ÿ& ğ&Ā!R !)ĥSRĆ¤CB!3ĕďRÞ¾!!ĥĥCÊ©¡Ă!!¦ĖĖ !&ČĭĽĽìÜ¼ĭ!!!R !,AĖ !+cĦąĖĕďĥĵ!Ħ!ÖĦ !&ĥĥĥÚæĶ !)ČCĥĕĕĕĥĥĥüĭĭĭ)j)) !&üüü !,¶Ć!!SCCC;Ħ!®:S!ĖĖĶĶĶĥ¥2!ĆĶ!!2ČCĥ Ķ)SĶĶåcĖ!}ç)!¼BĆ!ú!CB!!!2!Cc!÷BĥB¥¥J!!Zd!Ħ22ĦăĦSĆ!!cĶR!!ĶĥĦĶĶ Ħ&Sĕĥõ×õĥĵÛxĵ9¥æ!Ć!Ļ !'ę4F!æÆSC2ĖĖcÞ!ĮŁ2ĵ!³2U2¡ÊR!Õ!!C8!ĦĶĶĶ!ĶĶRĕ!!ĶĖ Ķ'CąĦ!!c !*ęĴ4gVVFĪRRcî»Wĥ!Ķ!Ù!!!ê¡ !'ĥą!Ħ Ķ&!!!ĶĶĶĦ! Ħ'!Ė !&B !*ęęç÷ÂÒĒsË»»!!] !&Ã!ē!ê!µS !&2 Ķ)! Ķ&! Ķ'!!B!!BĦ!RC !+WW'Wĸ !'Ħă!!É!U !&ĕ!Ĥ2!!222 !*2 !*S!c !40 Ė&Ľ!fó!ó !&`!B!!BB!B 2(!222B! 2'!R!RBS !9ĵĶv!v !'Ĥ!R!!2S2!! 2&3 2,!!!2!!2 !6ćąĶ !'2!!ù!3!DĤ!! 2'!! 2&R! B'!!!22 !8Ö±Ķ !*p!1B!!!ĕCB 2(333!! 3'22!22!2 !6BB !+ùÙĤĤĤ!C!2C222BBĕB!!tĕB!222!dĵS!!t- !522 !'22Ķ!pB!!ĖĖį!ĕ2SCC333!B2Ķ3BB!!2ğğSĵSBġ !6cc 2(C2+!gĽ!RR!,,!!22BBB+!2!Kįğįįğ!!ğ,ğġ !7bG !'S2+ĽĝĦĦĝĽĽIÁ) ğ'ÀĀ$-MMD!R !*ĥ !=d!+Č!ĵ !&+6¥!I!!!}ÿ¿ĦĶĦ !1Ėĥ !4<!!!Ħ!+üSąĶĵ!!+ÜġNVúI!mĶĶ!kZĦ !FC2!Ħ!!Ķ!!!ĶĵKĽs!1cĆúmĖ!!Ķ!!k!!!Ė !,Ėĥ !6Ŀ32B !+ą!!¶nĦĖĖĥĖ!!Ķ!!!Ĥ$ !E3B!!2 !)æ¶!Ćn !+Ħ$Ĕ !-ĥ !8Ŀ!!Ķ!!+222!!CRs!!Ħ= !+Ĕ !-ĥ!!Ħ !7ĿC2ĽmČ]333!BCSs!!!RC !'ĞĔ !-Ħ!!Ħ !9ĿĦ!Ľ]Ľ222ĭ+!!S¶BRüRR !4ĦĦ!Ħ !9Ŀ!!Ėğ 2&ĽBBBS¦,!ü!!!2ĞĔ !.Ħ!!Ħ !;ğğ!! ğ& !&ğğ!!!üüüìĔ !/¤ĦĦ!¤ !B ğ& !{¤ !c¤¤ !d",
);
rawImages.push(
  "#c Ņc !Ņ !{¼¼ļI!)9 !Z¼Æs3M92!9 !X¼ÆĆR!ûĶĶĶ!9 !XÖâ3ĕĥĥĵ!Ķ!9 !U¼!R!åĶĶ ![Ķ×!!!ĦÊ©wfv !Y2!B©öĮĮĮľ^!9 !UBdÚg!J!BB!!^f} !Sc!!2õJ!Bjľľľ!ľ !TB!K3!!Bj·2*2*!ľ !VK!!!·kľ!ľ!!ô !S2!Ľ !(*!* !VĦõĶĽ¦B!c*ľ!!ľ !&ù !(üüĬRļzz !DĶą!/!!*Ķö*ľ!Ĥ!!!p!!!üüü!Rmĝ!ååzz !C³ĕ!*!!*sľ!Ĥ!R !&üü!!22 !(ğĶz !@ē!ÉĖĶēĤ ç'!DDuĬĬü!!22!2Ķ!!3!!!2Ķj !?U!!!ĥ!!!``!!D!!!CĖ 2(!2!!!SS !+ç !6RRR!Ķ!!Ħ!Ľ`!ĉ¤¤!!ûû! 2&!22SC!!2 !(R!!!ü7ü !3ħT$$!!!ĶĶĶĢ!!!¤ĦĦĦûn!ĕ 2'CC !'22 !(üü!R !1łrrqõõ3$ !&Ķö!!ĉĦą!!2!!22 C&!222!!2 !'į!I·t!CBć !.łńññđLLäõ!!pē!º!!¤ąĖĖ !&CC!!!22!22 !(ğį !'×!B !.łńÇ+ĦĦBBĀ§!!öU !'Ė2!!!Ĥ 2(!22!!ĽK2BB !'+BB!!!B !,łńħĦĖBSÕ¶!¾!!%!!!Âĉ!uBRõ !' 2&! 2&!Bğğ !+ĵ3 !/ö¥ĭĶõc!B !'Ó!Ê!·ô!!Ħ^ĭ; 2)!!229!II !+3ĵ!ć !.bRjÿ¦BZ !'¹ !&u !(B22! 2&Ð222!!ğ !)B!23C !-CQ¦dĦj!!ĎĆ!!!ē!!>Ė!c3!B2^!į2į2įÀįįµ ğ&Ķ9 !(22!22 !-C!B!!!¦¥!ĆĶ!c!R!!ĪR!!!ÕCĔ!ĭ!į!į!µ !)ÿį !*2!2!B !-ts!!åæ!cBÓCÓÖ¢o¡Ė!cR!Ç!Ĥ;!t·Ę !(ĖĖĖ! Ė'!ĽĖĖĖ !0ĥ¥Rĕħ|ÝÞk®ÞõĚĚ¶cs2!ĆĦ!óĽČĭĭõÕP!!!ĖĖĖ !+ĖğğĀġġ-!2 !.ĦĖ*ĭÇk¶!!ÃNNĆ¥cĶ!!!BČĕ!ĥĥüĭĭ !EsĆ!!CÍ!JĎġUĆ¹¹ĩĦR!!!7C!ĶĶĶCåRĭĝSç))¼Ĝ¼ü !/3 !+ĩUc!ïĶĥdĦ!Ħ!c¹ĆĆ/V!!!7ĶĥĦĶĦSõ×õĥĵÛxĵ2¥æ!Ćü !7¹!ę4æî¦t2!B¥¦!ccRF!!!´Ħ!ĦĶĦRĕĶ Ė(CąĦ!!c!I !6Ó!!ęgV&RÜ«HĬõ!!!2!!!Õuą!ĦĶĶ!ĶĦ! Ħ'!ĖĖ!!!B !;ç÷FË r& !*÷Ĥ!2ĖĖĦ!ĶĶ! Ė'!Ħs!!BĦ !-R !.%!!¥!Ė!!!Ķ!p !'Od!!R !&2! 2'!!S!c !<¶!!O!!ĖĖĖp!ĖpB!¡!ĉBB!BRB!2B! R'!!!RBS !;Ó!!!¹ !&Ė!ĩĖ!!ê!!Ĥ2S2223222B 2&!B !&2 !>¥ !&ù!!ĩ!!Â` !&22B22R!B R& !&2 !@O !*B!Ê!`ĉ!ĕCB223!! 3'2c!R2!2 !DĖ!!C !&`C!2C2ĕBtĕB!222!dĵS!!tğ !Că !)ĉ;!ĕ2S3!Ķ3BK;;į!ĶSĵSĿğ !DfĖö2!+!!`!]]!!B!+BĦ!!Ė!ğįğ,ğ !ER!Ħć!åÜüĝĽI!! ğ&ĖğòĖĖ !3ĵ !;Ħ÷!åB¦¦cB!II!!ę!!!O !*TTuuu !+Ėĵ !6öć2å¦CĦĆĦĦĶ !&O!ù !+TJJĆĆĖT !&AĶ!!!Ķ !8åR!!ĵĵĶ !*p !+:Ķ!kkĶĦT !(Ėĵ !:SåĥĶ !&F !0m!!Ķ!!k !+Ķ !9B!Ķ !'ĺ¥ĖI !/Ė!!Ķ !,ĵ !8cĦ!!!Ħ!!;åġN6úI !;ĥĶ!Ħ !62!!!2Ķ!]üs!ącĆúI !-R !-Ħ!!Ħ !7mõmąB2mü !&RĦĖú !,2 !'þB !(ĦĦ!Ħ !7c!m!B!!!¶¶Ć=R!Ė !,ì2!!2þ!!Ĕ !&Ħ!!Ħ !8,ĝĭS!!C!¥!!Ć= !/ì2Ďþ!BĔ !'¤ĦĦ!¤ !8Ŀįį<!B!!¥!!Ħ=Â !.ìĴĴĴĔ !GĖ+dCCÇcBRğ !:¤ !@ĖğBBB¦¦, !<¤¤ !@ ğ' !@",
);
rawImages.push(
  "#c Ņc !Ņ !§¼¼ļI!)9 !Y¼¼Æs3M92!9 !W¼!ÆĆR!ûĶĶĶ!9 !U¼ÆĀÖâ3ĕĥĥĵ!Ķ!9 !U3!R!åĶĶ !Y«×K !&ĦÊ©wfv !Y2!B©öĮĮĮľ^!9 !SB!!dÚg!J!BB!!^f} !Qc !&2õJ!Bjľľľ!ľ !RB!!!K3!!Bj·2*2*!ľ !(É !J]åĽ!!K!!!·kľ!ľ!!ô !(Ã !M9 !)*!* !)ù !Hv !&]ÕĶ!!¦B!c*ľ!!ľ!!üüĬRfļI!ù !Dó!!!5!!Ħ9!/!!*Ķö*ľ!ºü!Rmĝ!!ĕzp !)ç !@ĳ!!ĥĦ!!*!!*sĜ©º!22mĝĥ!!!ğj !K¢Ķ¹ò¿ĤĤ!ěÜ2ĶĶ22!ĥ!!!SI!j !)ç !Bé!Ó!¢!D!åĶĶ!2!2!!CSS!!!į !'ç!B !;%!!%5!¢!ĥ!!DDûû! 2&SmüC2!!+Ėį9R !'B!ç !:Ń!!¶Æ!Ö!!!Ådûną 2' !'22 !Hø!Óâá5SS!d£2!!Ķ222C2!!!2 !'Ħ9R!!!B !>qŀŀđ!BÂ!¨£3!!!dCCC!2!C !*Ķ !&ĻĻĻB !7%!!!ŀĆĦĦ=!Ê!!ĖR!Ĥt 2'!ĽKR2BB!2!!Ķ9züü!R !9Ń!!łĆįĦK!ONNĆ!B !)222!ĿBğğ!Ŀ)!!ĶĖ·!tCB !<ľ9cÞ!æĚÆc!!^ĭ; 2'!299!II !'Ķ!!tc!¦B !;*!|B!º!!!2!Ĥ!!B 2'Àā2!!ğ!IB2!!BĦBĆ !8%%!%%Y¿¿!Þã_NÆĆB!!^!į22Ðāį×!ğğğ!!ğ!BB2 !&BB !6ŃŃ!ŃŃčĮÍ®®¨ĚĚÆcC!!Ĥĭ!įį×!!ĤP !(ğğ22įBRB !>ZßÞÞãNNÆĆÇÇĉĉ;!ttöP !-ğ2 !&Rġ !9è!þ¬¬* !+`ĽČÜÜP !(éIII!!!ğ!R !=£%Ç¿ďJ s'cÅÅ`Čĕ!ĥĥüĭĭ!!!é!ÂÂÂĖI!!I!!R!!2 !9ŃİÍj½öövÓR!ĥ!ČC!ĶĶĶCåRĭĝSĔVVVO!ïI !&Ħġ !<ĩ¦ÏĶíESĽ!!ĖěĶĥĦĶĦSõ×õĥĵÛxĵ2KR!!ïĖïÐñđ !=øīĎ¦+ģNNÆ!!Ħ!ĆBĖtõ2ÅCĦĆÆÆĆ; !Gq!īû¾¨ĚĚĚB!ą!Ķ!Ħ!ĦĦĦõĖĖ!!À!!!R !Bv !&vË!ĶÂ!2R!2Ħ!Ķ!ĖĖĖ!Ħs !23 !8ó!!%!óè!ÒÊ!!d !&2!222!!S!c !JŃ!%£!fĢ!BBB!B!B!RRR!!!RB !LŃ!!!F!pç2S2322B22!B !RĶ!Â !&B2R!BRR !&2 !Kv!!mĦ+Ó!`!ĕ22!!333¦c!R2ĝ!!!Ė !Fó !(é!S!dĶ2ĕBRĵ!C2dCB !Nã!!¢!+Sĕ2S3!Ķ3BK;;į!ĭĽĖ !KU!!!Ľ!+]!!B!+BĦ!!Ė!ğįğ!ù !Gv!!R!!Ľ!ÜÜüĦ!R+!ğğĖĖ!!ę!!!p !&Aĥ !Aó!üö!!!åB¦¦cB!IĖ !(O !+ts!!ĵ !?öć!!å¦CĦĆĦĦĶ!z !&ù !,TJĆ !A«¥+!ÜR!ąĵĵĶ !*p !,J!kĦ !A¦!!!Są!St©R2 !2} !'Ķ !BB !&ĺ¥ĖĖ !3Ķ !CcĦ !(åġN6úĖ !7Ħ !>2 !(°s!ącĆúĖ !0þ2!þ !Amõĝ!mąmü!!!RĦĖú !2þ!B!Ħ !?mĵČ!m!!¶¶Ć=R!Ė !0Ĵþ !E,,ĝĭ!C¥!!Ć= !3Ĵ !&¤ !BĿį!B!¥!!Ħ=Â !2Ĵĕ !GĖ+CCÇcBRğ !3Aõõ !FĖĿBB¦¦S !5AA !H ğ' !8",
);
rawImages.push(
  "#c Ņc !Ņ !º¼¼ļI!)9 !Y¼¼Æs3M92!9!!ĸ !T¼!ÆĆR!ûĶĶĶ!9!t !S¼ÆĀÖâ3ĕĥĥĵ!Ķ!9!Ù !S3!R!åĶĶ !(¥B !Q«×K !&ģÊ©wfv!!!B !U2!B¬öĮĮĮľ^ !UB!!dtg!JúúúÚÚ2c !Rc !&võJúd m&+ !SB!!!K3!úd+Ľ ĝ&p¢ !Q]åĽ!!KOd+ìõ ĕ&üĭ !T9!!!+ì!! ö&!ĥ9 !Q]ÕĶ!¹!!!ööÇçððmC !TĦĈºĳ!ö!ÇÅ¤ììÜ; !Tĥ¦ĕĶ!!ÇÅs×d}°ĭ; !S?sģ!ĽăĥsĦĕĕüČ; !Tĥ!ĖÆĦ!æĦ !'ĭĭ !R_¦ÓöéĕfRB2 !YsD!²ĶsĖĶ2 !ZĦĚ!!Ķ!!Ķ!!!3!; !Qá¦õą!!!d!!dCCC!; !Qŀzs!Ė!Ĥt2×! ą'ĭ !PłĆ!!S !'µ Ć'2 !UæSÂĭ;µ!cc¥¶Ç¦BĽ !QCöRSã !'B2!!Ė !Qń¦!s!!¨^!!c°m]]KKB !WÇĭð° !(ğ+ !Qc !'Ģĉĉĉ !VEå!¶R!ą¢`VVVČĭĭ!!$× !RÖ!öÇéČĕĕĕ!ĥĥüĭ !Qĩ!!!s!ÅEC!!!ĆĆĆĖå!B !PiEöÅĴěĶĥĦÖÖĖĖ¦ÀÀń !RRs!!Ħ!ĆB!!s×;!!!r !Q2Ê!!ą!ĶÖ!Rd; !WĶtR!2ĦRR!; !Xĥ!d !'À !YĶ!BBÖB¦À ![Êtæ!Ç; !*Ę !RĶ!Ê!¶+ !*$ !RmĦ+¤!] !_y!¶ !+Č !W] !*Ľ3 !TĖ!ð !*Ľ+Ģ !TR !*ĽI+ !Uüö !)9B!ID!!ĥ !Qöćð !&ĝĝĦĦĶ!'!÷ !Q«¥+!ÜČĽÜĵĵĶ !X¦!!!Są!St©R2 !YB !&ĺ¥ĖĖ!!Ħ !RcĦ !(åġN6úĖ!!ĦĦ !P2 !(°s!ącĆúĖ !Smõĝ!mąmü!!!RĦĖúĖĖĦ !QmĵČ!m!!¶¶Ć=R!Ė !U,,ĝĭ!C¥!!Ć=!!Ć!¤ !TĿį!B!¥!!Ħ=Â !YĖ+CCÇcBRğcR !XĖĿBB¦¦S!RB !Z ğ'!`?!",
);
// }
enemyFrameOffsets.push(rawImages.length);
// BJ {
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !Ņ !Ņ !F×ÇÇÇ××× !Y×¦ÖöĆĆĶööd !XĖĆ¶¥!cĆ!!!ç !V¦Ħ¶[[!2!sBB !VÇöĖĖ½Ýs!¥tĦRBćć ç)ħćħ !IĦ!øÇsR··ĆÅ!!!d B'cBBĦBtu !AñÁñ!!!Ç!RA!Ķs !(dRCĘBBBCBBd!!!RIIęļ !8ÕāāıcĆæÑÑħĦ!cåµ!Ħĥ!!Ħ!R!!RµCCC!CC!C!!!2+!S !7ÅĶĚ!1sBÕræm,!Ħ!RB!!ĥÏïm!RB! R+!!!Ŀ!B+ !9_Ö!RđĦ!ąąÕ,!c2!!!m!2ö±B !&ć !+ĉ!g !8ĶĶúV!ÅÛRBæ2!BB!!!$!ĦĶ!2 !&B!b Ė&!!õµD`!Ŀ !8ĶĶÂ_¦2Q¦S!!¦s2!!!ń!¶¦Sc!!ĦĖÕõÕ ą&ÕQöBĦD !(IIę !3Ê!!ĶėÆ!!!å!R!!Ķ!!ç¶¥s!!õĥĦĆ Ė'æRsC!ĦIIĝ)zI!ò© !3ĦĊFç±cĦ¥ĶS!!B!ĶĦ!ĬÍí½HĦ!ĆĶĦĖĦĶĖĦR!ĦąĖĖ!ĖBĒ!ò!Ħ !222²_ĢĶWĕĵ·×¶( !'Ħĵ!!ĦĦĖ!Ķ!Ķ!ĶĶ!ĶĖ!öĖ!!!22©!©2B !2×BRcÖ¶Ħ·×R¥iĦBö!!cµ!!Ė!!!ĦĶ!Ķ2!!!2!Ħćç!!!âBB!Ŀ!©â !2·''7Ćc¥»»(!BĆĶĶ2r!C !(2!2!2Ķ!Ķ!ć¦ç!R!Êğğâ!Ķ!© !6xËx!!A!öĶ!2s!ćBĖR!!RBB!BBBÇRRR¤q¤R!ğğ!ĉ`Ė+ĂĿ !<Ħ!Ķ2!ö¨Ę!sBB!!tR2RRRĥRRRsöĖ!!ĖĖĖ/Ė!Ė/Ė !=ĸ2!2çąµBĦĤïďBBt d(··t·!ĔĔ !Eb@22¦!ĦBĦ÷đs!ôôĔ ń(ĔĔĔńń !HcBc!!B×!rÖö' !VABCR!Ħr!!×' !XAń Ĕ(Ī !Ņ !Ņ !Ņ !Ņ !ĥ",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !Ņ !§ d&t ![ddBĨ!!!-ĠĠ !W×!!R´!!¯õĦĦ~ !U×;!!RR !'çR !T×;Ý!s!!s!!cçRc !TöÝBsR··çąiĆ¶cW !S¦!ÈÇ!Bõ!Ĕ!!iWW!!ććć×çt×çħ$T !IA¤ĶĦĦ!T!!ħTT$ćĖĖö!öR!BĦ!ĖRII!!!II !?Ħ!¤!ĶĖBõĖT$ĦõõõĖ!ĦBĶ !)$R2IYY!òj !8ñÁñ!!¦ !&ĶĦĆĦĥĖ!!CĦ!øĦ!ĦĖ !*âB2Ŀ22Ħ !5ÕāāıcĆæÑÑ!B2c!!uĖĦĦ !&Ė!q !.`!2!!2B !4ÅĶĚ!1sBÕræĐ,ÐĆc2äRBĦĥRdąĶ!!2!2R!!2!!ĥė!!Ò2!!!© !6_Ö!RđĦ!ąąÕĦR22!!!cĆõ!!2!B2BĶ!R2B!!!Q!!pğ!įį2į !3ĶĶúV!ÅÛRBæ2 !'2!!!BĦ!dRĦ!!èB22ĶĦBB!RńD !'įĖ !3ĶĶÂ_¦2Q¦S!!¦!2R22!!CB!!!B2!sôsRRcĶ!!!Õ$!ĽĽ99ĖĖRIĩ !3Ê!!ĶėÆ!!!å !'Ķ!!CB !&ĦCCCdB!RĦĦ!BĖĦ!!ĦòRI9Ă© !3ĦĊFç±cĦ¥ĶSB2!!22 !&RRCB2!ĥĥĥ! B&CCR!22!©ù!!Ķ !222²_ĢĶWĕĵ·×¶ !&ĶĶ·ą!Cõ!!BB !*CRR!!BB2!p2!2 !2×BRcÖ¶Ħ·×R¥HüRĖ!!!ńdR!Ħ !/ĖõĖ!â!B!!B!wâ !2·''7Ćc¥»»Ĭ!RĦ!!!Ķ!!ĖRdõRCBĥC !)ĥ·s!`ğğğ!!!2© !6xËx!!bĦĦ !&4Ùą !*RCCCøCCą·dÇB !&Ė!įįį !<B!Ĩ!!2Pb·!!RCĖRCC!RRRåRRdµµ¤! Ė&!ïĖĖĖ !<d!0 !(ńĔĔńńĔńń Ĕ)ńd!Ĕô !EńB222s·s!!!MMÁ !-ńń !HdBBB!ĖĦ!ħā!!!ñ !TńB!!Ħķ!Õ!Ė!R !WAB!!Ĵ!ĸö!!BR !WAB!ĦĖ0RXķR!· !WAdBĥBBBĬÍxĪ !XńA!CCAńĔ !]Ańń !Ņ !Ņ !Ņ !ħ",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !Ņ !æ d& !]×dss!u¦¦¦~~ !WĖs!!ÆńRRĀĆĖ~ !U×|ĆĖ!Ħ·22!æ!R !W2!RB!BB3ÆÖR !VJ!RĖĦ!dd(Æ !V×¸¤!ĶĶ!ąĥńĔhhh!!!ćççç ×'ç×$ !Fq2!$Ķ!ĖĦħ $&ħçćĖ Ħ)ĖĆRĥ$$ !?ñÁñ!Ė2B2Ĵ!!2ĖöĥąÕąĦĦ!ĶĦĦĦ Ķ&!¥ĖöąĥRYYY!!YYĩ !2ÕāāıcĆæÑL!ĶĶ2ĶĆB2ĖöBRĖ!Ħ!Ĉ !*Ė!!ĖĦ!ĶĶĶIRĶÒg !1ÅĶĚ!1sBÕræĐ,cĦB2æccĖöBĦ!B!@ !0Ă!!ĂĽ!Ė2 !3_Ö!RđĦ!ąąÕ]2B!!æc¥Ķ!söB!R !0w22w2!R2 !1ĶĶúV!ÅÛRBæ2!!B!!!Ħ!ĦcæBBB!2R×B222 !'4B!2ò 2&B !2ĶĶÂ_¦2Q¦S!!¦!!c!!!Ćc!¥!RĖ!BRĵcRB22!ĖRR@t!įpįįį2 !5Ê!!ĶėÆ!!!å !&ç¥Ķ!K+!B!!Rdt·cs¥sÆÆĦd·B !&ĖĖįÏG !3ĦĊFç±cĦ¥ĶS!söĶrµ!+!!+!¥!ĖRĖBtttdC!¦sBī!)ĉ!!!ĖÚÚ !122²_ĢĶWĕĵ·×¶(!Ė!2CĆ!···C!BR!ĵåąĖĖ!!CRĦ!!!ĿĶ !7×BRcÖ¶Ħ·×R¥i!ö!ĦĶe¸d !&32dõ!!3!!BBBĶ!!Ŀ!!2 !8·''7Ćc¥»»(!ĦĶøB÷µń8XX«R!!!2 !'Ħ!!RB !&g !<xËx!!ĦĦĆĶPRbbĖ!Ė !&3!3!3!ė !&dÇ !Fb!!Ħ!Ė!!Ė !&ĔRR!RdRR¤RR2!ąÅĤĖĖĖďĖ !CB!Ħ!!ĦBRR!! Ĕ,!2ĦôĖ !Fb22B!BB!ĦĖĦ !.ĔĔĔ !Iµ2BBRRsÆ¥Bb !Xµ2RRR$bbb !Zµµbb³ !Ņ !Ņ !Ņ !Ņ !Ĩ",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !Ņ !§dç×d !]ddBæ2!d× !Y×¯BBs!s2Ė×× !V×;ýB2!¦!cĶllĠM !S×öýR2!R!R!¯Ħ2tR !SĖÈÇ!!R·ńd·!c·RR !R¦!A¤ĶR·!Tń!×!!Ry$ ç(!!×ç !HĦ¤!!ĖÕÕĖTĥÜZíy!ąĶĶĦĶĦĦÇ×2!ħ$T !GcĦ!Ė!ąĖ!ĦÕ !'22!222!!c!ĥĖYYR!!IęY !6ñÁñ!!×!BBĦ!ĶĶĖ!ąĦ!Ė!ĦĦĦD !&222BĦ!!!ĶĶĽRR !5ÕāāıcĆæÑÑ!!!c!!D!Ķ!!ĦĦRÕ!Ħ!ĴB222 !(C!Ē2ĒI!!Ħ !2ÅĶĚ!1sBÕræà,RĆc!Ą!2ĖĦ!B!RĖ!ĶB !'BB!d!!RwĿw!!!BĿ !3_Ö!RđĦ!ąąÕm !'2!!BB!!!ĶĶB!4BBB!!d!Cė!į!įğ!2Ê !2ĶĶúV!ÅÛRBæ2!!B !&B2BBCBĦ!Ķ¥t·r d'RRR¤B!ĉ!!!B !3ĶĶÂ_¦2Q¦S!!¦!!!B !&Ħ!!C!!BĦ¤¤ Õ&RåĖB!B!!`!!Ėğğ !4Ê!!ĶėÆ!!!å!2B!!2!B!C!!!Ķ!Ė Ķ(¤ĶRĦBěě9!!Ė!ĖĖĖ !3ĦĊFç±cĦ¥ĶS !&B2!!Ķ!!åcĶ!Ħ Ķ(!2Õ!!MĒ299jĹ !422²_ĢĶWĕĵ·×¶Ĭ !&¦BĖs!ĥB!!! Ķ)!B !&©ğ2įâ !5×BRcÖ¶Ħ·×R¥HĖRĖ!!P!sC!Ħ· !-öĖĖ!!!ĉ!!p !6·''7Ćc¥»»Ĭ!RĶ !'C!ĥd!ĦBB 2&!!!Ħćç !&`ğ!ĉ !:xËx!!bBĶ!!!4ÙCąRC!!!R! B&R2!ć¦çR!!â!!!`` !AĦĶ2ńń!·B!ńĔdd·RR$RRs!¤0¤!!!` Ė' !@Ħ!$2s·s!öń!!ńńĔb·å···ÆRĶĔĔôôĖ !DA!!0 !($ććŁÁñ! Ĕ'Abµ !MB!ĖĦ!!ą!àR !Uµ22!!R!!!ĖĖĖR !V¤BBCĖ!!ĥRR!BR !VbAńR!ĖCdd)ýxx !XĔĔ ń&ĔĔ !Ņ !Ņ !Ņ !Ņ !£",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !Ņ !?ddd× !^dBĨBĖ× ![d2ðý¿ !]d¯¯õĦĦŀ !Z×¯Ý!çççRµ !YĖý!ć!!Rc ![Ħ!«¶¶cW !Y¦ĦÈçö88W !+ććć×çt×çħ$TT !GA¤ĶĦĦTT!!!ħTT$ćĖĖö!öR!BĦ!ĖńIII!!III !=Ħ!¤!ĶĖBõĖT$ħĦõõõĖ!ĦBĶ !)$R2!YY!òBj !5ñÁñ!!!¦ !&ĶĦĆĦĥõ!Ħ!CĦ!øĦ!ĦĖ !*âB2Ŀ22Ħ !3ÕāāıcĆæÑÑÑ!B2c!!uĖĦĦCĥB!!Ė!q !.`!2!!2B !2ÅĶĚ!1sBÕrææ,ÀRĆc2äRBĦĥC!BąĶ!!2!2R!!2!!ĥė!!Ò2!!!© !4_Ö!RđĦ!ąąÕ!ŀR22!!!cĆ !&2!B2BĶ!R2B!!!Q!!pğ!įį2įį !0ĶĶúV!ÅÛRBæ2!!Ė!!!2!!!B!C!BRĦ!!èB22ĶĦBB!RńD !'į!Ė !0ĶĶÂ_¦2Q¦S!!¦!R2R22!!!dĥ!!!B2!sôsRRcBö!!õ×ĦDĽĽ999ĖRIĩĩ !/Ê!!ĶėÆ!!!å!c !&Ķ!!ĥ!!!C!!ĦCCCddB!RĦĦ!BĖĦ22ĶòįR9R!© !/ĦĊFç±cĦ¥ĶS!B2!!22 !(RCB2! ĥ&! B&CCR!222©ù!į !022²_ĢĶWĕĵ·×¶ !'ĶĶ·Ħ!CĥC!!BB !+CRR!!22!!p !2×BRcÖ¶Ħ·×R¥cĬüRĖ!!!ńdt!C !1ĖõĖ!â!2 !'©â !.·''7Ćc¥»»GĬ!RĦ!!!Ķ!!ĖR!!õRCBĥC !*ĥ·s!`ğğğ!I9!!© !2xËx!!!bĦĦ !&4Ùą !+R C&øCCą·dÇB!!!Ė!!įğįÿ !9B!Ĩ!!2Pb·!!RRCĖRCC! R&åRRdµµ¤!DĖĖ!ĖïĖĖĖ !:bB@!!!ĖąĖRĔĔĔń!Ėń!Ė Ĕ)ńd!Ėôô !DB222Ķ·s !'ńń!ńń !*ńńń !Eb!B!Ħ¥Ŀğlħ !YB!ĦcĠ!!!Đ$ !XABB!Ė!R !]AcĦ!!BR !]AcXķR!· !]AbċXzĬń !^AAńń !Ņ !Ņ !Ņ !Ī",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !ĝdd¦¦ !]dd!!!2× !Zd!!!B2 !ZĀĀ¿İ<B2!B2 !Y··æ¶2!RRB !X·!!t!RsBB !YüææõÜ!BB !ZAWWÜ!ĖĆĦ !^ĦĦudĦ!B !, ć'×çt¦çħ$T !FAÕĦĦĦħć!!! ×'ĖĖööö!ö2RBĦ!ńIIR!III !<d!BÅ!ĶĖB!BćççRR2!B!Ħ!!!Ħ2B!Ħ!ĥ$R2!Y!!òj !4ñÁñ !(Ħ!Ķ!2Ħ!!ĦĶBĦĦ!!!ø !&Ķ !)âB!222Ħ !1ÕāāıcĆæ Ñ&m2cĦ!uĖ!!!¦RĖ!!Ķ!!P !.`!!!22B !0ÅĶĚ!1sBÕræĦĦsRĆc2äR!!!ądRĶĶĶ!!2 !&2!!2B !&Ò!!!Ķº !2_Ö!RđĦ!ąÅÕ¶ŀR22!Ķ!!!BądR!2!!2B!!!2B2B !'p!įį2įį !/ĶĶúV!ÅÛRBæç!!c!!!2!ĦĦ!!BądR2!!!èBBB22ĶĦBB2ńD !&į!Ė !/ĶĶÂ_¦2Q¦S!!!R!2R22!!!Ħ!!BądB2!sôs R&cĶ!2!$!ĽĽ999ĖRRIĩ !.Ê!!ĶėÆ !&Ė !+Ħ!!B!B!ĦCCCddR!!¥C33ĖĦ22ĶòįR99Rºĩ !-ĦĊFç±cĦ¥¤Ķ!B2!!22 !'CĦRCB2! ĵ&!RR !&R!222©ù!įį !.22²_ĢĶWĕĵ·×÷s !&ĶĶ×!!dCĥ!!!BBĥ3 !*RR!!22!!p !1×BRcÖ¶Ħ·×R¥ccüRĖ!!!ńBBRĥCdÕ !/ĖĖĖ!â!2 !(Ķ !-·''7Ćc¥»»GGĬRĦ!!!Ķ!!CĖtĥ!dąCB!!3 !*ss!`ğğğ!I99!!? !0xËx !'Ħ!Ķ!!4ÙĦą!!C!!·!CCR!333è33ĥsdÇB!!!IĖïÿÿïÿ !8bB!$Ķ!0ńd·!!R!!ĖR!!! R&åRRCÕµ¤!DĖĖï !@BńBB!ĦąĖRĔĔń!!Ĕ!!Ė Ĕ)ńC!Ėôô !CĖĶĖĖBc·ńĔ!!!ńń!ńńń !*ńńń !Db!!2R!!Ĕ ![Ħ !d¥cB !]ŀ]]à, !^SÆÆ¶Ć !^BBB !`RRRĆX!A ![ËËËxAA !Ņ !Ņ !Ņ !ñ",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !ėdd¦¦ !]dd!!!2× !Ydd!!!B2 !Ydd!!!BB2!B2ç !TĀĀ¿İ<BB!22R2 !W·3æ¶22BRBĶB !V·!t!!RRB!!R!B !Uüæõ!W¤¤¤æĖĖ!!Bç !SAWWW !'·ĦĦ !1 ć'×çÇ·ççħTT !DĶĦ!BćçÇ!d!d¦¦÷××ĖĖĆĆĆ!ĦĶBBBĦńĻIII! I& !9ą¤ĖĖ !&BBÇcdcĦ !'ĦĶĶĶĦĶ2!ĦĦ!$RR22R2!òBj !2ñÁñ !(ĦĶ !'B!cĦ!B!!Ķø !.ğâBB!22Ħ !0ÕāāıcĆæ Ñ&!2cöĖ$ĦĦ!!B!BRĆĦ!!a !/` !&2B !/ÅĶĚ!1sBÕræĦĦàRĆcĦĔ !'B!2RĖ!!! 2(!2BB !'Ò!!!© !1_Ö!RđĦ!ąÅÕ¶ŀRĆ2ĦĶ!B!!BB22RB222 !'2B !(ğp!įį2įį !-ĶĶúV!ÅÛRBæD·õĖ!sĦ!Ķ!ĦBB!B22Ħ!!!è 2'ĶĦBBBńDD !'į!Ė !-ĶĶÂ_¦2Q¦S!cB!R2RR22BB!BB!B2RĶBsôs R&cĶ!22$!ěĽ999Ė!!Iĩ !.Ê!!ĶėÆ!!ĆĦ!Ė !'Ħ !&B!BĦ!ĦCCCddR!!¥C33!ĦM2ĶòįR99Rºĩ !-ĦĊFç±cĦ¥ĤÅtÖ2!!22 !(BBcB2! ĵ&3dd3!RR!!!22©ù!įį !.22²_ĢĶWĕĵ·×÷s !&ĶĶ× !(CBBBĥ3 !)R !'2!!p !1×BRcÖ¶Ħ·×R¥ccüRĖ!!!ńBBt!C!ĥC !(3 !-2 !(Ķ !-·''7Ćc¥»»GGĬRĦ!!!Ķ!!CĖtĥCCĥCB!!3 !*BB!!ğğğ!I99!!? !0xËx !'Ħ!Ķ!!4ÙĦą!!C!!t!CCR!3!!×!!õBdÇB!!!IĖïÿÿïÿ !8bB!$Ķ!0ńd·!!RR!ĖR!!! R&åRRCöµ¤!!ĖĖï !@BńBcBĦąĖRĔĔĔ!!Ĕ!!Ė Ĕ)ńńńĔôô !CĖĶĖĆ!c·ńĔ!!!ńń!ńńń !Iññ !&b!!2B!!Ĕ !SMÆ!Áı·t·ĦR !ZcRĆBcĦ!ĖB!B !UBB !'c!BĖ !WûRÖ!X R&2R !XËËxAB!!BBBc ![AbB!!B!!A ![AbbAAA !Ņ !Ņ !Ņ !ó",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !Ņ !. d& !]dd !&¦¦ !Xdd !'2B2· !Vd !&2BBB!22· !RĀĀĀİ<B222!22B2!2· !U¶22cRRBBĶ!BB2 !Q··3æ!BR!µµöĖ!!!Bc·Ç !Oü!t!Wµµµ!!ąĶĦ!Ķ!!sBÇ¦!··· !( ć'×çÇ·çççħTT !4AěĪW !)ĦDĦ!Ħ!!B!B¦!ĖĶdd÷İ××ĖĖĆĆĆ!ĦĶ B&ĆńĻIII! I& !7ąô!!!Ħ!!B!c2ÆĦBB!t!!!ĦĶĶĶĦĶ2R!ĦĦ!$RR22R2!òBj !1ñÁñ !&ĖĦĖĶĦĦ!2!ĦĆÆĦB!cĶĶø !+B!!!ğâBB!22Ħ !/ÕāāıcĆæÑÑÑm!Ħ2öĶDĶ!ĶRĦĆRĆĦ8!!a !)Ė!!BB!!` !&2B !.ÅĶĚ!1sBÕræĦĦàRĆcĦĄ!RĶ!cĦ2RĖ !& 2(!2 !*Ò!!!© !0_Ö!RđĦ!ąÅÕ¶ŀRĆ2!!ĆcĶ!¥22RB 2& !'2B !)ğp!įį2įį !,ĶĶúV!ÅÛRBæD×õc!sĆĶ!2ĦcĶ!22Ħ !&è 2'ĶĦ B&ńDD !'į!Ė !,ĶĶÂ_¦2Q¦S!cR!!2!RĶĶ2!ĦRĖBRRĶ22sôs R&cĶ!22tDěě999Ė!!Ľĩ !.Ê!!ĶėÆ!!ĆĖ !'2ĦĦ!B!R!!Ħ!Ķ¦CCCddR!!¥C33!ĦM2ĶòįR99Rºĩ !-ĦĊFç±cĦ¥Ĥ¤tB2R2!B!!!B!!!cB2! ĵ'3dd3!RR!!!22©ù!įį !.22²_ĢĶWĕĵ·×÷s !&22÷B!!BB!BBBĥ3 !*R !'2!!p !1×BRcÖ¶Ħ·×R¥ccüRĖ2!sńBBt!CBC!B !'3 !-2 !(Ķ !-·''7Ćc¥»»GGĬRĦĶĶ!r÷CCĖtĥCąCCC!33 !*BB!!ğğğ!I99!!? !0xËx !'ĦĦĶB4Ù!ĥĥ!!C!·!!!R!!3!!×!!õBdÇB!!!IĖïÿÿïÿ !.ññ !*bĖĶ4ĖĤń!Ct!!RńĖRń!! R'åRRCöµ¤!!ĖĖï !3MrĖıı !(×ĦĦĔ!s!!!ĔńĔĔ!ńĔ!ń Ĕ+ńńńĔôô !6ĕt¶Ć1··!!!tĆ!!!B!BCń !NtRÖ!÷ĦĦtt·R¶!!Ö2!!ń !Oû!!!XRB!!ĦĖÖBcĦc!C !QËËx!cBRB !&ĦĦ!Bń !TA!R B&cBBB !XbbBRB!Ħ !&A !Xb!RB!!RBA !ZbbRsRBA !^bbbA !Ņ !Ņ !Ņ !ù",
);
// }
enemyFrameOffsets.push(rawImages.length);
// Dr. Schabbs {
rawImages.push(
  "#c Ņc !Ņ !Ņ !åt!!ŀİİŀ !YCC!^ŀĖĦĦĶŀ= !VC!Ħ!!Ė!!BĦĶ!= !TCĶĦ!Ė8t!RĦ!!ĥ !TCĶ·!ÇĦ!BR!B !&= !Qd!·!!Å!!!C!2 !VĦĦÅÅ!Ç!Ħ8BC!!ĦĶĥ !QdĦ!Ç!ÇÅ !&2!B !&= !OĦ!!Å!Å2RB!!ěC2B !-3d !EdĶ!!!22 B&iÇ«C !&ĥŀ!!SSSt!dtÇ !CĖĶ!222BcB22!!!«2!!ąĦ!ŀS!ĦĦ!·Õ2!Ç !BĶÇ!Ç !&2!!!ĶĦĦ¬!Ħ!!Ħ!ďĦ·BĦą!B!!çç!·tt·ç !;Å !'ĖĶĶĶ!22!ĶĶ !&ddBõ!B2cĦĶB!!×!!22B !=Å !& Ķ&!2!Ķ !&B!!!cBR !)RB!!¥ !1MMÑM !'¦ !'ĶĶĶĦĶ!ĶĶ!!B!!!BdBBBĦ!Ė !+BBö!ç !,ĀSSyy¤ąİ ^&æc!Ç !(ĶĶĶ!ĶB!!!BdB!ļ!!s !/B !,Ā!ß!ÖĆĶĖĖÅÅÅ!]ĖcÅ!!··ĶĶ¦22ĶĶĶ!ÍBdB!8!!!ö !9ÐĖc¦İQĶÍ!!RR·ĶcïĶc!!åÕĶ!åĶd!!!22¬8((!22¶!!B2!2 !'2!s!Bć !*RĶcÌķ2!!RÇ¦ĕĕĖė2Ķ !&ÇĦĶĶõ!!ĶĶ!Ķ !&B!æ¶¶!!!Ħ !(ĦĆ !+Ð !'22RRÇĆļCĶåB<Bs2!·åÇ¦t !'Ħ!2!!Ķ!B2!ö2!¥!!!B!22ÆcCB !)ÝRR!æĐĖcÀĖĦĦĆ!ĦĦ2ÆĶB!!å!!åÕĶĶ!R!2c!Ħ!!B22Ć2BBĆc!B!Ħ!2ĆĦ !+BB!!ĥRR]BRscb!!B !&2!¦!2¦·Ķ!!Ė!RĖ!Ķ!!!2B2BBÇcBB! B'!RCBć !'R2!2CĖBÜBÇ!Ħħ!BC!!B!B!å2å2ą·Ķ !)Ħ !&RĆæb¥æccĆ B'!AÆæ !'ð!!!¥XĥĦ8ĆĖ!B!2cBd!2!B2!t!!õ!Ķ!!Ė!Ć2Ķ!ĶæÆ¥ĆĆĦ!C!!öÖ¥ÖA!ĵĦĆĆ !'ī !'ė2!ąöc,ĥ3R!»!R !&ąõ!d2!Ķ!!Ķ!2ĶRöĦ!!Ķ¦Ķ2Å2sBæĶĦ3ÆĦBcB !(22!ĆĐc2RĦĕÕĦSc¥!!Ræ!!22¦BBĥR!!!RĶR2B!ĦĶĶ¦·ÅĶ!2cBĦ22Ė!Ķ×ĦæĆ !((CCB(cR¯B!!ĕ2R!d2R !'ÅĶ!ĶĦR2!!!2ĖBöĦĶĶÅÅÇ!ĖcBĦĦ!!!2!µ×BB !)ī¥yRssWSdÇÇccBËBĆ!e·!!ĶĶ2!!!2!Ė!!Ķ!Ė!Ç!!!ÅÇ2ĖĆĦĶ!Ķ!!Ķ·µcc !*Ë¤¤°°¡RěËËËhWBĆĦ!Aħ !(2!!R!!!t!!!Å !&Å!ĶĶ!!!ĦĶĶ!2!ĆĆ !-ûû»û !'ĖĆ!!!õĄ¦!2 !(Ħ!!22!· !+¦Ħ Ķ(!!BB !8Ķ!!!2å!22!2!2 !'Ķ!Õ!!Ç !&·!åBcRccc2Å!!B !;t!222!!!222!2!!Õ !'Ç!!!Õ22!!222!BR×BB !;õ!!!BB!BBĶ !'ÇB!2ÇÅ !'B22ĶĶ!!2!!QR2 !72!2 !&2ĶĦ!!Ķ!22!!!å!!!ÕÇÅ2Ç!BĖR! 2(ĖcĖĶ !7µ2!!!t!22B!!$! 2&!2!R!ÇBçBåB!ĶĖR 2&!2¥R¥c !:2!õ2!2BB202!22BĆcĆcRõåÕRccBÇĖĖ 2&B¥BRĆĆ !8B2!22!ĦĦĦ!ĀĀĀĠĖ|¿ÿ¿ïĦąBBRBBBRÅĶ!Ħ2ÅÅÅ!Çė÷Ç !8¤22!!Ķ !(RĖÏĖ2Ė!!Ï!ååB Å&Ņs2BÅ !A222!22B!!BRĶĦĆ!!!2!2!!!Å !'õõÕ !B¤ 2' !&B!2!!3÷dÇd !5Ėĥ !:¤2B222B,R!2cÇt¥!R!R !P¤¤222, !&2sÆ 2&Û !4Ėĥ !>¤¤¤ !&BBB!22ËË !Vxx !'B»» !7ĥ !D x( !8ĥ!!Ħ !^Ħ!!Ħ !`ĦĦ!Ħ !^Ħ!!Ħ !_¤ĦĦ!¤ !Â¤ !c¤¤ !d",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Bŀİİŀŀ !Zt^ŀĖĦĦĖ!ŀ !WC#!!Ė !&Ė!ŀ !U3ĦÇĖ8t !'3 !U3·!ÅĦ!BRR !XC·Å!Ç2!!· !(ŀ !QCĦÅ!ÇÕ!Ħ8!·RRBĥĖĖĐ !PĦ!Ç!Õ!!Ħ!!cCĶĦĦ!!!^ !NC!!Å2!!!B!c!ĥĦ!!!dd !(Èdd !FĶ !'BB!!ĜĜĶ!!dtRRR!SSS3!ĖĖtt !Cd !' B&¦!Å2!tRB!!!S!¦ĦÇÕ!!2Bt !HB!!!ąBçí!B!!!RČĦĦÅÇÅ!!B2!!¦¦ !@Ė·!Ç22ĦB!BRĖĦĦX!!!RĜ!!·!Å !&ĖĦB!cç··t !<ĶÅ!2 !&BĶĆĶĦĦÇH!RČ!Ħ!Õ !'Ķ!!!2ĖĶ!!!t !>Å!!!Ė !'2Ķ!(Ĝ!R !0RBB!!Çć !?Ķ!ĖĦĦĦ2!Ķ!B2 !(Ç !(22!ö!!2!Ķ !0MMÑM !'¦ !'Ķ!Ħ!2!B!Ķ!!!2 !(Å !.2s!!ç !+ĀSSyy¤ąİ ^&æc!×!!!¦·ĦĶ2d !*B !(2 !'22!!!Ć!B!ç !)Ā!ß!ÖĆĶĖĖÅÅÅ!]Ėcµ!!!ÕÕ!!2ĕĦdd!!!B!!Ç !(BBB!!!cRR!2B !+ÐĖc¦İQĶÍ!!RR·ĶcïĶc!!22Ķ¦ĦĖĦ!õõ !&ĶsõB·22!!Ķ!2 !&ĖĖ!ss!!Bć !(RĶcÌķ2!!RÇ¦ĕĕĖė2Ķ !&22ĶtSĦ!!Ķ!!RĶ!!2ąÇBRĶĶĖĦ !(2æĆ !*Ð !'22RRÇĆļCĶåB<Bs2!!·Õ22ÕĦĦ!2R!!2Ėc!!2·BB·!!!Bc!222ccC¦B !'ÝRR!æĐĖcÀĖĦĦĆ!ĦĦ2ÆĶB!!2å222ÇÇ·ĦĶĖ!ĦB2!BBõõ2cå¶BBB!Ħ!!2 !,BB!!ĥRR]BRscb!!B !&2!!!¦2å2åÕB!Ķ!RĦBĦ B&22¶BÇB!!cBBBc!RRCBć!!!R2!2CĖBÜBÇ!Ħħ!BC!!B!B!!2õ!t!2B!!!Ķ!!Ħ! B(!ĦÕĖĆĆĆBBB!!!AÅæb!!!ð!!!¥XĥĦ8ĆĖ!B!2cBd!2!B2!!2ąõt 2'Ė!!!Ė Ķ)!!Ķ!ĦÖ¶ÖA!A!ĖĖ !&ī !'ė2!ąöc,ĥ3R!»!R !&·BBBĵ !)2! Ķ+C!!ĶĦ!ĦtÆ!!RR !'22!ĆĐc2RĦĕÕĦSc¥!!Ræ !&ÅĶ!ĶĦB !&R !' Ķ'S!ĕ2ĶĦ!ĶĶ!Ķ!Ėææ !'(CCB(cR¯B!!ĕ2R!d2R!e·2!ĶĶ2!!!2 !,ĦĦddąĶĶĶĦĶĶ!!Ķ!t !+ī¥yRssWSdÇÇccBËBĆ!Aħ !(2 !)2!!!ĦĶ!ååSĶĶĦ!2!ĶĶĶ!ÅÇcc !)Ë¤¤°°¡RěËËËhWBĆĦ!õĄ¦!2 !(222Ė2!!!Ķ!¦ĶĶĶõdĶĶ!Ķ !(ÅĆĆć !+ûû»û !'ĖĆ!!!ĶĶÕ!22!2!22!!B2 !(Õ Ķ&åĶĶt Ķ'!·!BB !7Ķ!ĶĶ!!22!!!22!!!Ħ!!!22 !&·!ĶĶ¦!õBBRRRB2!!B !:·!!2BB!BBĶ !0·!!Õ !*õRBB !;2B!ĶĦ!!Ķ! 2' !&2!2·å!!!22! 2'!2¦R2 !62!!!å!!2 !'$!222!22 !&2õ¦å22!RR 2'!!õĖĶ !6µ2 !&Ķ22B!!!ń2Ħ||¯¯|¿2Ħ22t2·BB¦ĖĶBB!!!2!!¥c !822 !&2BB!!!ĶÏ Ė'!2RB!ąõõ!!õ2ĦĦ!222¥B!ĆĆ !7B2!!!¦ĦĦĦ!2<<µĆ !'Çµ2BcR B& 2&!ÅÅÅ!Çė÷Ç !<åĶĶ!!!ĖĖñ! ¦'!!¤¤¤µ Å&åBB2µ !?¤!222 !'Ġ!!¶¦ !2ÅÅµ !&AĥĖ!R !8222!!!2!!ĦĦĦccBB!!!Û !7Ė !8µ 2'BBĠ!!!Ć!BB¥¥Ö !Pµ22BB!!!B!!c!!B!!x !7ĖĥĦ !9µB222!R!BRsBB!!R !S¤222¤!RR!!2!!Rx !8ĥ !=¤¤¤!xxxB!BRRx !8ĥ !E x' !8Ħ!!Ħ !`ĦĦ !`Ħ!!Ħ !_¤ĦĦ!¤ !Â¤ !c¤¤ !d",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !êĐĐĐ= !]ĐĐ!BR!= !Xt!Đ!!B!Ķąąŀ !UCC!^t!B!!Ķ!!C= !SC!Ħ!!BR!!Ķ!!dB!~ !QÈ¦ĦÇĖ8!CĶĶ!!dB!c !QCÅÅÇÅĦĦ8B¦!!dB!B!ë !Od!Ç!Å!!!B!!!dB!B!ë !OdĦĦÅ B&Ķ!!i¦B!B!ë !QĦ!2 !&RĶX!ċąą(ë !,¦¦¦##ç !(C¦¦ !7dĆ!ÇĶĦ!2R!B2!!ÍÍĦ¦¦d##¦d C&SĆS!!ö·d·tħCĦĆĆ !7ĆÇ !&Ħ!ĶĶææ!Ç!ĆB!ĦĆ!¥ĦĦ!·ĶĶÅ2µ2sBæĶĦĆÆĦBcB !8Å!Å!!!ĦĶ!c!æĖ!!!Ħ!!¥ĦĖĶĶÅÇĶĶ!2cBĦ22Ė!Ķ!ĦæĆ !>·2!ĶR¦SĆB!!B!!!ĶĶÇĶµ!!ĖcBĦĦ!!!2!!!BB !-MMÑM !'¦ !&22ÇÕĆ!222ÅĶĶæĦ!!!Ė!!µ !&2ĖĆĦĶ!Ķ!!Ķ!×cc !*ĀSSyy¤ąİ ^&æc!Ç!!!ÕĶÇ!Ķ!åBĖ!cĦ !.ĶĶ!!!ĦĶĶ!!!ĆĆ !)Ā!ß!ÖĆĶĖĖÅÅÅ!]ĖcÅ2!Ķ2Ç!ĖĶĶB!×ö2×2 !*× !&Ħ Ķ(!µBB !(ÐĖc¦İQĶÍ!!RR·ĶcïĶc!Ķ!!õÕ!tttBÕ!!2 !'×!!!µ !&BcRccc2Ç!!B !)RĶcÌķ2!!RÇ¦ĕĕĖė2Ķ !'B!ĶĶõ22!!å !'µ !(22!!222!B!×BB !'Ð !'22RRÇĆļCĶåB<Bs!!!ĶtB2Ķdt2R¦!!2B! 2)!B22ĶĶ!!2!õQR2 !'ÝRR!æĐĖcÀĖĦĦĆ!ĦĦ2ÆĶB !&õ!2õÅõ22!!!2!BB!!Ç!!!BĖR! 2(ĖcĖĶ !'BB!!ĥRR]BRscb!!B !&B!!!Ķ2Õ!BĦ!!Å2!2!2!BBåÇBB!ĶĖR 2&!2¥R¥c !'R2!2CĖBÜBÇ!Ħħ!BC!!B!!B !&22!!!·RBĆcĆc R&BÇRB!ĖĖ 2&B¥BRĆĆ !'ð!!!¥XĥĦ8ĆĖ!B!2cBd!2!!!ÇsRR222ß*|¿İ!BĦ B&ĕõ!2×Ķ!Ħ2ÅÅÅ!Çė÷Ç !'ī !'ė2!ąöc,ĥ3R!»!R!!!õĆĶ!B!¿Ė!cS!Ġ2!BBB2B¥ç¥QĆÆÖcćććĦ !,22!ĆĐc2RĦĕÕĦSc¥!!RæćÇĶĖĖĶ2Ķ¿!c¦C !(ĶĦĶĦĦÅĆĦĦ!ĦĆĆööö !,(CCB(cR¯B!!ĕ2R!d2R!Ćc!B !'BC!!2!!!2!ĶĶBBĦĦ2Ė!ĆĖc!!BB !-ī¥yRssWSdÇÇccBËBĆĦµQç !(B!!!ĶBR!2!B!ĖĖ22ĦR!2!!2!Ė2 !.Ë¤¤°°¡RěËËËhWBĆĦ!!!¤!!2!!ý!ĥ!BBR!2!!Ħ!!!Ħ!RĦĶ !&RBc !1ûû»û !'ĖĆ!!!Ç!!!R!!2 !&22 !-Ė!2!!!2!!ö !<Ķ !(R!!!2ídB !*2 !&R!Ķ22!ĶĖ !@ĶÅ !)BĶ !)2!!!2R22Ħ !(RB !DBcBBĶ$Ė !'ŀ !&cĦB!!22 !&B!s !;2 !'ÇĖĆĦ!!ĐĎ !)2!!!ĆcĶ!B!!!B!2Ħ!Ć !;µ2!2B!Å!Ė!!Đ !-22c!R!Ħ2 !& B& !<B!B!B !(ĦĦRĖ !'¤!22ĦĦĦ2!!!¤ b'B !<¤R!R2RRR !'BRĶ !' ¤(2B!¤ !D2R!B!!B!!ĦBc!Ķ2!2 !+¤¤¤ !E¤2RBBB!!!cB!BÆRR!RR !3A !>¤2BRRRB, R&!RRR !5ħ!!Ėĥ !;¤¤222,!! 2'!!!x !S¤¤¤!!! Ķ'xxx !6Ėĥ !A x* !zĥ !aĥ!!Ħ !^Ħ!!Ħ !`ĦĦ!Ħ !^Ħ!!Ħ !_¤ĦĦ!¤ !Â¤ !c¤¤ !d",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Bŀİİŀŀ !Zt^ŀĖĦĦĖ!ŀ !WC#!!Ė !&Ė!ŀ !U3Ħ!Ė8t !'3 !UÈ·!ÇĦ!BRR !XCÅÅÇÅ2!!· !(ŀ !QCĦÇ!Å2!Ħ8!·RRBĥĖĖĐ !PĦ!Å!2!!Ħ!!cCĶĦĦ !RC!!!2!!!B!c!ĥĦ!!!dd^ !NĶ!Ç!!!BB!!ĜĜĶ!!dtRR !.ÇÇ× !?d !' B&!!Å2!tRB!!R!!ççç× Ç&¦ææĶ× !?·!Å!!B!!!BBçí!B!!!RÛ!dæĦĆĖĦĖĖĖSĶ·Ķ!tttħ t& !6ĖÅ!222ĦB!BRĖĦĦX!!!RĜSS!BĦĖĦĦdĶĖÅRĥ!öĶĶĶæ!!RR !6Ķ !)BĶĆĶĦĦÇH!RļB22RBĶ!ĶtÕtĶ!RĦĦĶĦĦĦĶ!Ėææ !=Ė !'2Ķ!Hļ!!BR!!ĦĦĦÅĶÅ!!Ė!ĦĶ !&Ė !?Ķ!ĖĦĦĦ2!Ķ !*Ķ !*Ė !+cc !,MMÑM !'¦ !'Ķ!Ħd2!B!Ķ!Rt !3B2 !'¦ĆĆ !)ĀSSyy¤ąİ ^&æc!Ç !&¦åĶ22 !&õ!B!!ĶĶ!!!Ç!!!Ç!!ĦĦ !&Ħ!!BB !(Ā!ß!ÖĆĶĖĖÅÅÅ!]ĖcÅ!!!Ķå!!2!ĦĶ!Ė!!Ħ!!d!!BBÅ!!!Å!!B22BBB!!å!B !'ÐĖc¦İQĶÍ!!RR·ĶcïĶc!!22Ķ¦dĖĦ!!Ķ !(2!2 !, 2'B¦RBB !(RĶcÌķ2!!RÇ¦ĕĕĖė2Ķ !&2!ÕĦĖĦ!!Ķ !'õ!!B! B(¥22!!!2!BtR2 !&Ð !'22RRÇĆļCĶåB<Bs2!!2å22Ķ¦dt2 !&R !&cRR¦RBBĆ2!222!2ą!ĖĶ !&ÝRR!æĐĖcÀĖĦĦĆ!ĦĦ2ÆĶB!!2!22!2!!Ķd !&Ķ!!! 2&ĥtB!B 2&BBB!ą¥c !&BB!!ĥRR]BRscb!!B !&2!!!22B22å!õĶ!!BĦ! 2&B22!dRBS22BB¥cB!ĆĆć!!!R2!2CĖBÜBÇ!Ħħ!BC!!B!B!!2!!22åBą!!Ķ!Ħ!!R 2&BBĵĥ22ĕB¥sc!!¥Æ÷÷B!!!ð!!!¥XĥĦ8ĆĖ!B!2cBd!2!B2!!2! 2)!!2!ĖĶĶ Ė'2RÇcB !/ī !'ė2!ąöc,ĥ3R!»!R !&¦BBBR !(2Ķ!2ĖĶĦĦĖĖ!Ö¶ÅĦĦĦ ö' !*22!ĆĐc2RĦĕÕĦSc¥!!Ræ !&ÕĶ!ĶĦB !)BĦBöĦĶĶtĆĦ! Ħ&ĖĖĖĆĆöĖ !((CCB(cR¯B!!ĕ2R!d2R !'ĶĶ2!!!2!!!tĶBĦĶ!ĦĦĶ¦!Ħ· !&Ħc!!t!Ė !*ī¥yRssWSdÇÇccBËBĆ!e·2 !'2 !'ĕ!!ĶRÖ!·ĦÅÅ2õR2ĶĶĦĦR2õ!!ĥ !*Ë¤¤°°¡RěËËËhWBĆĦ!Aħ!!2 !(222Ķ2Ė2!!!Õ!·!!2!!ĶĶ!!!22Çd !.ûû»û !'ĖĆ!!!åô¦!22!2!22 !(2C !&Õ·!ĦĦĦ !&2!!Õą !9Ķ!ĶĶ!Õ22!!!22 !&2!Ħ!Õ !'ÕĶ¦!!22B!!!·!2 !?2BB!BBĶ !&Ķ !'· !'å!!22 !&å2!Ħ !;22B!ĶĦ!!Ķ! 2' !'Õ !&· !(c!!222 !82!!!t!!2 !)222!2 !(·!!Õ !(Ħ!BBBcd !7µ2 !&Ķ22B !&2!Ħ|¯[Ïlď!!·Õ!!!2 !&B !&Bd !:22õ!!!2BB!!!Ķ2ÏĖĖ !&B!!·!!B!RR!!Ħ ¤&B!R !8B2 !&ĦĦĦ!2<<µ¤Ć !&c!BcB2·!ĦĦ2!!ÅÅ !EdĶ!!!ĖĖñ=!¦Bçç¦·s!õąĕB !&Å !A¤!222!õ!!!Ġ!!¶c¦!Ç !&¤ õ&BRRÅÅ !C222!!!2!!ĦĦĦcĆc !&2Û !'õąą !.Ė !8µ 2'BBĠ!!!Ćc!c!BsÛ !Oµ22BB!!!B!!c!!BB!x !7Ėĥ !:µB222!R!BRsBB!!R !S¤222¤!RR!!2!!Rx !8ĥ !=¤¤¤!xxxB!BRRx !8ĥ!!Ħ !B x' !8Ħ!!Ħ !`ĦĦ!Ħ !^Ħ!!Ħ !_¤ĦĦ!¤ !Â¤ !c¤¤ !d",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !| İ' ![İİ !'İ !Yİ!C!!IIIYSt !Vİ!!ĥCI !(· !Sİİ!22CXÇ!Ç !'· !5¦#tç !(C¦¦ !.İİěě!2C33!!Å!Å!· !4 C'æ!!Ėtd·tħCĦĆĆ !/C!!2!!!RR!ÇĶĶ2Õ !&· !+ C&!·!Ķ¦!sBĦĆĶĦĆÆĦBcB !/BµÖS!R¥ !1tSSdC##!Ķ·ĶĶ!Ķ·Å2!!!22Ė!Ķ!ĦæĆ !0¬8Æ·2!R!!Å!!Ķ !)tĦĖĖĆB!!ĦĶµĶĶµĶÅ!cBĦĦ!!!2!!ÇBB !/BæĖ!!ûÛÛ(Ħ!×!ĶĶĖöÖĆĦtĦBR×!Ħ!!!Ç!Ç !&2ĖĆĦĶ!Ķ!!ĶÇÅcc !.ā!!¥ĆÛ !&ĶĶµ!!ĶR!!ĖöĆ!Ķ!2BB!!!Å!Å !'ĶĶ!!!ĦĶĶ!!!ĆĆ !-ë~ûûxÛ !&ĦÇ!!!Ç!ĦR!!ÇĶĖĖ!Å!!B !.Ħ Ķ(!!BB !*ĀĐS²dĠĀĀĀŀ^!!!Å!!!Å!ĶtB2Å!!·ĖĶ!BB22!!Ç !)BcRccc2ÅÇ!B !)Ā!¦İQŅÍ!!RĶĶMÁBR !&B2ÅĦĶsRBÅ!!Ħ !(Å !'22!!222!BRõBB !(ÐĖccÌ!ħ!!Rt¦ĕåĖ¿Ķc !&B!ÇÇd!2B!ÇB !,2!B22ĶĶ!!2!!ÖR2 !)RĶ!!ħRRRtąļC!Åė2Ķ2!!Ħ!×!ÅµB!2!µBĆB!!×! 2&!BĖR! 2(ĖcĖĶ !'Ð!!!ÅĐĶcÀĖ2ĶĆ!!!B<BB!!!Ėå2!!öB!RRĦĶB!!Å×Ç!!!B¦ĶĖR 2&!2¥R¥c !'ÝRR!!RR]BRs¦b!!B2ÆĶ2 !(B!!¯Ï22BĶĆs!!2åBBBRą!ĖĖ 2&B¥BRĆĆ !'BB!!CĖBÜBÇ!Ćħ!BC !&B!!BĶõBcÿccÿBĶ¥B!BBÕ R&BR!Ķ!Ħ2ÅÅÅAÇçÇÇ !'R2!2¥Xĥĥ8ĆĖBB!2c!!BB!!!ÇBR!¿!Ć!!ßR2!!RRR B'ÅŅŅąõÅ !/ð !'ėħ!ąöB,ĥ3RBd !'õĖöR !(ß22!BBB!BBcBćć !,R !(ī!!!ĆĐccRĦĕõĦSc¥!»!¥!22ĖĶĦĶ !*22 B&Ķ!!öööććħć ·& !,22!B(cR¯B!!ĕ2R!!!Ræė×!Bc¶Ħ!!!ĆCCÇĶ!!ĶĶĶĦĶĦĦ!!!Ħ!ĦĆ2 !&R !*(CC!Ġ!Ġ!2CStccĦd2R!ös!!ĆĖcÍ!!!Ræ!ĶĶ2ĶĶ !'22R!ĆĖc !1ī¥yys¼·CBsR!!cËBĆĦµA× !&ï!!B!Ć!!!Ķ!!ĶĶBBĦĦ2Ė!2!!2!BB !.Ë¤¤°°BRěËËËhWBĆĦ!!!µ!RB!!!BBRĶ(2Ķ!!!B!ĖĖ22ĦRĶ !&RĖ2 !1ûû»û !'ĖĆ!!ĶÇ!!ĖĦ!!Ė!!CĶ!!22Ķ!BĦ!!!Ħ!RĦ !(Bc !<ĶĖ!Å!Ç!!ĶB !'B2!2R !*Ė!!22!2Ė!ö !;2 !'Å!cßl!!2!!B22!!2!!2 !&R !'Ķ !>µ2R!B·!!ß!Ė !&2!Ķ22 !'2R22Ħ!2 !&¶B !=B!!!Õ!c!Ė!!R!R2!2!222!!!cĦB!!2!!B!2Ć!s !<¤RR!RR2!RRR!ĶRĶ !+ĆcĶ!B !'B!!Ć !=2RR!2B!!SCC·!!!¤¤!!¤!22c!R!Ħ2!¤bbbBBB !=¤2RB!!¦S!2R!!Rx!!¤¤!¤µµĦĦĦBB !(bbB !>¤2R2!¥R¥¥c¶cx !+ ¤&!!¤ !F¤µcBļ¥RRchh !0¤¤ !I¤¤¤xxxh !>Ėĥ !ÃĖĥ !Äĥ !aĥ!!Ħ !^Ħ!!Ħ !`ĦĦ!Ħ !^Ħ!!Ħ !_¤ĦĦ!¤ !Â¤ !c¤¤ !d",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !?333ààà ![3ďÏÏsÇķ !Z3ďĆ!!S¶Ć !Y#ďB!BÇ¶ĦXt !X2BC!¦s!!¥R !4ccc !B#!æåė¶BĦĦ !5c!!ćtç !'C¦¦ !:B¦B!ĦĦÜ !.CCCØCCCu !&Ėd·!ħCĦĆĆ !:¦!ĦĦĦÜ!æĦt!tSS##S#CĶ·Ķ!ĶĶ·ô!ćsBĦĶĶ3ÆĦBcB !7#×ĶĬåööÜ!æ!!Ķt!ĖĖ×RĶ!ĦĶµĶµĶĶÅ!!2!!!RĆ!ĶBĦæĆ !8Å!!jĥ!ææĶĶ!2Ħ!!R!22 !(bbQ!ćcBĦĦĶRc!B÷BB !;×Ķ!Ħ!ĶĶĶ!2!×Bµ !&×b×b !&2ĖĆ!B!!!2!µcc !/MMÑM!!!#!s!×µ9ĬĶĖĶĶ2!!!Õ!!!BR2µ!ô !(ĶĶ !(·BĆĆ !,ĀSSyy¤ąİİİįįæcµ!!2Ė Ķ&¦ !&× !&2ć !+ Ķ'!!!BB !+Ā!ß!ÖĆI Ė&!!įĖc!!2ĶĆĦ!!µ!2!!õ!!!2!2ć !* B'2!B!B !*ÐĖĖĆď<ÿ!½íRR!!d°Ķ!!!2!!!Ķ !+22!×ććć!!!22 !(õtBB !,RRĶĕíBR2SSÇ¦ĕĖ2!2 !'ĦBB!RĶ!!BB!2!Å222ć!ĶB2! 2'!1R2 !)Ð !&C!!R!B!sĆļCå<!B!· !)Ķ!!!2!BBB2!!!2ėbĆR22 !'æĖĶ !)ÝÝRRR!CĠ2RİåĦĦĆ!ĦÆ¥2!!!BĦ2B2!!·!!ĖB!!¦·BBB!B!!Ė!Ķ22 !&¥c !)BBB !&ĖĖ]ĖRscb!B !&µ!!Ç2!dĦĦµ! 2'cĕRRRBçćbĖĖ!Ė!ÕÅB!ĆĆ !)RR2 !&RBÜRÇ!Ħħ!C!!BĦ!cĦ!·!õĦ!B2BB!!!Õ B&RõbćĶ!ĦõÅ!!ÇçÇÇ !)ðð!!2!!HöĶļĆĖ!B!c!!!R!Ħ!åõ!Ħ!B!22!ĦBBB! B'#cc!õ !1īĕ!232ĥ!c22Ħöc,ĥRü!B2!!BBtĦĖÇ!B2!!!cBBBĶ!BB¤ąąącÇÇÇ !&R !+22!22SĐ2!2!!öĦS¥!! B'!ÕĖ2å222!ĦĦ!!ĶĦĶĦĆ!çÇÇÇ!!!Ķ· !/(CC!ĶB(RRÀ!ĕĥĦR!2cĆĦB·BBĖ2B!B2!ĦĦc!! Ķ&!Ħ !&c !&·!R !-ī¥ÌÌÜ¶äÐB¶×ÇöæČBĸt!BræĦR¥BR2!ĆĦ!B !'R !(Ėc !4Ë¤¤°°¡RěËËÌüìBĆAħBĆBBĦ!ĶB2ĦĆ!!B!!!B!!Ė!ĶĖĶc2!!2 !6ûû»û!!!¶!ĦĆ!ąĤĆc2!BĦĶ!ĆĦ!BB2Ħ!!Ħ !'B!Ħ!2!!!BB !:ÕĦ!4!!!s22!!! B+!!!2!!!BĦ2 !(Ė2 !;B!Ĵ!2!2ĶBBc¥B!BBR2BRBĦ!!!22ĶĦ2B!2 !&Bc !;Õ !&R!222!B¤!ccRRB!Ħ!B !(BĦĶ !(ö !<B!!!ĦBRRR¤¤!¤ Ħ(!BĦ!B!!22Ħ22 !C¤2!!!Ħ !)¤¤¤!!!BĦĶ2Ħ!B!B !&B!2RB !>224BBĠĀİ !)¤¤B!!2!c2Ħ!Ħ!2 !&B!!s !=¤2ńĠĠĆ2 !,bb¤!2!!22c!BBBbbbBBĦ !>¤ĠĖĖcBµĐàĐ !+¤¤ĦR2!Ė2!!b!!!bbB !?2!R2µĖĖRtÑ !,¤b¤222!b !FËR2µĶ!Rt!Ö !/¤¤¤b !IĆ!Ħ!R !@Ėĥ !<ËRt!R!!!¶ !ZË!B!CBB» !<Ėĥ !?û8Ķ!Ħc !_8ccË !=ĥ !Cëë !=ĥ!!Ħ !^Ħ!!Ħ !`ĦĦ!Ħ !^Ħ!!Ħ !_¤ĦĦ!¤ !Â¤ !c¤¤ !d",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !CĐĐĐ !^ĐĐ!!!ŀ !YddĐ!!!BB !XC#ĦÏBĶĶĶĦĦ!ŀ !,¦¦##ç !F#Ħ!ğBĖ2!!!B !'U!é !&Ć!!!ö·C!!!CCC¦ !<#Ç!!!Ħ2!!!2!!3!é!¶!¢!!S3¦æ2sBæ!C3CĦĦĦĆ¦ !:d!Å!!!Ķ!R !'2!¢é!!!SSĦ!!2cBĦ2!!sĦ!!Bc !;Ć!!Ç!!2 !)BU!¢Ô¦SĦĦ·ĶÅcBĦĦ!!!Ć¥!!ĦæR !93!!!22!RRd !'B¶éSRĖ!·!Å!!ĖĆĦĶ !*BĖç !8Ķ!!!µ2z!C!2 !&B!ÔR!!ĶÕĶÇ!!ĶĶ!!!ĶĶĶĖ¥!!c !;Ç!!2!Ėzĥą !(Ą!!!÷!!!Å !&Ħ Ķ'Ė!!!ĆR !:Å !&2!z½!!22!Ć !&r!!Ç !'BcRcccR!!!BĖ!ć !9Ç2!ĶBBB2B2!!¦B !(×Õ 2'!!222!Ræ !E2!!2Ķ!Ėå!÷!Ç÷DSÇ!!!B22ĶĶ!!2!!!RB!B !-SSTTt¦!!!ĠĠB!Å!!!öÖĶ!Ķ!!!ĕ!!r!Å!Ħĥ!!!BĖR! 2'!BB¶RB !-Ā!!!ĥĆð-ĠĠĦĦğBħ!!ė!!2Ħ!!BdĮd!!ĶÇ¤0ĦÕ22!ĶĖR 2&!!22ÖĖB!Bć !)Ā!!!ÎïïBĥĦĦ!!ĆĦb!ėQ!RĦĶ !&¿BĶ÷!ÅB2õÇBÇB!ĖĖ 2&B!!¶ÖcB !+ÐĖ !&ėRÕ !&J!ÿĦø¦ėħĶĖĶ!!dB!!BµĦ!!ç!å¦!2!Ķ!Ħ2BccBRĦĆcdd !,ĖÏÏzQĖRĖ!!!Ğ¦l!ÆµÅæĨ·!zB!!!8ĦĦRĖBÅBBąą2¶×¥RBB!ĦBcBB !,C!!R !'Ė!ľRR!õ:sĄtÇÅP!!Ķ9ľkĞ!×!ĖRĦR!!!B221BÇB!!cBBBc!RRCBć !&¯!R2zzRB!!!|dd!Bs<$@Aħ!ÕĦć!ĴÖ@Ćb!!Ķ!!cBRBBB!ĦÕĖĆĆĆBBB!!!AÅæ !' R&cBĶÍ!RR¥®¶!Ccöńc!b!!!Q!ćõĦĶ !)B2! Ķ&!!Ķ!ĦÖ¶ÖA!A!Ė2 !'RR2Cs!B!!!ÇĬ¥Zľĵ!R!2!2·Ķ·çB!ć¸ć2!B22Ķ!!ĦĦ Ķ'd!!ĶĦ!ĦtÆ!RR2 !'CC!sĐB2RRÇæĖ!!k!!¥B!!!ÕĨĶµĘ·Ņ!ĥBB2!2!ĶĦĶĶĶtt!!õ2ĶĦ!ĶĶ!ĆĖææB !'B!SĆRBRÀĖĦ!2!!CC!!R2R$ĶÅ2Ĩöå3b!!22B!!!ĶĶĦĶåõ!!ĶĶĦĶĶ !/sB !&]BRsccĦ!ss!8B!!ń!ÕåPŅćæĥ!BeT!!!ĦĦ Ķ'CĶĶĦ!2!ĶĶ!!!cc !(Ës!!!2ÜÆÇ!Ħ<**cc !&B!Ĩ2!Ķ#ĔöCös!!cc!ĦĶĈ¦ĶĶĶąĶĶĶ!Ķ !(ĆĆ !)ËscĖ!ĶČcĖcĦĖGxx8Ė22!Ķ02ĶTscĄå·!@ĔĨö!!Ķ@ħĘĶøĶdĶĶĦ Ķ&!!!BB !*Ë!R2B!!Ħ!cx!!!b!2Ėe×!!söÄ!Ć!åöĨĶĄĶ !&Ö¶eqĦÕĶ!BBBRRB!!!B !+ÛªµBBĬûÛx !'ĶĶ2ĴħBçd!Èæ¦Ķ!2Ĥ222!22·!!R !.RBB !.µµµ !-ĦĄBĦtqĄ2Õ !&222B2B·!ĤĔBR·22! 2&!!¶R2Ħ !8Å!22BdRa!!·22BÅ B&!2øaåĶC!!å!RR 2&!sæĖĖ !<22sÕcRĖõ2B!!¤¤¤!!BÄRą¦ą!!B!ĖĶBB!!!2!!¥B !9Å!!!å2BB222!¤ !&¤¤!2BBĕt!B!22ĦĦ!222¥B!ĆĆ !?Ķ!,,,Ġ !)¤¤¤µBĥ!!B 2&!ÅÅÅ!Çė÷Ç !:Å!!!22,!ĖöĦàİ !+¤µÅÅÅåBB2µ !CÅBB2,!ĖĆĆµs !2ÅÅµ !&AĥĖ!R !<¤¤,!ĖĆĦÅĖ··ŀ !;Ė !>x!!Ħĕ!ÇBB¦ !Yx!!öRR!!B !:ĖĥĦ !?Ë!!¦R!!B ![RsB!!!ª !:ĥ !BûSR!!B !:ĥ !Dī!!Bª !9Ħ!!Ħ !CËËª !;ĦĦ !`Ħ!!Ħ !_¤ĦĦ!¤ !Â¤ !c¤¤ !d",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !øCCC¦ !]3#ĦĦĦĆ¦ !Z#Ķ!B¥¥¥B !D##SSt !2C!!!ĦĦB2Bç !B#sÖ¥¥ct !*##!!333Ħ!!BBc2 !D#¥c[[[!c· !(#!s33 !(cc!!2!B !BR[!!!¯ !,Ķ !*ĆĆ !JĶ2!ðB!!è!!U!!Ķ !'B!!ĦBĦĶ!!!ć !A¯ĶĶ!Ķ!!!d!£!!Ĕ!!Ķ!!!ĶĶ !*B !BŅĆ!!!2!!!¦d!UĘė!ė!!ĶĶ !'RB!!Ķ !H23*!ąRĸµrĆ!QĦĶ!!2R2sBĶĆc2 !'É!!!çç !=B|ĭľ!!Ħ!ç!c !'BB!!!222ÖĖ !'Ã!!ç!!ç !=ýlHĖ×Ė1õė·ėėç!!2!!!2RcRBcR !Cŀ!!B2!Bt·Ķėķtt¶QQ¤!c222R2B2B2öĆBBb!!!ç!!B !9Ė!!!2dĮåÅbQĦ!sÖçėç!ĖR!222!BBcsB !?5 !'B!!cŃÇĖ!÷·P!ÕĶQ¤!ĶĖR22 !)AA !'BB !6ĳ!!5!!2Bd!!´!Ç!Ń!bµc!!!ėĖĖ2BBB!BB¤¤ !'ç !<ĭĶ !&ċ!§ĦäĆØ!!B¤Bç!QĶ!ĦBB!¤bbù !)B!!BB !4¦¦İĆ!!Ķ!Rèeä×!ôQ!å·ç÷Å!!ÖB2!!Bć!!p!!ù !<S!ėĖ !(æRęB!ħB!¦åÕ!!RRĖcc !&ùù!!!p !(d!!ç !0ĀĀ!ėĎ!!!B!d!×R!ħ!!ĶĶĵs2ÕBĶcR !(pp !=Ā!½ÏÎCĦĦĦĆ!Bî!ç!A!!ĶĖ!!s2cc!!!B!!!b !.RCB !/ÐĖ!Ĩ!Çåc¥¥¥B!{µQOĦ!Ħħ1æ!!sB¥sRB!!ĦĦçç××ÇÇç !&¥¥AÅ !2zPRÅ!Ħ!dd¦!ĶÅĖè¥eØ£!ĥæ!!B !&ĦĦ!!ĶĶ!ĖĶĶĆtt·åARccCB !-CRR!Đ !&ĶBB!!ĆDR£ĦB!v!!öÆÆĆ!!!Ħ!SĶĦĶĶĖĶ!!Ķ!!æ!!R2B !/¯!zRĕĖ!Ztd¤¤þĶåĤÅ!BsÖ!!!2!2ĦĆ!!SĶ! Ķ'22ĦĶĶĶQ!ħĦB !0R!QĶÍ!Rľ¥®!!ľR¯ĿćøçSÕŅ%ėB¦t!Ħ!ĦąĶtĆĖĶöĖ2Ķ!!!Ħ !5R!ė !&ÇČ¥!!:!JĞSS!s!!õT$22tB!!Ķt!Ħ!·!RĶĦĶĦĦ!!!c¥ !1CtcRRRÇæ!!¿cĝ!Rïõ¶!BC¥ĆµµĶĦrcħ!tÕRÇĦr!2ĶĶĦ!ĦĦ!!ĆĆ !1¥!BRÀĖĦ!RôZľC½RRć !&ærĦÔäôb!A!Õ·!÷ĦĦ!ĶĶĆĦĦ !&B !2Ûc!]BRscÀĦR¿:djI¤æĦ¤Aħ×ô¸!u!ö!S·Çrs!çĦĦĶBBB !8B2ÌÆÇ!Ħö}cB{¾dçÇąBç!Å¥ė¤ėÅėS!ĕåĤRQ!¤!!ç222BB!!B !3Û!ĦČcĖcĦĖĖÞBxēĆÓt!¤bbÕsħRħ×å¶BRçrĖ!ç!Ėµ2B222ė!R2Ħ !2ÅcĦ!Ħ!c!xģx!!ēfR³!Ç2ĆBÕcÕąBBö!õBRBµ!2!RR2B2!ėõĖ !4ÕcĬûÛxx!!!EEfRÓ!0cccBŀŀŀ<cRĶĖBBÕ22B!ĶĖ2BBBs2ħ¥B !4µµ !)ģģăÓĸ!!0Å!S!!Ć¤[ŀc2!cBR÷2!!Ķ!B2BB¥ĆĆĦ!ĥ !?0 !&ÅP!ĆĖ!SÖ¤Å¤¤BBõssĦ!Ħ! Å&!Ç×tC !Cĸ!!Ë!č!ĕ!~!!!¤ÅÅÅåĵs2µ !AĘ !'E !&0!!!Ė:dÇs !,ÅÅ !'AĥĖ!R !8P !0ĕĶ¥BBs !6Ė !>ģ!!é!!ĸ!!!d !UĘ !&Æ!!0!!!¥!!Rx !5ĖĥĦ !;P !&ģ !'· !bû!BBx !6ĥ !IËªª !6ĥ !aĦ!!Ħ !`ĦĦ !`Ħ!!Ħ !_¤ĦĦ!¤ !Â¤ !c¤¤ !d",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !³33t3C !-E !P3!!!¥s··Ç !*Æ !O3!ccB!!222×ç !(¢ !OĶ2ĖB!!2!2!!!ç !&v !O#!cc!!2!2!22!BE!!!R!É !OĆ2!2!2 !(ģ!!!2Éc !OB!2!2 !)ć!!!2Ã` !Hø!!#d !'2!!!2 !*2 !DccCC!!q!#¥!!RBĶ2!!22 !)É!pé !BcCd×ïĐĸ!#¥ĦĆ!ĶĆ !+B!b!Ã!!¢çç !?cCBl:!!*ŀRRĆ!!Ħ2cæ22!!!BB !(ùç !AøB!!!Į2!)sR !&ĖÆĶöĖĶBB!!!b !&ĴĘ !Aq!¿Ķl*:!÷c!× !&BBĖöĶĖĖĖ!b !)BB !>ĸ!!Ć!!|C;cuuÇ!BsBĦĶcsĶĦ!Rb!ù!É!ç!!Ĩ !?0ĆąZÏííĝĴĦĥôÖ×ĦĖR!2!2BRRBéęp!Ã!¤!B2 !AĆĎ½!Ï|e·tÈ!3!ĦöR2B22BBĸRĖÉ!!!ç!!2 !@Ę%Ï|Z!ĖĖĖ!!æ!ç÷È¶B!RBB!Q!¢Ã!!ç!B2 !APŃ½íĎÝRĥĥõÄ!Ĵsc!ĈTDĖĦĆ!ĥĶùéÙÙĸB!22 !EBõ11ÕÈäRå!ĄQ´Ą !'Rp¢!³0 !&Bć !BZC!!ķ·!!BsåBcsR!ĶB!!!ĹùBé!!B2 !@Ę !&*B0!bĕ!!!ĈR¥õc¦2RB!!1!ccB$ĨĨ !AP!ŀĮ:Cs#Rs!äT!¤ĨdccĵcB!!!ĥĖĖ/`ń@b !CĆ:J!»ħscB!Ĕ!ĥ¤çCĘĘĈ!ĦĦ !&ĉé$ !&CBć !AsĀAc!T!!!Td!÷ĶĶ!ĈĦĦööĄĤ`¢äÆ¤ĤQ !AB!dc!÷æ!ô!!!Ĕą2Ķ¤ń!!æåÖĖĶĖccĖĖ!Ćå!C !<ø!!ĆBBÜÿ!tķĆæ#øĦĥĶ!åĦĄäŅ!RĶöæ!dssBcB !>q!!¥|!°j*!cĸĸĆæĘĦb@$ĦĆĦ!ħ2Ė!Q!æBRBB!ĥ !@dJ!ö¿!ZĆÅ!×Br!ąĦĔeAA!!Ć!A!ħs22B !BUċ!zÍõ¯¯çÇB¥B!C!dĘĥ!!ħR!!!Cc2 !Døē!īĕîĖĦĦ!ĦĆ!BĆ!d¦s!!!AĖ!!!ĥĆ!2B !Bq!!Ĺ2!*@ÍíÕÕrrc!¦Õ!!Ø!!AAA!!B !HĴ!¥Zė¿[ttrtĶ!å·!!´!!ħħħ !Lèæ[õ!Įą!÷!Ė!!£ö !'2!!!B !Hĥ@RcĐîĆį!AĔ×!åB£å !&2Ķėt!B !IĝcĦÖ9ö!ðs@!·Ħ!¥ħħ!Ķ!22ÆöĶB!!!BC !BõĦĬ¥!ÿBą!×õÅµĆ!Bc!!QĶ¶¶s2ÖĦ!!BtR !CÕµĬc!!0x@!åcĘS!c¥ķ!1Ħ!R¥¥ĦĆBC !Gµxxx!U!!!¤ēPĀ!Bs!!!µµ Å& !KĘ!!ē!U !&ëĀĀLáá° !QP !&ē !'ö !-A!ĖĖ !NĘ !2ĥ!!ĥ !MP!!!Ļ!!Ė!G !*ĥĥ !SëxxG !*Ħ!!ĦĦ !_ĦĦ !`Ħ!!Ħ !_¤ĦĦ!¤ !Â¤ !c¤¤ !Ņ !e",
);
rawImages.push(
  "#c Ņc !_U !Å2 !b2!!f !_Bv!2 !T33t3C !(B!R !Sè×!!¥s··Ç!¹!2!Ã !R3!õcB!!222×P!!!f !RĶÅĖB!!2!2!!!P!!c !Q#!cc!!2!2!22!B2!Ã !SĆ2!2!2 !Zç!B!2!2 !)2 !S¤ !&2!!!2!!!B2 !TR¥Ķ2!!22 !'2 !SçĶÆĆĦ !)B!2ĩ !SĦ2!RĦ !&BBB !U£!·!ÆĦĦĶĶĶ!!!C2 !TŅ¤BBĖöĶ!!Ė !YçŅc2cĦĶĶ2BC!2 !Tcä!SsBcBccC !We!ėÅĦĶĦĶĦĦĥ !VĘ!¸!!d!!!B!!!R !URÔB!ÕRB2!B!!ć !UĦ!·!!ÖBBB!C!!!Ķ !Q%!Beä·ÖÖBB!ĦĥR !TĥSR¥ę·¸ØĈĸĸ4ĸć!!Ķ !TçÕµĴa Ĵ&0 !UĶ!ė!ħ#¸DT4TT4!!Ħ !SBcRRRB!2 !'ĦĖ !S2!cĖĤQĦBB !&Ć !SĦ2!!¶§3¥ ![RĴ!!¥ Ņ& !'B!ć !PĶ!!¥ŅåbĆĆrqÔôĔµRB !S¸åæq1ÔÅt·ĦĦĦą !S2ĦåĆôuħu2ĕĕBB!Ħ12 !RĶ!Ħ!Õ!ĥ¥cBB!!!ĥ !RBĶĆô!!sR! B( !UĦ!uc2!B !ZĖå!ôĆ!B !Z2õ!u!B !*B !SCĦ !-B !TŃô!ô!B !(B !Xėu!B!!!BB !WĆ!¥ÅöĶ!!B !'C !T1Ć¥Æ!æĖĆĦ !&R !TĆ!!Ħ2RĶĦĆæ!CCć !Uĕ!2!] m&!ĥķ !WÕ!!!Ėææ!İ4 !YÅÐæľ!ĖĖ !'Ħ !VąÅrÅ!RB!!!Ķ !W8 !&ĖĦ!ĶĆ !YtĖ!!RBĆĖĦ !YċÏ!!ĖĦĦĦRĄ¤ !Xċ!!RBRRĤ ![t!ĖĦ``!¸ !ZċċªW!!¤B !Â5!!B !_Æ!!R !_³!!R !`5!p !`Ö !b¢!!!",
);
enemyFrameOffsets.push(rawImages.length);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !Ņ !Ņ !Ņ !Ņ !CS× !aĕæ× !,¦ !UB! h'×!!!·Ć !GttS 3-!! Ė&2ĆtttĦc !Gõõĕ ĵ-2! ¥&Bcõõõc !X Ñ'µ!!!Ķc !T·Rµ !+Å¤ !TÕµ !Ņ !Ņ !Ņ !Ņ !Ņ !Ņ !İ",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !Ņ !Ņ !Ņ !ī¦dç!!SS ![Ħc!33!ĕ !YxxBö¶!!ĕ !XC×ĶröĦc©ĵ !XCcúĖ·s¶s !^RR!!!Ñ !Y¶!>RRĦĆĖ !ZµRR>ÑąąÕ ![µµµ !Ņ !Ņ !Ņ !Ņ !Ņ !Ņ !Į",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !Ņ !Ņ !Ņ !Ņ !G×S !T¦ !,×æĕ !TĆ·!!!× h'!B !UcĦtttĆ2 Ė&!! 3-Stt !HcõõõcB ¥&!2 ĵ-ĕõõ !GcĶ!!!µ Ñ' !W¤Å !+µR· !aµÕ !Ņ !Ņ !Ņ !Ņ !Ņ !Ņ !Ĭ",
);
rawImages.push(
  "#c Ņc !Ņ !Ņ !Ņ !Ņ !Ņ !Ņ !Ņ !Id·Ç !_dR22ç !ZtthB22 !]ĺĺł !_7ĖĖ6!2!!B !X·_RRB622Rb !W·!õ.N>Ñ¤¤b !XÕÕ!cB !aµµµ !Ņ !Ņ !Ņ !Ņ !Ņ !Ņ !í",
);
// }
// }

// Episodes {

var episodes = [
  {
    levels: [
      {
        worldMap:
          " H4IHIHHI H&IJI H'IHKHHIHIIHII HDII---H *;I HBIH---e *;I HBIIx--H *; HFIHHHI*HHJHH***HHHKIHH*IHI***I H>IJHIHJ H'***IHIIHe H)***HH***I H9 )&I))){)))IHHI***H (+IHH***II*** H: )&M)l)))l)MHHH***I(q ('q(HHHj**HH***I H9 )&H ))HHJHHJIH (+HHIHJIHI***I H9 )&Io )(H E(H (+I *,HH] H9))K)))k)))e E(e (+e *,K]#] H:Io )(H E(H (+H *,HJgJ H; ))HIJIHJHH (+HHIHJIIH***HDDD H:M)l)))l)M H(I(q ('q(I H(I***HDDDHDD H8 ))I H) (+I H)***IHHDHDD H8IJIeHJ H,JHIJHIJ H*I***HDDD H=FFF H2I H+I***HDDD H7IHIHHIFFFI H:IJIe H< F+ H=DDDHDD H7I F+M H;IDDDIDI H7I F+ H=DDD H;FFFHHHFFFI H;MDDDM H9IFFFHHIFFF H<IDDD H:IFFF HCDD!I H9JFFFJ H'I H;IJgJ H;FFF HC]D] H:IFFF H) S*HIHMHIIMI H,]HIH O/ H,FFFI H( S*HHq $'q H/OPOOPOOPOOOPOO H(SSSQSeSRSSSHHHSS &&SSHI $)K H-OO %&O%%%P%%%L H(SSr G(SSHHHSS &&SSHH $) H.OP %&P%%%P%%%P H(SS G) S)Q S'HJ $)I H-OO %&O%%%O%%%O H(SQGk G'Q S(! S'HI $)HH O-P %&O%%%O%%%L H(SS G)SSSRSSS&SSSQSSq $*OOPOPPOPOPPOOOeOPPOeOP%%%O H(SS G)S &.Q $+O $-O %.P H(SSGk G'e &.e $+e $-e %.N H(SS G)S &.Q $+P $-O %.O H(SS G)SSSRSSS&SSSQSSq $*OPPPOPOOPPOPOOeOPOOeOP%%%P H(SQGk G'Q S(t S'IH $)H O)P O' %&O%%%O%%%L H(SS G)SSSHH S(HHIJ $)II H,OO %&O%%%O%%%P H(SSr G(SSSHH S(HHIH $)KI H,OO %&O%%%P%%%O H(SSSQSeSR S& H,II $)HI H,OP %&O%%%O%%%L H( S&FFF S' H,IHq $'qII H,OO P&OOP O( H( S&F!FSS H/IHIM$$$MIHI H, O1 H*SSFFFSS H/IIIPPeOOIII HCSSSQSSS H1PO'''OI HE S) H1PO''' O/ HPPO '&OPPOPOPOOPOO HPPP '0PO HPPO '0OO HPPO '&OPOPOPO'''OO HPPO'''P O*eOOO HPPP'''POOPPPOP...PO HM P''''OO P&O .'O HMP O'ePOPOPPPOO...OO HMPO C+POPO .'O HMPP C+OPPOP...OO HMPO C(sCCyPPO .'O HMPO C+PPPOP...OO HMPO C+OPPO .'O HMPPx C'sCCzPPOO...OO HMPPx C*PPPOPOLOPO HMPPxx C)OPP O) HMPOOPOPLPOPOPPP HT P0 H9",
        objectMap:
          " !Ú²£!!!£!!!£!!!Å !&£ !'£÷!¿ !ÿė!± !? ³& !(¹¹ !'£!!Ĕ !.£ !&£ !; ³&!· !'¹ !&±Î¸ !'Ò !I·¹¹¹!¸!Ì!!Ĕ !-£!!!£ !G··¹ !d¾ !+£!!£ĕ !'Ã !*£!!ę!Á !A· !a¸!!ó !/£!!!£ !dĕ !1¾ !;ė !&ĕ !<£ !)½ !Ā¾ !a¾ !;£ !&Í£ !B² !¤ñ !>Î !ÄĖ!ò !<£ !ě¿ !W³³µ !;¥ !,Ĕ !;²² !&ė!!¡ !3± !'Ç !>¾ !H£ !:Ì !DË !rÏ !d¡ !'ó£!!!£!!!£ !(¡ !(£!!!£ė!!£!!!£ !&£!!!£± !Ā± !IÒ !4¢ !*£ !/ó !7¡ !=ò !^¥!!!³ !.·!¸ !`·Ė¸ !`¸·¸ !x¿ !bĶ !bÃ !Ìĕ!!!Í !ńÆ !aÄ!¿ !Q± !&ÅēÁ !)Âì !`Ä !bĒ !Y± !)Ã!À !Q~ !.°!Â !TÎ !.Ķ¦ !UÃ!!!± !`Ė !â",
      }, // 1
      {
        worldMap:
          " H4JHHHIHIJIIHJHHHJ H'IHIIHHIHH]HIHHOOOPOPOPPOO H1I F&IH 08HHH]B]HHHOp ,*P H0Il F&!I 08IHIHgHIHHOO ,*O H0 F)K 08HGnGGGnGIOO ,*P H/JFFk F&Hq 07HGGG!GGGHPOs ,)P H0 F)e 08hGG! G&I O&,,,POOO H0 F)I 0'IHJHIIJIHHIH000HIH G(!IO,,O,,,O,,O H/I F)I 0'IIHHHIIHHH 0)H G)HO,,O,,,O,,P H/I F)e 00I 0) H&IHIHHP,,e,,,e,,P H/JFFk F&Hq 0/H 0)I H*O,,O,,,P,,O H0 F)K 00I000s000HH /(H O&,,, O& H/IHl F&!I 00I 0)IH /(HO,,O,,,O,,P H1I F&IH 00HHIIHI H& /(HP,,e,,,e,,O H/ I'J I'000HH000HHe H'IHHIHHHeHH//HO,,O,,,P,,OSSSQ S, H,000HH000H...HH +)H&&&H//HPPOOOeOPOOOSr@@@rS<<<S:S: S-eSSI000H...HH+m+++m+I&&&I//H /+OOR @'e<<<R:S: S,777SI000I...HI +)H&&&H//e /+TOS @'S<<<S:::Q S+777SH000I...HH +)J&&&JIII /+OOS @'S<<<S::: S+Q777QH000H...HI +)H&&&HOOOPOOPOOOPOOOQ @'Q<<< S0777SH000H...HH +)I &&P%%%O%%%P%%%PPS @'S<<<Ro:oR S+777SI000H...HH +'m+I &&O%%%P%%%P%%%OOS @'S<<<S::: S,777SH000I...HI +)H &&O%%%O%%%O%%%PPR @'R<<<R::: S,777SH000 H( +(IH &&P%%%O%%%O%%%OOS @'S<<<S:::Q S+777SH000 H&IIHHeHeHIq &&OOePPOeOPOeOPOS @'S<<<S::: S,777SI000HHH&&&H &-O %.OQ@@s@@Q<<<Q::: S,777SI000IHMk&&e &-e %.LSr@@@rS<<<S:::R S+777SH000IHH&&&I &-O %.PSSSRSSS<<<S::: S+R777RH000HHHIIHHIeIeHHq &&PPePOOeOPPePOOSS <*R:::SSQSSR S&777SH000I H' *(HH &&O%%%P%%%O%%%OOSS <*S :*S666S777SH000H--xHHm *(H &&P%%%O%%%O%%%PPSS <*S :*S666SSeSSI000H---HI *)I &&O%%%P%%%P%%%OOSS<<<SS<<<Q :*e666S555SH000e---HH *)I &&P%%%O%%%O%%%PPSS<<<SS<<<S :*S666S555SH000H---HIm *(I&&&IOPPPOOPOOPPPOOSS<<<SS<<<S :*S666Q555RHIIHHHIHHI *)K&&&K ',IOOOSS<<<SQ<<<RSSQSSRSSS666S555SHPPPOOOHHI *)I&&&H ',IIIOSS<<<SS<<<S ;*S666S555SHP11O1OHHH**j *&H&&&H ',I'IOSS<<<SS<<<S;l ;&l;Q666R555QHP11O!O H'IIHpsH&&&I '.IOSS<<<SR<<<Q ;*S666S555SSPPOO1POOO H(IHHeIHIIIJ I&H I&HSS<<<SS<<<S;;k;;k;;e666S 5'O 1)O ';ISS<<<SS<<<S ;*S666Q 5'e 1)e ';ISS<<<SQ<<<R;l ;&l;R666S 5'O 1)O ';ISS<<<SS<<<S ;*S666S555SSSOOOt O&IHHIIIHIIMIHIIHJ H&IH'''ISS<<<SS<<<SSSRSSQSSS666R555Q55SSPPPSSIHIHI H&IIHIHHIHKHIHHH'''ISS<<<SR <.S666S555S 5&SPPSSHxx333H 2(I ()HK'''KSS<<<SS <.Sq66S555SSSQSRSQSSHx33s3Hj222k2H(k(l(k(IH'''ISS<<<SS <.e666Q555RR 4&o44RH 3'I 2(e (*Iq''ISS<<<SQ <.Sq66S555SS4o 4&rSI 3'Hj 2'H (*e'''ISS<<<SS <.S666S555SS 4)SH 3'H 2(H(k(((k((Iq''HSSSe S(RSSQSSRSSS666SSeSSQo 4(QH 3'e 2(I ()HH'''HS ?+Sp =)S666S666SS 4&o44SI 3'Hj 2'H ()HI'''HS?k ?'k?SS=s==s==S666S66oS 4*SI 3'H22k222H (*Iq''HS ?+SS =)S666Q666e 4*RH3x333H22k222H (*e'''HS ?+SS =)e666S66oS 4*SH333s3Hj 2'I (*Iq''IS???k?k???SS =)S666S666SS 4)SH333s3Ij 2'H () H&IIS ?+SS=s==s==S666R666SS 4)QI 3'I22k222H () H&IHS ?+S =*S666S666SSo 4(SI 3'H22k222I(k(((k(MIj)jIS ?+ S,666S666SS 4)SI 3'Hj 2'H ()HH)))HS ?+S >*S666Q666SS 4)RI 3'e 2(I (*H))!HS???k?k???S >*S666S666SS 4)SH 3'H 2(I(k(((k((e)))IS ?+S>>>j >&e666S66oS 4*SH 3'Ij 2'H (*H)))HS ?+S>>jjj>>>S 6)e444r44q4QIx 3&I 2(e ()HH)))HS?k ?'k?S>>>j >&S 6(oS 4'o44SHx33s3Hj222k2H(k(l(k(MHpIpHS ?+ S, 6)SSq 4(SHIHyIzH 2(H ()HHIIHI S@RSQSRSSHIHIHHHIHHI H&IHJHHIHHHIHH",
        objectMap:
          " !½¦~!Æ!Å¿ !4Ï!!!Ĕ!!Åï !3¿ !2Ä!ì !3³ !,£!!£!!!£!!!£!!!£ !/°Ä !&À !2±± !+¿!!á !-ęíÁ !'ā !*Â!ÀÁ!~ !RÍ£ !+Æ !Zĥ!!¿~!Ã!¿!Å¿ !1± !*ö !@ì!!!Â!!°Đ !1± !LÄ !7± !+Å!!!ã !&¿!!!¸ò£ !/Ã¦!Ē!!!ÃÁ !1³!!!ò !)£!!£!!!£ !'¸!!Ħ !&Å!!¿ !CĖ!!Ã !+ÑÁ !'Î !(£ !+Ã!À!!¿ !Y¦!!!Â!!!ì !Y¦¦ !(Ã !EÀ !2Î !9³!³ !5Æ!Â !F£!!±!± !6ÄĶ !'Î!Ă !(Å£!Å!£!!!£ÁÈ !/³!³ !=£ !'£ !4ð!ð !5Ĕ !+Ă !K¾ !6Î !*ħ !*¥ !'¢¢¥ !.£ !L± !P» !.£ !4Ì!ÌĖ !Y± !0£ !V¹!Þ !)Ĕ !9ė !?·!!!·!!£ !2Ì !,£ !&£ !'£ !&£ !&£!!£!Í!!!¹¸¸ !@³³ !I£ð !tÎ !;±!!± !(£ !&£ !H£ !&¢ !B£ !/ĕ !J£!!£ !0£ !&± !6¥ !&¥ !1Ï !6±± !'£ !;£ !&£ !.£!!!£ !7£!!³³³ !&¸¹¹ !M¢ò !(Ò!!³³ !'·¸¹ !2··¸ !1¶³!³ !*¢ĥ !0·¸ !1·!·!Ì!!Ĕ!!£ !,¾Ì !2µ !2£ !&£ !V¾ !/¹ !b¹ !+£!!!£ !&ė!!£ !&Å!!£Ó!!£!!!£!!!£!!!£!!!£Á !0¹ !W£ !&£!!!¹!!¸ !h£ !'¾ !d³³³ !*±!±!!!¤!¤!!!¸!!!³Ĕ!!!£ !3Ï !9~ !(Ì !6£ !&£!!!£!!!£ !&£!!!£ !&³Ì¸ !'Å!!!¿ !.Ì !'Î !K¸ !<Î!Î !2Ĕ !,¸!Ì¸!!¸ !8£ !9£ !*¸ !&¸!!¸!~ !X¸ !@ò!!¸ !,£!!£ !<ì !<¡ !+ß !'£!!!£ !1° !)± !&¡ !(£ !,ā!!!³ !F± !1¸ !(¹!!!ă !+ð !(Ė!!!ñ !A¸¸ !(·!!£!!£!!Ħ!!£!!!£ !4~ !6¸¸!¹!!!··!¤² !-Î !>ò!!!Ė !)¸¸!¹ !&· !?± !'~ !0~!~!!¸ !0Å!¿!!£!!!£ !0± !7ĕ !,² !(Ķ !3Í¸ !?Ħ !FÃ!!!Á !8³!!!¡!Ý!³ !-£!!!£ !/®!!¸!!!Ï !6¸!!!¹ !&±±!!Ã!Á !.¹ !)±¸!± !.Î !3¸ !7¹¹ !/¤!¤Ė !'¸³ !j",
      }, // 2
      {
        worldMap:
          "IHIHIHHHIHHHIHHIHH VP H' %&HJH %'HV 1LVVVHH%%H %.IV11 VI1 H&%%%H %.HV11VHIHHIHIHHIHHI H/IHI H&IHIHH1I1HH%%%I %&HJH %'HV11VI :)IH 9'HHHtItHtHH 0' H&11H11H1HI%%HH%%%HHJHH %&HV11VH:n:n:n:I 9)H 2(tI0v000jHHI11HHHI1HI%%HI%%%H%%%I %&IV11VH :)H 9)H 2(HH 0)HH11 H&1HH%%HI%%%H%%%HH%%HHV11VH:n :'e 9)e 2(tH 0)e111H11H11I%%HH%%%I%%%IJ%%JIV11VI :)H 9)H 2(II 0)HH11I11I1HI%%HI%%%I%%%IH%%IIV11VH:n:::n:I 9)H 2(tH0u 0'HI11H11H1HI%%HH%%%I%%%H %&HV11VH :)IH 9'HI 2(HH 0)HH11H11H1HI%%HI%%%IH%%M %&MV11VHHHIe H(IHIHIHHIHe H'IHeHIHHIHHM H'I H'eHHHMHH %&IV11VHH ;'HH I*xx 3'HH /&j/I H,%%%H$$$H777HH%%HHV11VHIr;;;rIH I)Hx 3(I /) H-%%%I$$$H7k7IK%%KIV11VHM ;'M I+ 3)H /) H.%%H$$$I777HH%%II V&HHr;;;rIH I* 3)e /)M H-%%I$$$I777H %& H(M ;'MH I)H 3)H /) H.MHI$$$H777H %&II)))HHr;;;r I, 3)I/x /' H-$$$H$$$HHeII %&HH)))HH ;'HH I)H3y3H3z3H/xx/// H. $)HFFFIH %&I)))HIIHeHIHHHIHI H/IHeHHI H,T $)eFFFMM %&e)))H <) H2Ijjj,, H/ $)HFFFHH %&H)))H <) H3jj,,,IHI H+I$$$H$$$HHeHH %&HH)))I <) H2I ,) H.MHH$$$H888H %&JH)))H <) H3 ,)I H,(((I$$$H888H %&IH)))H <) H2I ,) H,I(((H$$$I888H %&IH)))I <) H4I,,,IHI H,(((I$$$H8k8I %&JH)))H <) H4I,,, H/(((H$$$H888H %&IH)))HHIHeHIHIHIHHII H+IIHHeIHI H-((HHHeHHIMHH %'I)))IH ='IHHIHJHIIH 5)H +(jI *)HHI(((H%%%HH%%H %'e)))I=o===o=HHk666k6H5n555n5H +)H*s***s*HHI(((H%%%H%%%H %'I)))H =)II 6(H 5)I +)I *)HHH(((H%%%H%%%H %&IH)))H =)IK 6(e 5)H +)I *)IHH(((I%%%I%%%I %&IH)))H =)HH 6(H 5)H +)H *)HII(((I%%%H%%%I%%%HHH)))I=o===o=IIk666k6H5n555n5H +)H*s***s*HHI(((I%%%HHJIH%%%MHH)))HI ='HHI 6(H 5)H +)I *)HHH(((I %-HIH)))HIHHI H'IHeHI H'eHHHIIHHeHHIHHIHeHIHIHI(HHH %.HH )KH)III(((I %.HH )KJ))HH(((IHH %' H(I )KH)HHP O&PPPOeOOPOPPOOOHIHHHIHKHHIHHHIH I&HHHIHHMHIHHIIHIIHIHeHIHHHO ('P ('O ('OI C/H B)H A)H???H >+IP ('O ('O ('PJ C/J B)h A)e???H >+HP(k(((e ('e(((k(PI C/I B)I A)H???H>>H>>>I>>HO ('O ('O ('OHCCC S)CCCIBBB H'IIHMHIHH???H >+HO ('P ('P ('OHCCCS D'SCCCHBBBHBBB H& A&H???H >+HOPOOPOP ('OO P'ICCCS D'SCCCHBBBHBBBIH]H A&H???e >+IO ('O ('P ('OHCCCSDkDkDSCCCHBBBHBBBH]B]HAAAI???H >+HP ('P ('O ('OHCCCQ D'RCCCHBBBHBBBIJgJHAAAI???H >+HP(k(((e ('e(((k(PICCCSDkDkDSCCCH B-IAAAH???I>>I>>>H>>HP ('O ('O ('PHCCCS D'eCCCI B-IAAAI???I >+HP ('P ('P ('OICCCS D'SCCCI B-HAAAI???H >+IPPPOPOO ('OPPOPOPJCCC S)CCCJBBB H'BBBIAAAH???HHIHHeHIIHIP G'O ('P ('PHCCCS E'SCCCIBBBHBBBHBBBHAAAH ?/HP G'O ('O ('OHCCCS E'eCCCHBBBH B)IAAAI ?/HPGkGGGe ('e(((k(PICCCSEkEkESCCCHBBBHBBBHBBBIAAAH ?/IO G'O ('O ('OHCCCQ E'RCCCIBBB H'BBBHAAAHHIIHI H&IHeHHO G'P ('O ('OHCCCSEkEkESCCCH B-H A/H@@@HOPPOPOO ('POPOPOPICCCS E'SCCCH B-H A/H@@@IO ('O ('O ('OHCCCS E'SCCCI B-H A/I@@@IO ('O ('O ('PICCC S)CCCHHIIHIHHHIHIIHIHHIHHHIHHHIH@@@HO(k(((e ('e(((k(OI C/M @?HO ('O ('O ('PJ C/e @?IO ('P ('O ('PH C/M @?IPPOOPOONOLOLOPOOPOP H&IHHK H&IHHIHHHIHHI H&I H&I H)IHJII",
        objectMap:
          " !v² !R¾!£ !*£ !bÍ !P² !@Ĕ !=³!!!¾ !EÅïÆ !(Ĕ !@³³ !0ó !(Ä!!!¿ !,Ì!!!ĕ !7³ !2¡ !'Ē!¡!Ĵ !'¡ !)¡ !+³¾!!!³ !@Ã!!!À !-ñ !&Ï!!!³!!³!¶!!!³ !2·¸ !.ÂíÁ !&ó !5³!²!!³¹ !2¹· !1° !5²!¾!!!²!!¹¹ !+¾ !(¸¸ !N¾ !3¸· !?Ĕ !8¸¸· !)¸· !=~ !:Ï!¸ !)¹¸ !P¶!!£!!!£¹ !0¡ !1¡!!ó !&¡ !1²²!!!Ì !FÏ !IĔ !AÎ !]± !tÊ !&£!!!£ !&£ !&£ !Íð !`¡ !9¡!!ó !-³³² !6Ï !8Ï !3³³²!!£!!!£ !3ė !F³!¹!!Ė!!Ï!¹ !X¹¹ !'¸ !,Î !fė !DĔ±± !0¾!!£ !)· !G± !;·!ó!!!¸ !0Ì !&Ì!!~!!!¢ !@±¹!¡¸¸ !'¡Ì !(¡ !)¡ !(Ì¡ !0³ !/¹¹!Î¸!±!!Ė !(ò !6ñ !.³³ !.¹!± !Nò !5·· !°£ !*£ !+ĕ !E² !8£ !/£ !)£ !)£ !)£!¾ !CÍ !@² !&¾ !b¥ !&ė!!!ĕ !*Å !'÷ !'¿ !e£ !)Ï!£ !'£ !1£ !'£ !'£ !(Å !)¿ !R±¥ !>¾ !Lă!ð¸ !Có !KÌ !4£ !*± !6¹ !=Ė!!!Í !.¢ !4² !L£ !'£ !'£ !*¸ !+Å !+¿ !X£ !)£ !D¥!!± !)Ï!¸ !&Ð !:ė !>Ò !L±± !7·· !.¸ !/Î !&ė !)±ė !7·!Ï !)ö!!!ó£ !&Ð !(£ !+£ !'£± !&£ !'£ !*Ü !/¸ !<ó!¢ !&Í !(¢ !*¹ !K» !7¹ !>·¹·¹¸¹!Å!¿ !-ò !/³!ó!Ħ !(£ !)£ !+¹·¹¸¹¸!!£ !5¢ !(³³ !*Ã !+Á !*·¹·¹¸¹ !*ė !b£ !'£ !'£ !(Ã !&õ!!Á!!!Å !6Ó !&Ã !&±¥ !0± !3£ !;£!!!± !4Ã !-Á!Ã !6Ñ !(Á !d",
      }, // 3
      {
        worldMap:
          "HHHTI H'IHHHI H&IIHHHIHHIHHM I&HHIHHIIH I&HHIIIHHHIHHIHIIIHHH$$$H$$HH &1I{ '){I 1.H D' H.$$$I$$$H &1H '&k '&I 1.H D' H-I$$$I$$$I&&&XXX&&&XXX&&&K '+K 1.e D'HI H+I$$$I$$$I&&&XzX&&&XzX&&&I '+H 1.IDDDjjHI H(IHHH$$$H$$$I &1H '+I 1.HDDjjj H*IHHI$$$I$$$I &1I''IJeJH''HIIHI111IIHIHHHIIIHHI H,MeM H(eHIIH&&&HHIHe H&I'''HIIHIIHH111 H5IHHH$$$HHHj B(I&&&I C)IH'''Hl 0&lH111 H8I$$$IHHjj B'H&&&HCx C'II'''I 0(H111I H7J$$$JHHjj B'IIeHICxxCCxxHH'''I 0(I111 H9$$$IHHjj B'H%%%HCCxCxxxHI'''H0k00k0I111I H7I$$$HHHBHHIIIHI%%%HHHI H('''I 0(I111I H7J$$$JHHBBBI %-I 9&H'''I0k00k0H111 H9$$$IHHBHBH %-H 9&e'''H 0(I111I H) 4, H'$$$IIHIHHH%%JH%%%HK%%I 9&I'''I 0(I111 H* 4, H&I $)IHI%%IK%%%JI%%H I&H'''HHII000HIeHI H) 4, H' $)H %1H '+H000H((( H* 4, H&I $)e %1e '+e000I((( H* 4, H&I $)H %1H '+H000I((( H* 4, H&I $)IHH%%HJ%%%KI%%IHHIHH'''IIHIIeHH((( H* 4, H'IHIIH I&H%%KI%%%HJ%%H I''''H (, H* 4, H& ),I %-H I''''H (,I H) 4,HHHK ),H %-H I''''I (,HII H&I 4,IIHI ),IIHIH%%%IHIH I'H'''I ()HHI H&IHHH44HIIIHI H(IeHIIIH ))I%%%H I*H'''H ()I33oHJH333H44H 4(I H& *(I ))HHeIH I*H'''H ()e 3&j 3&HHI 4*HHHI *&u*I ))H%%% I,'''I ()H 3+HI 4,IHI *(HIeHI)))I%%% I+H'''I ()H 3+H 4.II *,H)))M%%%M I*H'''I ()I33SSS3S33H 4'XX 4'II *&v *'H)))H%%%H I+JeJH ()H3j33S3S33I 4& X& 4&HI *,I)))I%%% I+H (-e33SS3SS33K 4& X& 4&II *,I)))HIeHH I)HH (-I33S3S 3&H 4& X& 4&HH*u *(u*H ))H I) (/H33S3SSS33H 4'XX 4'HI *,H ))H I(H (/Hj 3&j333H 4.HHIHHHIHH I& ))H I) (/H 3+HI 4,IHPOPPOLPLOOOIIHIH)))HHH I' (/e 3+HIH 4*IHHP,,,P,,,O,,OPOOPOeOOIH I&H (/I33oHJH333 H& 4( H&O,,,O,,,P ,(O+++P O&POOPO(((OOO P(HI H&IeHIIHIHeIHeIHIIHO,,,e,,,P ,(O+++O -*O(((Pl 6'lO 58IP,,,O,,,O ,(P+++O -*e(((P 6)e 58JO,,,P,,, O&POPO+++P--O--O--O(((O 6)O 58HOPOPO,,,POP ,&P+++P -*P(((P 6)PPOPPPOOPOPOOPP O(PPPO,,,P,,,PPO ,&O+++P -*O(((P 6)P 71POO] O',,,O ,&PPOOPOO+++P -*P(((O 6)O 71PO]E]OOPP,,,e ,)O +(O--O--O--O(((O 6)e 71PPPgOOOPO,,,O ,)e +(O -*e(((O 6)O 71OqEEEqOPP,,,P ,)O +(P -)xP(((Ol 6'lP 71O E'OPOPOOP ,&POPPOOPOOPPOeOPPOeOP(((POPOOOPO P'OPOO P'eOPPPhPOOPO,,,O,,, O- (8P O- 8,OP,,,P,,, O, (:P O+P 8,OO,,,e,,,P O*P (: O- 8,PO,,,O,,,P O*P (&HI H&I(((HI H&I((( O- 8,PP,,,O,,,P O*P (&I H((((I F'H((( O- 8,POPOPP,,,P O*P (&HHH(((I(((H F'I((( O- 8,OO,,,P,,,P O*P (&HHH(((H(((HFkFFFe(((P O+P 8,OP,,,O,,, O, (&IH (&I(((I F'I(((P O+P 8*j8PP,,,e,,, O, (&HH (&H(((H F'H((( O-888PPOPj88PO,,,O,,, O, (&IIHIHHI(((IIHIHHI(((P O+P888OPPOj88OO,,,P,,,P O*P (:P O+P 8&OP 8&OOPOPOPP O- (: O- 8, P, O*PO (8 O.P 8*OO P+ O*POOPOOOPOOOPPP O&POOOPP O&P O&P O& 8(OPOPOOPPOOOPPP OQPOOPOO",
        objectMap:
          " !e³!!¾ !.Í !*¸¸!!·· !5± !0£ !)£!ó!!!£!!!ĕ!£!!¸¸!Ü!!·· !'ð !&ð !*± !/Ç !@¹ !(¡ !+¡ !6³ !3ó !(¹ !)Ì !;£!!²³³!!£ !'£ !'£ !/ėė !)ĕĕ !8²³³ !4» !'ĖĖ !«ė³!!ñ!!!£ !.£ !'± !@£ !DÌ !FÎ !*± !0± !R± !P£ !(¾ !`³¶ !0·ė !&£!!Ì !H² !1·£!ó !'ó !3¸¸ !(ºº !(£ !.Ĕ !&Ĕ!!¸Ï !;¸ !*º !+ĕ !N¸ !*º !-ñ !/Í !B³ !-£!!£ !,¡ !+£!!£!!£ !)£ !/³³ !1Ė !>Ĕ !&Ì !*· !&³ !]· !>Ė !&Ė !-Ĕ !3· !)¹ !K£!ñ !-· !)¹ !(£!!ó!!!£ !6£ !8²²!!¹¹ !JĔ !KĔ!!!ò !E¾~ !1ĥ!!£!!!£ !:£ !^£ !4Đ!À!ĵÁ!!¦ !B£ !A¦!!±!!!ă !Q¿!°!!°!Â!¦ !0£!!ò !>¾ !6Ì !-Ĕ !9£ !(² !)ì !)¦ !-Î !6£ !?Ķ !ZÆ !(Ã !*± !&±!!£!Í!£ !I~ !`Åē!Ä!Ķ !Bó£!ĕ !'£ !7~ !*Å!¿¾ !`£ !(³³ !T¥ !.³!!£!!¶!!!ħ !,··· !)Í!!Ė !8Đ !(³ !'Ĥ!!® !(£ !&· !(£!!!ĕ!£!!ĕ!!!£!!£ !H¹¹!Ï!!Ė!Ė !.ñ!!ñ !-î£ !)² !1ò !D¢!± !+²± !+¯ !+¸ !J¾ !,Ü!!ă !.Ė !-ñ !C¯ !/ó!¸!!¸!ĕ£ !'£ !'£ !1£!!!£!!!£!!£ !.£ !(¸ !BÅ!ķ!!Á !*~ !0¸ !7ė!!!ĕ !Âĕ!!ĕ !*£ !/£!ó!!£ !&£ !&£ !&£Ĕ !.£ !(£ !^ñ !PÎ !/Î !,¥ !Zñ!!!ĕ !)£ !5±± !(ħ !DĶ !0£ !'±±!!£!!²!£ !&£ !7~ !>± !)ß !6Î !0Đ !BĖ !6± !*£ !/Î!!!¾ !L¥!Ã!Á !o£ !&£ !&£ !&£ !&£ !0£!±!!£ !ĉ",
      }, // 4
      {
        worldMap:
          "HHIIHHHIIHHIHIIHHII H&IHHIHH SEI 6&I .,IJI .+IS ,'SRS ,' S7H 6&H .8HQ ,/R,, S4I 6&I .8HS ,/S ,& S2H 6&H... X)... X)..HSSe S&QSSS,,,S ,& S2H 6&H...X D'X...X C'X..IS,,!S /'S,,,S ,& S2I 6&I..XX D'X...X C'XX.HS,,!S/k/k/S,,, S7H 6&H...h D'X...X C'h..IQ,!,R /'S,,,Q S6I 6&I..XX D'X...X C'XX.HS,,,S /'S,,, S7H 6&I...X D'X...X C'X..HS,,,S /'S,,, S7H 6&I!.. X)... X)..IR,,,Q /'e,,, S7I 6&II .6HHS,,,S /'S,,, S7H 6'e .6KHS,,,S /'S,,,R S6I 6&HH .6HIQ,,,R /'S,,, S7H 6&H!.. X)... X)..HS,,,S/k/k/SSe S8H 6&I...X E'X...X E'X..HS,,,SS///SS,,, S7I 6&I..XX E'X...X E'XX.I S)eSSS,,, S7H 6&H...h E'X...X E'h..HPOPOPS 0&S,,xS B& S2I 6&H..XX E'X...X E'XX.HOPPPOSm0m0S,xxS B& S2H 6&I...X E'X...X E'X..H P'S 0&S,,,S B& S2H 6&I!.. X)... X)..H P&OS 0&SSRSSe S5I 6&HH .6HIO P&S 0&Q &(SAAA S0H 6'e .6KH P'S 0&e &(eAAA S0I 6&HH .6IH P&OS 0&Q &(SAAA S0H 6&H!.. X)... X)..HOPPPOSv0uSSSRSSeSSSAASPOPPPO S)H 6&I...X G'X...X G'X..H P' S'OOOP%%%O S&P ?&O S)I 6&I..XX G'X...X G'XX.H P&OSSOPOOPPP%%%PPOPOO ?&P S)H 6&H...h G'X...X G'h..HOPPPOSSP((O %+O ?&k?OOPOPPPOI 6&I..XX G'X...X G'XX.IOPPPOSSO((e %+e ?(O *'PPH 6&H...X G'X...X G'X..H P&OPOP((O %+O ?(P***m*pOH 6&H!.. X)... X)..H P'q$OPPP%%jXXj%%%OOPOPOPO *'OOI 6&HH .6HH P&O$$$O %& X&j %&O *,LOH 6'e .6KIPOPOT$$$e %& X' %&e *&!***m*OPI 6&HH .6HHOwPwO$$$O %& X&j %&O *+!NPH 6&H!.. X)... X)..HP333Oq$PPOP%%jXXj%%%OOPOPPOO *'OOH 6&I...X F'X...X F'X..HO333PPOO((O %+O F(P***m*pOI 6&H..XX F'X...X F'XX.HO 3'!P((e %+e F(O *'POH 6&I...h F'X...X F'h..HP333j33O((O %+O F(POPOOPOPI 6&H..XX F'X...X F'XX.HP333OOOPOPPPOP%%% P& F( O*H 6&H...X F'X...X F'X..IP333O 4)jP%%%O%%Ox F'P O)H 6&H... X)... X)..IO333O 4(jjPOeOP%%Pxx F& O)PI 6&I .8IO333e 4&OPOOP!))O%%OPOOeOOO==O==OPH 6&H .8IP333O 4&O'''O)))O %&P:::PO ='OOI 6&H .,HJH .+HPOOPP 4&P'''e)))P %&O:::OO ='OOH 6&IIHHIIHHIIHHHIIHHHIHHIHHHIHOP 4&O'''O)))P %&P:::OPOPOPPOPH 6&I<<HHH 5&!H 50H 4(P'''O)))OOO%%P:::O =)OI 6&I<<HHI5s555H 50e 4(O'''P)))POO%%O:::e =)PH 6&e<<HHJ5!555e 50H 4(O'''O)))O %&O:::O =)OI 6&I<<<HI 5'H 50IOPPOOPP'''O)))P %&O:::P===y===O H(<<<HI5q5q5H 5/!HO 4'O'k'P)))P %&P:::O =)P H.IeHIHIHeHIIHeHIHHeHHO 4'P'''P)))PO%%%P:::e =)PI<<! <(I!777!H!! 8(!!I999I O(P'''P )&O%%%P:::O =)PH<SSS<SSS<H 7'H 8,H999 H&IHHOPPPO )&OPOOO:::OOPPOPOOOI<SS<<<SS<H 7'H8k 8(k8I999jj999IH)))! )'!)))O::: O+H <+I 7'I 8,H 9&j 9&e )/e:::P O*H <+H 7'H 8,H 9&j 9&H )/O:::P O*I <&S <&H 7'H 8,I 9&j 9&IHHeHMHeHMHeHHO:::P O)PH<<<SSS<<<h 7'H8k 8(k8H999jj 9&HIo;;q;;;q;;oIP:::P O*I <&S <&H 7'I 8,H999j 9'HH ;-HO:::P O*H <+H 7'IHH 8(HHI 9(jj9H ;.HP:::P O*H <+I 7'HHH 8(HHH 9)j9H ;.IP::: O*PI<<HJgJI<<H7k7k7Hy 8+H 9'jjj9HH ;-HO::: O*PH<!H]!]H<<H 7'H 8+zH 9'j999IHo ;+oHP:::P O*I H&]HIHHIHHIHHIHHJHIHIJHIIHIHIHHIIHHIHJIIHJHIHJHIOOOPOO P'OP",
        objectMap:
          " !dÅ!!¿ !=ó !H£ !5£!!!£ !+£!¾ !Bĥ !D· !`··¹ !>¹¹¹ !'Å!ï!¿ !)ĥ !+Ė!··¹º !>¹¹¹ !(°!°Ĵ !)Ĥ!± !CÐ !)£¹¹ !)£ !*Þ!!!Ì !J¹¹¹ !'Ē°!° !V¹¹¹ !'Ã!í!Á !.Ì !Bė !:£ !&£ !&£ !cÎ !:£ !/£ !&Í !*¸ !CÒ !>¸ !IÏ !fÅ!ï!¿ !'³³ !+» !'±!!¸ !GĴ !'³³ !PÐ !)£ !)³³£ !&Í !*ð !&£!!¸¸¸ !=Ē!!!Ĵ !'³³ !0£ !)¸£ó !=Ã!í!Á !'³³ !6±!¸!!Î !8ó !Að !hÌ !8£ !/£ !3ß !'£!!£!!£!Í !TĦ !.± !6ė !?£ !-±± !<··· !'Å!ï!¿ !4® !-³ !.Ð !)··· !+Ĵ !@³ !6£·· !)£ !1¿ !'£ !*£ !8··· !'Ē!!!Ĵ !/ì!!!Ì !+ñ !*~ !0··· !'Ã!í!Á !.~Ã !2Í!!¢ !-Ï !~³!!!~ !6¯ !)£ !/£ !*Í !)Ê£ !&ĕ !1Í!£ !Y¯ !,ñ !*ė !9³¸ !N¸¸¸ !'±± !*Ì!¸ !&¿ !+ñ !)³!!® !(Ò !,¸¸¸ !'± !,£!!!ñ!ì !/£!!£ñ !6£¸¸ !'±!£ !+Ì!!±!Ã³ !'£ !A¸¸¸ !'± !CÍ !/Ð !)¸¸¸ !'±± !:¾ !&£!!£ !OÌ !Tā !)£!!!£ !)ė !/±±!³³ !+£ !5£ !7±± !(±!!!³ !;Í !2£!!!£ !'±!!£!!!±!!!³!!!Ã!!Á !O± !*¾ !5ð !(ė !=±!!Ė !)±± !D£ĕ !8£!!!£± !&£ !*Ï£ !'£!Ï!!£ !&£ !-Ħ !4ñ !@ė !+¾!Þ !)¶ !Pò!! ³& !/³ !-± !+¾ !: ³&!!!£ !*³³!Î !&£!!!£!!!¸¸ė ¸(!ė!!!ĕ!ėė !(ĕĕ !.²Ă !)³³³ !,±Ė!!¸ !)¸ !.ñ !AĖ !,¸!!!·!!!¸ !,£!!£ !3ė !'ĕ !3Å!!Ó!÷!!¿ !@£!!!£!!!£ !&£ !8Ă !3£!!!£ !HÐ !'Ħ !&Î !NÒ£ !'£ !&£ !aÞ !/ò!!!ò !DÃ!!õ!!Ñ!Á !/Î !0³!£!!!£!!!£ !&ò !:Ħ !'£!!£ !(£!!!£!!!³!£!!!£!!!£ !K± !/Î!!!ò!!!Ė !3Ė!!Ħ !-± !2± !¢",
      }, // 5
      {
        worldMap:
          " XG S=X;;;X;;; X4888X 8)S 7& S' 72SX;;;e;;; X4x88e 8)S 7'SSS 73SX;;;X;;; X4xx8X 8)S 7(S 74SX;;; X<888XXeXS 71SSS 7)SX;;; X' <( X';; X*888X555S 70 S' 7(SX;;;XXX <.e;; X*888X555S 7. S+ 7&SX;;;XX <.XX;; X*888X555 S1QSRSQSSSeSSSX;;;XX <'HI <'XX;; X*888X 5?SX;;;X <'IHHH <'X;; X*888X 5?SX;;;X <'HHII <'X;; X*888X 5?SX;;;XX <'IH <'XX;; X*888X555HIHHHIHIHH555SSRSQSR S)X;;;XX <.XX;; X*888X555I 6*H555S X0;;;XXX <,XXX;; X*888X555H 6*I555S X0;;; X' <( X';; X*888X555H66k66k66H555S X0;;; X2;; X*888X555I 6*H555S X0 ;7 X*888X555H 6*H555S X0 ;7 X*888X555e 6*e555R X0 ;7 X*888X555H 6*H555S XC;; X*888X555I 6*I555S XC;; X*888X555H66k66k66H555S X0 &4X;; X*888X555I 6*I555S X0 &4e;; X*888X555H 6*H555S X0 &4X;; X*888X555IIHIHHHIHH555S X0&&&XXX&&& X,;; X*888X 52S X0&&& X&&XXX; X);; X*888X 52S X0&&&X&&X&X;;;XX;;XXX;; X*888X 52S X0&&&X&&Xe X( ;) X*888 X(555XYeYX555S X0&&& X&%XXX;;X;;XXX;;XXX888X 8'X888X555X444X555S X1h X'%XXX;; X(;;XXX888e 8'e888 X'444X S& X0!G!XX%q%q%XXY X(;;XXX888X 8'X888 X'4!4 X5GGGXX %'X;;; X';; X*YeY XBGGGXX %'X;;; X';; X*999 XBYgYXX %'X ;, X*999 XB]G]XX!%%%!X ;, X*999 XC] X&%%%XX ;, X*9k9 XH%%%XX ;, X*999 XCo%oXX%%% X1x::XX999 XBo%%%oX%%% X0 :'X999 XB %'e%%%XXXr $&r X'x :&X9k9 XB %'X%%%XX $) X' :'X999 XB %'X%%%X $+ X(eXXX999 XB %'e%%%X $'S $)XX'''X999 XBo%%%oX%%%X $&SSS $(YX'''XXe XDo%oXX%%%e$$SRSSSQS $&TX ') XH%%%X $&SSS $(YX ') XBw===wX%%%X $'S $)XX ') XC===XX%%%X $+ X,''' XBw===wX%%%XX $)XX(((X***lX''' XC===XX%%%XXXr $&rX (&e***kX''' XBw===wX%%% X, (&X *&X''' XC===XX%%%X (/X *&X''' XBw===wX%%%X (/e***kX''' XDeXXX%%%XX (.X***lX''' XB'''XX!%%%!X((SRS(( X-''' XB'''XX %'X((QSQ((X''X ', XB'''XX %'X((SRS((X''X ', XB'''XX %'X ()X''X ', XB'''XX%q%q%X ()X''X ', XB''' X&e X(e X) '&XeXXe XC ';XX +& XC ';X +( XB ';X +'j X¤",
        objectMap:
          " !dÅ!¿!!±± !4± !.ÅÆ !)Åï !(ķ !&¿ !&£!!!£± !5£!!!£!!!£!!Ä!£ !)£ !-£ì !'¿ !E» !.À!í!Á !SķÅ!Ä !-Â!!!Á !C£ !(Ã!£ !)£ !-£ !,¹·!!!ß !)£¿ !3Â!đ !(Á !7¹¹£ !'ħ£ !&Ä !S¹ !0Ð !+£ !G¹· !>£Å !'ě !&Æ£ !-£ !*º¹ħ¸ !<Ä !.¿ !7º !:£ !H¹!£ !(£ !:¸!¸ !>º!¸ħ!!ă !<±!!±!Ĕ!!Ð !P£ !(¸ !<Ã !IÎ !;Å !+ě !(Ã !9¸ !7£Â !&õ !,Á£ !,£ !*£!!£ !&£ !EÂ !qö!!ò!!!¸Í !U£ !)¸ !'¸ !Dĕ !9±!!±!Ė !6£Ï !&£ !*£Í !8¸!!¸ !Cĕ !2£ !fÃ !.À !T£Â!!Á£ !(Á£ !7½!!!²² !5£ !*Â !=¾ !)¾ !Wò !+² !o·£ó!!!£ !&£ !)£ !6ă!ĥ !+¾ !-·· !+Í· !(Î± !6£ !,Æ !]£!!!Ä!¿ !1³Ĕ !PÅ !'Ã !+³£ !Hė!!!ĕ!!£ !)¿ !*ð !W£ !YÃ!!!õ !&Á !O~ !&ð !4³!!Ü£Ĕ !C~Æ~ !9³ !F°Ä£¿ !9³!ð !EĶ!ì !+£!!£ !Q°Ē !-Å!ě!Æ !.£ !C~Ã£À !7Å!¿ !G~Â° !)Ä !)¿ !(£ !I~ !&£!!!Ò !*£!È !&Å!!ě¿ !MÃ !)À !,£ !D¸¸¸ !7Ã!!!Á !E¸!¸ !+Â!õ!Á !^£!!£ !S¡ !4£ !&Ý!!Ě !EÌð !&Î !9Ð !]¹ā !Iĕ !*£ !*£!!!¹º !SÅ!!ě¿ !*¹º !GÅ!¿!!ė!!!ĕ !Y£ !,Ě!!!Ð !&¾Å!!÷!!!Ã !K£ !-¶ !Nö !-Ã!!õÁ!!³³ !+£ !EĘ !-£ !&³³!ö!!À !'Á !§Å !.÷ !(Ã !R£ !(£ !*£!!¸£Î!£ĕ !BÃ !3Ñ!!Á !&¸¸ !¨",
      }, // 6
      {
        worldMap:
          " H'KHHIHHHI H.IIJIHHHIIHJHHHIHHIIIHHHIJHIIHJHHHIHIJHHH**I *+I H. .;H 4-HH**M *+M H-I .;I 4-JH**H *+ H.I .;e44y 4'y44HHIHHHe H&*** H.J...SSQSS... S&QeQ S&...H 4-II )*H*** H/...S0k0S...S{ 2){S...J 4-KJ)k )&k)I*** H/...S000S...S 2+S...I 4-HH )*H***I H....S000S...S22k222k22S...e44y 4'y44HH )*I***I H-ISeSSSeSS...S 2+S...I 4-JK )*e***J H.***S///S...e 2+e...H 4-HI )*I*** H/***S///S...S 2+S...HHIJHHIHHHJIHI )*I***I H.***S///S...S22k2s2k22S .& S.J)k )&k)H*** H/***S///S...S 2+S .&e55 S+H )*I*** H/***e///R...S{22SQS22{S .&S55 S+HHHIHIIeII***IHHHIHJHIIHHI***S///S... S=IBBBIICCCH *5S///S .&S 36 S'HBBBHHCCCH *5S///S .&e 36 S'IBBBIICCCI *5S///S .&S 36 S'HHeIHHHIHH*** S/***SSeSS... S6e S(H (*H***S --SSeSS111S...S -3S666 S'H(k (&k(I***S --S...S111S...S -3S666 S'H (*H***S --S...S1k1S...S -3S666 S'H (*I*** S&e S&---S...SSQSS...S--- S----S666 S'M (*e***S &)S---S .-S---So$$SQS$$oS---S666 S'I (*I***S&s&&&s&S---S .-S---S $+S---S666 S'I (*H***S &)S---S .-S---S $+S---S666 S'I(k (&k(I***e &)e--- S/---S $+S---S666 S'H (*H***S &)S -5S $+S---S666 S'IIHHHIHIHI***S &)S -5S $+S---S666 S2eSS &)S -5S $+S---S666 S1'''SSS&&& S(eSSeSSeSSeSSSeSSS$$$SRS$$$S---S666 S1 ''S&&&So %5oS$$$SSS$$$S---S666 S1 ''S&&&S %7S$$$QSQ$$$S---SSe S2 ''S&&&S %7S$$$SSS$$$S---S$$$ S3'''S&&&S %7S$$$SRS$$$S---S$$$ S3'''S&&&S %7S $+S---S$!$ S2Q'''S&&&S %7S $+S---S$$$ S/'''S'''S&&&S %7S $+S---S$$$ S/'''S'''S&&&SSSnSSnSSnSSnSSnSSSnSSS$$$qSq$$$SSeSS$$$ S/'''S'''S&&&S %7S$$$SSS $- S0''R'''S&&&e %7e$$$TSQ $- S/'''S'''S&&&S %7S$$$SSS $- S/'''S'''S&&&SSSnSSnSSnSSnSSnSSSnSSS$$$qSq$$$SSeSS$$$ S/'''S'''S&&&S %7S $+S888S$$$ S2Q'''S&&&S %7S $+S888S$$$ S3'''S&&&S %7S $+S888S$!$ S3'''S&&&S %7S$$$SRS$$$S888S$$$ S1 ''S&&&S %7S$$$SSS$$$S888S$$$ S1 ''S&&&S %7S$$$QSQ$$$S888SQhQ S1 ''S&&&So %5oS$$$SSS$$$S888S777 S1'''SSS&&& S(eSSeSSe S,$$$SRS$$$S888S777 S1'''S &)S '-Q 7)S $+S888S777 S1'''S &)S '-h 7)S $+S888S777 S1'''S &)S '-Q 7)S $+S888S777 S0R'''e &)e'''IHHIeHIHIJeJH777S $+S888S777 S1'''S &)S'''H :)H999I777S $+S8k8S777 S1'''S&s&&&s&S'''H:y:::y:I999J777S $+S888S777 S1'''S &)S'''H :)I!99e777So$$SQS$$oS888S777 S1''' S&e S&'''I :)H999J777 S.QSS777 S1 '1H :)H99!H777 S1777 S1 '1H :)IIgHI 77 S1 '1I:z:::y:H]9]H 77 S1 '1H :)IH]HH 77 S>QSI H*IHHI S<",
        objectMap:
          " !f¾ !RĤ !.¶³!!!£ !&£ !1£!!!Í!!!£ !(£ !(£ !-»!!!³³ !YÝ !¨¯!± !8£!!!£ !*ó !)Ì !4£Ĥ !,Ė !4± !b±!!± !^±±!!±!!£ !G£!ñ !&£ !&Ă !(±± !(Ì!Ė !5£ !.Î !`³³ !a³ !)Ħ !(£± !J£ !.² !*±± !m±±±!!¹¹¹ !Z±£!!!¹£¹!!£ !)£ !)£ !)£ !&£ !2£ !.¹¹¹ !HÞ !£Å !'Ó!!!¿ !/Å !+÷ !'¿ !0Ì !+£ !)£ !(Ă£ !)£ !/£!!!£ !)Ì !.Ã !)Á !)±!® !)¿!!!õ !)Á !fð !-£ !,Ì!!!Ì !&ô !?Ì !F£!!!ò!!!£!!Ò !CĖ!!ò !O£ !,ó !.£ !>£ !>£ !.Å!ě !-Ã !/Ò !D£ !1£ !PÃ !.ę !&Á !s£ !4Å!¿ !IĘ !8£ !;ð!!!£Ĕ !&£ !TÌ !KÐ !)£!!£!!£!!£!!£!!!£ !4£ !bÌ !DÌ !+Ì !)£ !(£ !4±±± !8ė !4Ã!Á !3±±± !`± !e¾ !'£ !&£!!£!!£!!£!!£!!!£ !&£È !&£ !)£ !0³ !-ė !U³³³ !`³³³ !/ė !`ó !9£ !(£ !KÎ !8¸!!Î !>£!!£!!£!!£!!£!!!£ !4£ !2Å!Ã !0Îò !:¸ !7£!£À !9Ė !&£ !'£!!¸ !:Á !@Ė !A¿ !JĖ¸!!£ !>Å !+¿ !5¸ !9ô !+Ò£ !)£!!!£!!!£ !R¿ !(õÁ !6¸Ė!Ė !:£ !>£ !j¸ !N£ !3£¸!!Ė !7Î!!!Î !*~!~!!!Î !4¸¸ !xÅ !*ěÃ !(£ !(Ė !7Ė !A± !'~ !,Ï !A£ !-£!!± !.£ !3£ !2Ã !)ę !'Á!!± !8ó!!!Ï !l",
      }, // 7
      {
        worldMap:
          " Xd /; X8>>X >.XX /; X'66 X1>>X >.XX /; X'66X66 X.>>X >.XX///IHHKI H&KHIHHHKHIH/// X*66 X2e X)>>>XX///Hw!11wHw!22wHw555wH/// X&66 X5<<< X(>>>XX///HH111IHI222IIH55!IH/// X&66X66XXX888X :)X <' X'>>>XX///Iw111wHw222wHw!55wH/// X)66XX[888e :)e <' X'>>>XX///HI111HIH222IHI555HI///XXX66 X)888X :)X <' X'>>>XX///Hw1!1wIw2!2wIw555wH///XXX66X66 X&888 X,<<< X(>>>XX///IH!11HHI222HHH5!5HH/// X(66 X&888 X-e X)>>>XX///Hw111wIw222wHw555wH///XX66 X*888 X,=== X(>>>XX///HH111HIH222HIH555HI///XX66XX 6&X[888 X,=== X(>>>XX///IIHeHIHIHeHHHIHeHIH/// X( 6&XX888 X,=== X(>>>XX///I 03H///X66 X+YeY X,=== X(>>>XX///e 03e///X66X666X ;) X,=== X(>>>XX///H 03H///X66X666e ;) X,=== X(YhYXX///IIHIeHII H&IHIHeIH/// X&666X ;) X+ =' X'>>>XX///H 3)H 4+I/// X*;;; X/ =' X'>>>XX///HH 3'HJ444k4k444H/// X*;;; X/=u=u= X'>>>XX///I 3)H 4+H/// X*;;;X %& X* =' X'>>>XX///HI 3'IJ4k4HIHHIHH/// X*;;;X %' X)=u=v= X'>>!XX///H 3)H444I /.[ ;)X! %' X( =' X'>>>XX///HI33y33HJ4k4I /.e ;)X %&!% X( =' X'!>>XX///I 3)H444H /.[ ;)X%%!%%% X2>!>XX///IH 3'HJ444H/// X/e X*e X3>>>XX///HHH3I3HIH444H///XXX *)X (' X'%%% X2>>>XX///IHIHHIHIHHHIH///XXX*s***s*X (' X'%%! X3gXXX /5XXX *)X (' X'%%! X2]>]XX /5XXX *)e (' X'%%% X3]XXX /5XXX *)X (' X' %)XX$! XE*s***s*X(((jj X' %*X$$ X7v---vX ,'XXX *)X(jjj X(%O %(X $&q$ X4---XXX,,, X'e X2%o %(Xq $* X0v---vX ,'XXX+++ X+&&&XXX%O %(e $+T X0---XXX,,, X&+++X )(!X&k&XXX%o %(Xq $* X0v---vX ,'XXX+++X)n)))n!X &'X%O %(X $&q$ X5e X'e X'+++X ))e &'X %*X$$ X. S+ F-XXX+++X ))X &'X %)XX$! X. S(FFR F-XXX+++X ))e &'X%%% X6 S(FFS F-XXX+++X)n)))n)X &'X%%!X E( X/ S'FFFSSSQ S'FFFXXX+++X ))X&k&k&X%%%e E( X/ S'FFFSSS F&SSFFFXXX+++ X+ &'X%%!X E( X/ S'FFFSSS F&SSFFF X&e X.e X&e X7 S.FFFSS F+XAAA X' A, X5 S.FFFSS F+eAAA X' A, X5 S3 F+XAAA X' A, X5 S5RSSSFFFXAAA X'AAA X< S2 G'qSFFFXAAA x'AAA X< S/GGQ G(eFFFX A'xx A& X< S/GGS G'qSFFFX A- X< S/GG S&RSSSFFFX A- X< S/GG S*FFFX A- X< S/GG S*FFFX A- X< S/GG S*FFFX A- X< S4 XP S4 XP S4 XP S4 XP S4 XP S4 XP S4 XP S4 X´",
        objectMap:
          " !dÅ !,ě !.¿ !:¾ !1£ !)£ !(£ !(£ !9³²!!£ !*£ !E¾ !0³² !(Í !H¾ !HĔ !'Ĕ!³!!!³³ !0¾ !F£ !'£³ !&£Ì !AĖ !?ð !-¾ !*£!!!Ï!£ !(£ !/£ !@¾ !Gð !'Ì !ZÌ !.Ĕ !+¾ !K£ !'£ !'£ !.¾ !cººº!!!£ !-ė !J¾ !&ºº½ !2£ !*£ !=Ð !J£!!!£ !(£ !(£ !+² !?ò !B¾!£!!!£!!!£ !X² !H£ !'£!±±Ï± !C³!!!Î !9£ !'£ !R£~ !&£!± !&±!ò !3³³³ !+³!£ !3± !(± !:³ !1³ !)Î!!!£!!£±!£!~£ !<Ï!!£ !*¯Ħò!³ !1±± !'± !&£ !'£ !,£ !(Ĕ !*³!³ !(ò !*£!±!!!£!!!Ė!!!¿!õ!!!Á !0ó !6Ė!!!Ò !'~ !(£ !P£ !+£!£!!!± !,Ì!!!ð !p£Ĕ !NÎ!!!ò !0ð !8£ !)£ !)£ !)£ !(£ !AÃ !3Á !*Ĕ !8Ĕ !zĀ!!!¥!!!¢ !*Ė !.Ì !JÌ !Z£!!!¢!£!¥!!!~ !7£ !'£!!£!!£È !B¹ !&¹Ĥ !O¥!!!¥!!!¯ !(·!!Ĥ ![¸ !*ð !U£!!¸¸!£ !(£ !/Ė !6¾ !'ě!!Æ£ !(®!¸¸ß !UÁ¿ !'¢!!¸ !1ò!Å!ķ!¿³ !:¾ !1¹!!!Ă!· !*£!!!£!!£³ !AÐ !&¥ !-ė !)Ė!Ã!!íÁ³ !4¶ !i³³²!!!Æ ![³³²!!!£Å!!!Æ£!!!£Ì !(£ !(£ !GÃ !'Á¿ !nÌ !Mħ!!!Ā !]¾!!»!£ !*~ !T²ß !ËÃÀ !aÃ£!!!£!!!£!!!£ !J½ !Ņ !Ņ !º",
      }, // 8
      {
        worldMap:
          " XŅ XŅ XŅ XĢ %* XZ %* XZ %* XZ%% Xa%% Xa%% Xa %) XW %- XW %. X`%%% XYYXXX[XXXYXXX[XXXY XNr %7r XK %9 XK %9 XJ[%%%H%%%H%%%H%%%H%%%H%%%XXXY X2HIH X*IMH X)%%%H%%%H%%%H%%%H%%%H %- X.W&I X*H&I X)%%%l%%%l%%%l%%%l%%%l %- X.W&HIHIHIHIHIlHJHXXqXX %9n%%n%%n% X'r$ X'W &*H &'H %F[ $( X'W &*h &'e %Fe $(T X&W &*H &'H %F[ $( X'W&II H&IHHHlHJIXXqXX %9n%%n%%n% X'r$ X'W&I X*H&I&&H X&%%%l%%%l%%%l%%%l%%%l %- X.HII X*IMH&&H X&%%%H%%%H%%%H%%%H%%%H %- X; H&XXX[%%%H%%%H%%%H%%%H%%%H%%%XXXY XG %9 XK %9 XKr %7r XNYXXX[XXXYXXX[XXXY XŅ XŅ XŅ XŅ XŅ X>",
        objectMap:
          " !Ņ !Ņ !Ņ !Ģ¶ ³) !Z ³* !Z ³* !Ņ !W²!²!² !^²!²!² !Ì¾ !Ņ !ĭĹ !bĹ !(ĸ !MÈ !.Ĺ !i¾ !Æ½ !Ņ !Ņ !Ņ !Ņ !Ņ !Ņ !¼",
      }, // 9
      {
        worldMap:
          " O+POPOO ZT O'POxx )&P (' Z&''Z %, Z3!$$$ Z&$$ZOOOPOOPx )'e (' Z&''Z %, Z4$$$ZZZ$$$ZPOPO))O )(O (' Z&''Z %, Z4$$$ZZ $&ZO )'Ox)) P&ZZ((( Z)%%% Z&%%%ZZ $5e $'ZO )'P)))O Z'((( Z)%%% Z&%%%ZT $5ZZ $&ZO )'O)))P Z'((( Z)%%% Z&%%%ZZ $5ZZZ$$$ZOOOPOPO)))O Z&a ()ZZZ%%% Z&%%% Z&$$$ Z-$$$ Z&$$ZOOP ))O Z' (*Z %'ZZZ%%% Z'e Z.!$$ Z)OOO ))P Z' (*e %'aZZ%%%ZZZ! 2&ZZ $)Z $+ZOOO )&x))OO Z* (&Z %'ZZZ%%%ZZZ 2'ZZ $)Z! $*ZOOPx))OPPPOOZZFFFZZZ(((ZZZ%%% Z&%%%ZZZ 2'ZZ $)Z $+ZOOPx))P )&OZZFFFZZa(((ZZZ%%% Z&%%%ZZZ 2' Z'e Z,$$$ZOOO)))O )&PZZFFFZZZ(((ZZZ%%% Z&%%%ZZZ 2' Z&$$$ Z+$$$ZOOP)))O )&OZZZe Z&(((ZZZ %'ZZ%%% Z+ $.ZZZ$$$ZPPO)))P )&OZZ+++ZZZ(((ZZa %'ZZ %' Z( $/ZZZ$$$ZPx )&O))POPZZ+++ZZZ(((ZZZ %'ZZ %' Z' $0ZZZ$$$ZP )'POOP Z& +&ZZ((( Z'%%%ZZ %' Z& $( Z($$$ZZZ$$$ZOx )&O Z)+++ZZZ((( Z'%%% Z&%%% Z& $' Z(a $+ZP)))OPO Z)+++ZZZ((( Z&!%%%!ZZa%%% Z& $&ZZ S'Z $+ZO)))OZZZ ++ZZZ((( Z& %'ZZZ%%% Z&$$$Z S&ooSZ $+ZP)))PZZZ +,ZZ((( Z&%%V%%ZZZ%%% Z&$$$ZS--S--S Z&$$$ Z&OOePPZZZ ++ZZZ((( Z&%%V%%ZZZ%%% Z&$$$ZS--Q--S Z'e Z(+++ Z&+++ZZZ+++ZZZ(((ZZZa %'ZZZ%%% Z&$$$ZS--S--SZ&&Z&&&Z!&ZZ +,ZZZ+++ZZZ((( Z& %'ZZZ%%% Z&$$$ZSS-S--SZ &+ZZ +,ZZZ +&ZZ(((a Z&%%% Z&%%%ZZZ!$$$!ZS-S--SZ &+aZ +,ZZZ+++ZZZ((( Z'%%% Z&%%% Z&$$$ZSS-S--SZ&&s&&&s&&ZZZ+ZZZ++ Z(+++ZZZ ('Z %'ZZZa%%% Z'eZZS--S--SZ &+ZZZ+ZZZ!+ Z(+++ZZZ ('e %' Z&%%%ZZZa'''ZS--R--Sa &)xxZZZ+ZaZ++ZZZ +)ZZ ('Z %' Z&%%% Z&'''ZS--S--SZ &(xxxZZZ+Z!++!+!Z +( Z4%%%aZZZ'!'ZSS-S--S Z(aZa Z&+Z +(Z +(Z +)ZZZ''ZZ''ZZe Z'!''ZSS-S--SRSSQS Z*+ Z)a+++ZZ+Z +)ZZZ''ZZ''Z ',ZSS-S--SoSSo S)Z++!+ Z(+++Z+ZZ++Z+Z++ZZZ''ZZ''Z ')!'!ZS--S -/S Z-+++ZZ+Z +)Z+Z''ZZ''Z ',ZS--Q -/S Z-+++ZZ+t +)t+Z''ZZ''Z'''ZZZa Z&S--S -/S Z& *&Z +' Z)e Z)''Z''Z''' Z* S)oSSoSSS---S Z& *&e +'ZZ 0.Z''Z''Z''' Z1RSSQ S&eSS Z& *&Z +'ZZ 0. Z)''' Z' ,+ Z*,,, Z'** Z, 0.ZZ''Z'Z'''ZZ,,Z ,+ Z*,,,ZZ*!Z** Z,000 Z(000aZ''Z'Z'''ZZ,,Z ,1ZZ,,,ZZ**Z** Z*! 0'! Z&000ZZ '&Z'''ZZ,,Z,,,ZZZ ,+ZZ,,,ZZ *' Z,000 Z' 0'Z '&Z''' Z',,,ZZ! ,+ZZ,,,Za *' Z&XXXZZXYeYX Z& 0' Z(''' Z',,, Z+,,,ZZ,,,ZZ *'ZZZXX]XXZXBBBXZZZa00n00ZZZ'! '(Z ,'Z,, Z(,,,Z ,&ZZ**Z**ZZZX]1]XZXBBBX Z& 0'ZZZ! ')e,,,!,Z,,, Z' ,)ZZZ*!Z**ZXXXYgYXXXB!BX Z& 0'ZZZ'! '(Z ,'Z,,, Z' ,( Z)**ZX 1)XBBBX Z'000 Z)!' Z,,,, Z' ,) Z(**ZX 1)XBBBX Z'000 Z)'' Z4 ,*ZZ*ZZ**ZX! 1'!X!BBX Z'000 Z)'' Z' ., Z*,,,ZZ*Za**ZXXX111XXXBBBXZZZ 0) Z''' Z' ., Z(,Z,,,ZZ*ZZ**ZX 1)XBBBXZZZ 0) Z''! Z' ., Z',!Z,,,ZZ**Z**ZX 1)[BB!XZZZ 0) Z...! Z& .)Z,ZZ,,,ZZ**Z!*ZX 1)hBBBX Z)000 Z.... Z& .)Z ,( Z'**ZX 1)[BBBX Z(IHeHH Z-... Z& .)Z,ZZ,,,ZZ! *&ZX 1)XBBBX Z(H///HH Z+HJeJH Z)...Z,!Z,,,ZZ *'ZX 1)XBBB X&ZZZI /&HHIHHIHHIHI///H Z)...ZZ,Z,,,ZZ *'ZX 1)[BBBXBB X&HI /,!HHH///I Z)... Z&,,,ZZaZZ**ZX 1)hBBBX B(XHH /*HIHIH///I Z)...ZZZ ,& Z'**Z X&gXXX[!BBX B(XZIH /1I Z&..Z...Z ,'ZZZ11 Z&X! 1'!XBBBX B(XZZHIHHH /-HZ .'Z...e ,& Z&111Z11X1!1!1!1XBBBX B(X Z(I /-IZ .'Z...Z,,, Z' 1(X11!1!11XBBBX B(X Z(HIHHHI H&IHHZ .' Z5 X6 ZG",
        objectMap:
          " !|¾ !)Å!¿ !3Ï !*¹ !:ºº !F¸¹ !)¾ !2ºº !E·¸¹!!º¸ !'ò !U·¸¹!!¹¹¹¸ !CÊ !7·¸¹!!ºº¹¸ !Z¸¹ !+Î !W¹ !7Ĕ !.Ķ!ì !4Î !4Ė !?ħ !(²²! ³& !V· !&² !&³³!Ă !9~ºº !9···!!!² !'³ !4¸¹!º !&£º!!!ð !6· !A¸ !'Ĥ !VÎ !'¹ !b¹ !8Ē!!!¿ !B¾ !/Ì !Pò!Ė !-¸ !&Ĕ !,Ã!Á !¤Ė !9ė!!!ĕ !·¸ !5ì !+³³ !FÌ !>³ !Eð !:³³ !.Ĥ ![ă !;¸ !9ó!!!ĕ !hĔ!!¢!!!¡!!!¯ !HĴ !+¸¸ !+Þ !-Ė !>Ē !/¾¸ !+~ !6¸ !?¸¸ !5Ï!!Ė!ñ !;Ã!Á !'Ė !:··!!·· !/±±!!!¹¹!!ºº !*ò !*ð !>¸ !)±!!!¹¹!!ºº !A¸!ĥ¸ !-¾¾ !(±!!!¹¹!!ºº !*Ė!Î!!±± !d± !&Ï !Y±± !´¾ !a¾ !b±³!± !(¹¹ !:Ā !=±³!± !(¹¹ !FÏ !'ñ !+±³!± !*¾ !U±³!± !0ó !Q¾ !cė !.¾ !Oñ!!!ó !-ĕ !&³ !2Ħ !0Ħ !(Ï !*Ï !0³³ !*ó !/ººº!ººº !-Ė !*ò !-³³³ !8ºº!!!ºº !T½ !(ă !'ĥ!Þ !R½ !Z¸ !(½ !(²² !/± !&Ĕ !)Ė !7Í !/²² !*Ă !&±± !5Ė !9Ħ!!!² !*£ !R¾ !'³ !Ză !(³ !SÍ !)½ !'³ !S¸ !/³³ !+¾ !4ĕ !C³³³ !(£ !(¸¹ !EÍ !(» !-Ħ !(·¹º !<¾ !.½½ !'ħ !'ĥ !)·¸¹º !.Ï !*³ !'Ï !-ººº!!!¾!ă!Þ!ā !)¸¹¹ºº !7³³ !2 º& !'Ă!Ă !)·¹ º& !7³³³²² !o",
        topColor: [65, 0, 65],
      }, // Secret
    ],
    parTimes: [
      [1.5, "01:30"],
      [2, "02:00"],
      [2, "02:00"],
      [3.5, "03:30"],
      [3, "03:00"],
      [3, "03:00"],
      [2.5, "02:30"],
      [2.5, "02:30"],
      [0, "??:??"],
      [0, "??:??"],
    ],
  },
  {
    levels: [
      {
        worldMap:
          " `M W' `^ $' `^ $' `^ $' `^ $' `^ n' `^ $' `_$$$ `G] `:$ `G]#] `8b$b `Gg `', `3I$H `G, `&,,, `2b$b `G,``` ,' `2$ `H,``` ,' `0 $' `F, `& ,& `/m $'m `E, `',,,``b``b `)b $' `F ,(`,,`,,yzxxb `(Ib$`H `K,`,,b ,'x `+e `R ,(b `*% `R ,( `+% `Ib`b``b``b ,( `*%%% `G+++yy+++`` ,(b `'b %( `Db +*b`` ,& `) %*b `C +*b``e``e `( %&y%%%jj `C +*b`b %&b `&b %+jb `Bbb +&b```b %&b `& %-b `De``e `(%%b `' %.```b`XXXYXXX `8 %& `' %& `&b %.b``%[X &&yX `7b %&b`b` %(bb` %'XYX %(`%%e &(X `8b %7YXY %+X &(X `9 %7XYX %+X &(X `8 %& `& %(`b` %0`%%e &(X `7b %& `'%%%j `' %.``b%[X &&zX `8e``e `(%% `'bj %-b `&XXXYXXX `8 *& `(%% `(jj %+ `*X&&X `7 **b``H%%b `(j%%%y%%%j `+X&&X `6b **H`` %& `(b %) `, X& `7y***jj*zb`b %& `* %' `Fj *(j``b%HK% `+%%% `Jbb``b```%KH% `+beb `Qb %& `+EEE `R %&`OOPPPOObEEEbb `Q%%I`Pxy(y(O`EEE```] `NH%%b`Ox (&PbEEE``]'] `Db`b `)%%H`P ('P``b``bHgHIb `A )'b```b`%%I`OOPeOPO `& ') `@b ))e%%`%%`b``%%%```b``'n'''n' `A))y )&` %.b`'''b ')b `@))y )&` %.`b'''` ') `@bj )(e%%`bb`%%``b`b`'''` ') `Aj )&b `) %&b `&'''` ')b `Ab`b `* %( `'''`'n'''n' `M%%JI%% `)b ') `Lb%%HJ%% `*bbJeJb `N %( `+b%%%b `Nb %& `,b%%% `Q%%``b %&`b```%%%b `Ob%%%` %(b`` %& `Q %(`b %* `S %&`bb` %'`b `Ņ `0",
        objectMap:
          " !±¬!!¬ !`¬¬!¬ !^¬!!¬ !ńÇ !ò² !a²³ !`²³³³ !a³³ !t£ !M¾ !g¸¸ !`¾¸!±±Ĭ !c~ !]±!!Ĉ!± !]±ä!!!© !R¥³ä!!³¯³!!±£!!£ !/¯ !E³!!!~³!ĭ !'± !T³~£!!£!~ !Z³³Ĉ!!!ĭ® !Ĝ® !)Ĭ!!¸ !;££ !(~ !=©ĉ£¸ !C££ !+£!!!£ !0¸ !C££ !;å!¸ !;££ !F£ !O¯ !0¸!¥¸ !a¾ !W¢ !,³ !8ç !(ĉ !&® !>¶ !8±!£!!£!± !^± !`±±±²² !Ø±£± !`³³³ !]±!!³µ³ !Z£±±!!³³³ !Xį!!!å !M²!Ĉ !9±±!!!³³ !A²!£!!± !6±!ä!!!³ !S£!!!ºº¹ !&£Ĉ !D~ !(~ !/º¹ !*Ĉ !Bæ£ !5¹¸ !(ä !E±į !4¸ !(£ !^¾ !cįį!!!ĭĭ !Ă£ !ā~ !Ņ !u",
      },
      {
        worldMap:
          "```b `-W`W `R$$`T`$$ `'InHnI `Pb$$b$b$$b `&b$$$b``bb `N$`$`$ `&b $(`%%% `Mb$q$q$b``` $)e%%%b `M $' `&! $'!`!%% `N $' `' $'```b `Nb`b$ `(b $'b `P$!$`$ `(b $'H `Ob$``b$b `' $'I `Q$` $'``b $'I `Qb$` $/b `@ O, `* $&V $+ `BOOONPL O& `*$` $,b `COO 7'POO `*$` $'``bHH `DOL 7'LOO `*$`b`$ `- OAP77V77OOO `*$!$b$b `,OPOOOP O'P O5L 7'LOO `+b``$ `-P4!!!44O44P4 O6!777!OOO `-b$b `,OOPOPO4O44O! O7PeOPOOO `.$I `, O(4POOO!P O6555OPOO `,H$$$H `+ O(4OOOP! O5! 5)O `,d$$$d `+ O'444POO4P O6555OO5P `,b$$$b `+O 4- O6 5&OO5P O) S'eSSS `*O4OPO444OOOP O5 5&OOP5 O']OOSSSn'''nS `*P! O&4 O9 5& O&5 O&]6]OSSSn'''nS `*O!OOOP4P O)LOLON O+ 5& O'5POOS_g_ S&n'''nS `*O! O&4 O(P 5) O) 5& O'P5OOOS666 S&n'''nS `*O4POO444P O' 5)P O' 5& O(P5OOOS666 S(_ S& `)OOOP 4'POOOP 5)P O& 5& O*5OOOS666 S( '&SSQSSRSSOOP 4) O'eOO555OPOO 5& O(55O5OPSS666 S( '&_ )(SOO 4+OOP444P 5, O)55O555S 6& S)'''e ))e 42e 5+P O)55O555h 6&RSSS''S'''_ )(SOO 4+OPO444O 5, O)55O555S 6&SS '&S'''SSQSSRSSOOO 4) O'ePO555OPPO 5&P O'55P5OP S)'''SXYeY X+OOP 4' O' 5) O&P 5& O*5 O*S'''SX(((X*** X'OOOP444 O'P 5) O'P 5&P O(5P O)S'''SX(((X *)X O'4 O) 5)P O'P 5& O(5O `)S'''SX(((X *)X O&P4P O)NPLOLP O* 5& O'5O `)S'''SX!((X *)XX O&4 O8P 5&POOO5P `)S'''SX((!XXeXXXeXXXOOO44! O9 5&OOO5P `)S'''SX(((X +)XXOOL444LO `1 O(P 5&OO5P `) S'X(((e +)XXOOO444OO `1 O*555PO5O `) X((((X +)XXOOOPLOOO `1 O(! 5)O `) X)e X(+++XX O* `1 O*555POPO `) X( ,)X+++ X0 `- O*Pe O' `) X( ,)X+++ X0 `1OOO 8'OOO `) X( ,)X+++ X0 `1OOL 8'LOO `) X,,,, X4 `1OOP88V88OOO `) X(---X,,, X4 `1OOL 8'LOO `) X(---e,,,X000X 3) X( `1OOO 8'OOO `) X(---X,,,X000e 3) X( `1 O&LOLOPOO `) X(---XXeXX000X 3) X( `1 O- `) X(---X 0) X'333 X( `1 O- `)XX...X--!X 0)X111X333 X( `CX[...e---X 0)e111e333 X( `CXX...X---X 0)X111X333 X( `CXX... X/111 X, `CXX .(X///!//X 1'X222 X( `CXX .(e /(X 1'e222 X( `CXXo .'X /(X 1'X222 X( `C X([ X'///X11 X&222 X( `C X.//!X11X 2( X( `C X.!//X11X 2( X( `C X/[ X3 `C",
        objectMap:
          " !e³³!!!³³ ![³Ĉ!!!Ĭ³ !_Ç !0³³³ !a£³ !P£ !(ċ !'ĭ!Į!³ !ñåº !Ņ!£!£ !°³³±±± !^³!å±± !_£!£± !.åº !qºėóÏ!!!³³!º !6ċ!!!ĭ !1æ !7¾Ĕ !bð !bÌ !5ħ!!£Å!!¿ !/£ !Sô !A£ !ÀÎ !bò !bĖ !/Ü !F£ !.º !/£!£!£ !:Ĥ !)¾ !Yð !H£ !(Ä !*² !)Ì !m¡!!!£!!£ !*£ !*£!!!£ā£!£!£Ò !,¾ !0¾ !££ !(Ã !*¶ !x··· !5£!£!£ !D£!!· !&Ĕ !2Ħ !B¹ !/£ !S¹¹!!!ò !&ó !W¹¹¹ !&Ė !/±!ñ !@Ę !+¹¹¹ !.ñ !'±£ !Q£!!!£!!!£ !¥ħ!!£Â!!Á !vñ!!Î !Z£!!!£!!!£ !F¹ !5Î!!!Ĕ!!!Ė !B¸ !b¹£!£· !^º!· !5£!!!£ !.Ĕ !:ºº¸ !=ă!!!£!!ñ !÷Ė !]£!!!£!!!Þ!!!£!!!£!!!£Í !MÎ !pÌ !Tó !(Ý !Xė!!£!!!£ !.£ ![Ė !aò± !^£Ă!±±!···Î!ò !UĦ»!!±±!··· !°",
      },
      {
        worldMap:
          " `f ./ `2 .) `' .+ `0 ./``` .-`` .)`...`.. `(. `0 ./`` ..`` .)`...``` .'`. `0 ., `' ..`` .)`...```e```.`. `0 ., `, .)`` .)`...` D&``.`. `0 .,`..``...`` .)`` .)`...` D&``.`. `0 .,`..``...`` .)`` .)`..`` D&``.`. `0 .,` .)`` .)`` .) `-... `0 .,`` .(`` .)`` .) `> .,`` .(`` .)`` .(``W`W`W`W `6 .,`` .(`` .)`` .(b`n`n`n`n `6 .,`` .(`` .)`` .(`q $)q `7.. `: .)` $+b `6.. `2b``b`` .+` $+`b``bb``b``b``b `(..``b .+`---`,,q`` .+`$$$HKI $3q `(...`` .+`k--e,,,q `&b `&b`$$$JHJ $4b `'...`` .+`---` ,)` *'o`$$$IKH $4 `*b```e `&... `&b ,)e *(` $+ `)b `&$$$ `' .'` /'b .)` ,)` *(` $+ `-b$$$ `' .'`///x/` .)e,,,q`b```b`***`q $)qb `-$$$ `' .'`///x/` .)`,,q `****b``b$$$`b``b`bb `& $( `' .'`//xxx`... `(b `+*** `&$$$```xx'''xx`b $( `' .' `'b` .&nn. `-b***```b$$$b`` '(x`` $(b `*.``b .)```. `&] `)*** `'e``SSS ''xb`$!`$$$ `+..n .+nn.```]0] `(***```b%%%`S'e '(b```b$$$ `+.``` .)```. `&g `*h `'%%%bSSS '( `'$$$ `+..n .+nn.`{ 0( `&))) `&%%%``` ')b''`b$$$ `+.``` .)b``.` 0) `&))) `&%%%```x''x''x`''`b$$$ `+. `&.`.`. `&e`0k 0'```r)))`b`r%%%rb `(e``''`b$$$b `*. `&n`n`n `&0` 0)` )(`%! %(!` &(```Io$$$b `* .&`.`.`.``b00` 0)i )(e %+e &(```M $&T `* ., `( 0)` )(`%! %(!` &(```Io$$$ `4e4`111`0k 0'```r)))`b`r%%%rb```b``e `'b$$$ `444`111` 0) `&))) `&%%%``` () `&b$$$ `5b`111`{ 0( `&)))```b%%%b`` ((jb `&$$$ `1 4'`111 `/h `&b%%%`SSS (&jj `'$$$ `1o444o` 1+ `(+++ `&%%%`SAe (( `'$$$ `1 4'` 1+ `(+++ `'e``SSS ((b`$!`$$$b `0o444ob 1& !&1 `(+++```b$$$``` ()`` $( `1 4'`111 `.+++ `&$$$``b ()`` $( `4e``111`22r `*+++ b&$$$`b `&b `' $(b `2333`j11e222r `)+++bq $)q `.$$$b `2333`jj1` 2)` +(` $+ `-b$$$ `2b333``b`` 2)e +(` $&o $&bb`b `&b```$$$b `2 3)` 2)` +'o`$$$HKI $4 `3 3)e222r `,b$$oJHJo $3 `2bq 3(`22r```333`55o``$$$IKH $3q `4b`b333 `'b 3&e555`` $&o $&`b``b`b`b `&b `8 3/`555`b $+ `Eb 3.q`o55``{ $){ `Fq 3.`555```n`n`n`n `Kb `& 3&e555b``W`W`W`W `Q333`555 `]b``55o `^! 5'! `^555 `^! 5'! `^555 `^! 5'! `^555 `^! 5'! `^555 `~",
        objectMap:
          " !j ·+ !4 º' !E ·( !5 º&!½!½¾ !A ·' !6ººº !G· !:ºº !M¾ !5º !)ĦÝ !?¾ !1¹ !*º !'Ă !Q¹¹ !+¾ !&ĂÞ!Ħ !E¸¸ !(¹¹¹ !V¸¸¸ !' ¹& !U ¸& !& ¹' !U ¸&!!! ¹( !T ¸'!! ¹) !b¾ !ó£ !'£!!!£!!!£ !E£ !9³³ !R¾ !7£!!!£!!£ !Aº·¹ !C£ !'£ !7¸¹ !'£!!± !,£ !L¹¸£!!!Î!ò!± !W¹ !'± !Q£ !8£ !&³ !6Î !&ß!!!Ĥ !C³ !/£ !6±Ħ !/²²!!!£!!!£ !&³ !:»!!!£ !D³ !6£ !>²²!!!£!£!£ !&³ !;ă !(¾ !@³!!£!!!£ !(£ !6² !@ß !A²² !>³ !3ó !(Í !<¶!!³!³!³ !'¾!!ħ£ !'£!!£!!ė£!!£!!£ĕ!!£!!£ !)£È !0³!³!³ !8ó !(Í !F¸¸!!ă !^¸£!!!£!!!£² !'£ !-±± !B¾ !,²² !3± !AÌð !;£ !O±º!º !4ß!!!£ !>£ !&£ !'£± !)£ !/Î!!!Î!!!Ā !=~!ĭĉåĭº !0Ì !*Î !;ė !D± !&±!!!£ !a± !=£!!!£ !Y£ !8£ !'£ !P£!!!£!!£ !²£!!!£!!!£ !E£ !¦£!!!£ !·£ !Ï£!!!£ !Ăç !'å !_£ !_ċ !'ĉ !¿į !'ĭ !_£ !_ç !'å !_¼ !¡",
      },
      {
        worldMap:
          " `Ņ `)b```bb `&b``b `&b `3bz`z `7o -3` $&o `+o $&` .' `6 -4e $' `+ $'e .'z `4b -4` $'b `* $'`..X.. `6---b```b `*b `'$$ `+$$ `& .'z `5--- `4b$$b `*$$`..` .' `5 -' `4$$ `+$$`..``z`zb `5 -' `3b$$`$ `(b$$b.. `;b---b `0b```b``$ `'$`$$`.. `:E`---`/ `- $' `&e``T``e`$$ `=eb`e``e `&111```b $' `&$`o$o`$`$$``b``b `1G `' /)``` 1'``` $'```b $)`$$`$$$xx `)b `(GGG `& /)``` 1'b`` $'```b $) `& $&x```l )(lb` G'``b///q///``` 1'```x $& `& $) `& $&xb`` )*` G)``///V///``` 1(``x $& `& $) `& $'``` )*b`x G&```///V/// `& 1'``xx $9``b )*```GGx `&///q///bb```b `(b`` $3``b `& )*`!``G``!`` /,`q 1& `( $)`$` $)b `( )*`)``e``)`b /,e 1' `( $)`$` $) `( )+` ))```b``b``///`q 1&`b`b`` $)`$` $) `&b` )*l`` )' `-e```b`b``q $-`$b $-q```b``b `())) `-000```%%%e $-ob$`o $-e))) `,)b `,b000b``%``` $)``b```$``b``` $)```) `,) `.000```%%%e $)`'''``$ `'b $)e(` ). `.000 `&b`` $)`'''``$ `( $)```)``b `(b `/000 `'Ee $)`'''``$b `&b $)e)))`IIHIIIHIHHHIH `*b000 `'b`q $'q``'```$b `'q $'q `'I,,,I,,,I,,,I `*b000b```&&`be`ebe`b`'```$ `)e`e`e`b `&H,,,H,,,H,,,H `+000 `&&!``&`' `''``b$ `)X`*`* `(I,,,I,,,I,,,I `+000 `&&```&`' `''```$b `**** `(IHIeHHeIHeIHI``o0! 0)```b &'` ')```$ `+***b `'H ,-H`` 0,```b&b``b `-$ `,* `)I ,-HI` 0+o `&& `1$ `+b* `'t`H ,-mI``e``b`b``b`q &'qb `,b$b `+* `'*`H ,-HI`111`111```b &) `.$ `,*`bb`***I ,-II` 1)e1``q &'q `.$ `, **e ,.I` 1) `(&&&`b `-b$ `.b``***I ,-II``11n11b `'SQiQS `/$ `2*`H ,-HI` 1) `'S***S `- $' `0t`I ,-mI` 1)e1```S***S `- $' `2I ,-HI`111`111 `'S***S `,b $'`b `0H ,-HI `(b `(S***S `)b $- `/IHIeHHeIHeIHII```] `+S***S `* $- `/H,,,H,,,I,,,II``]+] `*S***S `)b $-`b `-I,,,H,,,H,,,HI`HHgHH `)S***S `' $(``b`` $( `,H,,,I,,,I,,,II`Io+oIHHIHI``S***S `&b $'j `'j $' `,HIIIHHIIHHIIHI`H +*H``S***S``b`b $(``$$`$$j$$$``b `-I,,,I `(I +*I``S***S`` $( `&$$$`b`` $( `-I,,,I `(H+++HIIIHH``S***S`b $( `&$$$ `& $(b `,I,,IH `(H+++I `)S***S`` $(``b`$$$ `& $( `-IHHHI `(I+++H S****S```b` $'j`$$$bjj $&`b `9H +&S*!***! *&S `&b $(`$$$`j $' `;H +&h***! *(R `' $(`b``` $(b `:H +&S *+oS `* $-`bb `;H+++H S+RSS `)b $- `>InHnI `6 $- `?W`W `9b`$$$b`b `]$$$ ``$$$ `ab `B",
        objectMap:
          " !Ņ !²ÅďÆ~ !7£!!£!!£!!£!!£!!£!!!£ !1£!!Ä!!!¿ !Iį !6£!£è !^Ã!!!À !7£ !F¾!ÂıÁ !6³!!!Į !^³!!!Ċ !6¾³ !,²² !=£ !?² !&²² !:Ì !'² !/³³³ !V³³ !(ª!!³ !)Ç !=³ !1³³!!² !5¾!!!Ĕð !3²!³ !'£!!!£ !&³³ !(~!£ !3Ì !+¸¹¹ºº!!!²~!!³ !/³³ !4£ !+£ !*¸¹¹ºº!ó!!£!³ĕ !.³ !@~ !*¸¸¹º !&Ì !Z¸¹º !;¾ !E¸¹¹!Ì !'Ì!!!£!!!£ !+³ !0æ !7¸¹!³ !'³ !1£!³ !+£ !+£ !3¸ !;³ !L£ !T¾ !Aç !AĕÍ !;£ !&º !bç !(£ !&²²² !.£ !&ĭ!ñ !)Í !C²£² !Uç !+²Āĥ !3ĕÍ !f¦!ä!!Ĉ¦!!Ĭ¦ !3¸¸ !E£!!Ĉ£¦!Ĭ£Ĭ !4ĥ !&Î !5Î!Î !zħ !a£ !(£ !M£!!£!!£¢ !¾~ !3ĭ !)£ !T£!!!£!!½ !H£ !&£!!£!!£!Í¼ !*ĉ !Åĭ !;© !5¯ !-æ£!!!£!!½ !'£ !0£!£ !6£!!£!!£ !'æ!æ!!!ĉ !7ĳÅëÆ !À£ !)£ !1± !b±£æ!Ċ£!!Į£Į !W± !&Ċ¦!!Į !=£ !/£ !4¾ !+£!!³³³ĭ !4ª !&¾ª¨!!!Č !1³± !/²²²ĉ !/Ä !(² !*¿ !1³± !=³£!Ã !(² !*Č!£² !.¶± !=³³ !3À!²² !U³£³ !Iß!!!ħ !-£ !'³³³ !'£ !C£!ă !&£ !-¨ !Å£ !)£ !]Âı!Áı !Â£ !b» !¥",
      },
      {
        worldMap:
          "XXX[ X@ S@X (BX S7, S&'''SX (BX S6 ,&SS'''SX (BX S5 ,(S'''QXXYeY X(e X)eXXX[XXXeXX(((X S4_,y ,&e'''SXX<<<X <&X ;(X:::X::!X:::X(((X S5 ,(S'''SXX<<<X <&X ;(X:::X:::X:::X(((X S6 ,&SS'''SXX<<<X <&X;;VV;;X:::XXeXX:::X(((X S7, S&'''SXX<<<X <&X;;VV!;X :-X(((X S8_SSS'''SXX<<<X<<<XX;;;!;;X :-X(((X S3_SSSo)oSS'''SXX<<<X<<XXX ;(Xs :+sX(((X S2***Q )'S'''SXX<<< X4Y X((((X S2***h )'e'''_XX<<< X;(((X S2***Q )'S'''SXX<<< X99e(((X S2***SSo)oSS'''SXX<<< X2[XXX[ X&(((X S2***SSS_SSS'''SXX<<< X1 8)XXX(((X S2***SSS++SS'''SXX<<< X0 8&V 8&XX(((X S1 *'SS++SS'''SXX<<< X/8!V 8'V88X(((X S0 *)SSQSS'''SXX<<< X/ 8-X(((X S0 *)S+++S'''SXX<<< X.[ 8-X(((X S0o *'oS+++e'''QXX<<< X/ 8-X(((X S2RgRSSS+++S'''SX!<<<! X.!V888V888V8e(((X S2]*] S&QSS'''S[ <'[ X- 8-X(((X S3] S*'''SX!<<<! X-[ 8-X(((X S<'''SXX<<< X/ 8-X(((X S/xxSx.SS -'S'''SXX<<< X/8!V 8'V88X(((X S/x .&Sp-s-m-S'''SXXXy X1 8&V 8&XX(((X S(/// S'...SSS -'S'''S X6 8)XXX(((X S(/// S& .'Sp-m-m-e'''_ X7[XXX[ X&YeYX S(/// S&.x..xSS -'S'''S `+bb```b``b``b```b``b`J%%%JSSSRSSSeSSS_SSSeSSSRSSSeSS'''S` $=` %'Q '>S` $=e %'i '>S` $=` %'Q '>Sb$$$``e``bJb``e `(e`e``bb`J%%%JSSSR S)_ S)R S,b$$$` 5, `' 4' `&OOeP O<P O&`$$$`555s555s 5&``b 4'b```O&&& O:PP222OO`$$$b 5, `' 4' `&O&&&P O: 2'Ob$$$` 5, `' 4' `&O&&&OOP O6 2)Ob$$$`555s555s 5&``b 4'b```O&&&OO00P O3 2*Ob$$$e 5, `'j 4& `&P&&&PO00OOPOP O.P 2*O`$$$ `(b```b `' 4' `&P&&&O 0* O-P 2+O`$$$ `1b 4'b```P&&&e 0* O( P&O 2+OOb$$$ `2jj44j `&P&&&O00z00z00 O' 2/ O&`$$$ `;P&&&O 0*P O& 2,OOP O&`$$$```! `7O&&&P 0* O+POOOP O*`$$$b``6 `7O&&&P 0*OOO2O2O2 O0`$$$`q 6&b `4O&&&P 0*OO 2)OOOPOP O)`$$$e 6'J `4P&&&P 0*POO 2' O&333 O)`$$$`q 6&b `&=b `.P&&&O00z00z0jPO 2)OP 3' O(`$$$```6 `(== `/O&&&e 0)jPOP 2'POL 3'L O'b$$$```! `&b===b `.O&&&O 0(jjOO 2)OO 3'P O'b$$$ `* =& `/O&&&OP00OPOP O& 2'POOO333OOLOLOOb$$$ `) =' `/P&&&PO00 O) 2)OOOP3OOPFFFPOb$$$```b``` ='bZZ `,O&&&OOOP O* 2'P O&3OO F'O`$$$`r777r` ='`=Z `,O&&&P O, 2) O&3PP F'P`$$$e 7'e ='y=Z `& O'`O&&&POLOLON O&P 2' O'3POOFFFOO`$$$`r777r` ='`=Z `&O&&&O`O&&&O 1( O& 2)OOP333POFFFOO`$$$b``b``b ='bZZ `&O&&&O`P&&&e 1(L O& 2'OOO 3'PFFFPOb$$$ `) =' `)O&&&O`O&&&O 1( O& 2)OO 3'OFFFOO`$$$ `* =& `)O&&&O`O&&&OOPPPOeOPPOPOOeOPOOPOeOePOePeOO`$$$ `+=== `)OO&&OPO &BPO`$$$ `,==b `(O&&O!! &CtO`bT`b `+b= `) O&POP &BOO `< O&P O'PPOOOPP O'P O&PPPOOPOOPPO",
        objectMap:
          " !fÏ !,ó !,ė !?į !-£!!!£!!!£!!!£ó!!£ė!!£!!!£!!!£ !KÏ !.ė !@² !&Ĉ!!£ !Y² !2¸¹¹¸!!!ñ!ñ !(²!ā !?~!æ !,£ !&¹¹!!£!!£ !(²£² !(£ !K¹ !O² !'£ !'£ !-Ė³!!!ò!ĕ!ėÏ !TÎ!ĕ³³!!£!!!£!!!£!!!£ !E£!¾ !+³³ !¬£ !&£ !'£ !{ç!!£ !E£ !RĖ !aÞ !&½ !&£ !'£ !SĖ !?Ü !-£ !4Ė!!!Í!!¾ !+£ !3£!!!£ !8ħĂ!£!!ñ !.æ !5³ !B³£!!!£ !'£Ċ !3³³³ !A³³ !)į!!!ĭ !.Ĥ!!¶³!³³ !'£ !E£ !4³³³ !Jæ!!!æ !3³ !G£ !&Ċ£ !3£!!!£ !;Ĭ!!¥¸Ü³® !*¼ !1Ă !-£ !2Ĉ!!³!!¢!!!³ !Aħ !/³³ !)£ !&³!!!³ !>ă !2³£³ !-~!¸ !&£ !Lħ!ĥ !&² !(ă²¯!Ħ !Í£!!!£!!!£!!!£!!!£!!!£!!!£!!ĥ!£Íĥ!!!£!!!£!!!£!!!£!!!£!!!£!!!£ !Ð®!±±± !)į!!!ĭ !K£ !)£± !&¤!!!~!!!~ !Dººº !_¹¹¹ºº !)± !/³ !,£ !:···¸¹¹º !-£ !&±¤!!!~!£!~ !C··¸¹º!!!£ !&¢!!!¯!!¥ !)Ċ!± !A±±!!·¸¹ !7³!!!± !-ä®!± !1±±±!!··¹ !7~æ!!~ !(£!!!£ !5±±±!!!· !:³Į !0Ĭ!± !0±± !+£ !C~ !DÌ !C± !'¾ !Q£!!ċ !'£ !&°!ì !:³º !<æ!Į !*Æ!¿ !2£ !&£³º !@¢ !)ÄÀ !'» !2³º !'³ !?Ä !&°!!~ !:ð³ !1£!!!£ !-Æ !9Î !)³ !8± !'°!!Â !'ă!Ì!ĥ !*£ !+Ì!!³ !5Ċ± !,Ã!¿ !`Ķ !.Ü !D£ !/Ä !.±!!!³ !4ä !=ĶÂ!!ì !*²!Ü!³!!!£ !&£ !'£ !OĤ!Ĥ !<²!³ !3°!Ã!!À !?± !,³ !&£!!!£!!£ !(Ä !-~!Ā!Ā !2±± !4Î!!!ó !)ÂÁđ !&ó!!!ĕ !*£ !+Î!!± !yñ!!Í !'ĕ!!!ñ !0É !-ò !-¾ħÏ!!£!!!£!!!£!!!£!!!£!!!£!!!£!!!£ !Jĕ !5Í!!!ĕ !f",
      },
      {
        worldMap:
          " OD Z<TZZZ OD Z6 $+Z O=POOOPOO Z6$ZZZ $'Z O<'''O'''O Z6$ZZZ $'Z O;Pk''O''kP Z5$$$ZZ $'Z O<'''P'''O Z5$$$ZZ $'Z O<POeOeOPO Z5$$$ZZZ$$$ZZ O6POOOPPOO'O'OOO Z5$$$ZZZ$$$ZZ O6((!O(((O'O'OOO Z;$$$ZZ O5P ()P'P'POO Z;$$$ZZ O6(((!((!O'O'OOO Z: $&ZZ O+] O-((O((OP'''POO Z9 $'ZZ O*]F]OPOOOPOOPl ('lP'''OOO Z8 $'ZZZOOPOPOOSSg S+O ()POe O& Z7 $(ZZZO E(SFFFS G(S (*O&&&OOO Z6 $( Z&P E(gFFFe G(h (*e&&&e&O Z5 $( Z'O E(SFFFS G(S (*O&&&OOO Z4 $( Z(OPOOPOP S.O ()P&&&OOO Z, $/ZZZ***Z O2POOPl ('lP&&&POO Z, $. Z&***Z O6P((O((OP&&&POO Z, $- Z'***Z O6(((!((!O&&&OOO Z,$$$ Z0eZZ O6 ()O&&&OPO Z,$$$ Z/)))Z O6((!O(((P&&&OOOZaZZa Z'$$$ Z& )' Z&)))Z O8POPOPO &'O %(Z$! $(!Z ).Z O> &'e %(e $+e ).Z O=P &'O %(Z $+Z ).Z O4HHMHH O'POOPOOZZa Z0 )' Z') Z6H///H Z@) Z)! Z6H///H Z- .& Z1) Z)) Z/ H*///I H( Z' .& Z1) Z)) Z/ H)IHeHI H( Z' .& Z))!)))ZZZ) Z)) Z/ H'IH /'I H' Z' .( Z')ZZZ)ZZZ) Z)) Z/ H' /+IHHH Z' .( Z')ZZ)))ZZ) Z7 H& /'n /'HHH Z1!)!Z )( Z/ H,I //HH Z* .'ZZ)))Z)))Za Z0 H+IH///n /'n///HH Z) .)Z)))ZZ) Z)a Z+ H)IHH /1HZa Z' .) Z'a)a Z&)))jj Z) H(///H /1H/// Z' .' Z) ),j Z) H'M///e//n///! /'n /( Z(... Z&,ZZZ ),j Z) H(///H /1I/// Z)e Z',ZZZ )- Z) H)IHH /1HZZ/a Z(- Z', Z+ )' Z) H-///n /'n///IHZa/ Z)- Z', Z,))) Z* H,I //HHZZ/ Z)- Z', Z,))) Z2 H& /'n /'HHHZZ/ Z)---ZZZ ,( Z&a)))aAAA Z. H' /+IHHHZZ/ Z)--- Z*, Z')))ZAAA Z. H'IH /' H(ZZ/ZZZa Z'- Z*, Z')))ZAAA Z. H(IHIeHI H(ZZ /( Z&-- Z&a ,' Z&e Z&A Z. H*/// H) Z'aZ/ Z&--ZZZaZ ,'ZZZ+++ZZZA Z5H///I Z.aeaZZZ -&e ,+e+++eAAA Z5H///H Z.---ZZa--ZaZaZ ,'Zaa+++ZZZA Z5IHMHH Z- -'Za-- Z&a ,' Z+A Z5 H' Z--ZZZ-ZZ-ZZ,,,ZZZ, Z+AAA Z;111 Z)-ZZZ-ZZ-ZZ,!,ZZZ, Z+AAA Z: 1' Z(-ZZa -&ZZZ, Z&, Z+AAAa Z9 1' Z(- Z, ,. Z@ 1(e0ZZZ -, Z.,ZZZ,,, Z: 1'ZZ0 Z'- Z(- Z.,ZZZ,,, Z: 1'ZZ0 Z'- Z( -) Z(,ZZZ,,, Z;111ZZZ0 Z'e Z+-ZZ--ZZZ ,'ZZ, ZB0 Z'0 Z+-ZZZ-ZZZ,S_S,ZZ, ZB 0) Z+-ZZZ--e,,QSQ ,& ZR--ZZ-ZZZ,S_S, ZV -&ZZZ,!!,, Zh",
        objectMap:
          " !ĂÇ !?ð!Ì!Ì!ð !=£ !@£!!!£ !7Ï!Í !D²²!!!³³ !6±!³ !`±£³ !FĔ!Ĕ !8±³³ !@Ì!!!³ !CĮ !9³£!!!£³ ![³!!ç!!ĥ !Aį!£ !Ãæ !kç !/Ĕ !Qċ£!ç£į !,ħ!!!Ï !)£!!¶ !Dċį !.ò !oĔ !7ċ !)²³³ !P£ċ !'£ !)²£³ !@ð !X³!!ç!!ĥ!!!Ì !W³£!!!£!!Ĕ !Y³!Î!!!³ !D£ !Nį !(ĭ !O£!!!£!!£!!!£ !'£ !&£ !ãÜĀĤ !IĊ !7³³³ !. º& !9Į !7³³³ !.ºº¹³ !9Ċ !Fº¹¹³ !*ċ !0æ !Fºº³³³ !8Į !Fº ³& !c¾ !&ċ!ĭ!!£ !UĀ!!!Ā!!!£ !a¹¹¹ !G¡ !1ħ!!£!!ĥ !0~ !1ă³² !=Ü !Cß³² !(¡Í»!¡ !D£ !1ħ³² !k¡ !4Ì !Ě¸¸ !a¸£ !aį !dä !6³³³ !>æ !B³³³ !=å£ċ !'£ !;ĂÞĦ !>Ĭ !µò !+³~± !/į!æ !;¹¹¹ !3³ä !0·£ !; ¹' !B·· !;¹¹!!Ĭ !^¹!£ß!!!ð!!!ė !&ė !6³³ !;²!!³³ !B³£ !;²ò³³³ !_³³³ !vò !Uė !1Ï !Äė !'āħ !j",
      },
      {
        worldMap:
          " `RZaZaaZZ `ZZZ 1&jZZ `YZ11 j'a `XZZ 1'jjZZ `Wa 1+Z `Wa 1+a `WZ 1+a `WZZ 1)ZZ `XZ 1)a `YZZ 1'ZZ `ZZaeaeZZ `]Z000a `^a000Z `^Z000Z `^Z000a `^Z000Z `^Z000a `^Z000Z `^Z000Z `^Z000Z `^a000Z `^Z000Z `^Z000Z `^Z000a `^Z000Z `^Z000Z `^ZZeZZ `_/// ``/// `a/ `ab/b `a/ `ab/b `a/ `b /*e. `b. `E- `<.. `Dx-- `;.. `<,,, `&x -& `9... `< ,&``xx -' `7b... `< ,& `'e `: .&``` H3 `0q** `9 .&b`` H3``bKb `&,m```***b `7 .&j```HH'!IH'' H+`b)))```m ,&`*** `*b```b `)b` .&j```I ')s H*` )'``m ,&e *4` .+jj```M '*M H)`k)))k``m ,&K *4e .+jjb``H ')s H*` )'``m ,&e *4` .,j```HH'!HH''HIH&& H&``)))```m ,&`***`b`b``***`b``bb `&b`` .'``` H(eHH && H&`b)))b```mm``b*** `(*** `/ .'``` H'I$HH&&&I H&``))) `+q** `(*** `0 .&b``T $)e&&& H'``))) `*b`e`b `&b***b `/ .&```HHHIHH$HH&&& H'``))) `)M +'M```b*** `1...``` H(iHH && H&```) `+b```b `'***bl333l `*b...``` H'%%%HHH&& H&``b)b `3b***` 3' `(2```..b``H%%M %'MHI H'```) `5***` 3&k`b`b``22``..```HH%HH%%% H&IJHHH``b)b `*bKb `&b``***` 3'` 2*``.```HH%HHJgJHHH ('H```) `+o*o `&*``***` 3'e 2+e.```HH%HH]G]HHH(k(k(H``)))b `( *'```*b`***` 3'` 2*``b```HH%IHH] H& ((` )'```b` *1` 3&k`bbb`b22 `)HH% H)K ((e ))e *3` 3' `(2 `*HH% H* ((` )'`b``` *1`l333l `1HH% H'IHH(k(k(H`by)z `(b *'bb`*```bb `7HH %*e ('H``bKb `*o*o `&* `< H/JHHH `/bKb `&b `<",
        objectMap:
          " !¸½½½ !Â¢!Ĭ !eä !]Ë!£!!Ë ![ä!!ä!Ĉ !^Ĉ !eË!¯ !]į!!!ĭ !ă£ !aË !Æ£ !ą£ !ÆË !a£ !a¯ !Æ£ !ą£ !Ņ !Ņ !µ~ !W½º !)£ !;Ĕ !>ºº !)Ĥ!!± !9ñ !=ºº !d¾ !AÌ !A¥ !?Ĕ !,ð!!~ !.¸¸ !'ç!į !W¹!!!Ĕ!!!Å !,ã !,¿ !2¼£ !'£ !-£ !(£ !&£ !*£ !+£ !(£ !9ó!!!ĕ!!!Ã!á !-Á!¿!!ą!!Á !,~ !)Ė !)²² !/ċ !PĔ!ñ² !MĖ !=Ì !GÎ !(Ê !&£!!!Í !PĖ!!ñ !C£º£º£ !)Ĩ !@Ė!ñ³ !BºĀ !>³³ !=Ī!!!ººº !*Ĕ !-¾ß!£!ā !-Ĕ !9ºº !/Ė !Rº !@Ĥ!!!ð !7³ !(¶!ħħ!!!£ !&£ !/Ħ !Gº !Bð !0Å!!!ć !)Ã!!!ºº !?Ĥ!¡ !(£ !,£ !+£!!ººº !*ò !8Í !/Ã!!á !,Á!!ºÞ !¼³ !}",
      },
      {
        worldMap:
          " Hd$$H$$H$$H$$H$$H$$H$$H$$H$$H$$H$$H$$H$$H$$H$$H$$H$$H$$H$$H$$H$$HH$$H$$H$$H$$H$$H$$H$$H$$H$$H$$H$$H$$H$$H$$H$$H$$H$$H$$H$$H$$H$$ He$$H$$e$$H$$H$$H$$H$$H$$H$$H$$H$$H$$H$$H$$H$$H$$H$$H$$H==H=$H$$HH$$H$$H$$H$$H$$H$$H$$H$$H$$H$$H$$H$$H$$H$$H$$e$$H$$H$=H=$H==H$$ He$$H$$H$$H$=H==H$$H$$H$$e$!H$$H$$H$$H$$H$$H$$H$$H$$H==H$$H$=H$$HH$$H$$H$$H$=H$=H==H$$H$$H$$H$$H$$H$$H$$H$$H$$H$$H$$H=$H$$H==H$$ He$$H$$H$$H==H$$H$=H$=H==H$$H$$H$$H$$H$$H$$H$$H$$H$=H=$H$$H=$H$$HH$$H$$H$$H=$H$$H==H==H$=H==H$$H$$H$=H=$H$$H$$H$$H==H$$H$$H==H$$ HKe H:$$H$$H$=H=$H$$H=$H==H$$H$=H==H$=H==H=$H$$H$$H$$H==H=$H$$H$=H$$HH$$H$=H==H$$H$$H==H$=H$$H$$H$=H==H$$H==H$$H$$H$$H$$H==H$$H==H$$ H:e HK$$H==H$$H$$H$$H$=H==H$$H$$H$$H$=H=$H$=H$$H$$H$$H$=H==H$$H=$H$$HH$$H=$H$$H$$H$$H$$H=$H$$H$$H$$H==H==H==H$$H$$H$$H$=H$$H==H=$H$$ H5I H'I HJ$$H==H$$Hbz4y4zbH 3+H$$H==H$=H=$H$$H$$H$$H==H$$H=$H$HH$$HH$$H$=H$$H` 4'`H3u33u33u3H$$H$=H==H==H$$H$$H$$H=$H$=H=$H$$H$$ H-bz 4&bI 3+I HG$$H==H$$HH 4&HHI3u33u33v3H$$H$$H$$H$=H$=H==H$=H=$H$=H=$H$$H$$HH$=H=$H$$HHy444IHH 3+H$$H$$H$$H$=H==H$=H==H$$H$$H==H$$H$$ H.Ie H(IHIeHHII HH$=H=$H$$HHq55 H&IHH333J $)IH$$H$$H$$H$$H$$H$$H$$H$=H$$H$$HH$$H==H$$HH555HHH$$$H333e $)IH$$H$$H$$H$$H$$H$$H$$H==H$$H$$ H-M 5&e $&H333J $) HC==H==H$$HH555HHI$$$IHHIHHIHH$$$I H7d$$dHH] H&=$H$$H$$HIq55HHH$$$ H*I$$$ H3IIHHII$$HH]D] H/IeIHHH$$$I H)I$$$I H0 $&H $'HIHgHIHH==H$$H$$H} 6&HH$$$ H+$$$ H1 $&H $'I )'IH$=e=$H$$HHI666IH$$$I H*$$$ H3$$ H) )' H-} 6'H$$$I H(o $'o H/$IH$H$$ H& )'IH$$H$$e$$HIH 6&e$$$HIHIIHH $)HIHIHHHIIHHH$$$HIHHIHHHIIHh H&$$H$$H$$H} 6'H $.HMH $@ H&e H*I6H6IH $.JHJ $@MHH$! H+}H}HI $.HTH $@HHH$$ H,IIHI$$$HIHIHIH $)I H&IIHHIHH$$$HIHHIHHHIIIHI H4I$$$ H)o $'o H/$ H) S&R S& H3$$$ H+$$$ H( S*HHH S'HSl.{.{.lSHHIIHHJHIHIHHq77I$$$I H)I$$$I H'S *(SSHHS---SHS .)SI{88Ho 8(e777H$$$ H+$$$ H(S *)SHHSx--SHS...k...SHk88I 8)I777e$$$I H)I$$$IHH S& *) S&xx-SSS .)SK888e 8)e777H$$$ H+$$$HHHS((S *&S**S**Sxx-xxS .)SHk88H888HIIHH777e$$$ H*S_e_SHHS((S *&S**S**S -&xSl .'lSH{88I888H999e777H$$$I H)S%%% S&((S *& S)e S*e S&IHIHH888H999Hq77H$$$ H*S%%%S ('S**SSS *5SH888H888I999HI H&I H+S%%%S ('S**S%e *5SH888e888H999J99HHSSSR S*%%%SSe S)%S *5SI888H888I{k{H99IHS %; S3***SHHIHHhdhHHtHI99IHS %; S&0s000|Sk/k/kS***S H'CCCI H*Q %; S'000ySSk/k/kS***SHHHIICCC H+S %; S&p000SSSk/k/kS***S H& C'I H)S %;SSwSS000e /)S***SHHH C) H)S %' S+_i_SSS %'Sw+wSSe S'eSeSS***SHb C&z C& H(S %'S &'SSS'''SSS %'SS+SS *1SHICCCzyyCCC H(S %'S&&& S& ''SS%%x%%Sw++e *1SHICCCyzzCCCI H'S %'S &'e ')S%xxx%SS+SS *1SHH C&z C&b H'Q %'Q &'S ')R%xxx%Sw+wSSeSSSeSSSeSS***SHHI C) H)S %'S &'e ')S %'SSwSS 1)S222S***S H& C'I H)S %'S&&& S& ''SS %' S' 1)S2SeS***S H&ICCC H+S %'S &'SSS'''SSS %' S'1S1S1S1SpS2S***S H(bI H+SSSR S.Q S(_ S6RSS",
        objectMap:
          " !i¾ !*¾ !'¾ !*¾ !'¾ !'¾ !-¾ !'¾ !(¾ !*¾ !0¾ !'¾ !'¾ !'¾ !'¾ !'¾ !*¾ !'¾!!¾ !'¾!¾!!!¾!¾ !0¾ !'¾¾!!¾ !,¾ !?¾ !'¾ !&· !&½ !/¾ !,½ !,¾ !0¾ !'¾ !3¾ !,¾ !.¾ !'¾!¾ !(¾ !-¾ !)¾!!!¾ !'¾!!¾ !)¾ !'¾ !/ĸ !+¾ !-¾ !'¾ !.¾ !'¾ !'¾!!¾ !0¾ !'¾!!¾!!¾ !?¾!!¾!!¾ !,¾!!¾ !.¾ !)¾ !'¾!!¾ !*¾ !0¾ !4½ !,¾ !1¾ !6¾ !&·!!·!!!¾ !-¾ !2¾ !*¾!!¾!!¾!!¾ !(¾ !*¾!¾ !'¾!!!¾!¾ !'¾!!!¾!!¾ !,¾ !.½ !&¾ !'¾ !3¾ !4¾ !9¾ !E¾!!¾ !*¾!!¾!!¾ !3¾!!¾!!¾!¾ !(¾!!¾!¾!!¾ !-¾ !3¾ !'¾ !3¾ !:¾ !'¾ !'¾ !-¾ !6¾ !)¾!!¾!!¾ !7¾!¾ !*¾!!¾!!!¾!!¾ !&¾ !(¾ !/ä!~!!!²²!ä!³³³ !,¾ !H±!Ĉ!±!!³!Ü!!ä!!³ !(¾ !-¾ !*¾ !&½ !(¾!!¾!!¾ !&£!ĭ !&³!£!³!ĉ!¾ !+¾!!¾ !)¾!!!¾ !&¾!!¾ !/į~ !'³!ă !+¾ !-¾ !'¾ !'¾!!¾ !+¾ !0³Įį!!!Ħ!³ !(¾ !'¾ !'¾ !6¾ !&¾ !=¾ !6¾ !'¾ !&¾ !3ó !3¾ !'¾ !'¾ !'¾ !=ė£ !)£ !'¾ !'¾ !'¾ !'¾ !&³ !+¾!!¾!!!£ !'£!!!Î !B¾ !-¾ !¾Ĥ !&¾¾ !&¾ !K³³ !4§ !'³!!Ì !D³³ !)ó!Ā!ñ !R¾ !&¾ !'ė!£!ĕ!!¾ !(¾!!³ė£!³ !A¦!!!¾ !(ė!!!ĕ !Q¦!¦ !5½ !(³ó!!³ !_³!³!!!£ !*£ !'£ !/£ !.£ !'ĸ !~Ç !1¦!¦ !a¦ !l²!²!² !Kº!!· !)² !'³ÌăÜ!Ì³!!!Ýº !E¸º· !0ó³!!!³³!!!²ā !(£!!!£ !1£ !*¹ !2ėº!!º³ĕ!!!£ !1£ !3³³!¸º !)¶ !)º³ !&ĕ!!!²ĥ !,£ !7³³!¹º !'¾ !0º !'º!!!ĕ !>³³!¹ºº !'¾ !9ñ!!!³ !4£!!!Ĕ!³³!·¹!!!Å !&Ó !.¿!!!Āĥ!!!Í!³£³ !:³³!¹¹ !&£ !1£!!!ß£!!!£!!ÞĂĦ¾ !AÃ !,ę !&Á !&¼!ĥ !+²²!!!Å!Ó !3÷!!!¿ !D²² !B«!!¨ !-ô !7£ !+£ !+£ !lª !+Ò !*ÅëÆ !0¿!ę !,õ!!Á !+© ![Ĕ!!² !6±Ä !&~¿¦ !)ö !'²Ü!ĥā !'Í !/Å÷ !,Ã !(Ď !'è !0² !(Ĕ!!!Ĕ !+£!!!£ !-£ !'Ĳ~ !&İ !.ô !)ð !'ð !-Ã !(ę !(Á!!!±Ã !'À± !+£!!!ß»£ !(£ !I± !<³!!³£³ !1£ !-ÂčÁ± !1² !,³ !&³ !*£!!!£!!~ !.¦ !.Ã!!!Á!²Þ!ĥā !'³!!!Ã³Ñ³Á !'~!~!~!~!!!¦ !h",
      },
      {
        worldMap:
          " VŅ VŅ VJ %0 VT %0 VT %0 VT %0 VT%%% V*%%% VT%%% V*%%% VT%%% V*%%% VT %0 VT %0 VT %0 VT %0 VT %0 V`%%% V_ %& V_ %& VA W. V4%%% VA '. V( %. VDnVnVnVnVnVnVV''VVV %. VD '.V''VVV %. VD'V ',V''VVV%%% V(%%% VBWV '. V( %& V& %& V+$$$ V6nV'V ',V %* V( %*VVV $' V4 '1U %+ V& %,U $) V3k'''V ',e %* V( %+e $)T V2 '1U %+ V& %,U $) V4nV'V ',V %* V( %*VVV $' V5WV '. V( %& V& %& V+$$$ V8'V ',V''VVV%%% V(%%% VD '.V''VVV %. VDnVnVnVnVnVnVV''VVV %. VD '. V( %. VD W. V4%V%% VW% V' %' VW% V' %' VW% V( %& VW %- VW %- VW %- VW %- VW %- VW% V( %& VW %- VW %- VW %- VW %- VŅ VŅ Vē",
        objectMap:
          " !Ņ !Ņ !M ³* !Z ³* !Z ³* !Z ³* !¼¶ !Ç ³* !Z ³* !Z ³* !Z ³* !Z ³* !Ņ¾ !µ²² !&£ !*£ !R²² !S²!!£ !(£Ĭ¾ ![ċ !&Ĭ !V³ !cç !_£ĺ² !0£!!!£ !*£ !&£ !+È !7ç !a³ !hċ !&Į !V²!!£ !(£Į¾ !Ç½ !&£ !*£ !À¾ !'¾!¾ !ľ ±( !] ±( !] ±( !] ±( !] ±( !À ²( !] ²( !] ²( !] ²( !Ņ !Ņ !ė",
      },
      {
        worldMap:
          "OOP O`P/// O)..O .-O ,- O>/O/POOPPOO..O.u..u .'!O ,- O>/O/O /&OO..O .(OOOeOO,, O),, O>/P/P/OO/OO..O .(O ,) O),, O>/O/O/OO/PO..O.u..u.e ,) O),, O6L O(P/O///OO/OO..O .'!O ,) O),, O6& O)/OOPOPP/ O&POP O(P O&P O),, O4LO&PL O'/ O(/ O& +- O,P,, O3 &(yOOOP///O /&OOOP +- O-,, O2P! &(L O'/O/P O'P++OOPP +' O-,, O/POOP &) O'P/O/ O(P++ O& +' O,P,, O/PPOO &+NOOP/O/ O)++ O&+!!+++x O) ,& O. &. O(/O/OOOPPOO++POOOPOOO+++ O) ,& O-P &.L O'/O/PO +) O)P+++P O& ,( O. &'!&&!&&! O&///O/OP +)P O)+++OP%OO ,( O.&&&OOPOOPOPPOOOP/POO/OO +) O)P+++e%%%e ,& O/P&&&P O./POO/OO +' O,+++ O' ,& O0&&& O//POO//e +'P O-PO%%% O5&&&e%%P O+/OOPOPO +'P O(% O(%%% O2POPOPOO%%P O+/ O&POPOOPPP O(%OPOOOP%%%POOOP O, %,OPOP O'P/POOOPOOP O.%%O %)O%% O, %,PPq''q O&/OOP /' O( %'O %/ O,%%OPPOPO%%Oq '&qOOO/OOO/OOO/P O' %'O %/P O&POPOO%% O(%%e '(OOO/OOO/OOP/P O'%% O&%%% O)%%%POOO %*P O(PO '(OOO /'OOO/ O(%%O%OP%%%OOOTOOO%%%POPO %* O*P '( O,P/ O(%%O %(OO$$$OO %(O%%POOP%% O+ '( O)PPOO/P O'%%OO %&!OO$$$OO! %'O%% O&%% O+ '( O( /( O(%%O %'!OO$$$OO! %'O%% O'P O*P '( O'P/OOOP O)%%O%OO%%!OOOeOOO!%%POOOP O2q '&q O(/P O,%% O&%%%OO%%%OO%%% O8 '& O)/ O-%%OOOP %/P O7eOOeOPOO /&P O,%% O& %/P O5P D(OOO/PP O( %*OOOP%%O %)O%% O6s D(sOO/ O* %* O&eOOPO%%%PP O1((( O&P D*OP/P O)e O* B'OOP%%% O3((( O's D(sOO/P O& *' O) B'OOO%%%OOO %(O((j O&((( O(DsDDsDOOO/ O&Px *& O) B' O&P O& %(e((j O&((( O*POP O&/ O&Px *& O) B'O %, O'((( O&((( O( D)OP/ O'PO *' O' B'O %, O' (&jOO((( O( D)OP/ O(P *' O(g O.%% O' ('OO((( O-POOO/POOPOPOx *&P O&]B]O %& O(%% O' (, O0P/OO /&POO*** O(]OO %& O(%% O*j (( O1/PO/OO/OOP*** O5%% O@/OO/OO/POOOPe O1!%!%%% O@/OP/OO/ O' /&j O-%! %& O@/OO/OO/ O' /&j O-e OE/PO/OO/ O*// O* )( OC/OO/PO/P O)//OP O( )( OBP/OP/PO/POOO///Oj/O/P O' )( OC/OO/PO/ O&/O/O//O/P O' )& OE/PO/OO/OOPO/O/O// O*))) OF/OO/OO /(P/OPOO/!/ O&))) OF/OO/ O(POO/ O&!/! OLP/PO/P O) /+ OLP/PP/ O* /+P OKP/OO/ O&POOP /+P OL/PO/OP /&OO /+ OM/OO /&OO/OO /+ OM/ O*/PO /+P OL/ O*/OP /+P OL/ P)O/ O'POPP OO /, OWP O'POPPOP OV",
        objectMap:
          " !e· !,¾²²²Ëį!!!ĈĈ !K·!· !)³³!² !+ĭ !&® !J·!·!!³³!ç !T·!·!· !'³³!ç !)Ë !S·!!¶³ !.Ë !,¯ !>·!·!· !'½½ !&æ!Į !G± !0· !Z· !W±!!!± !(·!!!·!· !OĬ !'± !(·!· !1£ !ZĮ !L£ !&± !&·!· !0ċį !=® !m± !(·!·!!!įç!!!æ !5¢ !5å!!ĉ!!Į !'· !Q£ !0·!!!· !*Ċ !+£ !f¾ !F·!!!·!!!£ !bį!į !W· !u¾¾ !M·!!!·!·!· !Sñ !`£!!£ !&·!!!·!!!· !Sñ!³ !&·!· !g· !4Ç³ !<Ė!Î!³³ !6¾¾ !&ä !)ä !'¾ !7Ė !*·!·!· !0Ĉ !)Ĉ !:£Ė!£ !)· !5Ĭ !)Ĭ !¨· !_·!· !V² !dæ!¯ !&· !O±³³ !'£!£!!£Į£ !6įįį !;ä±³ !(®ĮĊ !(· !*£ !-Ċ !;±³ !*²¢ !<Ċ !'¾ !+£!£ !(ð!± !(¾ !*· !*Þ !.æ!³³ !7£ !* º&³³ !:æ!³³ !6Ĥ !+ º&³³!!· !+ă !0¾ !8¹ !Gºº !9¹¹ !1·!!!·!· !&Ĥ !,ºº !8¹¹¹ !4· !*£ !U· !'· !7Ï!ė !F· !:£ó !D· !'· !_· !.~ !*·²!£ !E· !'· !+³ !*¸·² !I· !)·!·!!³ !*¹¸···² !C· !'· !*³³ !*¹¹¸· !H· !)·!·!!!¾¾ !(º¹¹ !F· !'·!·!· !)·Ā· !&ºº¹ !I· !+· !&Ĥ·Ý !M· !-·!·!·!·!· !P· !+·!·!·!· !N· !-·!·!·!·!· !P·!!!·!·!!!·!·!·!· !N·!!!·!· !'·!·!·!·!· !V·!!!·!·!·!· !N· !-·!·!·!·!· !V· !X·!·!·!·!· !¼",
      },
    ],
    parTimes: [
      [1.5, "01:30"],
      [3.5, "03:30"],
      [3, "03:00"],
      [2, "02:00"],
      [4, "04:00"],
      [6, "06:00"],
      [1, "01:00"],
      [3, "03:00"],
      [0, "??:??"],
      [0, "??:??"],
    ],
  },
];

var ceilingColorIndexes = [
  0x1d1d, 0x1d1d, 0x1d1d, 0x1d1d, 0x1d1d, 0x1d1d, 0x1d1d, 0x1d1d, 0x1d1d,
  0xbfbf, 0x4e4e, 0x4e4e, 0x4e4e, 0x1d1d, 0x8d8d, 0x4e4e, 0x1d1d, 0x2d2d,
  0x1d1d, 0x8d8d, 0x1d1d, 0x1d1d, 0x1d1d, 0x1d1d, 0x1d1d, 0x2d2d, 0xdddd,
  0x1d1d, 0x1d1d, 0x9898,
];

var ceilingColorPallette = [
  [0, 0, 0],
  [0, 0, 168],
  [0, 168, 0],
  [0, 168, 168],
  [168, 0, 0],
  [168, 0, 168],
  [168, 84, 0],
  [168, 168, 168],
  [84, 84, 84],
  [84, 84, 252],
  [84, 252, 84],
  [84, 252, 252],
  [252, 84, 84],
  [252, 84, 252],
  [252, 252, 84],
  [252, 252, 252],
  [236, 236, 236],
  [220, 220, 220],
  [208, 208, 208],
  [192, 192, 192],
  [180, 180, 180],
  [168, 168, 168],
  [152, 152, 152],
  [140, 140, 140],
  [124, 124, 124],
  [112, 112, 112],
  [100, 100, 100],
  [84, 84, 84],
  [72, 72, 72],
  [56, 56, 56],
  [44, 44, 44],
  [32, 32, 32],
  [252, 0, 0],
  [236, 0, 0],
  [224, 0, 0],
  [212, 0, 0],
  [200, 0, 0],
  [188, 0, 0],
  [176, 0, 0],
  [164, 0, 0],
  [152, 0, 0],
  [136, 0, 0],
  [124, 0, 0],
  [112, 0, 0],
  [100, 0, 0],
  [88, 0, 0],
  [76, 0, 0],
  [64, 0, 0],
  [252, 216, 216],
  [252, 184, 184],
  [252, 156, 156],
  [252, 124, 124],
  [252, 92, 92],
  [252, 64, 64],
  [252, 32, 32],
  [252, 0, 0],
  [252, 168, 92],
  [252, 152, 64],
  [252, 136, 32],
  [252, 120, 0],
  [228, 108, 0],
  [204, 96, 0],
  [180, 84, 0],
  [156, 76, 0],
  [252, 252, 216],
  [252, 252, 184],
  [252, 252, 156],
  [252, 252, 124],
  [252, 248, 92],
  [252, 244, 64],
  [252, 244, 32],
  [252, 244, 0],
  [228, 216, 0],
  [204, 196, 0],
  [180, 172, 0],
  [156, 156, 0],
  [132, 132, 0],
  [112, 108, 0],
  [88, 84, 0],
  [64, 64, 0],
  [208, 252, 92],
  [196, 252, 64],
  [180, 252, 32],
  [160, 252, 0],
  [144, 228, 0],
  [128, 204, 0],
  [116, 180, 0],
  [96, 156, 0],
  [216, 252, 216],
  [188, 252, 184],
  [156, 252, 156],
  [128, 252, 124],
  [96, 252, 92],
  [64, 252, 64],
  [32, 252, 32],
  [0, 252, 0],
  [0, 252, 0],
  [0, 236, 0],
  [0, 224, 0],
  [0, 212, 0],
  [4, 200, 0],
  [4, 188, 0],
  [4, 176, 0],
  [4, 164, 0],
  [4, 152, 0],
  [4, 136, 0],
  [4, 124, 0],
  [4, 112, 0],
  [4, 100, 0],
  [4, 88, 0],
  [4, 76, 0],
  [4, 64, 0],
  [216, 252, 252],
  [184, 252, 252],
  [156, 252, 252],
  [124, 252, 248],
  [92, 252, 252],
  [64, 252, 252],
  [32, 252, 252],
  [0, 252, 252],
  [0, 228, 228],
  [0, 204, 204],
  [0, 180, 180],
  [0, 156, 156],
  [0, 132, 132],
  [0, 112, 112],
  [0, 88, 88],
  [0, 64, 64],
  [92, 188, 252],
  [64, 176, 252],
  [32, 168, 252],
  [0, 156, 252],
  [0, 140, 228],
  [0, 124, 204],
  [0, 108, 180],
  [0, 92, 156],
  [216, 216, 252],
  [184, 188, 252],
  [156, 156, 252],
  [124, 128, 252],
  [92, 96, 252],
  [64, 64, 252],
  [32, 36, 252],
  [0, 4, 252],
  [0, 0, 252],
  [0, 0, 236],
  [0, 0, 224],
  [0, 0, 212],
  [0, 0, 200],
  [0, 0, 188],
  [0, 0, 176],
  [0, 0, 164],
  [0, 0, 152],
  [0, 0, 136],
  [0, 0, 124],
  [0, 0, 112],
  [0, 0, 100],
  [0, 0, 88],
  [0, 0, 76],
  [0, 0, 64],
  [40, 40, 40],
  [252, 224, 52],
  [252, 212, 36],
  [252, 204, 24],
  [252, 192, 8],
  [252, 180, 0],
  [180, 32, 252],
  [168, 0, 252],
  [152, 0, 228],
  [128, 0, 204],
  [116, 0, 180],
  [96, 0, 156],
  [80, 0, 132],
  [68, 0, 112],
  [52, 0, 88],
  [40, 0, 64],
  [252, 216, 252],
  [252, 184, 252],
  [252, 156, 252],
  [252, 124, 252],
  [252, 92, 252],
  [252, 64, 252],
  [252, 32, 252],
  [252, 0, 252],
  [224, 0, 228],
  [200, 0, 204],
  [180, 0, 180],
  [156, 0, 156],
  [132, 0, 132],
  [108, 0, 112],
  [88, 0, 88],
  [64, 0, 64],
  [252, 232, 220],
  [252, 224, 208],
  [252, 216, 196],
  [252, 212, 188],
  [252, 204, 176],
  [252, 196, 164],
  [252, 188, 156],
  [252, 184, 144],
  [252, 176, 128],
  [252, 164, 112],
  [252, 156, 96],
  [240, 148, 92],
  [232, 140, 88],
  [220, 136, 84],
  [208, 128, 80],
  [200, 124, 76],
  [188, 120, 72],
  [180, 112, 68],
  [168, 104, 64],
  [160, 100, 60],
  [156, 96, 56],
  [144, 92, 52],
  [136, 88, 48],
  [128, 80, 44],
  [116, 76, 40],
  [108, 72, 36],
  [92, 64, 32],
  [84, 60, 28],
  [72, 56, 24],
  [64, 48, 24],
  [56, 44, 20],
  [40, 32, 12],
  [96, 0, 100],
  [0, 100, 100],
  [0, 96, 96],
  [0, 0, 28],
  [0, 0, 44],
  [48, 36, 16],
  [72, 0, 72],
  [80, 0, 80],
  [0, 0, 52],
  [28, 28, 28],
  [76, 76, 76],
  [92, 92, 92],
  [64, 64, 64],
  [48, 48, 48],
  [52, 52, 52],
  [216, 244, 244],
  [184, 232, 232],
  [156, 220, 220],
  [116, 200, 200],
  [72, 192, 192],
  [32, 180, 180],
  [32, 176, 176],
  [0, 164, 164],
  [0, 152, 152],
  [0, 140, 140],
  [0, 132, 132],
  [0, 124, 124],
  [0, 120, 120],
  [0, 116, 116],
  [0, 112, 112],
  [0, 108, 108],
  [152, 0, 136],
];

// }

/**

WOLFENSTEIN 3D

A CLONE OF THE ORIGINAL FIRST EPISODE

[THIS IS NOT AN AI PROGRAM]

Features the entire first episode, all ten levels.

This is, as nearly as possible, an exact clone of the original title. So far as I know, the only missing features are audio and the text that appears when you find a secret.

The original plan was to make the first three episodes, but KA has space limits for programs. As it is, even the officer and mutant enemy types, which I originally implemented, have had their images removed, to fit other things.

Turn on mouse controls if you wish, but if you are not using them, leave them off, since they make it harder to aim with keyboard.

You can change the difficulty level in the constants section.

**NEW** I have added save codes. Press [L] to get your code, then you can paste it in at the Save Code section;

**NOTE** If you are experiencing performance issues, try changing the INV_SCALE constant under performance settings to 4, or even 8. This lowers the resolution of the frame buffer, reducing the workload each frame.

CONTROLS: 
Up/Down or W/S - Move Forwards and Backwards
Left/Right or A/D - Turn Left and Right
Alt - Hold to strafe
Ctrl - Shoot
Shift - Hold to sprint
1,2,3,4 - Change weapons

MOUSE CONTROLS:
Mouse works as joystick, with mouse movement mimicking the up/down/left/right keys.
Hold right click to strafe.
Left click to shoot.

**NOTE** When using mouse controls, sprinting is always on. This is why it will be harder to aim using keyboard, because you turn faster when sprinting.

**/
hint(DISABLE_OPENGL_2X_SMOOTH);
// Performance Settings {
// Must be a power of two
var INV_SCALE = 2;
var TARGET_FPS = 70;
var DEBUG_FPS = false;
// Must be at least 0
var DECORATION_CLIPPING_DISTANCE = 0.2;
// }
// Control Settings {
var useMouse = true;
var mouseSensitivity = 0.04;
// }
// Save Code {
var saveCode = "!*%©$# ! ! ! ! !";
//}
// Constants {

var DIFFICULTIES = {
  CAN_I_PLAY_TOO_DADDY: 0,
  DONT_HURT_ME: 1,
  BRING_EM_ON: 2,
  I_AM_DEATH_INCARNATE: 3,
};

var GAME_STATES = {
  GET_PSYCHED: 0,
  FADE_IN: 1,
  FIZZLE_IN: 2,
  PLAY: 3,
  DIE_1: 4,
  DIE_2: 5,
  ELEVATOR: 6,
  WIN: 7,
  SCORE_SCREEN: 8,
  END_SCREEN: 9,
  TITLE: 10,
  DEATHCAM_1: 11,
  DEATHCAM_2: 12,
  DEATHCAM_3: 13,
};

var difficultyLevel = DIFFICULTIES.I_AM_DEATH_INCARNATE;

var MOVE_SPEED = 0.003204345703125 * 1.41;
var TURN_SPEED = 0.1;

var DIRECTIONS = {
  NORTH: new PVector(0, -1),
  SOUTH: new PVector(0, 1),
  EAST: new PVector(1, 0),
  WEST: new PVector(-1, 0),
  NONE: new PVector(0, 0),
};

var TICS_TO_MILLIS = 100 / 7;

var ENEMY_STATES = {
  STAND: 0,
  PATROL: 1,
  PAIN: 2,
  CHASE: 3,
  SHOOT: 4,
  DIE: 5,
};

var FLOOR_CODES = 37;
var TURN_POINT_START = 84 + FLOOR_CODES;
var SECRET_FLAG = 83 + FLOOR_CODES;
var DOOR_CODES = [
  29 + FLOOR_CODES,
  31 + FLOOR_CODES,
  32 + FLOOR_CODES,
  33 + FLOOR_CODES,
];

var WIN_CODE = 243;

var ENEMY_CODES_START = 96 + FLOOR_CODES;

var END_ELEVATOR_CODE = 21 + FLOOR_CODES;
var END_ELEVATOR_CODE_FLIPPED = 22 + FLOOR_CODES;

var GUARD_AMMO_ID = 73 + FLOOR_CODES;

var GOLD_KEY_ID = 80 + FLOOR_CODES;
var HANS_CODE = 205 + FLOOR_CODES;
var EXIT_CODE = 206 + FLOOR_CODES;
var SCHABBS_CODE = 207 + FLOOR_CODES;

// }
// Global {
var currentLevel = 0;
var currentEpisode = 0;
var totalScore = 0;

var totalSeconds = 0;
var averageKillRatio = 0;
var averageSecretRatio = 0;
var averageTreasureRatio = 0;
//}
// Frame Buffer {
var bufferWidth = 640 / INV_SCALE;
var bufferHeight = 400 / INV_SCALE;

var invalidScreen =
  width !== bufferWidth * INV_SCALE || height !== bufferHeight * INV_SCALE;

if (invalidScreen) {
  println("Please add this to the end of the url to continue:");
  println("?width=" + bufferWidth * INV_SCALE);
  println("You will need to reload the page.");
}

var bufferImage;
var bufferContext;

var frameBufferCreated = false;
var hudHeight = 96 / INV_SCALE;
var hudMargin = bufferWidth * (bufferHeight - hudHeight) * 4;

var pixels;
var renderPixels;

function createFrameBuffer() {
  bufferImage = createImage(bufferWidth, bufferHeight, RGB);

  bufferContext = bufferImage.sourceImg.getContext("2d");

  pixels = bufferContext.createImageData(bufferWidth, bufferHeight);
  renderPixels = bufferContext.createImageData(bufferWidth, bufferHeight);

  var pixelIndex = 0;
  for (var i = 0; i < bufferWidth * bufferHeight; i++) {
    if (pixelIndex < hudMargin) {
      pixels.data[pixelIndex++] = 0;
      pixels.data[pixelIndex++] = 0;
      pixels.data[pixelIndex++] = 0;
      pixels.data[pixelIndex++] = 0;
    } else {
      pixels.data[pixelIndex++] = 0;
      pixels.data[pixelIndex++] = 64;
      pixels.data[pixelIndex++] = 64;
      pixels.data[pixelIndex++] = 255;
    }
  }
  frameBufferCreated = true;
}

function renderFrameBuffer(fizzlePixels) {
  for (var i = 0; i < renderPixels.data.length; i += 4) {
    if (fizzlePixels.data[i + 3] === 255) {
      renderPixels.data[i] = fizzlePixels.data[i];
      renderPixels.data[i + 1] = fizzlePixels.data[i + 1];
      renderPixels.data[i + 2] = fizzlePixels.data[i + 2];
      renderPixels.data[i + 3] = fizzlePixels.data[i + 3];
    } else {
      renderPixels.data[i] = pixels.data[i];
      renderPixels.data[i + 1] = pixels.data[i + 1];
      renderPixels.data[i + 2] = pixels.data[i + 2];
      renderPixels.data[i + 3] = pixels.data[i + 3];
    }
  }
  bufferContext.putImageData(renderPixels, 0, 0);
  image(bufferImage, width / 2, height / 2, width, height);
}

function clearFrameBuffer() {
  var pixelIndex = 0;
  for (var i = 0; i < bufferWidth * bufferHeight; i++) {
    if (pixelIndex < hudMargin) {
      pixels.data[pixelIndex++] = 0;
      pixels.data[pixelIndex++] = 0;
      pixels.data[pixelIndex++] = 0;
      pixels.data[pixelIndex++] = 0;
    } else {
      pixels.data[pixelIndex++] = 0;
      pixels.data[pixelIndex++] = 64;
      pixels.data[pixelIndex++] = 64;
      pixels.data[pixelIndex++] = 255;
    }
  }
}

// }
// Mouse  {
var vMouseX = 0;
var vMouseY = 0;
var vMouseXOld = 0;
var vMouseYOld = 0;
var leftClick = false;
var rightClick = false;

var scopeOut = function (p) {
  return (function () {
    return this;
  })()[p];
};

function onMouseMove(e) {
  if (!scopeOut("document").pointerLockElement) {
    return;
  }
  vMouseX += e.movementX;
  vMouseY += e.movementY;
}

function onMousePressed(e) {
  if (!useMouse) {
    return;
  }
  if (e.button === 0) {
    leftClick = true;
  } else if (e.button === 2) {
    rightClick = true;
  }
}

function onMouseReleased(e) {
  if (!useMouse) {
    return;
  }
  if (e.button === 0) {
    leftClick = false;
  } else if (e.button === 2) {
    rightClick = false;
  }
}

mouseClicked = function () {
  if (useMouse) {
    scopeOut("document").getElementById("output-canvas").requestPointerLock();
    scopeOut("document").getElementById("output-canvas").onmousemove =
      onMouseMove;
    scopeOut("document").getElementById("output-canvas").onmousedown =
      onMousePressed;
    scopeOut("document").getElementById("output-canvas").onmouseup =
      onMouseReleased;
  }
};
function updateMouse() {
  vMouseXOld = vMouseX;
  vMouseYOld = vMouseY;
}
// }
// Pallette {
var pallette = [
  -1250068, -13092808, -1310720, -2556712, -16473088, -14670596, -16777128,
  -3669812, -11207428, -16748432, -222112, -10731488, -1779712, -13369256,
  -16749388, -14633804, -2302756, -13355980, -2097152, -4391752, -16476160,
  -16775940, -16777140, -4980556, -12518148, -16749460, -1010596, -11256804,
  -3357696, -14155712, -16753508, -14634832, -3092272, -13619152, -2883584,
  -6488932, -16480256, -16776964, -16777152, -5767000, -14615300, -16751516,
  -1536936, -12044264, -4936704, -3081124, -219044, -16777216, -4144960,
  -13882324, -3670016, -8323972, -16483328, -16776980, -16777164, -6553444,
  -16712452, -16752544, -2324396, -12570600, -6513664, -3867584, -223168,
  -197380, -4934476, -14145496, -4456448, -10421156, -16486400, -16776992,
  -16777172, -8126332, -16718620, -16754600, -3112880, -13095916, -8092672,
  -4916192, -227296, -204748, -5723992, -14671840, -5242880, -11207596,
  -16489472, -16777004, -16777188, -9699216, -16724788, -16760768, -3638196,
  -13622256, -9409536, -6226944, -231424, -207836, -6776680, -14935012,
  -5767168, -12518336, -16492544, -16777016, -206596, -10485660, -16730956,
  -202532, -4425656, -14147572, -10988544, -7281664, -1807360, -209896,
  -7566196, -206632, -6029312, -14615520, -16495616, -16777028, -214788,
  -11009960, -16734040, -204592, -4951996, -197416, -12566528, -8336384,
  -3383296, -212984, -8618884, -214856, -6815744, -16712704, -16498688,
  -16777040, -221956, -11534256, -16735068, -206652, -5740480, -197448,
  -4972292, -9128960, -4959232, -216064, -9408400, -222052, -7864320, -16716800,
  -2565892, -16777048, -230148, -12058552, -16737124, -207684, -6265796,
  -197476, -5766916, -10445824, -5745664, 0, -10197916, -230276, -8650752,
  -16719872, -4670212, -16777052, -238340, -12582848, -16738152, -209744,
  -6528968, -197508, -6815516, -10699524, -6534144, 0, -10724260, -238500,
  -9437184, -16722944, -6513412, -16777064, -240388, -2556676, -16741236,
  -211804, -7316428, -198564, -8388404, -12537604, -2558732, 0, -11250604,
  -240556, -10223616, -16463872, -8617732, -16777080, -245508, -4653828,
  -16743292, -213860, -7841744, -197548, -9174860, -14636804, -4658968, 0,
  -11776948, -245696, -11010048, -16466944, -10723076, -16777092, -253700,
  -6488836, -16745348, -214896, -8368084, -199616, -10485604, -16737028,
  -6497060, 0, -12040120, -253920, -11796480, -16470016, -11250436, -16777104,
  -261892, -8585992, -16746376, -216960, -9155544, -199648, -11534204,
  -16741148, -9123640, 0, -12566464, -262144, -12582912, -16734208, -12566276,
  -16777116, -2096924, -10683140, -16747404, -220048, -9680860, -199680,
  -12320656, -16745268, -12009280, -6815608,
];
//}
// Decoding {
var safeAlpha =
  "!#$%&'()*+,-./0123456789:;<=>?@ABCDEFGHIJKLMNOPQRSTUVWXYZ[]^_`abcdefghijklmnopqrstuvwxyz{|}~¡¢£¤¥¦§¨©ª«¬®¯°±²³´µ¶·¸¹º»¼½¾¿ÀÁÂÃÄÅÆÇÈÉÊËÌÍÎÏÐÑÒÓÔÕÖ×ØÙÚÛÜÝÞßàáâãäåæçèéêëìíîïðñòóôõö÷øùúûüýþÿĀāĂăĄąĆćĈĉĊċČčĎďĐđĒēĔĕĖėĘęĚěĜĝĞğĠġĢģĤĥĦħĨĩĪīĬĭĮįİıĲĳĴĵĶķĸĹĺĻļĽľĿŀŁłŃńŅ";

function decodeToArray(str) {
  var out = [];
  var i = 0;
  while (i < str.length) {
    var c = safeAlpha.indexOf(str[i]);
    if (str[i] === String.fromCharCode(32)) {
      var c = safeAlpha.indexOf(str[i + 1]);
      var count = safeAlpha.indexOf(str[i + 2]);
      for (var j = 0; j < count; j++) {
        out.push(c);
      }
      i += 3;
    } else {
      out.push(c);
      i++;
    }
  }
  return out;
}

function decodeSubFilterToArray(str) {
  var imageHeight = safeAlpha.indexOf(str[0]);

  var filtered = decodeToArray(str.slice(1));
  var imageWidth = filtered.length / imageHeight;

  var out = [imageHeight];

  for (var i = 0; i < filtered.length; i++) {
    if (i % imageWidth === 0) {
      out.push(filtered[i]);
    } else {
      out.push((out[i] + filtered[i]) % 256);
    }
  }

  return out;
}

function decodeUpFilterToArray(str) {
  var imageHeight = safeAlpha.indexOf(str[0]);

  var filtered = decodeToArray(str.slice(1));
  var imageWidth = filtered.length / imageHeight;

  var out = [imageHeight];

  for (var i = 0; i < filtered.length; i++) {
    if (i < imageWidth) {
      out.push(filtered[i]);
    } else {
      out.push((out[i + 1 - imageWidth] + filtered[i]) % 256);
    }
  }

  return out;
}

function decodeFilteredToArray(str) {
  var filterType = safeAlpha.indexOf(str[0]);
  if (filterType === 0) {
    return decodeSubFilterToArray(str.slice(1));
  } else {
    return decodeUpFilterToArray(str.slice(1));
  }
}

// }
// Image Rendering {
var cachedTextures = [];
var renders = [];
var sliced = [];
var currentImage = 0;
var finishedRendering = false;

function renderTexture(imageData, imageScale) {
  background(0, 0, 0, 0);
  imageScale = imageScale || 1;
  cachedTextures.push([]);
  var imageDataArray = decodeFilteredToArray(imageData);
  var imageHeight = imageDataArray[0];
  var imageWidth = (imageDataArray.length - 1) / imageHeight;
  for (var y = 0; y < imageHeight; y++) {
    for (var x = 0; x < imageWidth; x++) {
      var index = y + x * imageHeight + 1;
      var fillColor = pallette[imageDataArray[index]];
      noStroke();
      if (fillColor === undefined) {
        println(currentImage);
      } else {
        if (fillColor === -6815608) {
          fillColor = 0;
        }
        if (fillColor === 0) {
          fill(0, 0, 0, 0);
        } else {
          fill(fillColor);
        }
        rect(x * imageScale, y * imageScale, imageScale, imageScale);
      }

      cachedTextures[cachedTextures.length - 1].push(fillColor);
    }
  }
  var rendered = get(0, 0, imageWidth * imageScale, imageHeight * imageScale);
  renders.push(rendered);
  // var slices = [];
  // for (var x = 0; x < 64; x++) {
  //     slices.push(get(x * imageScale, 0, imageScale, 64 * imageScale));
  // }
  // sliced.push(slices);
}
function initializeTextures(imageScale) {
  if (finishedRendering) {
    return;
  }
  renderTexture(rawImages[currentImage], imageScale);
  currentImage++;
  if (currentImage === rawImages.length) {
    finishedRendering = true;
  }
  fill(0, 0, 0);
  text(
    "Loading: " + floor((currentImage / rawImages.length) * 100) + "%",
    width / 2,
    height / 2,
  );
}
// }
// Utilities {
function sign(x) {
  return x < 0 ? -1 : 1;
}

function sign0(x) {
  if (x === 0) {
    return 0;
  }
  return x < 0 ? -1 : 1;
}

function vectorEquals(v1, v2) {
  return v1.x === v2.x && v1.y === v2.y;
}

function wrap(num, min, max) {
  return ((((num - min) % max) + max) % max) + min;
}

function checkTile(scene, x, y, ignoreActor, ignoreAllActors) {
  x = floor(x);
  y = floor(y);
  var out = 0;
  if (scene.level.worldMap[x][y] > FLOOR_CODES) {
    out = 1;
  }
  var doorKey = x + "-" + y;
  var door = scene.doors[doorKey];
  if (door) {
    out = -(1 - door.openAmount);
  }

  if (
    scene.enemyGrid[x][y] !== null &&
    scene.enemyGrid[x][y].health > 0 &&
    scene.enemyGrid[x][y] !== ignoreActor &&
    !ignoreAllActors
  ) {
    out = 1;
  }

  if (scene.player !== ignoreActor && !ignoreAllActors) {
    if (
      scene.player.pos.x >= x - scene.player.radius &&
      scene.player.pos.x <= x + 1 + scene.player.radius
    ) {
      if (
        scene.player.pos.y >= y - scene.player.radius &&
        scene.player.pos.y <= y + 1 + scene.player.radius
      ) {
        out = 1;
      }
    }
  }

  return out;
}

frameRate(TARGET_FPS);
// }
// Fonts {
var fonts = [];
fonts.push("0123456789ABCDEFGHIJKLMNOPQRSTUVWXYZ:%!'");

var charWidths = [
  {
    def: 16,
    ex: {
      ":": 8,
      "!": 8,
      "'": 8,
    },
  },
];

function displayText(x, y, message, fontIndex) {
  var font = fonts[fontIndex];
  var tempX = x;
  imageMode(CORNER);
  for (var i = 0; i < message.length; i++) {
    if (message[i] === " ") {
      tempX += (charWidths[fontIndex].def * 2) / INV_SCALE;
      continue;
    }
    var charIndex = font.indexOf(message[i]);
    if (charIndex === -1) {
      println("Invalid message character: " + message[i]);
      tempX += (charWidths[fontIndex].def * 4) / INV_SCALE;
      continue;
    }

    image(renders[fontOffsets[fontIndex] + charIndex], tempX, y);

    var charWidth = charWidths[fontIndex].ex.hasOwnProperty(message[i])
      ? charWidths[fontIndex].ex[message[i]]
      : charWidths[fontIndex].def;
    tempX += (charWidth * 4) / INV_SCALE;
  }

  imageMode(CENTER);
}
// }
// Input {
var inputKeys = {};
var inputKeysJustDown = {};

keyPressed = function () {
  inputKeys[key.toString()] = true;
  inputKeysJustDown[key.toString()] = true;
  if (keyCode === UP) {
    inputKeys.up = true;
    inputKeysJustDown.up = true;
  } else if (keyCode === DOWN) {
    inputKeys.down = true;
    inputKeysJustDown.down = true;
  } else if (keyCode === LEFT) {
    inputKeys.left = true;
    inputKeysJustDown.left = true;
  } else if (keyCode === RIGHT) {
    inputKeys.right = true;
    inputKeysJustDown.right = true;
  } else if (keyCode === ALT) {
    inputKeys.alt = true;
    inputKeys.alt = true;
  } else if (keyCode === CONTROL) {
    inputKeys.control = true;
    inputKeysJustDown.control = true;
  } else if (keyCode === SHIFT) {
    inputKeys.shift = true;
    inputKeysJustDown.shift = true;
  }
};

keyReleased = function () {
  inputKeys[key.toString()] = false;
  if (keyCode === UP) {
    inputKeys.up = false;
  } else if (keyCode === DOWN) {
    inputKeys.down = false;
  } else if (keyCode === LEFT) {
    inputKeys.left = false;
  } else if (keyCode === RIGHT) {
    inputKeys.right = false;
  } else if (keyCode === ALT) {
    inputKeys.alt = false;
  } else if (keyCode === CONTROL) {
    inputKeys.control = false;
  } else if (keyCode === SHIFT) {
    inputKeys.shift = false;
  }
};
// }
// Delta Time {
var lastTimestamp = millis();
var delta = 0;

function calculateDelta() {
  delta = millis() - lastTimestamp;
  lastTimestamp = millis();
}

var peakFPS = 0;
var lowFPS = Infinity;
var fps = 0;

function displayFPS() {
  if (!DEBUG_FPS) {
    return;
  }
  fill(200, 200, 200);
  var fps = floor((1 / delta) * 1000);
  peakFPS = max(peakFPS, fps);
  lowFPS = min(lowFPS, fps);
  textSize(11);
  text("FPS: " + fps + " Peak: " + peakFPS + " Low: " + lowFPS, 10, 10);
}
// }
// HUD {

var flashColor = color(255, 0, 0);
var flashAlpha = 0;

function displayNumber(num, col) {
  image(
    renders[hudOffset + 1 + num],
    16 * col + 6,
    height - (hudHeight * INV_SCALE) / 2 + 8,
    16,
    32,
  );
}

function flashScreenColor(col) {
  flashAlpha = 128;
  flashColor = col;
}

function displayStat(num, startCol) {
  var temp = num;
  var pos = startCol;

  if (num === 0) {
    displayNumber(0, startCol);
  }

  while (temp > 0) {
    var digit = temp % 10;
    displayNumber(digit, pos);
    pos--;
    temp = floor(temp / 10);
  }
}

function displayHUD(scene) {
  imageMode(CENTER);
  image(
    renders[hudOffset],
    width / 2,
    height - (hudHeight * INV_SCALE) / 2,
    640,
    80,
  );

  displayStat(scene.player.ammo, 28);

  displayStat(scene.player.health, 23);

  displayNumber(scene.player.lives, 14);

  displayStat(totalScore + scene.player.score, 11);

  displayStat(scene.player.floor, 3);

  image(
    renders[hudOffset + 11 + scene.player.currentWeapon],
    560,
    height - (hudHeight * INV_SCALE) / 2,
    96,
    48,
  );

  var frame =
    scene.player.health === 0
      ? scene.player.killedBy.id === 8
        ? bjHudOffset + 23
        : bjHudOffset + 22
      : scene.player.grin
        ? bjHudOffset + 21
        : bjHudOffset +
          scene.player.faceFrame +
          floor((100 - scene.player.health) / 16) * 3;
  image(renders[frame], width / 2 - 24, height - (hudHeight * INV_SCALE) / 2);

  if (scene.player.hasGoldKey) {
    image(
      renders[hudOffset + 16],
      488,
      height - (hudHeight * INV_SCALE) / 2 - 16,
      16,
      32,
    );
  } else {
    image(
      renders[hudOffset + 15],
      488,
      height - (hudHeight * INV_SCALE) / 2 - 16,
      16,
      32,
    );
  }

  if (scene.player.hasSilverKey) {
    image(
      renders[hudOffset + 17],
      488,
      height - (hudHeight * INV_SCALE) / 2 + 16,
      16,
      32,
    );
  } else {
    image(
      renders[hudOffset + 15],
      488,
      height - (hudHeight * INV_SCALE) / 2 + 16,
      16,
      32,
    );
  }

  fill(flashColor, flashAlpha);
  rect(0, 0, width, height);

  flashAlpha -= delta * 0.3;
  if (flashAlpha < 0) {
    flashAlpha = 0;
  }
}
// }
// Fizzle Fade {
var fizzleRndVal = 1;
var fizzleDone = false;
var FIZZLE_BLOCK_SIZE = 2;
var fading = false;
var fizzleColor = [255, 0, 0, 255];
var fizzlePixels;

function setFizzlePixels(r, g, b, a) {
  var pixelIndex = 0;
  for (var i = 0; i < bufferWidth * bufferHeight; i++) {
    fizzlePixels.data[pixelIndex++] = r;
    fizzlePixels.data[pixelIndex++] = g;
    fizzlePixels.data[pixelIndex++] = b;
    fizzlePixels.data[pixelIndex++] = a;
  }
}

function setupFizzleFade() {
  fizzlePixels = bufferContext.createImageData(bufferWidth, bufferHeight);

  setFizzlePixels(0, 0, 0, 0);
}

function resetFizzle() {
  fizzleRndVal = 1;
  fizzleDone = false;
}

function fizzleFade(frames, protectHUD) {
  fading = true;
  var pixPerFrame;
  var p;
  var x;
  var y;
  var bx;
  var by;
  var pixelIndex;

  if (fizzleDone) {
    return false;
  }

  pixPerFrame = (bufferWidth * bufferHeight) / frames;

  for (p = 0; p < pixPerFrame; p++) {
    y = (fizzleRndVal & 0xff) - 1;
    x = (fizzleRndVal >> 8) & 0x1ff;

    if ((fizzleRndVal & 1) !== 0) {
      fizzleRndVal = (fizzleRndVal >> 1) ^ 0x00012000;
    } else {
      fizzleRndVal = fizzleRndVal >> 1;
    }

    if (x >= bufferWidth || y >= bufferHeight || y < 0) {
      continue;
    }
    for (by = 0; by < FIZZLE_BLOCK_SIZE; by++) {
      if (y + by >= bufferHeight) {
        break;
      }

      for (bx = 0; bx < FIZZLE_BLOCK_SIZE; bx++) {
        if (x + bx >= bufferWidth) {
          break;
        }

        pixelIndex = ((y + by) * bufferWidth + (x + bx)) * 4;

        if (pixelIndex > hudMargin && protectHUD) {
          continue;
        }
        fizzlePixels.data[pixelIndex] = fizzleColor[0];
        fizzlePixels.data[pixelIndex + 1] = fizzleColor[1];
        fizzlePixels.data[pixelIndex + 2] = fizzleColor[2];
        fizzlePixels.data[pixelIndex + 3] = fizzleColor[3];
      }
    }

    if (fizzleRndVal === 1) {
      fizzleDone = true;
      return false;
    }
  }

  return false;
}
// }
// Areas {
var areaConnectedToPlayer = [];

function refreshAreasConnectedToPlayer(scene) {
  var playerArea =
    scene.level.worldMap[floor(scene.player.pos.x)][floor(scene.player.pos.y)];
  for (var i = 0; i < FLOOR_CODES; i++) {
    if (i === playerArea) {
      areaConnectedToPlayer[i] = true;
    } else {
      areaConnectedToPlayer[i] = false;
    }
  }

  var doorKeys = Object.keys(scene.doors);
  var playerKey = floor(scene.player.pos.x) + "-" + floor(scene.player.pos.y);
  for (var i = 0; i < doorKeys.length; i++) {
    var door = scene.doors[doorKeys[i]];
    if (door.openAmount > 0.1 || doorKeys[i] === playerKey) {
      if (door.adjacentAreas.includes(playerArea)) {
        areaConnectedToPlayer[door.adjacentAreas[0]] = true;
        areaConnectedToPlayer[door.adjacentAreas[1]] = true;
      }
    }
  }
}
//}
// Elevator {
function tryElevator(scene) {
  if (
    scene.level.worldMap[floor(scene.player.pos.x + scene.player.forward.x)][
      floor(scene.player.pos.y + scene.player.forward.y)
    ] === END_ELEVATOR_CODE &&
    abs(scene.player.forward.x) > abs(scene.player.forward.y)
  ) {
    scene.level.worldMap[floor(scene.player.pos.x + scene.player.forward.x)][
      floor(scene.player.pos.y + scene.player.forward.y)
    ] = END_ELEVATOR_CODE_FLIPPED;
    scene.gamestate = GAME_STATES.ELEVATOR;
    resetFizzle();
    if (
      scene.level.worldMap[floor(scene.player.pos.x)][
        floor(scene.player.pos.y)
      ] === 1
    ) {
      currentLevel = 9;
    } else if (currentLevel === 9) {
      currentLevel = 1;
    } else {
      currentLevel++;
    }
    return;
  }
}
// }
// Doors {
function initializeDoors(scene) {
  var doors = {};
  for (var x = 0; x < scene.level.worldMap.length; x++) {
    for (var y = 0; y < scene.level.worldMap.length; y++) {
      var id = scene.level.worldMap[x][y];
      if (DOOR_CODES.includes(id)) {
        var adjacentAreas = [];
        if (scene.level.worldMap[x + 1][y] < FLOOR_CODES) {
          adjacentAreas[0] = scene.level.worldMap[x + 1][y];
          adjacentAreas[1] = scene.level.worldMap[x - 1][y];
        }
        if (scene.level.worldMap[x][y + 1] < FLOOR_CODES) {
          adjacentAreas[0] = scene.level.worldMap[x][y + 1];
          adjacentAreas[1] = scene.level.worldMap[x][y - 1];
        }
        doors[x + "-" + y] = {
          openAmount: 0,
          opening: false,
          closing: true,
          blocked: false,
          waitStartTimestamp: -1,
          requireGold: id === 32 + FLOOR_CODES,
          requireSilver: id === 33 + FLOOR_CODES,
          adjacentAreas: adjacentAreas,
        };
      }
    }
  }
  scene.doors = doors;
}

function openDoor(scene, key) {
  var door = scene.doors[key];
  if (door.requireGold && !scene.player.hasGoldKey) {
    return;
  }
  if (door.requireSilver && !scene.player.hasSilverKey) {
    return;
  }
  if (door.closing) {
    door.opening = true;
  }
}

function updateDoors(scene) {
  var doorKeys = Object.keys(scene.doors);
  for (var i = 0; i < doorKeys.length; i++) {
    var door = scene.doors[doorKeys[i]];
    if (door.opening) {
      door.closing = false;
      door.openAmount += 0.001 * delta;
      if (door.openAmount >= 1) {
        door.openAmount = 1;
        door.opening = false;
        door.waitStartTimestamp = millis();
      }
    } else if (door.closing) {
      var doorX = parseInt(doorKeys[i].split("-")[0], 10);
      var doorY = parseInt(doorKeys[i].split("-")[1], 10);
      if (checkTile(scene, doorX, doorY) <= 0 && !door.blocked) {
        door.openAmount = constrain(door.openAmount - 0.001 * delta, 0, 1);
      } else {
        door.openAmount = 1;
      }
    } else {
      if (millis() - door.waitStartTimestamp >= 3000) {
        door.closing = true;
      }
    }
  }
}
// }
// Secrets {
function setupSecrets(scene) {
  var out = [];
  for (var x = 0; x < scene.level.worldMap.length; x++) {
    for (var y = 0; y < scene.level.worldMap[x].length; y++) {
      if (scene.level.objectMap[x][y] === SECRET_FLAG) {
        out.push({
          x: x,
          y: y,
          offset: 1,
          side: 1,
          tilesLeft: 2,
          sliding: false,
          temp: false,
          direction: 1,
          floorCode: 0,
        });
      }
    }
  }
  scene.secrets = out;
  scene.secretCount = out.length;
}

function trySecret(scene) {
  for (var i = 0; i < scene.secrets.length; i++) {
    var secret = scene.secrets[i];
    if (
      secret.x === floor(scene.player.pos.x + scene.player.forward.x) &&
      secret.y === floor(scene.player.pos.y + scene.player.forward.y)
    ) {
      if (secret.temp) {
        continue;
      }
      if (secret.sliding) {
        continue;
      }
      if (secret.side === 1) {
        secret.direction = -sign(scene.player.forward.y);
      } else {
        secret.direction = -sign(scene.player.forward.x);
      }

      var moveX = secret.side === 0 ? -secret.direction : 0;
      var moveY = secret.side === 1 ? -secret.direction : 0;

      if (
        scene.level.worldMap[secret.x + moveX][secret.y + moveY] <
          FLOOR_CODES &&
        scene.level.worldMap[secret.x + moveX * 2][secret.y + moveY * 2] <
          FLOOR_CODES
      ) {
        scene.player.secretCount++;
        secret.sliding = true;

        scene.secrets.push({
          x: secret.x + moveX,
          y: secret.y + moveY,
          offset: 0,
          side: secret.side,
          sliding: true,
          temp: true,
          direction: -secret.direction,
        });

        secret.floorCode =
          scene.level.worldMap[secret.x + moveX][secret.y + moveY];
        scene.level.worldMap[secret.x + moveX][secret.y + moveY] =
          scene.level.worldMap[secret.x][secret.y];
      }
    }
  }
}

function updateSecrets(scene) {
  var i = 0;
  while (i < scene.secrets.length) {
    var secret = scene.secrets[i];
    if (secret.sliding) {
      if (secret.temp) {
        secret.offset += 0.0005 * delta;
        if (secret.offset >= 1) {
          scene.secrets.splice(i, 1);
        } else {
          i++;
        }
      } else {
        secret.offset -= 0.0005 * delta;
        if (secret.offset <= 0) {
          secret.tilesLeft--;
          var yMove = secret.side === 1 ? -secret.direction : 0;
          var xMove = secret.side === 0 ? -secret.direction : 0;
          scene.level.worldMap[secret.x + xMove][secret.y + yMove] =
            scene.level.worldMap[secret.x][secret.y];
          scene.level.worldMap[secret.x][secret.y] = secret.floorCode;
          if (secret.tilesLeft === 0) {
            scene.secrets.splice(i, 1);
          } else {
            secret.offset = 1;
            secret.x += xMove;
            secret.y += yMove;
            scene.level.worldMap[secret.x + xMove][secret.y + yMove] =
              scene.level.worldMap[secret.x][secret.y];

            scene.secrets.push({
              x: secret.x + xMove,
              y: secret.y + yMove,
              offset: 0,
              side: secret.side,
              sliding: true,
              temp: true,
              direction: -secret.direction,
            });
            i++;
          }
        } else {
          i++;
        }
      }
    } else {
      i++;
    }
  }
}
// }
// Raycasting {
var zBuffer = new Array(bufferWidth);
var plane = new PVector(0, 0.74);
function raycast(scene) {
  var player = scene.player;
  var worldMap = scene.level.worldMap;
  var secrets = scene.secrets;
  var doors = scene.doors;
  // rotate the camera plane
  var rotatedPlaneX = plane.x * cos(player.angle) - plane.y * sin(player.angle);
  var rotatedPlaneY = plane.x * sin(player.angle) + plane.y * cos(player.angle);

  var playerX = player.pos.x;
  var playerY = player.pos.y;
  var playerForwardX = player.forward.x;
  var playerForwardY = player.forward.y;

  var ceilingColor =
    ceilingColorPallette[
      ceilingColorIndexes[currentEpisode * 10 + currentLevel] & 0xff
    ];

  for (var x = 0; x < bufferWidth; x++) {
    var cameraX = (x * 2) / bufferWidth - 1;

    // ray direction
    var rayDirX = playerForwardX + rotatedPlaneX * cameraX;
    var rayDirY = playerForwardY + rotatedPlaneY * cameraX;

    // current map cell
    var mapX = floor(playerX);
    var mapY = floor(playerY);

    // length of ray to next x or y side
    var deltaX = rayDirX === 0 ? Infinity : abs(1 / rayDirX);
    var deltaY = rayDirY === 0 ? Infinity : abs(1 / rayDirY);

    // step direction
    var stepX = rayDirX < 0 ? -1 : 1;
    var stepY = rayDirY < 0 ? -1 : 1;

    // initial side distances
    var sideDistX =
      rayDirX < 0 ? (playerX - mapX) * deltaX : (mapX + 1.0 - playerX) * deltaX;

    var sideDistY =
      rayDirY < 0 ? (playerY - mapY) * deltaY : (mapY + 1.0 - playerY) * deltaY;

    var hit = 0;
    var side = sideDistX < sideDistY ? 0 : 1;
    var hitDoorTile = false;
    var initialTest = true;
    var doorOpenAmount;

    var wallX;
    var textureOffset = 0;

    // DDA loop
    while (hit === 0) {
      if (worldMap[mapX][mapY] > 0) {
        hit = worldMap[mapX][mapY];
        if (hit <= FLOOR_CODES || hit - FLOOR_CODES >= wallCount) {
          hit = 0;
        }

        // Secrets {
        for (var i = 0; i < secrets.length; i++) {
          var secret = secrets[i];

          if (secret.x === mapX && secret.y === mapY) {
            if (!secret.sliding) {
              secret.side = side;
            }
            if (secret.offset !== 1) {
              var nx = secret.side === 0 ? secret.direction : 0;
              var ny = secret.side === 1 ? secret.direction : 0;

              var dot = rayDirX * nx + rayDirY * ny;

              if (side === 1) {
                if (side === secret.side) {
                  if (dot >= 0) {
                    hit = 0;
                    continue;
                  }
                  if (sideDistY - deltaY * secret.offset >= sideDistX) {
                    hit = 0;
                  } else if (secret.direction === sign(playerForwardY)) {
                    hit = 0;
                  } else {
                    sideDistY += deltaY * (1 - secret.offset);
                  }
                } else {
                  var xPos = playerX + (sideDistY - deltaY) * rayDirX;
                  xPos -= floor(xPos);

                  var xPosFar = playerX + sideDistY * rayDirX;
                  xPosFar -= floor(xPosFar);

                  if (secret.direction === -1) {
                    xPos = 1 - xPos;
                    xPosFar = 1 - xPosFar;
                  }

                  if (xPos > secret.offset) {
                    if (dot >= 0) {
                      hit = 0;
                      continue;
                    }
                    var wouldHitSide = false;
                    if (sideDistX < sideDistY) {
                      wouldHitSide = true;
                    } else if (xPosFar < secret.offset) {
                      wouldHitSide = true;
                    }

                    if (secret.direction === sign(player.forward.x)) {
                      wouldHitSide = false;
                    }

                    var newSideDistX = sideDistX + deltaX * (1 - secret.offset);
                    if (sideDistY - deltaY > newSideDistX - deltaX) {
                      wouldHitSide = false;
                    }

                    if (wouldHitSide) {
                      sideDistX = newSideDistX;
                      side = 0;
                    } else {
                      hit = 0;
                    }
                  } else {
                    textureOffset = (1 - secret.offset) * -secret.direction;
                  }
                }
              } else {
                if (side === secret.side) {
                  if (dot >= 0) {
                    hit = 0;
                    continue;
                  }
                  if (sideDistX - deltaX * secret.offset >= sideDistY) {
                    hit = 0;
                  } else if (secret.direction === sign(playerForwardX)) {
                    hit = 0;
                  } else {
                    sideDistX += deltaX * (1 - secret.offset);
                  }
                } else {
                  var xPos = playerY + (sideDistX - deltaX) * rayDirY;
                  xPos -= floor(xPos);

                  var xPosFar = playerY + sideDistX * rayDirY;
                  xPosFar -= floor(xPosFar);

                  if (secret.direction === -1) {
                    xPos = 1 - xPos;
                    xPosFar = 1 - xPosFar;
                  }

                  if (xPos > secret.offset) {
                    if (dot >= 0) {
                      hit = 0;
                      continue;
                    }
                    var wouldHitSide = false;
                    if (sideDistX >= sideDistY) {
                      wouldHitSide = true;
                    } else if (xPosFar < secret.offset) {
                      wouldHitSide = true;
                    }

                    var newSideDistY = sideDistY + deltaY * (1 - secret.offset);
                    if (sideDistX - deltaX > newSideDistY - deltaY) {
                      wouldHitSide = false;
                    }

                    if (wouldHitSide) {
                      sideDistY = newSideDistY;
                      side = 1;
                    } else {
                      hit = 0;
                    }
                  } else {
                    textureOffset = (1 - secret.offset) * -secret.direction;
                  }
                }
              }
            }
          }
        }
        //}

        // Doors {
        if (hitDoorTile) {
          hit = 30 + FLOOR_CODES;
        }
        if (DOOR_CODES.includes(hit)) {
          doorOpenAmount = doors[mapX + "-" + mapY].openAmount;
          if (initialTest) {
            if (
              sideDistX < sideDistY &&
              worldMap[mapX + 1][mapY] > FLOOR_CODES
            ) {
              hitDoorTile = true;
            }
            if (
              sideDistY < sideDistX &&
              worldMap[mapX][mapY + 1] > FLOOR_CODES
            ) {
              hitDoorTile = true;
            }
          }
          if (side === 1) {
            if (sideDistY - deltaY * 0.5 >= sideDistX) {
              hit = 0;
              hitDoorTile = true;
            } else {
              var doorX = playerX + (sideDistY - deltaY * 0.5) * rayDirX;
              doorX -= floor(doorX);

              if (doorX < doorOpenAmount) {
                hit = 0;
                if (sideDistY >= sideDistX) {
                  hitDoorTile = true;
                }
              } else {
                sideDistY += deltaY * 0.5;
              }
            }
          } else {
            if (sideDistX - deltaX * 0.5 >= sideDistY) {
              hit = 0;
              hitDoorTile = true;
            } else {
              var doorX = playerY + (sideDistX - deltaX * 0.5) * rayDirY;
              doorX -= floor(doorX);

              if (doorX < doorOpenAmount) {
                hit = 0;
                if (sideDistX >= sideDistY) {
                  hitDoorTile = true;
                }
              } else {
                sideDistX += deltaX * 0.5;
              }
            }
          }
        }
        //}
      }
      if (hit === 0) {
        if (sideDistX < sideDistY) {
          sideDistX += deltaX;
          mapX += stepX;
          side = 0;
        } else {
          sideDistY += deltaY;
          mapY += stepY;
          side = 1;
        }
      }
      if (initialTest) {
        initialTest = false;
      }
    }

    var perpWallDist = side === 0 ? sideDistX - deltaX : sideDistY - deltaY;

    var isDoor = DOOR_CODES.includes(hit);
    if (isDoor) {
      textureOffset = doorOpenAmount;
    }
    if (side === 0) {
      wallX = playerY + perpWallDist * rayDirY - textureOffset;
      wallX -= floor(wallX);
    } else {
      wallX = playerX + perpWallDist * rayDirX - textureOffset;
      wallX -= floor(wallX);
    }

    zBuffer[x] = perpWallDist;

    var lineHeight = floor(bufferHeight / perpWallDist);
    var textureX = 0;

    textureX = constrain(floor(63 * wallX), 0, 63);

    if (!isDoor) {
      if (side === 0 && rayDirX < 0) {
        textureX = 63 - textureX;
      }
      if (side === 1 && rayDirY > 0) {
        textureX = 63 - textureX;
      }
    }

    var drawStartY = (bufferHeight - lineHeight) / 2;
    var drawEndY = bufferHeight - drawStartY;

    var pixelIndex = x * 4;
    var texture = cachedTextures[(hit - FLOOR_CODES) * 2 - side - 1];
    for (var y = 0; y < bufferHeight; y++) {
      if (y < bufferHeight - hudHeight) {
        if (y < drawStartY) {
          pixels.data[pixelIndex] = ceilingColor[0];
          pixels.data[pixelIndex + 1] = ceilingColor[1];
          pixels.data[pixelIndex + 2] = ceilingColor[2];
          pixels.data[pixelIndex + 3] = 255;
        } else if (y > drawEndY) {
          pixels.data[pixelIndex] = 112;
          pixels.data[pixelIndex + 1] = 112;
          pixels.data[pixelIndex + 2] = 112;
          pixels.data[pixelIndex + 3] = 255;
        } else {
          var textureY = floor(
            ((y - drawStartY) * 64) / (drawEndY - drawStartY),
          );
          var pixelColor = texture[textureX + textureY * 64];
          pixels.data[pixelIndex] = (pixelColor >> 16) & 0xff;
          pixels.data[pixelIndex + 1] = (pixelColor >> 8) & 0xff;
          pixels.data[pixelIndex + 2] = (pixelColor >> 0) & 0xff;
          pixels.data[pixelIndex + 3] = (pixelColor >> 24) & 0xff;
        }
        pixelIndex += bufferWidth * 4;
      }
    }
  }
}
// }
// Decorations {
function Decoration(id, x, y) {
  this.id = id;
  this.pos = new PVector(x, y);
  this.dx = 0;
  this.dy = 0;
  this.visible = false;
}

Decoration.prototype.getTexture = function () {
  return cachedTextures[this.id - FLOOR_CODES + wallCount - 1];
};

Decoration.prototype.update = function () {};

function spawnDecorations(scene) {
  var decorations = [];
  var pickupGrid = [];
  for (var x = 0; x < scene.level.worldMap.length; x++) {
    pickupGrid.push([]);
    for (var y = 0; y < scene.level.worldMap[x].length; y++) {
      pickupGrid[x].push([]);
    }
  }
  var totalTreasure = 0;
  for (var x = 0; x < scene.level.worldMap.length; x++) {
    for (var y = 0; y < scene.level.worldMap[x].length; y++) {
      if (
        scene.level.worldMap[x][y] >= wallCount + FLOOR_CODES &&
        scene.level.worldMap[x][y] <= totalTiles + FLOOR_CODES
      ) {
        decorations.push(
          new Decoration(scene.level.worldMap[x][y], x + 0.5, y + 0.5),
        );
      }
      if (
        scene.level.objectMap[x][y] >= wallCount + FLOOR_CODES &&
        scene.level.objectMap[x][y] <= totalTiles + FLOOR_CODES
      ) {
        var dec = new Decoration(scene.level.objectMap[x][y], x + 0.5, y + 0.5);
        decorations.push(dec);

        var pickupId =
          scene.level.objectMap[x][y] - pickupOffset - FLOOR_CODES - 1;
        if (pickupId >= 0 && pickupId <= 15) {
          pickupGrid[x][y].push(dec);
          switch (pickupId) {
            case 9: // Cross
              totalTreasure += 100;
              break;
            case 10: // Chalice
              totalTreasure += 500;
              break;
            case 11: // Chest
              totalTreasure += 1000;
              break;
            case 12: // Crown
              totalTreasure += 5000;
              break;
            case 15: // One Up
              totalTreasure += 40000;
              break;
            default:
              break;
          }
        }
      }
    }
  }
  scene.decorations = decorations;
  scene.treasureCount = totalTreasure;
  scene.pickupGrid = pickupGrid;
}

function renderDecorations(scene) {
  var playerX = scene.player.pos.x;
  var playerY = scene.player.pos.y;

  if (scene.decorations.length > 1) {
    scene.decorations.sort(function (a, b) {
      a.dx = a.pos.x - playerX;
      a.dy = a.pos.y - playerY;
      b.dx = b.pos.x - playerX;
      b.dy = b.pos.y - playerY;

      return b.dx * b.dx + b.dy * b.dy - (a.dx * a.dx + a.dy * a.dy);
    });
  } else if (scene.decorations.length === 1) {
    var a = scene.decorations[0];
    a.dx = a.pos.x - playerX;
    a.dy = a.pos.y - playerY;
  }
  var playerForwardX = scene.player.forward.x;
  var playerForwardY = scene.player.forward.y;
  var rotatedPlaneX =
    plane.x * cos(scene.player.angle) - plane.y * sin(scene.player.angle);
  var rotatedPlaneY =
    plane.x * sin(scene.player.angle) + plane.y * cos(scene.player.angle);
  for (var i = 0; i < scene.decorations.length; i++) {
    var decoration = scene.decorations[i];
    decoration.visible = false;

    var invDet =
      1 / (rotatedPlaneX * playerForwardY - playerForwardX * rotatedPlaneY);

    var transformY =
      invDet * (-rotatedPlaneY * decoration.dx + rotatedPlaneX * decoration.dy);
    if (transformY <= DECORATION_CLIPPING_DISTANCE) {
      continue;
    }

    var transformX =
      invDet *
      (playerForwardY * decoration.dx - playerForwardX * decoration.dy);

    var spriteScreenX = floor(
      (bufferWidth / 2) * (1 + transformX / transformY),
    );
    decoration.screenX = spriteScreenX;
    if (spriteScreenX < -64 || spriteScreenX > bufferWidth + 64) {
      continue;
    }
    var decorationHeight = abs(floor(bufferHeight / transformY));

    var drawStartX = floor(spriteScreenX - decorationHeight / 2);
    var drawEndX = floor(spriteScreenX + decorationHeight / 2);
    var drawStartY = floor((bufferHeight - decorationHeight) / 2);
    var drawEndY = floor(bufferHeight - drawStartY);

    var drawEndYClamped = min(drawEndY, bufferHeight - hudHeight);

    for (var stripe = drawStartX; stripe < drawEndX; stripe++) {
      var textureX = floor(((stripe - drawStartX) / decorationHeight) * 64);
      if (stripe > 0 && stripe < bufferWidth && transformY < zBuffer[stripe]) {
        var pixelIndex = (drawStartY * bufferWidth + stripe) * 4;
        var texture = decoration.getTexture();
        for (var y = drawStartY; y < drawEndYClamped; y++) {
          var textureY = floor(
            ((y - drawStartY) * 64) / (drawEndY - drawStartY),
          );

          var pixelColor = texture[textureX + textureY * 64];
          var a = (pixelColor >> 24) & 0xff;
          if (a !== 0) {
            decoration.visible = true;
            pixels.data[pixelIndex] = (pixelColor >> 16) & 0xff;
            pixels.data[pixelIndex + 1] = (pixelColor >> 8) & 0xff;
            pixels.data[pixelIndex + 2] = pixelColor & 0xff;
            pixels.data[pixelIndex + 3] = a;
          }
          pixelIndex += bufferWidth * 4;
        }
      }
    }
  }
}

function updateDecorations(scene) {
  for (var i = 0; i < scene.decorations.length; i++) {
    scene.decorations[i].update(scene);
  }
}

//}
// Enemies {

function Enemy(id, x, y, forwardX, forwardY, definition, startFrame) {
  Decoration.call(this, id, x, y);
  this.pos = new PVector(x, y);
  this.forward = new PVector(forwardX, forwardY);
  this.oldForward = this.forward.get();
  this.dx = 0;
  this.dy = 0;
  this.frame = 0;
  this.animDir = 1;
  this.renderFrame = 0;
  this.angleOffset = 0;
  this.state = 0;
  this.radius = 0.3;
  this.timestamp = 0;
  if (!definition.notHittable) {
    if (definition.health.length) {
      this.health = definition.health[difficultyLevel];
    } else {
      this.health = definition.health;
    }
  }
  this.screenX = -64;
  this.targetPosition = this.pos.get();
  this.definition = definition;
  this.currentFrame = startFrame;
  this.tilePos = new PVector(floor(this.pos.x), floor(this.pos.y));
  this.distanceToMove = 0;
  this.firstAttack = true;
  this.canSeePlayer = false;
  this.reactionTime = -1;
}
Enemy.prototype = Object.create(Decoration.prototype);
Enemy.prototype.getTexture = function () {
  return cachedTextures[enemyFrameOffsets[this.id] + this.renderFrame];
};
Enemy.prototype.move = function (scene, move) {
  this.pos.x += move * sign0(this.forward.x);
  this.pos.y += move * sign0(this.forward.y);
  this.distanceToMove = max(
    abs(this.pos.x - this.targetPosition.x),
    abs(this.pos.y - this.targetPosition.y),
  );
};
Enemy.prototype.setTargetPosition = function (scene, x, y) {
  scene.enemyGrid[floor(this.targetPosition.x)][floor(this.targetPosition.y)] =
    null;
  this.targetPosition.x = x;
  this.targetPosition.y = y;
  scene.enemyGrid[floor(x)][floor(y)] = this;
  this.distanceToMove = max(
    abs(this.pos.x - this.targetPosition.x),
    abs(this.pos.y - this.targetPosition.y),
  );
};
Enemy.prototype.tryWalk = function (scene) {
  var targetX = floor(this.tilePos.x + sign0(this.forward.x));
  var targetY = floor(this.tilePos.y + sign0(this.forward.y));

  var destinationTile = checkTile(scene, targetX, targetY, this);

  if (abs(this.forward.x) + abs(this.forward.y) > 1) {
    if (
      checkTile(scene, targetX, this.tilePos.y, this) !== 0 ||
      checkTile(scene, this.tilePos.x, targetY, this) !== 0
    ) {
      return false;
    }
  }

  if (destinationTile < 0 && this.id !== 4) {
    this.distanceToMove = -1;
    return true;
  }

  if (destinationTile === 0) {
    this.setTargetPosition(scene, targetX + 0.5, targetY + 0.5);
    return true;
  }
  return false;
};
Enemy.prototype.update = function (scene) {
  var angle =
    (vectorEquals(this.forward, DIRECTIONS.NONE)
      ? this.oldForward.heading()
      : this.forward.heading()) -
    scene.player.forward.heading() +
    202.5;
  angle = wrap(angle, 0, 360);
  this.angleOffset = floor(angle / 45);

  var directionToPlayer = scene.player.pos.get();
  directionToPlayer.sub(this.pos);
  directionToPlayer.normalize();

  var angleToPlayer = wrap(
    directionToPlayer.heading() - this.forward.heading(),
    0,
    360,
  );
  this.canSeePlayer =
    (angleToPlayer < 90 || angleToPlayer > 270 || this.id > 4) &&
    this.checkLineOfSight(scene);

  var frame = this.definition.frames[this.currentFrame];
  if (frame.think !== null) {
    this[frame.think](scene);
  }
  var progress = millis() - this.timestamp;
  if (progress >= frame.duration && frame.duration > 0) {
    if (frame.action !== null) {
      this[frame.action](scene);
    }
    this.currentFrame = frame.next;
    frame = this.definition.frames[this.currentFrame];
    this.timestamp = millis();
  }
  this.renderFrame = frame.frame;
  if (frame.angle) {
    this.renderFrame += this.angleOffset;
  }
};

Enemy.prototype.stand = function (scene) {
  this.checkAlert(scene);
};

Enemy.prototype.patrol = function (scene) {
  if (this.checkAlert(scene)) {
    return;
  }

  if (
    vectorEquals(this.targetPosition, this.pos) ||
    (vectorEquals(this.forward, DIRECTIONS.NONE) && this.distanceToMove !== -1)
  ) {
    this.selectPatrolDirection(scene);
    if (vectorEquals(this.forward, DIRECTIONS.NONE)) {
      return;
    }
  }

  var move = this.definition.speed * delta;

  while (move > 0) {
    if (this.distanceToMove < 0) {
      var doorKey =
        floor(this.pos.x + this.forward.x) +
        "-" +
        floor(this.pos.y + this.forward.y);
      var door = scene.doors[doorKey];
      if (door && this.id !== 4) {
        openDoor(scene, doorKey);
        if (door.openAmount === 1) {
          this.distanceToMove = 1;
        } else {
          return;
        }
      } else {
        return;
      }
    }

    if (move < this.distanceToMove) {
      this.move(scene, move);
      break;
    }

    this.pos.x = this.targetPosition.x;
    this.pos.y = this.targetPosition.y;
    this.tilePos.x = floor(this.pos.x);
    this.tilePos.y = floor(this.pos.y);
    move -= this.distanceToMove;

    this.selectPatrolDirection(scene);
    if (vectorEquals(this.forward, DIRECTIONS.NONE)) {
      return;
    }
  }
};

Enemy.prototype.chase = function (scene) {
  var dodge = false;
  if (this.checkLineOfSight(scene)) {
    var dx = abs(this.pos.x - scene.player.pos.x);
    var dy = abs(this.pos.y - scene.player.pos.y);

    var distance = max(dx, dy);

    var chance;

    if (distance <= 1.5) {
      chance = 300;
    } else {
      chance = 16 / distance;
    }

    if (random(0, 255) < chance) {
      this.currentFrame = "shoot1";
      this.timestamp = millis();
      return;
    }
    dodge = true;
  }

  if (
    vectorEquals(this.targetPosition, this.pos) ||
    (vectorEquals(this.forward, DIRECTIONS.NONE) && this.distanceToMove !== -1)
  ) {
    if (dodge) {
      this.selectDodgeDirection(scene);
    } else {
      this.selectChaseDirection(scene);
    }
    if (vectorEquals(this.forward, DIRECTIONS.NONE)) {
      return;
    }
  }

  var move = this.definition.speed * this.definition.chaseSpeed * delta;

  while (move > 0) {
    if (this.distanceToMove < 0) {
      var doorKey =
        floor(this.pos.x + this.forward.x) +
        "-" +
        floor(this.pos.y + this.forward.y);
      var door = scene.doors[doorKey];
      if (door && this.id !== 4) {
        openDoor(scene, doorKey);
        if (door.openAmount === 1) {
          this.distanceToMove = 1;
        } else {
          return;
        }
      } else {
        return;
      }
    }

    if (move < this.distanceToMove) {
      this.move(scene, move);
      break;
    }

    this.pos.x = this.targetPosition.x;
    this.pos.y = this.targetPosition.y;
    this.tilePos.x = floor(this.pos.x);
    this.tilePos.y = floor(this.pos.y);
    move -= this.distanceToMove;

    if (dodge) {
      this.selectDodgeDirection(scene);
    } else {
      this.selectChaseDirection(scene);
    }
    if (vectorEquals(this.forward, DIRECTIONS.NONE)) {
      return;
    }
  }
};

Enemy.prototype.dogChase = function (scene) {
  if (
    vectorEquals(this.targetPosition, this.pos) ||
    vectorEquals(this.forward, DIRECTIONS.NONE)
  ) {
    this.selectDodgeDirection(scene);
    if (vectorEquals(this.forward, DIRECTIONS.NONE)) {
      return;
    }
  }

  var move = this.definition.speed * this.definition.chaseSpeed * delta;

  while (move > 0) {
    var dx = abs(scene.player.pos.x - this.pos.x) - move;
    if (dx <= 1 + scene.player.radius) {
      var dy = abs(scene.player.pos.y - this.pos.y) - move;
      if (dy <= 1 + scene.player.radius) {
        this.currentFrame = "jump1";
        this.timestamp = millis();
        return;
      }
    }

    if (this.distanceToMove < 0) {
      return;
    }
    if (move < this.distanceToMove) {
      this.move(scene, move);
      break;
    }

    this.pos.x = this.targetPosition.x;
    this.pos.y = this.targetPosition.y;
    this.tilePos.x = floor(this.pos.x);
    this.tilePos.y = floor(this.pos.y);
    move -= this.distanceToMove;

    this.selectDodgeDirection(scene);
    if (vectorEquals(this.forward, DIRECTIONS.NONE)) {
      return;
    }
  }
};

Enemy.prototype.schabbsChase = function (scene) {
  var dodge = false;
  var dx = abs(this.pos.x - scene.player.pos.x);
  var dy = abs(this.pos.y - scene.player.pos.y);

  var distance = max(dx, dy);
  if (this.checkLineOfSight(scene)) {
    var chance = random(8, 40);

    if (random(0, 255) < chance) {
      this.currentFrame = "throw1";
      this.timestamp = millis();
      return;
    }
    dodge = true;
  }

  if (
    vectorEquals(this.targetPosition, this.pos) ||
    (vectorEquals(this.forward, DIRECTIONS.NONE) && this.distanceToMove !== -1)
  ) {
    if (dodge) {
      this.selectDodgeDirection(scene);
    } else {
      this.selectChaseDirection(scene);
    }
    if (vectorEquals(this.forward, DIRECTIONS.NONE)) {
      return;
    }
  }

  var move = this.definition.speed * this.definition.chaseSpeed * delta;

  while (move > 0) {
    if (this.distanceToMove < 0) {
      var doorKey =
        floor(this.pos.x + this.forward.x) +
        "-" +
        floor(this.pos.y + this.forward.y);
      var door = scene.doors[doorKey];
      if (door && this.id !== 4) {
        openDoor(scene, doorKey);
        if (door.openAmount === 1) {
          this.distanceToMove = 1;
        } else {
          return;
        }
      } else {
        return;
      }
    }

    if (move < this.distanceToMove) {
      this.move(scene, move);
      break;
    }

    this.pos.x = this.targetPosition.x;
    this.pos.y = this.targetPosition.y;
    this.tilePos.x = floor(this.pos.x);
    this.tilePos.y = floor(this.pos.y);
    move -= this.distanceToMove;
    if (distance < 4) {
      this.selectRunDirection(scene);
    } else if (dodge) {
      this.selectDodgeDirection(scene);
    } else {
      this.selectChaseDirection(scene);
    }
    if (vectorEquals(this.forward, DIRECTIONS.NONE)) {
      return;
    }
  }
};

Enemy.prototype.bite = function (scene) {
  var dx = abs(scene.player.pos.x - this.pos.x) - 1;
  if (dx <= 1 + scene.player.radius) {
    var dy = abs(scene.player.pos.y - this.pos.y) - 1;
    if (dy <= 1 + scene.player.radius) {
      if (random(0, 255) < 180) {
        scene.player.damage(floor(random(0, 255) / 16), this, scene);
      }
      return;
    }
  }
};

Enemy.prototype.BJRun = function (scene) {
  var speed = ((2048 / 65536) * TICS_TO_MILLIS * 1.41) / 1000;
  this.pos.y -= speed * 2 * delta;
  if (this.pos.y < this.targetY) {
    this.timestamp = millis();
    this.currentFrame = "jump1";
  }
};
Enemy.prototype.BJJump = function (scene) {
  var speed = ((680 / 65536) * TICS_TO_MILLIS * 1.41) / 1000;
  this.pos.y -= speed * 2 * delta;
};
Enemy.prototype.BJDone = function (scene) {
  scene.gamestate = GAME_STATES.ELEVATOR;
};

Enemy.prototype.checkAlert = function (scene) {
  var area = scene.level.worldMap[this.tilePos.x][this.tilePos.y];
  if (this.reactionTime > 0) {
    this.reactionTime -= delta;
    if (this.reactionTime > 0) {
      return false;
    }
    this.reactionTime = 0;
  } else if (this.reactionTime < 0) {
    if (!areaConnectedToPlayer[area] && area !== 0) {
      return false;
    }

    if (
      this.canSeePlayer ||
      (scene.player.madeNoise && area !== 0 && this.id < 5)
    ) {
      this.reactionTime = this.definition.getReactionTime();
    }
    return false;
  }
  this.currentFrame = "chase1";
  this.timestamp = millis();
  return true;
};

Enemy.prototype.selectDodgeDirection = function (scene) {
  if (!vectorEquals(this.forward, DIRECTIONS.NONE)) {
    this.oldForward = this.forward.get();
  }
  var turnAround = this.forward.get();
  turnAround.rotate(180);
  var directions = [];
  if (this.firstAttack) {
    turnAround = DIRECTIONS.NONE;
    this.firstAttack = false;
  }

  var dx = floor(scene.player.pos.x) - this.tilePos.x;
  var dy = floor(scene.player.pos.y) - this.tilePos.y;

  if (dx > 0) {
    directions[1] = DIRECTIONS.EAST;
    directions[3] = DIRECTIONS.WEST;
  } else {
    directions[1] = DIRECTIONS.WEST;
    directions[3] = DIRECTIONS.EAST;
  }

  if (dy > 0) {
    directions[2] = DIRECTIONS.SOUTH;
    directions[4] = DIRECTIONS.NORTH;
  } else {
    directions[2] = DIRECTIONS.NORTH;
    directions[4] = DIRECTIONS.SOUTH;
  }

  var tempDir;

  if (abs(dx) > abs(dy)) {
    tempDir = directions[1];
    directions[1] = directions[2];
    directions[2] = tempDir;
    tempDir = directions[3];
    directions[3] = directions[4];
    directions[4] = tempDir;
  }

  if (random(0, 255) < 128) {
    tempDir = directions[1];
    directions[1] = directions[2];
    directions[2] = tempDir;
    tempDir = directions[3];
    directions[3] = directions[4];
    directions[4] = tempDir;
  }

  directions[0] = directions[1].get();
  directions[0].add(directions[2]);

  for (var i = 0; i < directions.length; i++) {
    if (
      vectorEquals(directions[i], DIRECTIONS.NONE) ||
      vectorEquals(directions[i], turnAround)
    ) {
      continue;
    }
    this.forward = directions[i];
    if (this.tryWalk(scene)) {
      return;
    }
  }

  if (!vectorEquals(turnAround, DIRECTIONS.NONE)) {
    this.forward = turnAround;
    if (this.tryWalk(scene)) {
      return;
    }
  }

  this.forward = DIRECTIONS.NONE;
  this.setTargetPosition(scene, this.tilePos.x, this.tilePos.y);
};
Enemy.prototype.selectChaseDirection = function (scene) {
  if (!vectorEquals(this.forward, DIRECTIONS.NONE)) {
    this.oldForward = this.forward.get();
  }
  var turnAround = this.forward.get();
  turnAround.rotate(180);
  var directions = [];
  var oldDir = this.forward.get();

  var dx = floor(scene.player.pos.x) - this.tilePos.x;
  var dy = floor(scene.player.pos.y) - this.tilePos.y;

  if (dx > 0) {
    directions[0] = DIRECTIONS.EAST;
  } else {
    directions[0] = DIRECTIONS.WEST;
  }

  if (dy > 0) {
    directions[1] = DIRECTIONS.SOUTH;
  } else {
    directions[1] = DIRECTIONS.NORTH;
  }

  if (vectorEquals(directions[0], turnAround)) {
    directions[0] = DIRECTIONS.NONE;
  }
  if (vectorEquals(directions[1], turnAround)) {
    directions[1] = DIRECTIONS.NONE;
  }

  if (abs(dy) > abs(dx)) {
    var tdir = directions[0];
    directions[0] = directions[1];
    directions[1] = tdir;
  }

  if (!vectorEquals(directions[0], DIRECTIONS.NONE)) {
    this.forward = directions[0];
    if (this.tryWalk(scene)) {
      return;
    }
  }
  if (!vectorEquals(directions[1], DIRECTIONS.NONE)) {
    this.forward = directions[1];
    if (this.tryWalk(scene)) {
      return;
    }
  }
  if (!vectorEquals(oldDir, DIRECTIONS.NONE)) {
    this.forward = oldDir;
    if (this.tryWalk(scene)) {
      return;
    }
  }

  var dirs = Object.keys(DIRECTIONS);
  if (random(0, 255) > 128) {
    for (var i = 0; i < dirs.length; i++) {
      var dir = DIRECTIONS[dirs[i]];
      if (vectorEquals(dir, turnAround)) {
        continue;
      }
      if (vectorEquals(dir, DIRECTIONS.NONE)) {
        continue;
      }
      this.forward = dir;
      if (this.tryWalk(scene)) {
        return;
      }
    }
  } else {
    for (var i = dirs.length - 1; i >= 0; i--) {
      var dir = DIRECTIONS[dirs[i]];
      if (vectorEquals(dir, turnAround)) {
        continue;
      }
      if (vectorEquals(dir, DIRECTIONS.NONE)) {
        continue;
      }
      this.forward = dir;
      if (this.tryWalk(scene)) {
        return;
      }
    }
  }

  this.forward = DIRECTIONS.NONE;
  this.setTargetPosition(scene, this.tilePos.x, this.tilePos.y);
};
Enemy.prototype.selectPatrolDirection = function (scene) {
  if (!vectorEquals(this.forward, DIRECTIONS.NONE)) {
    this.oldForward = this.forward.get();
  }

  var newDirection = this.oldForward.get();
  var info = scene.level.objectMap[floor(this.pos.x)][floor(this.pos.y)];
  if (info >= TURN_POINT_START && info < TURN_POINT_START + 8) {
    var angle = (info - TURN_POINT_START) * 45;
    newDirection.x = round(cos(angle));
    newDirection.y = -round(sin(angle));
  }

  this.forward = newDirection;

  if (this.tryWalk(scene)) {
    return;
  }

  this.forward = DIRECTIONS.NONE;
  this.setTargetPosition(scene, this.tilePos.x, this.tilePos.y);
};

Enemy.prototype.selectRunDirection = function (scene) {
  if (!vectorEquals(this.forward, DIRECTIONS.NONE)) {
    this.oldForward = this.forward.get();
  }
  var directions = [];

  var dx = floor(scene.player.pos.x) - this.tilePos.x;
  var dy = floor(scene.player.pos.y) - this.tilePos.y;

  if (dx < 0) {
    directions[0] = DIRECTIONS.EAST;
  } else {
    directions[0] = DIRECTIONS.WEST;
  }

  if (dy < 0) {
    directions[1] = DIRECTIONS.SOUTH;
  } else {
    directions[1] = DIRECTIONS.NORTH;
  }

  if (abs(dy) > abs(dx)) {
    var tdir = directions[0];
    directions[0] = directions[1];
    directions[1] = tdir;
  }

  if (!vectorEquals(directions[0], DIRECTIONS.NONE)) {
    this.forward = directions[0];
    if (this.tryWalk(scene)) {
      return;
    }
  }
  if (!vectorEquals(directions[1], DIRECTIONS.NONE)) {
    this.forward = directions[1];
    if (this.tryWalk(scene)) {
      return;
    }
  }

  var dirs = Object.keys(DIRECTIONS);
  if (random(0, 255) > 128) {
    for (var i = 0; i < dirs.length; i++) {
      var dir = DIRECTIONS[dirs[i]];
      if (vectorEquals(dir, DIRECTIONS.NONE)) {
        continue;
      }
      this.forward = dir;
      if (this.tryWalk(scene)) {
        return;
      }
    }
  } else {
    for (var i = dirs.length - 1; i >= 0; i--) {
      var dir = DIRECTIONS[dirs[i]];
      if (vectorEquals(dir, DIRECTIONS.NONE)) {
        continue;
      }
      this.forward = dir;
      if (this.tryWalk(scene)) {
        return;
      }
    }
  }

  this.forward = DIRECTIONS.NONE;
  this.setTargetPosition(scene, this.tilePos.x, this.tilePos.y);
};

Enemy.prototype.fire = function (scene) {
  var dx = abs(this.pos.x - scene.player.pos.x);
  var dy = abs(this.pos.y - scene.player.pos.y);

  var distance = max(dx, dy);

  if (this.id === 2 || this.id >= 5) {
    distance *= 2 / 3;
  }

  if (this.checkLineOfSight(scene)) {
    var hitChance;
    if (scene.player.running) {
      if (this.visible) {
        hitChance = 160 - distance * 16;
      } else {
        hitChance = 160 - distance * 8;
      }
    } else {
      if (this.visible) {
        hitChance = 256 - distance * 16;
      } else {
        hitChance = 256 - distance * 8;
      }
    }

    if (random(0, 255) < hitChance) {
      var damage;
      if (distance < 2) {
        damage = floor(random(0, 255) / 4);
      } else if (distance < 4) {
        damage = floor(random(0, 255) / 8);
      } else {
        damage = floor(random(0, 255) / 16);
      }
      scene.player.damage(damage, this, scene);
    }
  }
};
Enemy.prototype.schabbsThrow = function (scene) {
  var angle = scene.player.pos.get();
  angle.sub(this.pos);
  angle.normalize();
  var needle = new Enemy(
    this.id + 1,
    this.pos.x,
    this.pos.y,
    angle.x,
    angle.y,
    enemyDefinitions[this.id + 1],
    "needle1",
  );
  scene.decorations.push(needle);
};
Enemy.prototype.projectile = function (scene) {
  this.pos.x += this.forward.x * delta * this.definition.speed;
  this.pos.y += this.forward.y * delta * this.definition.speed;
  if (checkTile(scene, this.pos.x, this.pos.y, this, true) !== 0) {
    var i = scene.decorations.indexOf(this);
    scene.decorations.splice(i, 1);
  } else if (
    abs(this.pos.x - scene.player.pos.x) < 0.75 &&
    abs(this.pos.y - scene.player.pos.y) < 0.75
  ) {
    scene.player.damage(floor(random(0, 255) / 8) + 20, this, scene);

    var i = scene.decorations.indexOf(this);
    scene.decorations.splice(i, 1);
  }
};
Enemy.prototype.hit = function (damage) {
  if (this.health === 0) {
    return false;
  }
  this.health -= damage;
  if (this.health <= 0 || this.id === 4) {
    this.health = 0;
    this.currentFrame = "die1";
    this.timestamp = millis();
    return true;
  } else if (this.id < 5) {
    this.currentFrame = this.health % 2 === 0 ? "pain1" : "pain2";
    this.timestamp = millis();
    return false;
  }
};
Enemy.prototype.checkLineOfSight = function (scene) {
  var rayDirection = scene.player.pos.get();
  rayDirection.sub(this.pos);
  rayDirection.normalize();

  var mapX = floor(this.pos.x);
  var mapY = floor(this.pos.y);

  var sideDistX;
  var sideDistY;

  //length of ray from one x or y-side to next x or y-side
  var deltaDistX = rayDirection.x === 0 ? Infinity : abs(1 / rayDirection.x);
  var deltaDistY = rayDirection.y === 0 ? Infinity : abs(1 / rayDirection.y);

  var stepX;
  var stepY;
  var side = 0;
  var hit = 0;

  if (rayDirection.x < 0) {
    stepX = -1;
    sideDistX = (this.pos.x - mapX) * deltaDistX;
  } else {
    stepX = 1;
    sideDistX = (mapX + 1 - this.pos.x) * deltaDistX;
  }
  if (rayDirection.y < 0) {
    stepY = -1;
    sideDistY = (this.pos.y - mapY) * deltaDistY;
  } else {
    stepY = 1;
    sideDistY = (mapY + 1 - this.pos.y) * deltaDistY;
  }

  while (hit <= FLOOR_CODES || hit >= FLOOR_CODES + wallCount) {
    if (sideDistX < sideDistY) {
      sideDistX += deltaDistX;
      mapX += stepX;
      side = 0;
    } else {
      sideDistY += deltaDistY;
      mapY += stepY;
      side = 1;
    }

    hit = scene.level.worldMap[mapX][mapY];

    // Doors {
    if (DOOR_CODES.includes(hit)) {
      var doorOpenAmount = scene.doors[mapX + "-" + mapY].openAmount;
      if (side === 1) {
        if (sideDistY - deltaDistY * 0.5 >= sideDistX) {
          hit = 0;
        } else {
          var doorX =
            this.pos.x + (sideDistY - deltaDistY * 0.5) * rayDirection.x;
          doorX -= floor(doorX);

          if (doorX < doorOpenAmount) {
            hit = 0;
          }
        }
      } else {
        if (sideDistX - deltaDistX * 0.5 >= sideDistY) {
          hit = 0;
        } else {
          var doorX =
            this.pos.y + (sideDistX - deltaDistX * 0.5) * rayDirection.y;
          doorX -= floor(doorX);

          if (doorX < doorOpenAmount) {
            hit = 0;
          }
        }
      }
    }
    //}

    if (
      floor(scene.player.pos.x) === mapX &&
      floor(scene.player.pos.y) === mapY
    ) {
      return true;
    }
  }
  return false;
};
Enemy.prototype.clearGridSpace = function (scene) {
  var dropItemId = GUARD_AMMO_ID;
  if (this.id === 2 && scene.player.weapons < 3) {
    dropItemId = GUARD_AMMO_ID + 1;
  } else if (this.id === 5) {
    dropItemId = GOLD_KEY_ID;
  }

  var itemPosX = floor(this.pos.x);
  var itemPosY = floor(this.pos.y);

  if (this.id !== 4 && this.id !== 7) {
    var pickup = new Decoration(
      dropItemId,
      floor(this.pos.x) + 0.5,
      floor(this.pos.y) + 0.5,
    );
    scene.decorations.push(pickup);
    scene.pickupGrid[itemPosX][itemPosY].push(pickup);
  }

  var door = scene.doors[itemPosX + "-" + itemPosY];
  if (door) {
    door.blocked = true;
  }
};

Enemy.prototype.startDeathCam = function (scene) {
  if (scene.gamestate === GAME_STATES.DEATHCAM_2) {
    scene.gamestate = GAME_STATES.DEATHCAM_3;
    scene.startTime = -1;
  } else {
    scene.gamestate = GAME_STATES.DEATHCAM_1;
    scene.startTime = -1;
  }
};

var enemyDefinitions = [];
enemyDefinitions.push({
  health: 25,
  speed: 0.000547 * 1.41,
  chaseSpeed: 3,
  getReactionTime: function () {
    return (1 + random(0, 255) / 4) * TICS_TO_MILLIS;
  },
  score: 100,
  frames: {
    stand: {
      duration: 0,
      think: "stand",
      action: null,
      next: "stand",
      angle: true,
      frame: 0,
    },
    patrol1: {
      duration: 20 * TICS_TO_MILLIS,
      think: "patrol",
      action: null,
      next: "patrol1s",
      angle: true,
      frame: 8,
    },
    patrol1s: {
      duration: 5 * TICS_TO_MILLIS,
      think: null,
      action: null,
      next: "patrol2",
      angle: true,
      frame: 8,
    },
    patrol2: {
      duration: 15 * TICS_TO_MILLIS,
      think: "patrol",
      action: null,
      next: "patrol3",
      angle: true,
      frame: 16,
    },
    patrol3: {
      duration: 20 * TICS_TO_MILLIS,
      think: "patrol",
      action: null,
      next: "patrol3s",
      angle: true,
      frame: 24,
    },
    patrol3s: {
      duration: 5 * TICS_TO_MILLIS,
      think: null,
      action: null,
      next: "patrol4",
      angle: true,
      frame: 24,
    },
    patrol4: {
      duration: 15 * TICS_TO_MILLIS,
      think: "patrol",
      action: null,
      next: "patrol1",
      angle: true,
      frame: 32,
    },
    pain1: {
      duration: 10 * TICS_TO_MILLIS,
      think: null,
      action: null,
      next: "chase1",
      angle: false,
      frame: 40,
    },
    pain2: {
      duration: 10 * TICS_TO_MILLIS,
      think: null,
      action: null,
      next: "chase1",
      angle: false,
      frame: 41,
    },
    shoot1: {
      duration: 20 * TICS_TO_MILLIS,
      think: null,
      action: null,
      next: "shoot2",
      angle: false,
      frame: 46,
    },
    shoot2: {
      duration: 20 * TICS_TO_MILLIS,
      think: null,
      action: "fire",
      next: "shoot3",
      angle: false,
      frame: 47,
    },
    shoot3: {
      duration: 20 * TICS_TO_MILLIS,
      think: null,
      action: null,
      next: "chase1",
      angle: false,
      frame: 48,
    },
    chase1: {
      duration: 10 * TICS_TO_MILLIS,
      think: "chase",
      action: null,
      next: "chase1s",
      angle: true,
      frame: 8,
    },
    chase1s: {
      duration: 3 * TICS_TO_MILLIS,
      think: null,
      action: null,
      next: "chase2",
      angle: true,
      frame: 8,
    },
    chase2: {
      duration: 8 * TICS_TO_MILLIS,
      think: "chase",
      action: null,
      next: "chase3",
      angle: true,
      frame: 16,
    },
    chase3: {
      duration: 10 * TICS_TO_MILLIS,
      think: "chase",
      action: null,
      next: "chase3s",
      angle: true,
      frame: 24,
    },
    chase3s: {
      duration: 3 * TICS_TO_MILLIS,
      think: null,
      action: null,
      next: "chase4",
      angle: true,
      frame: 24,
    },
    chase4: {
      duration: 8 * TICS_TO_MILLIS,
      think: "chase",
      action: null,
      next: "chase1",
      angle: true,
      frame: 32,
    },
    die1: {
      duration: 15 * TICS_TO_MILLIS,
      think: null,
      action: "clearGridSpace",
      next: "die2",
      angle: false,
      frame: 42,
    },
    die2: {
      duration: 15 * TICS_TO_MILLIS,
      think: null,
      action: null,
      next: "die3",
      angle: false,
      frame: 43,
    },
    die3: {
      duration: 15 * TICS_TO_MILLIS,
      think: null,
      action: null,
      next: "die4",
      angle: false,
      frame: 44,
    },
    die4: {
      duration: 0,
      think: null,
      action: null,
      next: "die4",
      angle: false,
      frame: 45,
    },
  },
}); // Guard
enemyDefinitions.push({
  health: 50,
  speed: 0.000547 * 1.41,
  chaseSpeed: 5,
  getReactionTime: function () {
    return 2 * TICS_TO_MILLIS;
  },
  score: 400,
  frames: {
    stand: {
      duration: 0,
      think: "stand",
      action: null,
      next: "stand",
      angle: true,
      frame: 0,
    },
    patrol1: {
      duration: 20 * TICS_TO_MILLIS,
      think: "patrol",
      action: null,
      next: "patrol1s",
      angle: true,
      frame: 8,
    },
    patrol1s: {
      duration: 5 * TICS_TO_MILLIS,
      think: null,
      action: null,
      next: "patrol2",
      angle: true,
      frame: 8,
    },
    patrol2: {
      duration: 15 * TICS_TO_MILLIS,
      think: "patrol",
      action: null,
      next: "patrol3",
      angle: true,
      frame: 16,
    },
    patrol3: {
      duration: 20 * TICS_TO_MILLIS,
      think: "patrol",
      action: null,
      next: "patrol3s",
      angle: true,
      frame: 24,
    },
    patrol3s: {
      duration: 5 * TICS_TO_MILLIS,
      think: null,
      action: null,
      next: "patrol4",
      angle: true,
      frame: 24,
    },
    patrol4: {
      duration: 15 * TICS_TO_MILLIS,
      think: "patrol",
      action: null,
      next: "patrol1",
      angle: true,
      frame: 32,
    },
    pain1: {
      duration: 10 * TICS_TO_MILLIS,
      think: null,
      action: null,
      next: "chase1",
      angle: false,
      frame: 40,
    },
    pain2: {
      duration: 10 * TICS_TO_MILLIS,
      think: null,
      action: null,
      next: "chase1",
      angle: false,
      frame: 41,
    },
    shoot1: {
      duration: 6 * TICS_TO_MILLIS,
      think: null,
      action: null,
      next: "shoot2",
      angle: false,
      frame: 47,
    },
    shoot2: {
      duration: 20 * TICS_TO_MILLIS,
      think: null,
      action: "fire",
      next: "shoot3",
      angle: false,
      frame: 48,
    },
    shoot3: {
      duration: 10 * TICS_TO_MILLIS,
      think: null,
      action: null,
      next: "chase1",
      angle: false,
      frame: 49,
    },
    chase1: {
      duration: 10 * TICS_TO_MILLIS,
      think: "chase",
      action: null,
      next: "chase1s",
      angle: true,
      frame: 8,
    },
    chase1s: {
      duration: 3 * TICS_TO_MILLIS,
      think: null,
      action: null,
      next: "chase2",
      angle: true,
      frame: 8,
    },
    chase2: {
      duration: 8 * TICS_TO_MILLIS,
      think: "chase",
      action: null,
      next: "chase3",
      angle: true,
      frame: 16,
    },
    chase3: {
      duration: 10 * TICS_TO_MILLIS,
      think: "chase",
      action: null,
      next: "chase3s",
      angle: true,
      frame: 24,
    },
    chase3s: {
      duration: 3 * TICS_TO_MILLIS,
      think: null,
      action: null,
      next: "chase4",
      angle: true,
      frame: 24,
    },
    chase4: {
      duration: 8 * TICS_TO_MILLIS,
      think: "chase",
      action: null,
      next: "chase1",
      angle: true,
      frame: 32,
    },
    die1: {
      duration: 11 * TICS_TO_MILLIS,
      think: null,
      action: "clearGridSpace",
      next: "die2",
      angle: false,
      frame: 42,
    },
    die2: {
      duration: 11 * TICS_TO_MILLIS,
      think: null,
      action: null,
      next: "die3",
      angle: false,
      frame: 43,
    },
    die3: {
      duration: 11 * TICS_TO_MILLIS,
      think: null,
      action: null,
      next: "die4",
      angle: false,
      frame: 44,
    },
    die4: {
      duration: 11 * TICS_TO_MILLIS,
      think: null,
      action: null,
      next: "die5",
      angle: false,
      frame: 45,
    },
    die5: {
      duration: 0,
      think: null,
      action: null,
      next: "die5",
      angle: false,
      frame: 46,
    },
  },
}); // Officer
enemyDefinitions.push({
  health: 100,
  speed: 0.000547 * 1.41,
  chaseSpeed: 4,
  getReactionTime: function () {
    return (1 + random(0, 255) / 6) * TICS_TO_MILLIS;
  },
  score: 500,
  frames: {
    stand: {
      duration: 0,
      think: "stand",
      action: null,
      next: "stand",
      angle: true,
      frame: 0,
    },
    patrol1: {
      duration: 20 * TICS_TO_MILLIS,
      think: "patrol",
      action: null,
      next: "patrol1s",
      angle: true,
      frame: 8,
    },
    patrol1s: {
      duration: 5 * TICS_TO_MILLIS,
      think: null,
      action: null,
      next: "patrol2",
      angle: true,
      frame: 8,
    },
    patrol2: {
      duration: 15 * TICS_TO_MILLIS,
      think: "patrol",
      action: null,
      next: "patrol3",
      angle: true,
      frame: 16,
    },
    patrol3: {
      duration: 20 * TICS_TO_MILLIS,
      think: "patrol",
      action: null,
      next: "patrol3s",
      angle: true,
      frame: 24,
    },
    patrol3s: {
      duration: 5 * TICS_TO_MILLIS,
      think: null,
      action: null,
      next: "patrol4",
      angle: true,
      frame: 24,
    },
    patrol4: {
      duration: 15 * TICS_TO_MILLIS,
      think: "patrol",
      action: null,
      next: "patrol1",
      angle: true,
      frame: 32,
    },
    pain1: {
      duration: 10 * TICS_TO_MILLIS,
      think: null,
      action: null,
      next: "chase1",
      angle: false,
      frame: 40,
    },
    pain2: {
      duration: 10 * TICS_TO_MILLIS,
      think: null,
      action: null,
      next: "chase1",
      angle: false,
      frame: 41,
    },
    shoot1: {
      duration: 20 * TICS_TO_MILLIS,
      think: null,
      action: null,
      next: "shoot2",
      angle: false,
      frame: 46,
    },
    shoot2: {
      duration: 20 * TICS_TO_MILLIS,
      think: null,
      action: "fire",
      next: "shoot3",
      angle: false,
      frame: 47,
    },
    shoot3: {
      duration: 10 * TICS_TO_MILLIS,
      think: null,
      action: null,
      next: "shoot4",
      angle: false,
      frame: 48,
    },
    shoot4: {
      duration: 10 * TICS_TO_MILLIS,
      think: null,
      action: "fire",
      next: "shoot5",
      angle: false,
      frame: 47,
    },
    shoot5: {
      duration: 10 * TICS_TO_MILLIS,
      think: null,
      action: null,
      next: "shoot6",
      angle: false,
      frame: 48,
    },
    shoot6: {
      duration: 10 * TICS_TO_MILLIS,
      think: null,
      action: "fire",
      next: "shoot7",
      angle: false,
      frame: 47,
    },
    shoot7: {
      duration: 10 * TICS_TO_MILLIS,
      think: null,
      action: null,
      next: "shoot8",
      angle: false,
      frame: 48,
    },
    shoot8: {
      duration: 10 * TICS_TO_MILLIS,
      think: null,
      action: "fire",
      next: "shoot9",
      angle: false,
      frame: 47,
    },
    shoot9: {
      duration: 10 * TICS_TO_MILLIS,
      think: null,
      action: null,
      next: "chase1",
      angle: false,
      frame: 48,
    },
    chase1: {
      duration: 10 * TICS_TO_MILLIS,
      think: "chase",
      action: null,
      next: "chase1s",
      angle: true,
      frame: 8,
    },
    chase1s: {
      duration: 3 * TICS_TO_MILLIS,
      think: null,
      action: null,
      next: "chase2",
      angle: true,
      frame: 8,
    },
    chase2: {
      duration: 8 * TICS_TO_MILLIS,
      think: "chase",
      action: null,
      next: "chase3",
      angle: true,
      frame: 16,
    },
    chase3: {
      duration: 10 * TICS_TO_MILLIS,
      think: "chase",
      action: null,
      next: "chase3s",
      angle: true,
      frame: 24,
    },
    chase3s: {
      duration: 3 * TICS_TO_MILLIS,
      think: null,
      action: null,
      next: "chase4",
      angle: true,
      frame: 24,
    },
    chase4: {
      duration: 8 * TICS_TO_MILLIS,
      think: "chase",
      action: null,
      next: "chase1",
      angle: true,
      frame: 32,
    },
    die1: {
      duration: 15 * TICS_TO_MILLIS,
      think: null,
      action: "clearGridSpace",
      next: "die2",
      angle: false,
      frame: 42,
    },
    die2: {
      duration: 15 * TICS_TO_MILLIS,
      think: null,
      action: null,
      next: "die3",
      angle: false,
      frame: 43,
    },
    die3: {
      duration: 15 * TICS_TO_MILLIS,
      think: null,
      action: null,
      next: "die4",
      angle: false,
      frame: 44,
    },
    die4: {
      duration: 0,
      think: null,
      action: null,
      next: "die4",
      angle: false,
      frame: 45,
    },
  },
}); // SS
enemyDefinitions.push({
  health: [45, 55, 55, 65],
  speed: 0.000547 * 1.41,
  chaseSpeed: 3,
  getReactionTime: function () {
    return (1 + random(0, 255) / 6) * TICS_TO_MILLIS;
  },
  score: 700,
  frames: {
    stand: {
      duration: 0,
      think: "stand",
      action: null,
      next: "stand",
      angle: true,
      frame: 0,
    },
    patrol1: {
      duration: 20 * TICS_TO_MILLIS,
      think: "patrol",
      action: null,
      next: "patrol1s",
      angle: true,
      frame: 8,
    },
    patrol1s: {
      duration: 5 * TICS_TO_MILLIS,
      think: null,
      action: null,
      next: "patrol2",
      angle: true,
      frame: 8,
    },
    patrol2: {
      duration: 15 * TICS_TO_MILLIS,
      think: "patrol",
      action: null,
      next: "patrol3",
      angle: true,
      frame: 16,
    },
    patrol3: {
      duration: 20 * TICS_TO_MILLIS,
      think: "patrol",
      action: null,
      next: "patrol3s",
      angle: true,
      frame: 24,
    },
    patrol3s: {
      duration: 5 * TICS_TO_MILLIS,
      think: null,
      action: null,
      next: "patrol4",
      angle: true,
      frame: 24,
    },
    patrol4: {
      duration: 15 * TICS_TO_MILLIS,
      think: "patrol",
      action: null,
      next: "patrol1",
      angle: true,
      frame: 32,
    },
    pain1: {
      duration: 10 * TICS_TO_MILLIS,
      think: null,
      action: null,
      next: "chase1",
      angle: false,
      frame: 40,
    },
    pain2: {
      duration: 10 * TICS_TO_MILLIS,
      think: null,
      action: null,
      next: "chase1",
      angle: false,
      frame: 41,
    },
    shoot1: {
      duration: 6 * TICS_TO_MILLIS,
      think: null,
      action: "fire",
      next: "shoot2",
      angle: false,
      frame: 47,
    },
    shoot2: {
      duration: 20 * TICS_TO_MILLIS,
      think: null,
      action: null,
      next: "shoot3",
      angle: false,
      frame: 48,
    },
    shoot3: {
      duration: 10 * TICS_TO_MILLIS,
      think: null,
      action: "fire",
      next: "shoot4",
      angle: false,
      frame: 49,
    },
    shoot4: {
      duration: 20 * TICS_TO_MILLIS,
      think: null,
      action: null,
      next: "chase1",
      angle: false,
      frame: 50,
    },
    chase1: {
      duration: 10 * TICS_TO_MILLIS,
      think: "chase",
      action: null,
      next: "chase1s",
      angle: true,
      frame: 8,
    },
    chase1s: {
      duration: 3 * TICS_TO_MILLIS,
      think: null,
      action: null,
      next: "chase2",
      angle: true,
      frame: 8,
    },
    chase2: {
      duration: 8 * TICS_TO_MILLIS,
      think: "chase",
      action: null,
      next: "chase3",
      angle: true,
      frame: 16,
    },
    chase3: {
      duration: 10 * TICS_TO_MILLIS,
      think: "chase",
      action: null,
      next: "chase3s",
      angle: true,
      frame: 24,
    },
    chase3s: {
      duration: 3 * TICS_TO_MILLIS,
      think: null,
      action: null,
      next: "chase4",
      angle: true,
      frame: 24,
    },
    chase4: {
      duration: 8 * TICS_TO_MILLIS,
      think: "chase",
      action: null,
      next: "chase1",
      angle: true,
      frame: 32,
    },
    die1: {
      duration: 7 * TICS_TO_MILLIS,
      think: null,
      action: "clearGridSpace",
      next: "die2",
      angle: false,
      frame: 42,
    },
    die2: {
      duration: 7 * TICS_TO_MILLIS,
      think: null,
      action: null,
      next: "die3",
      angle: false,
      frame: 43,
    },
    die3: {
      duration: 7 * TICS_TO_MILLIS,
      think: null,
      action: null,
      next: "die4",
      angle: false,
      frame: 44,
    },
    die4: {
      duration: 7 * TICS_TO_MILLIS,
      think: null,
      action: null,
      next: "die5",
      angle: false,
      frame: 45,
    },
    die5: {
      duration: 0,
      think: null,
      action: null,
      next: "die5",
      angle: false,
      frame: 46,
    },
  },
}); // Mutant
enemyDefinitions.push({
  health: 1,
  speed: 0.001709 * 1.41,
  chaseSpeed: 2,
  getReactionTime: function () {
    return (1 + random(0, 255) / 8) * TICS_TO_MILLIS;
  },
  score: 200,
  frames: {
    patrol1: {
      duration: 20 * TICS_TO_MILLIS,
      think: "patrol",
      action: null,
      next: "patrol1s",
      angle: true,
      frame: 0,
    },
    patrol1s: {
      duration: 5 * TICS_TO_MILLIS,
      think: null,
      action: null,
      next: "patrol2",
      angle: true,
      frame: 0,
    },
    patrol2: {
      duration: 15 * TICS_TO_MILLIS,
      think: "patrol",
      action: null,
      next: "patrol3",
      angle: true,
      frame: 8,
    },
    patrol3: {
      duration: 20 * TICS_TO_MILLIS,
      think: "patrol",
      action: null,
      next: "patrol3s",
      angle: true,
      frame: 16,
    },
    patrol3s: {
      duration: 5 * TICS_TO_MILLIS,
      think: null,
      action: null,
      next: "patrol4",
      angle: true,
      frame: 16,
    },
    patrol4: {
      duration: 15 * TICS_TO_MILLIS,
      think: "patrol",
      action: null,
      next: "patrol1",
      angle: true,
      frame: 24,
    },
    die1: {
      duration: 15 * TICS_TO_MILLIS,
      think: null,
      action: "clearGridSpace",
      next: "die2",
      angle: false,
      frame: 32,
    },
    die2: {
      duration: 15 * TICS_TO_MILLIS,
      think: null,
      action: null,
      next: "die3",
      angle: false,
      frame: 33,
    },
    die3: {
      duration: 15 * TICS_TO_MILLIS,
      think: null,
      action: null,
      next: "die4",
      angle: false,
      frame: 34,
    },
    die4: {
      duration: 0,
      think: null,
      action: null,
      next: "die4",
      angle: false,
      frame: 35,
    },
    jump1: {
      duration: 10 * TICS_TO_MILLIS,
      think: null,
      action: null,
      next: "jump2",
      angle: false,
      frame: 36,
    },
    jump2: {
      duration: 10 * TICS_TO_MILLIS,
      think: null,
      action: "bite",
      next: "jump3",
      angle: false,
      frame: 37,
    },
    jump3: {
      duration: 10 * TICS_TO_MILLIS,
      think: null,
      action: null,
      next: "jump4",
      angle: false,
      frame: 38,
    },
    jump4: {
      duration: 10 * TICS_TO_MILLIS,
      think: null,
      action: null,
      next: "jump5",
      angle: false,
      frame: 36,
    },
    jump5: {
      duration: 10 * TICS_TO_MILLIS,
      think: null,
      action: null,
      next: "chase1",
      angle: false,
      frame: 0,
    },
    chase1: {
      duration: 10 * TICS_TO_MILLIS,
      think: "dogChase",
      action: null,
      next: "chase1s",
      angle: true,
      frame: 0,
    },
    chase1s: {
      duration: 3 * TICS_TO_MILLIS,
      think: null,
      action: null,
      next: "chase2",
      angle: true,
      frame: 0,
    },
    chase2: {
      duration: 8 * TICS_TO_MILLIS,
      think: "dogChase",
      action: null,
      next: "chase3",
      angle: true,
      frame: 8,
    },
    chase3: {
      duration: 10 * TICS_TO_MILLIS,
      think: "dogChase",
      action: null,
      next: "chase3s",
      angle: true,
      frame: 16,
    },
    chase3s: {
      duration: 3 * TICS_TO_MILLIS,
      think: null,
      action: null,
      next: "chase4",
      angle: true,
      frame: 16,
    },
    chase4: {
      duration: 8 * TICS_TO_MILLIS,
      think: "dogChase",
      action: null,
      next: "chase1",
      angle: true,
      frame: 24,
    },
  },
}); // Dog
enemyDefinitions.push({
  health: [850, 950, 1050, 1200],
  speed: 0.000547 * 1.41,
  chaseSpeed: 3,
  getReactionTime: function () {
    return 0;
  },
  score: 5000,
  frames: {
    stand: {
      duration: 0,
      think: "stand",
      action: null,
      next: "stand",
      angle: false,
      frame: 0,
    },
    chase1: {
      duration: 10 * TICS_TO_MILLIS,
      think: "chase",
      action: null,
      next: "chase1s",
      angle: false,
      frame: 0,
    },
    chase1s: {
      duration: 3 * TICS_TO_MILLIS,
      think: null,
      action: null,
      next: "chase2",
      angle: false,
      frame: 0,
    },
    chase2: {
      duration: 8 * TICS_TO_MILLIS,
      think: "chase",
      action: null,
      next: "chase3",
      angle: false,
      frame: 1,
    },
    chase3: {
      duration: 10 * TICS_TO_MILLIS,
      think: "chase",
      action: null,
      next: "chase3s",
      angle: false,
      frame: 2,
    },
    chase3s: {
      duration: 3 * TICS_TO_MILLIS,
      think: null,
      action: null,
      next: "chase4",
      angle: false,
      frame: 2,
    },
    chase4: {
      duration: 8 * TICS_TO_MILLIS,
      think: "chase",
      action: null,
      next: "chase1",
      angle: false,
      frame: 3,
    },
    shoot1: {
      duration: 30 * TICS_TO_MILLIS,
      think: null,
      action: null,
      next: "shoot2",
      angle: false,
      frame: 4,
    },
    shoot2: {
      duration: 10 * TICS_TO_MILLIS,
      think: null,
      action: "fire",
      next: "shoot3",
      angle: false,
      frame: 5,
    },
    shoot3: {
      duration: 10 * TICS_TO_MILLIS,
      think: null,
      action: "fire",
      next: "shoot4",
      angle: false,
      frame: 6,
    },
    shoot4: {
      duration: 10 * TICS_TO_MILLIS,
      think: null,
      action: "fire",
      next: "shoot5",
      angle: false,
      frame: 5,
    },
    shoot5: {
      duration: 10 * TICS_TO_MILLIS,
      think: null,
      action: "fire",
      next: "shoot6",
      angle: false,
      frame: 6,
    },
    shoot6: {
      duration: 10 * TICS_TO_MILLIS,
      think: null,
      action: "fire",
      next: "shoot7",
      angle: false,
      frame: 5,
    },
    shoot7: {
      duration: 10 * TICS_TO_MILLIS,
      think: null,
      action: "fire",
      next: "shoot8",
      angle: false,
      frame: 6,
    },
    shoot8: {
      duration: 10 * TICS_TO_MILLIS,
      think: null,
      action: null,
      next: "chase1",
      angle: false,
      frame: 4,
    },
    die1: {
      duration: 15 * TICS_TO_MILLIS,
      think: null,
      action: "clearGridSpace",
      next: "die2",
      angle: false,
      frame: 7,
    },
    die2: {
      duration: 15 * TICS_TO_MILLIS,
      think: null,
      action: null,
      next: "die3",
      angle: false,
      frame: 8,
    },
    die3: {
      duration: 15 * TICS_TO_MILLIS,
      think: null,
      action: null,
      next: "die4",
      angle: false,
      frame: 9,
    },
    die4: {
      duration: 0,
      think: null,
      action: null,
      next: "die4",
      angle: false,
      frame: 10,
    },
  },
}); // Hans Grosse
enemyDefinitions.push({
  health: 1,
  speed: 0.000547 * 1.41,
  frames: {
    run1: {
      duration: 12 * TICS_TO_MILLIS,
      think: "BJRun",
      action: null,
      next: "run1s",
      angle: false,
      frame: 0,
    },
    run1s: {
      duration: 3 * TICS_TO_MILLIS,
      think: null,
      action: null,
      next: "run2",
      angle: false,
      frame: 0,
    },
    run2: {
      duration: 8 * TICS_TO_MILLIS,
      think: "BJRun",
      action: null,
      next: "run3",
      angle: false,
      frame: 1,
    },
    run3: {
      duration: 12 * TICS_TO_MILLIS,
      think: "BJRun",
      action: null,
      next: "run3s",
      angle: false,
      frame: 2,
    },
    run3s: {
      duration: 3 * TICS_TO_MILLIS,
      think: null,
      action: null,
      next: "run4",
      angle: false,
      frame: 2,
    },
    run4: {
      duration: 8 * TICS_TO_MILLIS,
      think: "BJRun",
      action: null,
      next: "run1",
      angle: false,
      frame: 3,
    },
    jump1: {
      duration: 14 * TICS_TO_MILLIS,
      think: "BJJump",
      action: null,
      next: "jump2",
      angle: false,
      frame: 4,
    },
    jump2: {
      duration: 14 * TICS_TO_MILLIS,
      think: "BJJump",
      action: null,
      next: "jump3",
      angle: false,
      frame: 5,
    },
    jump3: {
      duration: 14 * TICS_TO_MILLIS,
      think: "BJJump",
      action: null,
      next: "jump4",
      angle: false,
      frame: 6,
    },
    jump4: {
      duration: 300 * TICS_TO_MILLIS,
      think: null,
      action: "BJDone",
      next: "jump5",
      angle: false,
      frame: 7,
    },
    jump5: {
      duration: 0,
      think: null,
      action: null,
      next: "jump5",
      angle: false,
      frame: 7,
    },
  },
}); // BJ
enemyDefinitions.push({
  health: [850, 950, 1550, 2400],
  speed: 0.000547 * 1.41,
  chaseSpeed: 3,
  getReactionTime: function () {
    return 0;
  },
  score: 5000,
  frames: {
    stand: {
      duration: 0,
      think: "stand",
      action: null,
      next: "stand",
      angle: false,
      frame: 0,
    },
    chase1: {
      duration: 10 * TICS_TO_MILLIS,
      think: "schabbsChase",
      action: null,
      next: "chase1s",
      angle: false,
      frame: 0,
    },
    chase1s: {
      duration: 3 * TICS_TO_MILLIS,
      think: null,
      action: null,
      next: "chase2",
      angle: false,
      frame: 0,
    },
    chase2: {
      duration: 8 * TICS_TO_MILLIS,
      think: "schabbsChase",
      action: null,
      next: "chase3",
      angle: false,
      frame: 1,
    },
    chase3: {
      duration: 10 * TICS_TO_MILLIS,
      think: "schabbsChase",
      action: null,
      next: "chase3s",
      angle: false,
      frame: 2,
    },
    chase3s: {
      duration: 3 * TICS_TO_MILLIS,
      think: null,
      action: null,
      next: "chase4",
      angle: false,
      frame: 2,
    },
    chase4: {
      duration: 8 * TICS_TO_MILLIS,
      think: "schabbsChase",
      action: null,
      next: "chase1",
      angle: false,
      frame: 3,
    },
    throw1: {
      duration: 30 * TICS_TO_MILLIS,
      think: null,
      action: null,
      next: "throw2",
      angle: false,
      frame: 4,
    },
    throw2: {
      duration: 10 * TICS_TO_MILLIS,
      think: null,
      action: "schabbsThrow",
      next: "chase1",
      angle: false,
      frame: 5,
    },
    die1: {
      duration: 12 * TICS_TO_MILLIS,
      think: null,
      action: "clearGridSpace",
      next: "die2",
      angle: false,
      frame: 0,
    },
    die2: {
      duration: 10 * TICS_TO_MILLIS,
      think: null,
      action: null,
      next: "die3",
      angle: false,
      frame: 0,
    },
    die3: {
      duration: 10 * TICS_TO_MILLIS,
      think: null,
      action: null,
      next: "die4",
      angle: false,
      frame: 6,
    },
    die4: {
      duration: 10 * TICS_TO_MILLIS,
      think: null,
      action: null,
      next: "die5",
      angle: false,
      frame: 7,
    },
    die5: {
      duration: 10 * TICS_TO_MILLIS,
      think: null,
      action: null,
      next: "die6",
      angle: false,
      frame: 8,
    },
    die6: {
      duration: 20 * TICS_TO_MILLIS,
      think: null,
      action: "startDeathCam",
      next: "die6",
      angle: false,
      frame: 9,
    },
    deathcam: {
      duration: 1 * TICS_TO_MILLIS,
      think: null,
      action: null,
      next: "die1",
      angle: false,
      frame: 0,
    },
  },
}); // Dr. Schabbs
enemyDefinitions.push({
  notHittable: true,
  speed: 0.00875,
  frames: {
    needle1: {
      duration: 6 * TICS_TO_MILLIS,
      think: "projectile",
      action: null,
      next: "needle2",
      angle: false,
      frame: 0,
    },
    needle2: {
      duration: 6 * TICS_TO_MILLIS,
      think: "projectile",
      action: null,
      next: "needle3",
      angle: false,
      frame: 1,
    },
    needle3: {
      duration: 6 * TICS_TO_MILLIS,
      think: "projectile",
      action: null,
      next: "needle4",
      angle: false,
      frame: 2,
    },
    needle4: {
      duration: 6 * TICS_TO_MILLIS,
      think: "projectile",
      action: null,
      next: "needle1",
      angle: false,
      frame: 3,
    },
  },
});

function spawnEnemies(scene) {
  var out = [];
  var dead = 0;
  for (var x = 0; x < 64; x++) {
    for (var y = 0; y < 64; y++) {
      if (scene.level.objectMap[x][y] === ENEMY_CODES_START) {
        var enemy = new Enemy(
          0,
          x + 0.5,
          y + 0.5,
          0,
          0,
          enemyDefinitions[0],
          "die4",
        );
        enemy.health = 0;
        dead++;
        out.push(enemy);
      } else if (scene.level.objectMap[x][y] > ENEMY_CODES_START) {
        var enemyCode = scene.level.objectMap[x][y] - ENEMY_CODES_START - 1;
        var enemyId = -1;
        var enemyFrame = "stand";
        var enemyForwardX;
        var enemyForwardY;
        var enemyDirection = enemyCode % 4;

        switch (enemyDirection) {
          case 0:
            enemyForwardX = 1;
            enemyForwardY = 0;
            break;
          case 1:
            enemyForwardX = 0;
            enemyForwardY = -1;
            break;
          case 2:
            enemyForwardX = -1;
            enemyForwardY = 0;
            break;
          case 3:
            enemyForwardX = 0;
            enemyForwardY = 1;
            break;
        }

        if (enemyCode < 32) {
          enemyId = floor(enemyCode / 8);
          enemyFrame = enemyCode % 8 < 4 ? "stand" : "patrol1";
        } else if (enemyCode < 36) {
          enemyId = 4;
          enemyFrame = "patrol1";
        } else if (difficultyLevel > DIFFICULTIES.DONT_HURT_ME) {
          enemyCode -= 36;
          if (enemyCode < 32) {
            enemyId = floor(enemyCode / 8);
            enemyFrame = enemyCode % 8 < 4 ? "stand" : "patrol1";
          } else if (enemyCode < 36) {
            enemyId = 4;
            enemyFrame = "patrol1";
          } else if (difficultyLevel === DIFFICULTIES.I_AM_DEATH_INCARNATE) {
            enemyCode -= 36;
            if (enemyCode < 32) {
              enemyId = floor(enemyCode / 8);
              enemyFrame = enemyCode % 8 < 4 ? "stand" : "patrol1";
            } else if (enemyCode < 36) {
              enemyId = 4;
              enemyFrame = "patrol1";
            }
          }
        }

        if (scene.level.objectMap[x][y] === HANS_CODE) {
          enemyId = 5;
        }
        if (scene.level.objectMap[x][y] === SCHABBS_CODE) {
          enemyId = 7;
        }

        if (enemyId !== -1) {
          out.push(
            new Enemy(
              enemyId,
              x + 0.5,
              y + 0.5,
              enemyForwardX,
              enemyForwardY,
              enemyDefinitions[enemyId],
              enemyFrame,
            ),
          );
        }
      }
    }
  }
  scene.enemies = out;
  scene.enemyCount = out.length - dead;
}

function setupEnemyGrid(scene) {
  var out = [];
  for (var x = 0; x < scene.level.worldMap.length; x++) {
    out.push([]);
    for (var y = 0; y < scene.level.worldMap[x].length; y++) {
      out[x].push(null);
    }
  }

  for (var i = 0; i < scene.enemies.length; i++) {
    out[floor(scene.enemies[i].pos.x)][floor(scene.enemies[i].pos.y)] =
      scene.enemies[i];
  }

  scene.enemyGrid = out;
}
// }
// Player {
function Player(x, y, angle) {
  this.pos = new PVector(x, y);
  this.angle = angle;
  this.forward = new PVector(cos(this.angle), sin(this.angle));
  this.radius = 0.3;
  this.damagedThisShot = false;
  this.currentWeapon = 1;
  this.firing = false;
  this.currentWeaponFrame = 0;
  this.ammo = 8;
  this.secretCount = 0;
  this.weapons = 2;
  this.canFire = true;
  this.killCount = 0;

  this.running = false;

  this.health = 100;
  this.score = 0;
  this.lives = 3;
  this.floor = 1;
  this.hasGoldKey = false;
  this.hasSilverKey = false;

  this.madeNoise = false;

  this.weaponChosen = 1;

  this.faceFrame = 0;
  this.faceTime = 0;
  this.treasure = 0;
}
Player.prototype.preUpdate = function () {
  this.angle = wrap(this.angle, 0, 360);
  this.forward.x = cos(this.angle);
  this.forward.y = sin(this.angle);

  var selectedWeapon = this.currentWeapon;
  if (inputKeys["1"]) {
    selectedWeapon = 0;
  }
  if (inputKeys["2"]) {
    selectedWeapon = 1;
  }
  if (inputKeys["3"]) {
    selectedWeapon = 2;
  }
  if (inputKeys["4"]) {
    selectedWeapon = 3;
  }
  if (this.ammo === 0) {
    selectedWeapon = 0;
  }
  if (selectedWeapon < this.weapons && selectedWeapon !== this.currentWeapon) {
    this.currentWeapon = selectedWeapon;
    this.firing = false;
    this.currentWeaponFrame = 0;
    this.canFire = false;
  }
};
Player.prototype.move = function (scene) {
  var inputForward = 0;
  if (inputKeys.up) {
    inputForward++;
  }
  if (inputKeys.down) {
    inputForward--;
  }
  if (inputKeys.w) {
    inputForward++;
  }
  if (inputKeys.s) {
    inputForward--;
  }
  if (useMouse && inputForward === 0) {
    inputForward += (vMouseYOld - vMouseY) * mouseSensitivity * 8;
  }

  var inputHorizontal = 0;
  if (inputKeys.left) {
    inputHorizontal--;
  }
  if (inputKeys.right) {
    inputHorizontal++;
  }

  if (inputKeys.a) {
    inputHorizontal--;
  }
  if (inputKeys.d) {
    inputHorizontal++;
  }

  inputHorizontal = constrain(inputHorizontal, -1, 1);

  if (useMouse && inputHorizontal === 0) {
    inputHorizontal += (vMouseX - vMouseXOld) * mouseSensitivity;
  }

  var speed = inputKeys.shift || useMouse ? MOVE_SPEED * 2 : MOVE_SPEED;
  var moved = 0;

  var strafe = inputKeys.alt || rightClick;

  var moveX =
    this.forward.x * constrain(inputForward * speed, -speed, speed) * delta;
  var moveY =
    this.forward.y * constrain(inputForward * speed, -speed, speed) * delta;

  if (strafe) {
    moveX -=
      this.forward.y *
      constrain(inputHorizontal * speed, -speed, speed) *
      delta;
    moveY +=
      this.forward.x *
      constrain(inputHorizontal * speed, -speed, speed) *
      delta;
  } else {
    this.angle +=
      inputHorizontal *
      delta *
      TURN_SPEED *
      (inputKeys.shift || useMouse ? 2 : 1);
    this.angle = wrap(this.angle, 0, 360);
  }

  var newX = this.pos.x + moveX;
  var newY = this.pos.y + moveY;

  var moved = 0;

  if (
    checkTile(scene, newX + this.radius, this.pos.y, this) +
      checkTile(scene, newX - this.radius, this.pos.y, this) +
      checkTile(scene, newX, this.pos.y + this.radius, this) +
      checkTile(scene, newX, this.pos.y - this.radius, this) ===
    0
  ) {
    this.pos.x = newX;
    moved += abs(moveX / delta);
  }
  if (
    checkTile(scene, this.pos.x, newY + this.radius, this) +
      checkTile(scene, this.pos.x, newY - this.radius, this) +
      checkTile(scene, this.pos.x + this.radius, newY, this) +
      checkTile(scene, this.pos.x - this.radius, newY, this) ===
    0
  ) {
    this.pos.y = newY;
    moved += abs(moveY / delta);
  }

  this.running = moved >= MOVE_SPEED * 2;
};
Player.prototype.update = function (scene) {
  this.madeNoise = false;
  this.move(scene);
  this.handleWin(scene);
  this.handlePickups(scene);
  this.handleDoors(scene);
  this.updateWeapon(scene);
  this.updateFace();
};
Player.prototype.handleWin = function (scene) {
  var objectId = scene.level.objectMap[floor(this.pos.x)][floor(this.pos.y)];
  if (objectId === WIN_CODE) {
    scene.gamestate = GAME_STATES.WIN;
    this.targetPos = this.pos.get();
    this.targetPos.y -= 5;

    var bj = new Enemy(
      6,
      floor(this.pos.x) + 0.5,
      floor(this.pos.y) + 1.5,
      0,
      -1,
      enemyDefinitions[6],
      "run1",
    );
    bj.targetY = bj.pos.y - 4;
    scene.decorations.push(bj);
    scene.enemyGrid[floor(bj.pos.x)][floor(bj.pos.y)] = bj;
  }
};

Player.prototype.handlePickups = function (scene) {
  var pickups = scene.pickupGrid[floor(this.pos.x)][floor(this.pos.y)];
  for (var i = pickups.length - 1; i >= 0; i--) {
    if (this.pickup(scene, pickups[i])) {
      pickups.splice(i, 1);
    }
  }
};
Player.prototype.handleDoors = function (scene) {
  if (inputKeys[" "]) {
    var doorKey =
      floor(this.pos.x + this.forward.x) +
      "-" +
      floor(this.pos.y + this.forward.y);
    if (scene.doors.hasOwnProperty(doorKey)) {
      openDoor(scene, doorKey);
    }

    trySecret(scene);
    tryElevator(scene);
  }
};
Player.prototype.updateWeapon = function (scene) {
  var fire = inputKeys.control || leftClick;
  var frameDelta = delta / (6 * TICS_TO_MILLIS);
  if (this.firing) {
    if (this.canFire) {
      this.currentWeaponFrame += frameDelta;
      if (
        floor(this.currentWeaponFrame) === 2 &&
        floor(this.currentWeaponFrame - frameDelta) !== 2 &&
        this.currentWeapon > 0
      ) {
        this.fire(scene);
      }
      if (
        floor(this.currentWeaponFrame) === 3 &&
        floor(this.currentWeaponFrame - frameDelta) !== 3
      ) {
        if (this.currentWeapon === 3) {
          this.fire(scene);
        } else if (this.currentWeapon === 0) {
          this.knife(scene);
        }
      }
    }

    if (fire && this.currentWeapon > 1) {
      if (this.currentWeaponFrame >= 4) {
        this.currentWeaponFrame = 2;
        this.fire(scene);
      }
    }
    if (this.currentWeaponFrame >= 5) {
      if (this.currentWeapon > 1) {
        this.currentWeaponFrame = 0;
        this.firing = false;
      } else {
        this.currentWeaponFrame = 0;
        this.canFire = false;
      }
    }
  }
  if (fire && (this.currentWeapon === 0 || this.ammo > 0)) {
    this.firing = true;
  } else {
    if (this.currentWeaponFrame === 0) {
      this.firing = false;
      this.canFire = true;
    }
  }
};
Player.prototype.fire = function (scene) {
  if (this.ammo === 0) {
    return;
  }
  this.ammo--;
  if (this.ammo === 0) {
    this.weaponChosen = this.currentWeapon;
  }
  var target = null;
  this.madeNoise = true;
  var distToTarget = Infinity;
  for (var i = 0; i < scene.enemies.length; i++) {
    var dx = abs(this.pos.x - scene.enemies[i].pos.x);
    var dy = abs(this.pos.y - scene.enemies[i].pos.y);

    var distance = max(dx, dy);

    if (
      distance < distToTarget &&
      abs(scene.enemies[i].screenX - bufferWidth / 2) < 32 &&
      scene.enemies[i].visible &&
      scene.enemies[i].health > 0 &&
      scene.enemies[i].checkLineOfSight(scene) &&
      !scene.enemies[i].notHittable
    ) {
      target = scene.enemies[i];
      distToTarget = distance;
    }
  }
  if (target !== null) {
    var damage = 0;
    if (distToTarget < 2) {
      damage = floor(random(0, 255) / 4);
    } else {
      if (distToTarget > 4 && random(0, 255) / 12 < distToTarget) {
        return;
      }
      damage = floor(random(0, 255) / 6);
    }
    if (target.hit(damage)) {
      this.addScore(target.definition.score, true);
      this.killCount++;
      if (target.id > 5) {
        this.killPos = this.pos.get();
      }
    }
  }
};
Player.prototype.knife = function (scene) {
  var enemies = scene.enemies;
  var target = null;
  var distToTarget = Infinity;
  for (var i = 0; i < enemies.length; i++) {
    var dx = abs(this.pos.x - enemies[i].pos.x);
    var dy = abs(this.pos.y - enemies[i].pos.y);

    var distance = max(dx, dy);

    if (
      distance < distToTarget &&
      abs(enemies[i].screenX - bufferWidth / 2) < 32 &&
      enemies[i].visible &&
      enemies[i].health > 0 &&
      enemies[i].checkLineOfSight(scene) &&
      !enemies[i].notHittable
    ) {
      target = enemies[i];
      distToTarget = distance;
    }
  }
  if (target !== null && distToTarget < 1.5) {
    var damage = floor(random(0, 255) / 16);
    if (target.hit(damage)) {
      this.addScore(target.definition.score, true);
      this.killCount++;
      if (target.id > 5) {
        this.killPos = this.pos.get();
      }
    }
    if (damage > 0) {
      this.madeNoise = true;
    }
  }
};
Player.prototype.addScore = function (amount, kill) {
  if (
    floor((totalScore + this.score + amount) / 40000) >
    floor((totalScore + this.score) / 40000)
  ) {
    this.lives = constrain(this.lives + 1, 0, 9);
  }
  this.score += amount;
  if (!kill) {
    this.treasure += amount;
  }
};
Player.prototype.pickup = function (scene, pickup) {
  var pickupId = pickup.id - pickupOffset - FLOOR_CODES - 1;
  var usedPickup = false;
  switch (pickupId) {
    case 0: // Gibs
      if (this.health < 11) {
        this.health = constrain(this.health + 1, 0, 100);
        usedPickup = true;
      }
      break;
    case 1: // Blood
      if (this.health < 11) {
        this.health = constrain(this.health + 1, 0, 100);
        usedPickup = true;
      }
      break;
    case 2: // Dogfood
      if (this.health < 100) {
        this.health = constrain(this.health + 4, 0, 100);
        usedPickup = true;
      }
      break;
    case 3: // Dinner
      if (this.health < 100) {
        this.health = constrain(this.health + 10, 0, 100);
        usedPickup = true;
      }
      break;
    case 4: // First Aid
      if (this.health < 100) {
        this.health = constrain(this.health + 25, 0, 100);
        usedPickup = true;
      }
      break;
    case 5: // Ammo
      if (this.ammo < 99) {
        if (this.ammo === 0) {
          this.currentWeapon = min(this.weapons - 1, this.weaponChosen);
          this.firing = false;
          this.currentWeaponFrame = 0;
          this.canFire = false;
        }
        this.ammo = constrain(this.ammo + 8, 0, 99);
        usedPickup = true;
      }
      break;
    case 6: // Ammo Guard
      if (this.ammo < 99) {
        if (this.ammo === 0) {
          this.currentWeapon = min(this.weapons - 1, this.weaponChosen);
          this.firing = false;
          this.currentWeaponFrame = 0;
          this.canFire = false;
        }
        this.ammo = constrain(this.ammo + 4, 0, 99);
        usedPickup = true;
      }
      break;
    case 7: // MP40
      if (this.weapons < 3 || this.ammo < 99) {
        if (this.ammo === 0) {
          this.currentWeapon = min(this.weapons - 1, this.weaponChosen);
          this.firing = false;
          this.currentWeaponFrame = 0;
          this.canFire = false;
        }
        this.weapons = max(this.weapons, 3);
        this.ammo = constrain(this.ammo + 6, 0, 99);
        usedPickup = true;
        this.currentWeapon = max(this.currentWeapon, 2);
        this.firing = false;
        this.currentWeaponFrame = 0;
      }
      break;
    case 8: // Chaingun
      if (this.weapons < 4 || this.ammo < 99) {
        if (this.ammo === 0) {
          this.currentWeapon = min(this.weapons - 1, this.weaponChosen);
          this.firing = false;
          this.currentWeaponFrame = 0;
          this.canFire = false;
        }
        this.weapons = 4;
        this.ammo = constrain(this.ammo + 6, 0, 99);
        usedPickup = true;
        this.currentWeapon = 3;
        this.firing = false;
        this.currentWeaponFrame = 0;
        this.grin = true;
        this.faceTime = 0;
      }
      break;
    case 9: // Cross
      this.addScore(100);
      usedPickup = true;
      break;
    case 10: // Chalice
      this.addScore(500);
      usedPickup = true;
      break;
    case 11: // Chest
      this.addScore(1000);
      usedPickup = true;
      break;
    case 12: // Crown
      this.addScore(5000);
      usedPickup = true;
      break;
    case 13: // Gold Key
      this.hasGoldKey = true;
      usedPickup = true;
      break;
    case 14: // Silver Key
      this.hasSilverKey = true;
      usedPickup = true;
      break;
    case 15: // One Up
      this.addScore(40000);
      this.health = 100;
      this.ammo = min(this.ammo + 25, 99);
      usedPickup = true;
      break;
  }

  if (usedPickup) {
    flashScreenColor(color(184, 184, 0));
    for (var i = 0; i < scene.decorations.length; i++) {
      var dec = scene.decorations[i];
      if (
        dec.pos.x === pickup.pos.x &&
        dec.pos.y === pickup.pos.y &&
        dec.id === pickup.id
      ) {
        scene.decorations.splice(i, 1);
        break;
      }
    }
  }
  return usedPickup;
};
Player.prototype.displayWeapon = function () {
  image(
    renders[
      floor(this.currentWeaponFrame + this.currentWeapon * 5) + weaponOffset
    ],
    width / 2,
    height - hudHeight * INV_SCALE - 128,
    256,
    256,
  );
};
Player.prototype.damage = function (damage, attacker, scene) {
  if (difficultyLevel === DIFFICULTIES.CAN_I_PLAY_TOO_DADDY) {
    damage = floor(damage / 4);
  }
  this.health -= damage;
  if (this.health > 0) {
    flashScreenColor(color(255, 0, 0));
  } else {
    this.health = 0;
    this.killedBy = attacker;
    scene.gamestate = GAME_STATES.DIE_1;
  }
};
Player.prototype.updateFace = function () {
  this.faceTime += delta * 0.035;
  if (this.faceTime > random(0, 255)) {
    this.grin = false;
    this.faceFrame = round(random(0, 3));
    if (this.faceFrame === 3) {
      this.faceFrame = 1;
    }
    this.faceTime = 0;
  }
};

function spawnPlayer(scene) {
  var player;
  for (var x = 0; x < 64; x++) {
    for (var y = 0; y < 64; y++) {
      if (
        scene.level.objectMap[x][y] > 91 + FLOOR_CODES &&
        scene.level.objectMap[x][y] < 96 + FLOOR_CODES
      ) {
        switch (scene.level.objectMap[x][y]) {
          case 92 + FLOOR_CODES:
            player = new Player(x, y, 0);
            break;
          case 93 + FLOOR_CODES:
            player = new Player(x, y, -90);
            break;
          case 94 + FLOOR_CODES:
            player = new Player(x, y, 180);
            break;
          case 95 + FLOOR_CODES:
            player = new Player(x, y, 90);
            break;
        }
        player.pos.x += 0.5;
        player.pos.y += 0.5;
      }
    }
  }
  player.floor = currentLevel + 1;
  scene.player = player;
}

// }
// Level {

function decodeLevel(levelData) {
  var level = {
    worldMap: [],
    objectMap: [],
  };
  var worldMap = decodeToArray(levelData.worldMap);
  var objectMap = decodeToArray(levelData.objectMap);
  for (var x = 0; x < 64; x++) {
    level.worldMap.push([]);
    level.objectMap.push([]);
    for (var y = 0; y < 64; y++) {
      level.worldMap[x].push(worldMap[y + x * 64]);
      level.objectMap[x].push(objectMap[y + x * 64]);
    }
  }

  level.topColor = levelData.topColor;

  return level;
}
// }

// Scene {
var currentScene = null;

function Scene(episode, levelNumber) {
  this.episode = episodes[episode];
  this.levelData = this.episode.levels[levelNumber];
  this.levelNumber = levelNumber;
  this.initialized = false;
  this.gamestate =
    levelNumber === 0 ? GAME_STATES.TITLE : GAME_STATES.GET_PSYCHED;
  this.startTime = -1;
  this.enemyCount = 0;
  this.secretCount = 0;

  this.fadeColor = [0, 0, 0, 255];
}

Scene.prototype.init = function () {
  this.level = decodeLevel(this.levelData);

  spawnPlayer(this);

  setupSecrets(this);

  initializeDoors(this);

  refreshAreasConnectedToPlayer(this);

  spawnEnemies(this);

  spawnDecorations(this);

  for (var i = 0; i < this.enemies.length; i++) {
    this.decorations.push(this.enemies[i]);
  }

  setupEnemyGrid(this);

  setFizzlePixels(0, 0, 0, 0);
  resetFizzle();

  this.initialized = true;
  this.fadingIn = true;
};

Scene.prototype.reset = function (lives) {
  this.level = decodeLevel(this.levelData);
  this.startTime = millis();
  fading = false;
  resetFizzle();
  spawnPlayer(this);

  this.player.lives = lives;

  initializeDoors(this);

  setupSecrets(this);

  refreshAreasConnectedToPlayer(this);

  spawnEnemies(this);

  spawnDecorations(this);

  for (var i = 0; i < this.enemies.length; i++) {
    this.decorations.push(this.enemies[i]);
  }

  setupEnemyGrid(this);
};

Scene.prototype.fade = function (amount) {
  this.fadeColor[3] = constrain(this.fadeColor[3] + amount * delta, 0, 255);
};

Scene.prototype.renderFade = function () {
  fill(
    this.fadeColor[0],
    this.fadeColor[1],
    this.fadeColor[2],
    this.fadeColor[3],
  );
  rect(0, 0, width, height);
};

var screenRender;
Scene.prototype.draw = function () {
  switch (this.gamestate) {
    case GAME_STATES.GET_PSYCHED: // {
      background(0, 64, 64);
      displayHUD(this);
      image(renders[hudOffset + 18], width / 2, height / 2);
      if (this.startTime > 0) {
        var w = constrain(((millis() - this.startTime) / 1000) * 440, 0, 440);
        fill(252, 0, 0);
        rect(width / 2 - 218, height / 2 + 42, w, 4);
        fill(252, 156, 156);
        rect(width / 2 - 218, height / 2 + 42, w > 2 ? w - 2 : 0, 2);
      }
      this.renderFade();
      if (this.startTime === -1) {
        this.fade(-1);
        if (this.fadeColor[3] === 0) {
          this.startTime = millis();
        }
      } else if (millis() - this.startTime > 1000) {
        this.fade(1);
        if (this.fadeColor[3] === 255) {
          this.gamestate = GAME_STATES.FADE_IN;
          this.player.preUpdate();
          updateDecorations(this);
        }
      }
      break; //}
    case GAME_STATES.FADE_IN: // {
      raycast(this);
      renderDecorations(this);
      renderFrameBuffer(fizzlePixels);
      displayHUD(this);
      this.renderFade();
      this.fade(-1);
      if (this.fadeColor[3] === 0) {
        this.gamestate = GAME_STATES.PLAY;
        this.startTime = millis();
      }
      break; //}
    case GAME_STATES.FIZZLE_IN: // {
      raycast(this);
      renderDecorations(this);
      renderFrameBuffer(fizzlePixels);
      displayHUD(this);
      fizzleColor = [0, 0, 0, 0];
      fizzleFade(60);
      if (fizzleDone) {
        this.gamestate = GAME_STATES.PLAY;
        fading = false;
        resetFizzle();
      }
      break; //}
    case GAME_STATES.PLAY: // {
      if (invalidScreen) {
        return;
      }
      this.player.preUpdate();
      this.player.update(this);
      updateDoors(this);
      refreshAreasConnectedToPlayer(this);
      updateSecrets(this);
      updateDecorations(this);
      raycast(this);
      renderDecorations(this);
      renderFrameBuffer(fizzlePixels);
      displayHUD(this);
      this.player.displayWeapon();
      break; //}
    case GAME_STATES.DIE_1: // {
      var targetAngle =
        -atan2(
          this.player.pos.x - this.player.killedBy.pos.x,
          this.player.pos.y - this.player.killedBy.pos.y,
        ) - 90;
      var turn = targetAngle - this.player.angle;
      if (turn > 180) {
        turn -= 360;
      } else if (turn < -180) {
        turn += 360;
      }

      if (abs(turn) > TURN_SPEED * delta) {
        this.player.angle += sign(turn) * TURN_SPEED * delta;
      } else {
        this.player.angle = targetAngle;
        this.fizzleProgress = 0;
        resetFizzle();

        this.gamestate = GAME_STATES.DIE_2;
      }

      this.player.preUpdate();
      raycast(this);
      renderDecorations(this);
      renderFrameBuffer(fizzlePixels);
      displayHUD(this);
      break; //}
    case GAME_STATES.DIE_2: // {
      renderFrameBuffer(fizzlePixels);
      displayHUD(this);
      fizzleColor = [170, 0, 0, 255];
      fizzleFade(60, true);
      if (fizzleDone) {
        this.player.lives--;
        totalSeconds += floor((millis() - this.startTime) / 1000);
        if (this.player.lives < 0) {
          currentLevel = 0;
          this.levelData = this.episode.levels[0];
          this.player.lives = 3;
          this.player.floor = 1;
          totalScore = 0;
        }
        this.reset(this.player.lives);
        this.gamestate = GAME_STATES.FIZZLE_IN;
        this.player.preUpdate();
        refreshAreasConnectedToPlayer(this);
        updateDecorations(this);
      }
      break; //}
    case GAME_STATES.ELEVATOR: // {
      raycast(this);
      renderDecorations(this);
      renderFrameBuffer(fizzlePixels);
      displayHUD(this);
      this.renderFade();
      this.fade(1);
      if (this.fadeColor[3] === 255) {
        this.fadeOut = false;

        if (this.player.floor === 9) {
          this.gamestate = GAME_STATES.END_SCREEN;
        } else {
          this.gamestate = GAME_STATES.SCORE_SCREEN;

          if (this.player.floor !== 10) {
            this.killRatio = floor(
              (this.player.killCount / this.enemyCount) * 100,
            );
            this.killRatioTemp = 0;

            this.secretRatio = floor(
              (this.player.secretCount / this.secretCount) * 100,
            );
            this.secretRatioTemp = 0;

            this.treasureRatio = floor(
              (this.player.treasure / this.treasureCount) * 100,
            );
            this.treasureRatioTemp = 0;

            this.seconds = floor((millis() - this.startTime) / 1000);
            if (this.seconds > 99 * 60) {
              this.seconds = 99 * 60;
            }

            this.time =
              floor(this.seconds / 60)
                .toString()
                .padStart(2, "0") +
              ":" +
              (this.seconds % 60).toString().padStart(2, "0");

            this.timeLeft = 0;
            if (
              this.seconds <
              this.episode.parTimes[this.player.floor - 1][0] * 60
            ) {
              this.timeLeft =
                this.episode.parTimes[this.player.floor - 1][0] * 60 -
                this.seconds;
            }

            this.timeLeftTemp = 0;
            this.timerTemp = 0;
            this.bonus = 0;
          } else {
            this.player.addScore(15000);
          }
        }
      }
      break; //}
    case GAME_STATES.WIN: // {
      var turn = 90 - this.player.angle;
      if (turn > 180) {
        turn -= 360;
      } else if (turn < -180) {
        turn += 360;
      }

      if (abs(turn) > TURN_SPEED * 2 * delta) {
        this.player.angle += sign(turn) * TURN_SPEED * 2 * delta;
      } else {
        this.player.angle = 90;
      }

      var moveY = this.player.targetPos.y - this.player.pos.y;

      if (abs(moveY) > MOVE_SPEED * delta) {
        this.player.pos.y += sign(moveY) * MOVE_SPEED * delta;
      } else {
        this.player.pos.y = this.player.targetPos.y;
      }

      this.player.preUpdate();
      updateDecorations(this);
      raycast(this);
      renderDecorations(this);
      renderFrameBuffer(fizzlePixels);
      displayHUD(this);
      break; //}
    case GAME_STATES.SCORE_SCREEN: // {
      if (this.bjBreath === undefined) {
        this.bjBreath = 0;
        this.bjBreathTime = (10 / 70) * 1000;
        this.bjBreathFrame = 0;
      }

      this.bjBreath += delta;
      if (this.bjBreath > this.bjBreathTime) {
        this.bjBreath = 0;
        this.bjBreathTime = (35 / 70) * 1000;
        this.bjBreathFrame = (this.bjBreathFrame + 1) % 2;
      }

      var complete = false;

      if (this.player.floor === 10) {
        complete = true;
        background(0, 64, 64);
        displayHUD(this);
        displayText(248, 40, "SECRET FLOOR", 0);
        displayText(248, 72, "COMPLETED!", 0);

        displayText(128, 256, "15000 BONUS!", 0);
      } else {
        if (this.killRatio === undefined) {
          this.killRatio = 100;
          this.killRatioTemp = 0;
          this.secretRatio = 95;
          this.secretRatioTemp = 0;
          this.treasureRatio = 95;
          this.treasureRatioTemp = 0;
          this.seconds = 60;

          this.timeLeft = 0;
          if (
            this.seconds <
            this.episode.parTimes[this.player.floor - 1][0] * 60
          ) {
            this.timeLeft =
              this.episode.parTimes[this.player.floor - 1][0] * 60 -
              this.seconds;
          }

          this.timeLeftTemp = 0;

          this.bonus = 0;
          if (this.seconds > 99 * 60) {
            this.seconds = 99 * 60;
          }

          this.time =
            floor(this.seconds / 60)
              .toString()
              .padStart(2, "0") +
            ":" +
            (this.seconds % 60).toString().padStart(2, "0");
          this.secondsTemp = 0;
          this.timerTemp = 0;
        }

        if (this.fadeColor[3] === 0 || this.fadeOut) {
          if (this.timerTemp !== -1) {
            this.timerTemp += delta;
            if (this.timerTemp >= 430) {
              this.timerTemp = -1;
            }
          } else if (this.timeLeftTemp < this.timeLeft) {
            this.timeLeftTemp += delta * 0.07;
            if (
              floor(this.timeLeftTemp) > floor(this.timeLeftTemp - delta * 0.07)
            ) {
              this.bonus += 500;
              this.player.addScore(500);
            }
            if (this.timeLeftTemp >= this.timeLeft) {
              this.timeLeftTemp = this.timeLeft;
              this.timerTemp = 0;
            }
          } else if (this.killRatioTemp < this.killRatio) {
            this.killRatioTemp += delta * 0.07;
            if (this.killRatioTemp >= this.killRatio) {
              this.killRatioTemp = this.killRatio;
              this.timerTemp = 0;

              if (this.killRatio === 100) {
                this.bonus += 10000;
                this.player.addScore(10000);
              }
            }
          } else if (this.secretRatioTemp < this.secretRatio) {
            this.secretRatioTemp += delta * 0.07;
            if (this.secretRatioTemp >= this.secretRatio) {
              this.secretRatioTemp = this.secretRatio;
              this.timerTemp = 0;

              if (this.secretRatio === 100) {
                this.bonus += 10000;
                this.player.addScore(10000);
              }
            }
          } else if (this.treasureRatioTemp < this.treasureRatio) {
            this.treasureRatioTemp += delta * 0.07;
            if (this.treasureRatioTemp >= this.treasureRatio) {
              this.treasureRatioTemp = this.treasureRatio;

              if (this.treasureRatio === 100) {
                this.bonus += 10000;
                this.player.addScore(10000);
              }
            }
          } else {
            complete = true;
          }
        }
        background(0, 64, 64);
        displayHUD(this);
        displayText(248, 16, "FLOOR " + this.player.floor, 0);
        displayText(248, 48, "COMPLETED", 0);

        displayText(228, 96, "BONUS " + this.bonus, 0);

        displayText(268, 144, "TIME " + this.time, 0);
        displayText(
          268,
          176,
          "  PAR " + this.episode.parTimes[this.player.floor - 1][1],
          0,
        );
        displayText(
          32,
          208,
          "        KILL RATIO " +
            floor(this.killRatioTemp)
              .toString()
              .padStart(3, "-")
              .split("-")
              .join("  ") +
            " %",
          0,
        );
        displayText(
          32,
          240,
          "    SECRET RATIO " +
            floor(this.secretRatioTemp)
              .toString()
              .padStart(3, "-")
              .split("-")
              .join("  ") +
            " %",
          0,
        );
        displayText(
          32,
          272,
          "TREASURE RATIO " +
            floor(this.treasureRatioTemp)
              .toString()
              .padStart(3, "-")
              .split("-")
              .join("  ") +
            " %",
          0,
        );
      }
      imageMode(CORNER);
      image(renders[hudOffset + 19 + this.bjBreathFrame], 0, 16, 208, 176);
      imageMode(CENTER);
      this.renderFade();

      if (inputKeysJustDown[" "]) {
        if (complete) {
          this.fadeOut = true;
        } else {
          if (this.timeLeftTemp < this.timeLeft) {
            var remaining = this.timeLeft - this.timeLeftTemp;
            this.bonus += 500 * ceil(remaining);
            this.player.addScore(500 * ceil(remaining));
            this.timeLeftTemp = this.timeLeft;
          }
          if (this.killRatioTemp < this.killRatio) {
            if (this.killRatio === 100) {
              this.bonus += 10000;
              this.player.addScore(10000);
            }
            this.killRatioTemp = this.killRatio;
          }
          if (this.secretRatioTemp < this.secretRatio) {
            if (this.secretRatio === 100) {
              this.bonus += 10000;
              this.player.addScore(10000);
            }
            this.secretRatioTemp = this.secretRatio;
          }
          if (this.treasureRatioTemp < this.treasureRatio) {
            if (this.treasureRatio === 100) {
              this.bonus += 10000;
              this.player.addScore(10000);
            }
            this.treasureRatioTemp = this.treasureRatio;
          }
        }
      }

      if (this.fadeOut) {
        this.fade(1);
      } else {
        this.fade(-1);
      }
      if (this.fadeColor[3] === 255) {
        var nextScene = new Scene(currentEpisode, currentLevel);
        nextScene.init();
        nextScene.player.ammo = this.player.ammo;
        nextScene.player.lives = this.player.lives;
        nextScene.player.health = this.player.health;
        nextScene.player.weapons = this.player.weapons;
        nextScene.player.currentWeapon = this.player.currentWeapon;
        totalScore += this.player.score;
        if (this.player.floor !== 10) {
          totalSeconds += this.seconds;
          averageKillRatio += this.killRatio;
          averageSecretRatio += this.secretRatio;
          averageTreasureRatio += this.treasureRatio;
        }

        saveCode = "";
        saveCode += safeAlpha[currentLevel];
        saveCode += safeAlpha[this.player.ammo];
        saveCode += safeAlpha[this.player.lives];
        saveCode += safeAlpha[this.player.health];
        saveCode += safeAlpha[this.player.weapons];
        saveCode += safeAlpha[this.player.currentWeapon];
        var longDatas = [
          averageKillRatio,
          averageSecretRatio,
          averageTreasureRatio,
          totalScore,
          totalSeconds,
        ];
        for (var i = 0; i < longDatas.length; i++) {
          saveCode += " ";
          var temp = longDatas[i];

          if (temp === 0) {
            saveCode += safeAlpha[temp];
          }

          while (temp > 0) {
            var digit = temp % 10;
            saveCode += safeAlpha[digit];
            temp = floor(temp / 10);
          }
        }

        currentScene = nextScene;
      }
      break; //}
    case GAME_STATES.END_SCREEN: // {
      background(0, 64, 64);
      displayHUD(this);
      displayText(302, 32, "YOU WIN!", 0);
      displayText(248, 64, "TOTAL TIME", 0);
      if (totalSeconds > 99 * 60) {
        totalSeconds = 99 * 60;
      }
      displayText(
        248,
        96,
        floor(totalSeconds / 60)
          .toString()
          .padStart(2, "0") +
          ":" +
          (totalSeconds % 60).toString().padStart(2, "0"),
        0,
      );

      displayText(196, 170, "AVERAGES", 0);
      displayText(
        144,
        212,
        "KILL      " +
          floor(averageKillRatio / 8)
            .toString()
            .padStart(3, "-")
            .split("-")
            .join("  ") +
          "%",
        0,
      );
      displayText(
        80,
        244,
        "SECRET      " +
          floor(averageSecretRatio / 8)
            .toString()
            .padStart(3, "-")
            .split("-")
            .join("  ") +
          "%",
        0,
      );
      displayText(
        16,
        276,
        "TREASURE      " +
          floor(averageTreasureRatio / 8)
            .toString()
            .padStart(3, "-")
            .split("-")
            .join("  ") +
          "%",
        0,
      );

      imageMode(CORNER);
      image(renders[hudOffset + 21], 16, 16, 176, 176);
      imageMode(CENTER);
      this.renderFade();
      this.fade(-1);
      break; //}
    case GAME_STATES.TITLE:
      image(renders[titleScreenIndex], width / 2, height / 2);
      this.renderFade();
      if (this.startTime === -1) {
        this.fade(-1);
        if (this.fadeColor[3] === 0) {
          this.startTime = millis();
        }
      } else if (millis() - this.startTime > 2000) {
        this.fade(1);
        if (this.fadeColor[3] === 255) {
          this.gamestate = GAME_STATES.GET_PSYCHED;
          this.startTime = -1;
        }
      }
      break;
    case GAME_STATES.DEATHCAM_1:
      renderFrameBuffer(fizzlePixels);
      displayHUD(this);
      if (this.startTime === -1) {
        fizzleColor = [0, 64, 64, 255];
        fizzleFade(60, true);
        if (fizzleDone) {
          this.startTime = millis();
          resetFizzle();
          for (var i = 0; i < this.enemies.length; i++) {
            if (
              Object.keys(this.enemies[i].definition.frames).includes(
                "deathcam",
              )
            ) {
              this.deathcamEnemy = this.enemies[i];
              break;
            }
          }
          if (this.deathcamEnemy) {
            var move = new PVector(
              this.deathcamEnemy.pos.x - this.player.killPos.x,
              this.deathcamEnemy.pos.y - this.player.killPos.y,
            );
            move.normalize();
            move.mult(-1.5);
            var newPos = this.deathcamEnemy.pos.get();
            do {
              newPos.add(move);
            } while (
              checkTile(
                this,
                newPos.x + this.player.radius,
                newPos.y,
                this.player,
              ) +
                checkTile(
                  this,
                  newPos.x - this.player.radius,
                  newPos.y,
                  this.player,
                ) +
                checkTile(
                  this,
                  newPos.x,
                  newPos.y + this.player.radius,
                  this.player,
                ) +
                checkTile(
                  this,
                  newPos.x,
                  newPos.y - this.player.radius,
                  this.player,
                ) !==
              0
            );
            this.player.pos.set(newPos);
            var targetAngle =
              -atan2(
                this.player.pos.x - this.deathcamEnemy.pos.x,
                this.player.pos.y - this.deathcamEnemy.pos.y,
              ) - 90;
            this.player.angle = targetAngle;
            this.player.preUpdate();

            this.deathcamEnemy.currentFrame = "deathcam";
            this.deathcamEnemy.timestamp = millis();
            this.deathcamEnemy.update(this);
            raycast(this);
            renderDecorations(this);
          }
        }
      } else if (millis() - this.startTime > 1000) {
        fizzleColor = [0, 0, 0, 0];
        fizzleFade(60, true);
        if (fizzleDone) {
          this.startTime = millis();
          resetFizzle();
          this.gamestate = GAME_STATES.DEATHCAM_2;
        }
      } else {
        background(0, 64, 64);
        displayHUD(this);
        displayText(24, (400 - hudHeight) / 2 - 16, "LET'S SEE THAT AGAIN!", 0);
      }
      break;
    case GAME_STATES.DEATHCAM_2:
      if (millis() - this.startTime > 1000) {
        this.deathcamEnemy.update(this);
        raycast(this);
        renderDecorations(this);
      }
      renderFrameBuffer(fizzlePixels);
      displayHUD(this);
      if (floor((millis() - this.startTime) / 500) % 2 === 0) {
        image(renders[deathCamOffset], width / 2, 128 + 16, 256, 256);
      }
      break;
    case GAME_STATES.DEATHCAM_3:
      renderFrameBuffer(fizzlePixels);
      displayHUD(this);
      if (millis() - this.startTime > 100) {
        this.gamestate = GAME_STATES.ELEVATOR;
      }
      break;
  }

  if (invalidScreen) {
    fill(255, 0, 0);
    textSize(20);
    text(
      "The raycast renderer needs a specific\n resolutionin order to run correctly.\nPlease follow the instructions\n in the console to play: \nAdd ?width=640 to the \nend of the url and reload.",
      20,
      40,
    );
  } else if (inputKeysJustDown.l) {
    println('var saveCode = "' + saveCode + '";');
  }
  displayFPS();
  updateMouse();
};
// }

// Game {
// Setup
imageMode(CENTER);

draw = function () {
  calculateDelta();
  if (!finishedRendering) {
    initializeTextures(4 / INV_SCALE);
    return;
  }

  if (!frameBufferCreated) {
    createFrameBuffer();
    setupFizzleFade();
  }
  if (currentScene === null) {
    var saveData = saveCode.split(" ");
    currentLevel = safeAlpha.indexOf(saveCode[0]);
    currentScene = new Scene(currentEpisode, currentLevel);
    currentScene.init();
    currentScene.player.ammo = safeAlpha.indexOf(saveCode[1]);
    currentScene.player.lives = safeAlpha.indexOf(saveCode[2]);
    currentScene.player.health = safeAlpha.indexOf(saveCode[3]);
    currentScene.player.weapons = safeAlpha.indexOf(saveCode[4]);
    currentScene.player.currentWeapon = safeAlpha.indexOf(saveCode[5]);
    for (var i = 1; i < saveData.length; i++) {
      var data = saveData[i];
      var num = "";
      for (var c = data.length - 1; c >= 0; c--) {
        num += safeAlpha.indexOf(data[c]);
      }

      num = parseInt(num, 10);

      switch (i) {
        case 1:
          averageKillRatio = num;
          break;
        case 2:
          averageSecretRatio = num;
          break;
        case 3:
          averageTreasureRatio = num;
          break;
        case 4:
          totalScore = num;
          break;
        case 5:
          totalSeconds = num;
          break;
      }
    }
  }

  if (!currentScene.initialized) {
    currentScene.init();
  }
  currentScene.draw();
  inputKeysJustDown = {};
};
// }
